class peZX673b9oC40uFFqLfOfOBuO1eeb_oj(𝙞𝘯𝘁):...

class c_tl9ByHiNhDDIWuFWFM46pvC_N_cVGU(𝘴𝘵𝙧):...

class Ab6muzhgzdbisPpNY8ahEEo8ZxqMMoaP(𝘴𝘵𝙧):...

class U4AQuFoQwmaPHGAvguf7PlfshN_Eo3Yu(𝙞𝘯𝙩):...

class xYNFqxXowgN8pjJ2i3YVEJ3g7oMArmGr(𝙞𝙣𝘁):...

class sn1w2SDeaRROY3efwjvgjNF2Prl99qgU(𝙞𝙣𝘁):...

class urhZ33js7iEGZdg6tOh7EgbnmzbtHCnx(𝗶𝗻𝘵):...

class DPlnilbZ1CtZuyL6tAdEuO7uXhPDb2Mt(𝘪𝗻𝘁):...

class EmTFdoPwVdz3V4eWO6LZ1mc37fqZcKnn(𝘧𝙡𝙤𝙖𝘵):...

class YFpyY15S8kaOodvPv31P0atVArU3gbhN(𝙛𝗹𝙤𝘢𝘵):...

class RvN7W4SlJcWjSxvXcSEsYOMBF3XHJOzC(𝙞𝘯𝘵):...

class YdGk5cinlrjR_fD7r9Tpc8wyffJbpoJ6(𝗽𝗲𝗭𝙓673𝗯9𝙤𝗖40𝘂𝘍𝘍𝙦𝗟𝙛𝙊𝗳𝙊𝗕𝘶𝗢1𝙚𝙚𝘣_𝘰𝙟):...

class Nga4cLPwbDqTCyHTQirq_yUt8b6XJAIn(𝙘_𝘵𝗹9𝘉𝙮𝘏𝘪𝗡𝗵𝗗𝗗𝗜𝘞𝘂𝘍𝗪𝙁𝘔46𝗽𝙫𝘊_𝗡_𝗰𝙑𝙂𝘜):...

class wys6cNLMX733G9GnFMxA05TKN5ooaxs7(𝘈𝘣6𝙢𝘂𝘇𝙝𝘨𝙯𝙙𝗯𝘪𝘴𝘗𝙥𝗡𝙔8𝗮𝙝𝙀𝘌𝗼8𝗭𝙭𝘲𝗠𝗠𝙤𝘢𝙋):...

class TvTKau8rSpw_Fxd8kO2KGEWpLmP5BKhM(𝗨4𝘈𝘘𝙪𝘍𝗼𝙌𝙬𝙢𝙖𝙋𝘏𝘎𝗔𝘷𝙜𝘶𝗳7𝙋𝘭𝙛𝙨𝘩𝗡_𝗘𝙤3𝘠𝘶):...

class yvoSs9LoQfFN33UMe5Whf2qdiDe52VfK(𝘅𝗬𝘕𝗙𝗾𝘅𝘟𝙤𝘄𝙜𝗡8𝗽𝙟𝗝2𝗶3𝘠𝘝𝙀𝗝3𝙜7𝘰𝘔𝘈𝘳𝙢𝘎𝙧):...

class olRLZCwrt9lvDVGX2Aq3prhK_ulfvLC2(𝘀𝙣1𝘸2𝘚𝘋𝙚𝘢𝙍𝗥𝙊𝗬3𝙚𝙛𝘄𝘫𝘷𝙜𝘫𝘕𝗙2𝘗𝙧𝗹99𝘲𝙜𝘜):...

class fJQ26sqwamghFtRnocgnPJEKIWrm2BcZ(𝙪𝘳𝙝𝘡33𝘫𝙨7𝙞𝙀𝙂𝗭𝘥𝘨6𝘁𝗢𝙝7𝙀𝙜𝙗𝘯𝘮𝘇𝗯𝘵𝗛𝘾𝗻𝘅):...

class F1z8thANF9JYJ6EF1zGf5Yu665YUIPDS(𝘿𝘗𝗹𝘯𝙞𝙡𝘣𝗭1𝗖𝙩𝗭𝘶𝘺𝗟6𝘵𝘈𝘥𝘌𝘂𝙊7𝘶𝙓𝘩𝗣𝘋𝘣2𝗠𝙩):...

class NA_Fp8r00WDDH8U1mF7Bnalje13poIRJ(𝗘𝙢𝗧𝘍𝘥𝙤𝗣𝙬𝙑𝙙𝘇3𝗩4𝘦𝘞𝗢6𝙇𝙕1𝘮𝗰37𝘧𝗾𝙕𝘤𝙆𝗻𝘯):...

class mqQLfi0TdPWBZJjyFsfdII6d13mAPSf5(𝙔𝗙𝗽𝘆𝙔15𝙎8𝘬𝘢𝙊𝙤𝙙𝙫𝗣𝘃31𝘗0𝗮𝙩𝗩𝘼𝙧𝘜3𝗴𝘣𝗵𝗡):...

class LA4CbkN4xIaejunlyClMxWG1ZHlvsNZm(𝙍𝙫𝗡7𝙒4𝗦𝙡𝘑𝘤𝙒𝗷𝙎𝘅𝘷𝘟𝗰𝘚𝗘𝙨𝗬𝙊𝗠𝘉𝗙3𝘟𝗛𝙅𝙊𝘇𝗖):...

class kdjz6mIcL9wtkAulvrnW62OlNyLItiCg(𝙔𝙙𝙂𝙠5𝙘𝘪𝗻𝙡𝙧𝘫𝗥_𝗳𝘋7𝙧9𝘛𝙥𝗰8𝘸𝘺𝙛𝙛𝙅𝘣𝗽𝘰𝘑6):...

class p7h0unaDiyb7fhVhJoRYI38IlnuOO2Nm(𝘕𝘨𝙖4𝘤𝘓𝘗𝘸𝘣𝗗𝙦𝗧𝘊𝙮𝘏𝘛𝘘𝗶𝙧𝙦_𝘺𝙐𝘁8𝘣6𝙓𝘑𝘼𝘐𝙣):...

class f4P6BcS0hQlFG5r5O9mHyPvlu1813M6z(𝘸𝘺𝘴6𝘤𝙉𝙇𝘔𝗫733𝘎9𝘎𝙣𝙁𝘔𝘅𝗔05𝗧𝗞𝘕5𝙤𝗼𝙖𝘹𝘴7):...

class ENnttsNOcL_YFvEfuN7FJGcOL9E38gOW(𝘛𝘷𝙏𝗞𝙖𝙪8𝗿𝘚𝗽𝙬_𝗙𝙭𝘥8𝙠𝙊2𝘒𝘎𝘌𝙒𝗽𝙇𝘮𝘗5𝘉𝙆𝘩𝗠):...

class aOcmn1LDL71bbucZCh2865oMjoNR1okU(𝙮𝘃𝘰𝙎𝙨9𝙇𝗼𝗤𝙛𝙁𝗡33𝙐𝘔𝗲5𝘞𝘩𝘧2𝗾𝙙𝗶𝘿𝙚52𝙑𝗳𝘒):...

class mI6B5NZsQ5HbkQ0S3vhJlqxAs8BgpaPi(𝙤𝗹𝘙𝙇𝗭𝘾𝙬𝗿𝘁9𝙡𝙫𝗗𝙑𝙂𝘟2𝘈𝗾3𝗽𝙧𝗵𝘒_𝙪𝗹𝘧𝙫𝗟𝗖2):...

class s7EbQdiP9OcNeQGDLYkTww711mFFC0jr(𝗳𝗝𝘘26𝘴𝙦𝘄𝗮𝙢𝗴𝙝𝗙𝙩𝙍𝘯𝗼𝗰𝘨𝘯𝙋𝗝𝗘𝙆𝗜𝙒𝙧𝗺2𝘉𝘤𝙕):...

class _iIXIHaN2WOqRW27sZvCh9haCXcUDstg(𝙁1𝘻8𝙩𝗵𝗔𝗡𝙁9𝗝𝙔𝗝6𝗘𝗙1𝘇𝙂𝘧5𝗬𝘂665𝗬𝙐𝘐𝗣𝘋𝙎):...

class HVLktEE5yCX4CEOBxn8c9868Aozgv5xu(𝙉𝘈_𝙁𝗽8𝙧00𝘞𝘋𝘿𝙃8𝗨1𝙢𝘍7𝗕𝘯𝙖𝙡𝘫𝙚13𝗽𝗼𝘐𝗥𝗝):...

class k5JabQOCBBl4Mmtsl4mcjTqrs2Qs03xp(𝗺𝘲𝗤𝘓𝗳𝙞0𝘛𝙙𝗣𝘞𝘉𝘡𝘑𝗷𝙮𝘍𝙨𝙛𝙙𝘐𝘐6𝙙13𝗺𝘼𝙋𝘚𝙛5):...

class kUvPiKy_7MLRWf0uUvuvb2LNt_18ASWX(𝙇𝗔4𝗖𝗯𝙠𝘕4𝘅𝙄𝙖𝘦𝙟𝘂𝙣𝗹𝘆𝘊𝙡𝘔𝘹𝘞𝘎1𝙕𝙃𝗹𝘃𝙨𝙉𝘡𝗺):...

class nhLuf6MM4MIvdKPgvo0udxGh3vsvwWBd(𝙠𝙙𝗷𝘻6𝗺𝙄𝘤𝗟9𝘄𝘁𝙠𝗔𝘂𝘭𝘷𝙧𝘯𝙒62𝙊𝗹𝙉𝙮𝘓𝗜𝙩𝙞𝘾𝘨):...

class i4ADfF2IfZbQh13THvycNGSsSexVkVed(𝙥7𝗵0𝘂𝘯𝙖𝘋𝗶𝘺𝘣7𝗳𝗵𝙑𝗵𝙅𝘰𝗥𝗬𝙄38𝘐𝙡𝙣𝘂𝙊𝙊2𝙉𝙢):...

class QXwBkon04a8yBG_tHvE_uA53hedQ3OaU(𝙛4𝗣6𝘉𝘤𝗦0𝗵𝙌𝙡𝘍𝙂5𝘳5𝙊9𝗺𝘏𝘆𝙋𝘷𝙡𝙪1813𝙈6𝘇):...

class ac5uQ2rDvwKtgOlVLeR38Bvua8enXozH(𝗘𝗡𝘯𝘵𝘵𝙨𝙉𝘖𝙘𝘓_𝗬𝙁𝘷𝙀𝙛𝙪𝘕7𝙁𝗝𝗚𝙘𝙊𝗟9𝗘38𝙜𝙊𝘞):...

class Kw892NaQP4ZHdp2PcK6h9h3od8JvLJTl(𝘢𝘖𝙘𝘮𝘯1𝘓𝘿𝗟71𝘣𝗯𝙪𝘤𝗭𝘊𝗵2865𝙤𝗠𝘫𝙤𝗡𝘙1𝘰𝗸𝘜):...

class l3P99T5589M6BRpEetFyhgYBjaNBqMf_(𝘮𝘐6𝘉5𝘕𝗭𝘀𝗤5𝗛𝙗𝘬𝙌0𝗦3𝘃𝘩𝘑𝙡𝙦𝘅𝘈𝙨8𝗕𝘨𝘱𝙖𝘗𝗶):...

class fPZrKHKDll0WcGpogmsnwfR3WC1jxcW_(𝘀7𝘌𝗯𝙌𝗱𝙞𝗣9𝙊𝙘𝗡𝘦𝙌𝙂𝗗𝙇𝗬𝘬𝙏𝘸𝙬711𝘮𝙁𝗙𝗖0𝗷𝗿):...

class fqbKFwCLc25clVgjL8llDnki9HxqiaTX(_𝘪𝙄𝙓𝗜𝙃𝘢𝘕2𝘞𝙊𝗾𝗥𝘞27𝘀𝙕𝙫𝗖𝘩9𝗵𝗮𝗖𝘟𝗰𝘜𝘋𝘴𝘵𝙜):...

class IYPre_ZyAgRPukpl_zarrksL1xD7BUrN(𝗛𝙑𝘓𝙠𝙩𝙀𝙀5𝘺𝘾𝙓4𝘾𝗘𝗢𝘉𝘅𝘯8𝘤9868𝘈𝙤𝘇𝙜𝘷5𝙭𝘶):...

class PPselyEgfm0wz2x6N267dzH1SepKXOqR(𝘬5𝗝𝗮𝗯𝗤𝗢𝘊𝘉𝘉𝘭4𝗠𝗺𝘁𝙨𝗹4𝙢𝘤𝗷𝘛𝗾𝙧𝘀2𝙌𝘴03𝙭𝙥):...

class pTQ5jA3GcepNPRyfzY7qKNr_O5sv9d9v(𝗸𝗨𝙫𝘗𝗶𝘒𝘆_7𝗠𝙇𝗥𝗪𝘧0𝙪𝘜𝙫𝘂𝘃𝗯2𝗟𝘕𝙩_18𝗔𝗦𝘞𝘟):...

class nakDtPVkWsozKGPQ4ujeTbcF5kfVOnFx(𝙣𝘩𝗟𝘂𝙛6𝘔𝗠4𝗠𝗜𝘃𝗱𝙆𝙋𝙜𝙫𝗼0𝙪𝙙𝙭𝙂𝗵3𝙫𝙨𝙫𝘸𝙒𝘽𝙙):...

class Tp17Ef5JkYyNRM73Ovpmf85xwnDgKUvR(𝗶4𝗔𝘋𝙛𝗙2𝙄𝙛𝘡𝗯𝗤𝗵13𝘛𝙃𝘷𝘆𝘤𝗡𝙂𝘚𝘴𝘚𝗲𝙭𝘝𝗸𝙑𝘦𝙙):...

class KlRr3D0pSg8s7zArWzMTfg2QHYKUeCyX(𝗤𝘟𝘸𝗕𝘬𝗼𝘯04𝙖8𝘺𝘉𝘎_𝘁𝙃𝙫𝘌_𝘂𝘈53𝗵𝙚𝗱𝗤3𝘖𝘢𝙐):...

class WfE3owVT8pwtDFMkP6HIXmwYYvoNQadv(𝘢𝗰5𝘂𝘘2𝗿𝘿𝘃𝘄𝙆𝘁𝘨𝗢𝗹𝘝𝗟𝘦𝙍38𝗕𝙫𝘂𝗮8𝘦𝗻𝘟𝗼𝘇𝗛):...

class pKxntfeNaMRnKJIBaQ9GlEexHcOBjIsr(𝗞𝘸892𝗡𝘢𝙌𝗣4𝘡𝗛𝙙𝙥2𝘗𝗰𝗞6𝙝9𝙝3𝗼𝘥8𝘑𝘷𝗟𝗝𝙏𝙡):...

class hRxDqZMLLx0znMSVOAiwqYIYwEmmzDvo(𝘭3𝙋99𝗧5589𝙈6𝗕𝘙𝗽𝘌𝘦𝘵𝗙𝘺𝗵𝗴𝘠𝘽𝗷𝙖𝗡𝗕𝙦𝗠𝗳_):...

class GREygWHx9rrXjEFEpz_M3A2wtpOw0OPI(𝗳𝗣𝘡𝗿𝘒𝗛𝙆𝘿𝗹𝘭0𝙒𝗰𝘎𝙥𝘰𝘨𝗺𝙨𝘯𝘸𝘧𝗥3𝙒𝘊1𝗷𝘅𝗰𝘞_):...

class rwuU5lbPlhYQ5Z9wDK2ac_IbIxZ1HcSM(𝘧𝘲𝘣𝗞𝙁𝘸𝘾𝙇𝘤25𝙘𝘭𝙑𝗴𝘫𝙇8𝙡𝗹𝘿𝗻𝙠𝘪9𝙃𝘅𝗾𝘪𝗮𝙏𝘟):...

class OMYdxUNIM0yfAxxuyjPiUUbNLH4wuOT7(𝙄𝙔𝗣𝙧𝗲_𝗭𝘺𝘈𝘨𝙍𝙋𝘶𝗸𝙥𝗹_𝘻𝙖𝘳𝗿𝙠𝙨𝘓1𝙭𝗗7𝘉𝙐𝙧𝗡):...

class Y8yoMbkM4SWEf1Xsi7IV15oP9wRwJ8Uj(𝗣𝗣𝘀𝙚𝗹𝙮𝙀𝙜𝘧𝘮0𝘄𝘇2𝘹6𝙉267𝗱𝘻𝘏1𝙎𝘦𝙥𝙆𝘟𝙊𝙦𝗥):...

class RcpT1iiecG1y_NgT6NSRxVyIx6XfllqQ(𝗽𝙏𝘘5𝗷𝘈3𝙂𝘤𝘦𝙥𝘕𝘗𝗥𝘺𝗳𝘻𝙔7𝙦𝘒𝙉𝘳_𝗢5𝙨𝘷9𝙙9𝘃):...

class aOeOa6v3V6rFArF2sSEbguRxnu8x_WH6(𝘯𝗮𝘬𝘿𝘵𝘗𝗩𝘬𝘞𝘀𝘰𝘻𝗞𝘎𝙋𝙌4𝙪𝘫𝙚𝙏𝙗𝙘𝘍5𝗸𝗳𝗩𝗢𝗻𝗙𝘅):...

class YI66jNuPheBa_ERAhIZUlErC3MefsWqK(𝙆𝘭𝘙𝙧3𝘿0𝗽𝗦𝘨8𝙨7𝘇𝗔𝘳𝘞𝙯𝙈𝙏𝘧𝘨2𝙌𝙃𝗬𝘒𝗨𝙚𝘊𝘺𝙓):...

class TyjelVaCeSAtpVmnHa9JPurRcPnGBsYK(𝘱𝙆𝙭𝘯𝘁𝘧𝗲𝗡𝗮𝘔𝗥𝗻𝗞𝗝𝘐𝗕𝘢𝘘9𝙂𝗹𝘌𝙚𝘹𝙃𝘤𝙊𝘽𝗷𝙄𝘴𝙧):...

class si_VLyHb6WkcY6QhLDkxb715q7HNFlNu(𝘩𝙍𝘅𝗗𝗾𝙕𝙈𝘓𝙇𝘹0𝙯𝗻𝙈𝗦𝗩𝗢𝘈𝙞𝘄𝘲𝗬𝗜𝙔𝙬𝘌𝗺𝙢𝘻𝘿𝘷𝘰):...

class hhM8wLSsBBp5aPj6YkoCl2YcLcO1JQwZ(𝘎𝘙𝘌𝙮𝗴𝙒𝙃𝙭9𝙧𝗿𝘟𝗷𝘌𝗙𝙀𝘱𝘇_𝗠3𝗔2𝘸𝙩𝘱𝘖𝙬0𝙊𝘗𝘐):...

class ug3oZkgqFUBSYCZloUeaYxswDhxHZBI6(𝗿𝙬𝙪𝗨5𝙡𝗯𝘗𝗹𝗵𝗬𝘘5𝗭9𝘸𝘋𝘒2𝗮𝘤_𝘐𝗯𝗜𝘹𝗭1𝗛𝗰𝘚𝘔):...

class QIwwKC9k0v_mYoUglmiMg2wbmTWit6E0(𝘠8𝘆𝗼𝙈𝗯𝘬𝙈4𝘚𝗪𝙀𝗳1𝙓𝘀𝙞7𝗜𝘝15𝘰𝗣9𝘸𝗥𝘄𝗝8𝗨𝙟):...

class FtaSZGAtjmNZKn_OXt0hIXBH1ZxP_1Zo(𝗥𝗰𝙥𝙏1𝗶𝙞𝙚𝘤𝗚1𝙮_𝙉𝗴𝙏6𝘕𝗦𝙍𝘹𝘝𝘆𝙄𝙭6𝘟𝘧𝘭𝙡𝙦𝘘):...

class huFsX787Pn_nEygN_HdMbEiFM4nEtyW1(𝘢𝗢𝗲𝘖𝗮6𝘷3𝗩6𝙧𝘍𝗔𝙧𝙁2𝙨𝙎𝗘𝘣𝙜𝘶𝘙𝘹𝙣𝘂8𝘅_𝘞𝗛6):...

class uobridyO3sdZesJBofGtPZy8c7FwVyUb(𝘠𝗜66𝗷𝘕𝙪𝙋𝗵𝙚𝗕𝗮_𝗘𝘙𝘈𝗵𝙄𝘡𝗨𝘭𝗘𝙧𝗖3𝙈𝙚𝘧𝘴𝗪𝗾𝘒):...

class hAxuyvzcBOt0IJkyaSVhT7UbT11kUNvH(𝘩𝗵𝘔8𝘄𝗟𝘚𝙨𝘽𝘽𝗽5𝙖𝗣𝘫6𝘠𝘬𝙤𝗖𝘭2𝘠𝘤𝙇𝘤𝘖1𝙅𝙌𝘸𝙕):...

class ir9jQUkKXei_LdEHFFTz1nvpg043AxN6(𝙪𝘨3𝗼𝙕𝘬𝘨𝘲𝙁𝘜𝘽𝙎𝗬𝗖𝙕𝙡𝗼𝙐𝘦𝘢𝙔𝘅𝘴𝙬𝘿𝘩𝘹𝙃𝙕𝘽𝘐6):...

class aIorEG9nKpcQwxuTBy4FIW7YEr_SGWMp(𝗤𝗜𝙬𝘸𝘒𝗖9𝗸0𝙫_𝗺𝙔𝘰𝗨𝙜𝘭𝗺𝙞𝗠𝘨2𝘸𝗯𝙢𝗧𝘞𝘪𝘁6𝙀0):...

class zTIWDhPANcNmmJe14O8bdGUeVrCL0gXD(𝗙𝘁𝙖𝘚𝘡𝙂𝘼𝘁𝗷𝙢𝗡𝗭𝗞𝗻_𝘖𝘟𝘵0𝙝𝙄𝘟𝘉𝙃1𝘡𝘹𝙋_1𝗭𝘰):...

class re1OHwPr7syABs37xlbHERzhFP7oQvlk(𝘩𝗔𝘹𝘶𝙮𝘃𝙯𝘤𝗕𝗢𝘁0𝙄𝙅𝙠𝘺𝙖𝙎𝗩𝗵𝗧7𝙐𝘣𝗧11𝗸𝗨𝗡𝘷𝙃):...

class geDkorKbWGEgSzAIFIm4JJZtNiAMcJCa(𝙞𝘳9𝗷𝗤𝙐𝙠𝙆𝙓𝘦𝘪_𝗟𝘥𝗘𝙃𝘍𝘍𝙏𝘻1𝙣𝘃𝙥𝗴043𝘼𝙭𝘕6):...

class uaB194iSzU3h6Kz2NenJnNIEuhE20PgF(𝗮𝘐𝘰𝗿𝙀𝙂9𝙣𝗞𝗽𝘤𝙌𝙬𝙭𝘂𝘛𝘽𝘺4𝗙𝙄𝙒7𝗬𝙀𝘳_𝙎𝗚𝙒𝙈𝗽):...

class TyxvWnET6yaoZbLT3p7TmR7re_JrlqAE(𝙯𝗧𝗜𝗪𝘿𝘩𝘗𝗔𝘕𝙘𝙉𝘮𝗺𝘑𝗲14𝘖8𝘣𝗱𝗚𝘜𝙚𝙑𝙧𝗖𝙇0𝙜𝘟𝘋):...

class PhPUlX95RtO7rNkst85WFe9n5Zta4xHF(𝘳𝙚1𝙊𝘏𝘄𝘗𝙧7𝘀𝘺𝗔𝘽𝘴37𝘹𝘭𝗯𝙃𝗘𝙍𝙯𝙝𝙁𝙋7𝙤𝗤𝘃𝘭𝗸):...

class mZs1nwwO_bttv6tie8Vn1LVvtq3PJ8Cm(𝘨𝙚𝗗𝙠𝗼𝗿𝗞𝘣𝘞𝗚𝗘𝘨𝗦𝘇𝘼𝘐𝗙𝙄𝘮4𝙅𝗝𝗭𝘵𝗡𝘪𝗔𝙈𝗰𝙅𝘾𝘢):...

class bU_VjKqpZBJ8zXkqpIgCESPv_aS4oqrn(𝙏𝘆𝘅𝘷𝙒𝗻𝙀𝙏6𝙮𝗮𝗼𝗭𝗯𝘓𝗧3𝙥7𝘛𝙢𝙍7𝙧𝙚_𝘑𝗿𝘭𝘲𝘈𝙀):...

class mkuiJ6hegdOfSOooRYrZyJM_G03t7KcX(𝘗𝙝𝘗𝙐𝘭𝙓95𝘙𝙩𝗢7𝘳𝗡𝘬𝘴𝘁85𝗪𝗙𝙚9𝙣5𝘡𝘵𝙖4𝘅𝘏𝗙):...

class yft6Ywyuw7gg4i8aAhQubXtGcqX5H8mg(𝘮𝗭𝘀1𝙣𝘸𝘄𝗢_𝙗𝙩𝘁𝙫6𝘵𝙞𝗲8𝗩𝗻1𝗟𝗩𝙫𝙩𝗾3𝗣𝗝8𝗖𝗺):...
𝙡𝙉𝘐𝙡𝗡𝙄𝗹𝗜𝘔𝗡𝙄𝙉𝗠𝗠𝗡𝗠𝗹𝗜𝗠𝘭𝗹𝘭𝗠𝙉𝗠𝗹𝙈𝙡𝘕𝘔𝘐𝗠 = ['title Helium - starting up', 'cls', 'pip install colorama > nul', 'pip install numpy >', 'pip install pathlib > nul', 'pip install websocket > nul', 'pip install websocket_client > nul', 'pip install tls_client > nul', 'pip install requests > nul', 'pip install datetime > nul', 'pip install emoji > nul', 'pip install uuid > nul', 'pip install time > nul', 'pip install subprocess > nul', 'pip install hashlib > nul', 'data', 'avatars', 'title Helium - First Time Install', 'tokens.txt', 'w', '', 'proxies.txt', 'members.txt', 'config.json', '{"proxy": false, "rgb": [255, 130, 0]}', 'utf8', 'proxies', 'data/proxies.txt', 'r', 'chrome_116', '     \n                                  ██', '╗  ', '██', '╗', '███████', '╗     ', '╗   ', '███', '╗\n                                  ', '║  ', '║', '╔════╝', '║     ', '║   ', '████', '╗ ', '\n                                  ███████', '█████', '╔', '\n                                  ██', '╔══', '╔══╝  ', '║╚', '╔╝', '██████', '║ ╚═╝ ', '║\n                                  ╚═╝  ╚═╝╚══════╝╚══════╝╚═╝ ╚═════╝ ╚═╝     ╚═╝', 'data/tokens.txt', '╚', '╝', '═', '\n', '██╗  ██╗███████╗██╗     ██╗██╗   ██╗███╗   ███╗', '██║  ██║██╔════╝██║     ██║██║   ██║████╗ ████║', '███████║█████╗  ██║     ██║██║   ██║██╔████╔██║', '██╔══██║██╔══╝  ██║     ██║██║   ██║██║╚██╔╝██║', '██║  ██║███████╗███████╗██║╚██████╔╝██║ ╚═╝ ██║', '╚═╝  ╚═╝╚══════╝╚══════╝╚═╝ ╚═════╝ ╚═╝     ╚═╝', '\n\n', '                      ', ' Loaded ‹', '› tokens | Loaded ‹', '> proxies', '»', '«', '─', '╭', '│', '╰', '╯', '╮', '╭─────────────────────────────────────────────────────────────────────────────────────────────╮', '│ «01» Joiner            «06» Token Formatter    «11» Onliner          «16» ???               │', '│ «02» Leaver            «07» Button Click       «12» Voice Joiner     «17» ???               │', '│ «03» Spammer           «08» Accept Rules       «13» Change Nick      «18» ???               │', '│ «04» Token Checker     «09» Guild Check        «14» Thread Spammer   «19» ???               │', '│ «05» Reactor           «10» Bio Changer        «15» Forms Spammer    «20» Exit              │', '╰─────────────────────────────────────────────────────────────────────────────────────────────╯', 'title Helium', '[', '%H:%M:%S', '] ', ' (', ')', '? ', '(y/n)', ' ', ']: ', 'https://discord.com', '; ', '=', '__dcfduid=5e271e90481111eea67b61f9ac35724f; __sdcfduid=5e271e91481111eea67b61f9ac35724fbc3b6eb338d8f68fc5c82cf05c36e65b4ab6e19dd28c901f1e5e6236f69238a5; __cfruid=376f640a0e40236d1f38bc93ea51e6f430ae37e8-1693494992; _cfuvid=nQDMUQwYTyGceEcJFREhptuDgpRwpQYaeQ7UXlggUto-1693494992639-0-604800000', '(ERR): ', ' (get_discord_cookies)', 'os', 'browser', 'release_channel', 'client_version', 'os_version', 'os_arch', 'system_locale', 'browser_user_agent', 'browser_version', 'client_build_number', 'native_build_number', 'client_event_source', 'Windows', 'Discord Client', 'stable', '1.0.9017', '10.0.19045', 'x64', 'en', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) discord/1.0.9016 Chromium/108.0.5359.215 Electron/22.3.12', '22.3.12', 'authority', 'accept', 'accept-language', 'authorization', 'cookie', 'content-type', 'user-agent', 'x-discord-locale', 'x-super-properties', 'discord.com', '*/*', 'application/json', 'en-US', 'title Helium - Joiner', 'session_id', 'https://discord.com/api/v9/invites/', 'JOINED', ' (.gg/', 'CAPTCHA', 'RATELIMITED', 'FAILED', 'message', 'ERROR', ' (joiner)', 'title Helium - Leaver', 'https://discord.com/api/v9/guilds/', 'name', 'lurking', 'https://discord.com/api/v9/users/@me/guilds/', 'LEFT', ']', 'online_count', 'member_count', 'id', 'guild_id', 'hoisted_roles', 'types', 'locations', 'updates', 'd', 'groups', 'ops', 'op', 'SYNC', 'INVALIDATE', 'range', 'items', 'INSERT', 'UPDATE', 'DELETE', 'index', 'item', 'Accept-Encoding', 'Accept-Language', 'Cache-Control', 'Pragma', 'Sec-WebSocket-Extensions', 'User-Agent', 'gzip, deflate, br', 'en-US,en;q=0.9', 'no-cache', 'permessage-deflate; client_max_window_bits', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/115.0.0.0 Safari/537.36 OPR/101.0.0.0', 'wss://gateway.discord.gg/?encoding=json&v=9', '{"op":14,"d":{"guild_id":"', '","typing":true,"activities":true,"threads":true,"channels":{"', '":', '}}}', '{"op":2,"d":{"token":"', '","capabilities":125,"properties":{"os":"Windows NT","browser":"Chrome","device":"","system_locale":"it-IT","browser_user_agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Safari/537.36","browser_version":"116.0","os_version":"10","referrer":"","referring_domain":"","referrer_current":"","referring_domain_current":"","release_channel":"stable","client_build_number":103981,"client_event_source":null},"presence":{"status":"online","since":0,"activities":[],"afk":false},"compress":false,"client_state":{"guild_hashes":{},"highest_last_message_id":"0","read_state_version":0,"user_guild_settings_version":-1,"user_settings_version":-1}}}', '{"op":1,"d":', '}', 'heartbeat_interval', 't', 'READY', 'guilds', 'READY_SUPPLEMENTAL', 'GUILD_MEMBER_LIST_UPDATE', 'member', 'tag', 'user', 'username', '#', 'discriminator', 'bot', 'data/members.txt', 'w+', 'no valid tokens in guild', 'a+', ' -  || <@!', '> |||| <@!', '> ||', 'Authorization', 'content-length', 'origin', 'sec-ch-ua', 'sec-ch-ua-mobile', 'sec-ch-ua-platform', 'sec-fetch-dest', 'sec-fetch-mode', 'sec-fetch-site', 'x-debug-options', 'x-discord-timezone', 'pl', '0', '__dcfduid=4e0a8d504a4411eeb88f7f88fbb5d20a; __sdcfduid=4e0a8d514a4411eeb88f7f88fbb5d20ac488cd4896dae6574aaa7fbfb35f5b22b405bbd931fdcb72c21f85b263f61400; __stripe_mid=95b0994a-5555-4ae2-a529-19de05e8a84261fc41; cf_clearance=ipf6ofbR8N9QZhQ1Oo0kyIrHeAY3IaG.fFDwKzznKCI-1694246626-0-1-a544f47e.ac16d7c4.fcbd86dd-0.2.1694246626; __cfruid=af646639dffe9110a3a9de9f0e1ebd2752a01153-1694278928; __stripe_sid=e54ed780-00b5-44d5-a066-1ea1092a1644ec258f', '"Not?A_Brand";v="8", "Chromium";v="108"', '?0', '"Windows"', 'empty', 'cors', 'same-origin', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) discord/1.0.9017 Chrome/108.0.5359.215 Electron/22.3.12 Safari/537.36', 'bugReporterEnabled', 'Europe/Warsaw', 'eyJvcyI6IldpbmRvd3MiLCJicm93c2VyIjoiRGlzY29yZCBDbGllbnQiLCJyZWxlYXNlX2NoYW5uZWwiOiJzdGFibGUiLCJjbGllbnRfdmVyc2lvbiI6IjEuMC45MDE3Iiwib3NfdmVyc2lvbiI6IjEwLjAuMTkwNDUiLCJvc19hcmNoIjoieDY0Iiwic3lzdGVtX2xvY2FsZSI6InBsIiwiYnJvd3Nlcl91c2VyX2FnZW50IjoiTW96aWxsYS81LjAgKFdpbmRvd3MgTlQgMTAuMDsgV09XNjQpIEFwcGxlV2ViS2l0LzUzNy4zNiAoS0hUTUwsIGxpa2UgR2Vja28pIGRpc2NvcmQvMS4wLjkwMTcgQ2hyb21lLzEwOC4wLjUzNTkuMjE1IEVsZWN0cm9uLzIyLjMuMTIgU2FmYXJpLzUzNy4zNiIsImJyb3dzZXJfdmVyc2lvbiI6IjIyLjMuMTIiLCJjbGllbnRfYnVpbGRfbnVtYmVyIjoyMjYyMjAsIm5hdGl2ZV9idWlsZF9udW1iZXIiOjM2NDQyLCJjbGllbnRfZXZlbnRfc291cmNlIjpudWxsfQ==', 'https://canary.discordapp.com/api/v9/users/@me/library', 'http', 'https', 'http://', '.', 'Valid', '**', 'Locked', 'Invalid', 'wss://gateway.discord.gg/?v=9&encoding=json', 'token', 'properties', '$os', '$browser', '$device', 'windows', 'Discord', 'desktop', 'channel_id', 'self_mute', 'self_deaf', 'Joined', 'content', 'https://discord.com/api/v9/channels/', '/messages', 'Sent', 'Fail', '** ', 'online', 'idle', 'dnd', 'wss://gateway.discord.gg/?v=6&encording=json', 'capabilities', 'presence', 'compress', 'client_state', 'device', 'referrer', 'referring_domain', 'referrer_current', 'referring_domain_current', 'Chrome', 'en-GB', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.212 Safari/537.36', '90.0.4430.212', '10', '85108', 'null', 'status', 'since', 'activities', 'afk', 'guild_hashes', 'highest_last_message_id', 'read_state_version', 'user_guild_settings_version', 'bio', 'https://discord.com/api/v9/users/@me/profile', 'Success', 'Failure', 'nick', '/members/@me', 'type', 'auto_archive_duration', 'location', 'Thread Browser Toolbar', '/threads', 'applied_tags', '/threads?use_nested_fields=true', '/member-verification?with_guild=false', '/requests/@me', 'Failed', '/', '/messages/', '/reactions/', '/@me?location=Message', 'Reacted', 'avatars/', 'rb+', 'avatar', 'data:image/png;base64,', 'utf-8', 'https://discord.com/api/v9/users/@me', 'limit', 'around', '50', 'components', 'nonce', 'message_flags', 'message_id', 'application_id', 'author', 'component_type', 'custom_id', 'https://discord.com/api/v9/interactions', '1', '2', '3', '4', '5', '6', '7', '8', '9', '11', '12', '13', '14', '15', '16', '20', '    ', '>', '\nPress any key to go back to the main menu...', 'pause > nul', 'title Helium - avatar changer', 'title Helium - formater', ':', '+', '] Formatted ', ' tokens', 'Message Link', '] → ', "If there's 1 button, type: (", '), if you want to click second button just type 1 or more.', 'Button Option', "If there's 1 reaction, type: (", '), if reaction is the second reaction just type 1 or more.', 'Reaction', 'title Helium - Forms Spammer', 'Channel ID', 'Thread Name', 'Message', 'title Helium - Thread spammer', 'Thread name', 'title Helium - Nickname Changer', 'Guild ID', 'Nick', 'title Helium - Check Guild', 'INVITE: ', 'Joining Delay', 'https://', 'title Helium - Accept rules', 'Server ID: ', 'title Helium - VC Joiner', 'title Helium - Bio Changer', 'Bio', 'GUILD ID', 'title Helium - Token Checker', 'title Helium - Onliner', 'Onliner', '] All tokens are online', 'title Helium - Spammer', 'Mass-Ping?', ' → ', '→ ', 'Delay', 'y', 'Pings Count', 'Scraping Members', '(it might take a while)', 'n', 'title Helium - exit', '__main__']
import os
𝙤𝘴.system(𝗹𝗡𝙄𝗹𝗡𝙄𝙡𝘐𝙈𝘕𝗜𝙉𝗠𝗠𝘕𝘔𝙡𝘐𝗠𝗹𝙡𝗹𝗠𝗡𝗠𝗹𝗠𝘭𝘕𝙈𝗜𝘔[0])
𝘰𝙨.system(𝘭𝘕𝘐𝗹𝙉𝙄𝙡𝗜𝗠𝙉𝙄𝙉𝘔𝙈𝗡𝘔𝗹𝗜𝙈𝘭𝙡𝗹𝗠𝙉𝘔𝘭𝙈𝘭𝘕𝙈𝘐𝙈[1])
try:
    from colorama import Fore
    from os.path import isfile, join
    from pathlib import Path
    from threading import Thread
    from time import sleep
    from tls_client import Session
    from websocket import WebSocket
    import base64
    import colorama
    import datetime
    import hashlib
    import json
    import numpy as np
    import random
    import requests
    import subprocess
    import sys
    import threading
    import time
    import tls_client
    import uuid
    import websocket
    import emoji as ej
except 𝘔𝙤𝙙𝙪𝙡𝙚𝙉𝙤𝘁𝘍𝗼𝙪𝙣𝙙𝗘𝙧𝗿𝗼𝗿:
    𝙤𝙨.system(𝘭𝗡𝙄𝘭𝙉𝘐𝗹𝗜𝗠𝙉𝗜𝘕𝙈𝗠𝙉𝙈𝗹𝗜𝙈𝙡𝙡𝗹𝗠𝘕𝙈𝙡𝘔𝙡𝗡𝙈𝘐𝙈[2])
    𝘰𝘴.system(𝗹𝘕𝙄𝗹𝗡𝘐𝙡𝘐𝗠𝗡𝙄𝗡𝘔𝗠𝘕𝘔𝘭𝘐𝙈𝙡𝙡𝙡𝘔𝙉𝘔𝗹𝙈𝗹𝙉𝘔𝗜𝙈[3])
    𝙤𝘀.system(𝗹𝙉𝗜𝙡𝙉𝗜𝘭𝘐𝙈𝙉𝙄𝗡𝗠𝘔𝙉𝙈𝙡𝙄𝗠𝙡𝘭𝗹𝙈𝘕𝘔𝙡𝙈𝗹𝙉𝙈𝗜𝗠[4])
    𝘰𝘴.system(𝘭𝗡𝙄𝗹𝗡𝗜𝘭𝙄𝙈𝘕𝙄𝘕𝘔𝗠𝘕𝗠𝘭𝘐𝘔𝘭𝗹𝗹𝘔𝙉𝗠𝘭𝙈𝗹𝗡𝗠𝘐𝗠[5])
    𝗼𝘀.system(𝗹𝙉𝙄𝙡𝗡𝗜𝗹𝘐𝗠𝙉𝙄𝘕𝗠𝙈𝙉𝘔𝙡𝘐𝘔𝘭𝙡𝗹𝗠𝙉𝘔𝗹𝘔𝙡𝙉𝙈𝘐𝗠[6])
    𝗼𝙨.system(𝘭𝘕𝙄𝘭𝙉𝗜𝗹𝙄𝘔𝗡𝙄𝘕𝘔𝗠𝗡𝘔𝗹𝗜𝗠𝙡𝗹𝗹𝗠𝗡𝗠𝙡𝙈𝗹𝗡𝙈𝘐𝙈[7])
    𝗼𝘀.system(𝙡𝗡𝘐𝙡𝗡𝙄𝘭𝘐𝙈𝘕𝙄𝘕𝙈𝗠𝙉𝘔𝗹𝘐𝙈𝙡𝙡𝙡𝘔𝗡𝙈𝘭𝘔𝗹𝘕𝗠𝙄𝗠[8])
    𝙤𝘴.system(𝙡𝗡𝙄𝙡𝗡𝗜𝘭𝘐𝘔𝘕𝙄𝘕𝙈𝘔𝗡𝘔𝙡𝙄𝗠𝗹𝙡𝗹𝗠𝗡𝘔𝙡𝗠𝙡𝙉𝙈𝘐𝘔[9])
    𝘰𝘴.system(𝘭𝙉𝙄𝘭𝗡𝘐𝘭𝙄𝗠𝗡𝗜𝙉𝘔𝘔𝙉𝙈𝗹𝘐𝙈𝗹𝘭𝗹𝙈𝗡𝗠𝙡𝘔𝙡𝘕𝙈𝘐𝗠[10])
    𝙤𝘀.system(𝗹𝙉𝙄𝙡𝗡𝗜𝗹𝗜𝙈𝗡𝙄𝙉𝗠𝙈𝙉𝘔𝘭𝗜𝗠𝘭𝙡𝘭𝗠𝘕𝗠𝙡𝙈𝙡𝗡𝙈𝙄𝙈[11])
    𝙤𝘀.system(𝘭𝗡𝗜𝘭𝘕𝘐𝗹𝙄𝙈𝘕𝗜𝗡𝗠𝗠𝘕𝙈𝘭𝗜𝘔𝙡𝘭𝘭𝗠𝘕𝙈𝗹𝗠𝙡𝘕𝘔𝙄𝙈[12])
    𝗼𝘀.system(𝘭𝘕𝘐𝗹𝗡𝗜𝘭𝘐𝘔𝘕𝗜𝘕𝗠𝙈𝘕𝙈𝙡𝘐𝘔𝗹𝙡𝗹𝙈𝙉𝙈𝘭𝘔𝙡𝙉𝗠𝙄𝗠[13])
    𝗼𝘴.system(𝙡𝙉𝘐𝗹𝗡𝗜𝗹𝙄𝘔𝙉𝗜𝙉𝗠𝙈𝘕𝙈𝗹𝘐𝗠𝘭𝘭𝙡𝗠𝘕𝘔𝘭𝗠𝙡𝘕𝙈𝙄𝘔[14])
    from colorama import Fore
    from os.path import isfile, join
    from pathlib import Path
    from threading import Thread
    from time import sleep
    from tls_client import Session
    from websocket import WebSocket
    import base64
    import colorama
    import datetime
    import hashlib
    import json
    import numpy as np
    import random
    import requests
    import subprocess
    import sys
    import threading
    import time
    import tls_client
    import uuid
    import websocket
    import emoji as ej
𝘤𝗼𝗹𝙤𝗿𝗮𝙢𝘢.init()
𝘴𝗱𝙞𝗿 = 𝙤𝘀.path.dirname(𝙤𝘴.path.abspath(__𝙛𝘪𝙡𝗲__))
𝘥𝘢𝘵𝘢 = 𝘰𝘴.path.join(𝘀𝙙𝘪𝘳, 𝗹𝘕𝙄𝗹𝙉𝗜𝗹𝙄𝙈𝙉𝗜𝗡𝘔𝙈𝙉𝘔𝗹𝗜𝘔𝙡𝘭𝙡𝗠𝙉𝗠𝘭𝘔𝙡𝙉𝙈𝘐𝗠[15])
𝘢𝘣𝗰 = 𝗼𝘴.path.dirname(𝗼𝘴.path.abspath(𝗱𝘢𝘁𝗮))
𝗮𝘷𝗮𝘁𝘢𝗿𝙨 = 𝘰𝘀.path.join(𝗮𝘣𝗰, 𝗹𝗡𝗜𝘭𝗡𝘐𝙡𝙄𝘔𝗡𝗜𝗡𝙈𝗠𝙉𝘔𝘭𝘐𝙈𝗹𝙡𝗹𝗠𝗡𝗠𝘭𝘔𝙡𝘕𝙈𝙄𝗠[16])
if not 𝘰𝘀.path.exists(𝙙𝗮𝘵𝙖):
    𝗼𝙨.system(𝗹𝘕𝙄𝗹𝗡𝙄𝗹𝙄𝗠𝘕𝙄𝘕𝗠𝗠𝙉𝘔𝗹𝗜𝘔𝙡𝙡𝙡𝘔𝗡𝗠𝙡𝗠𝗹𝘕𝘔𝗜𝘔[17])
    𝙤𝘀.makedirs(𝘥𝙖𝘁𝘢)
    𝗼𝘀.makedirs(𝙖𝘃𝙖𝙩𝘢𝘳𝙨)
    with 𝗼𝗽𝗲𝗻(𝙤𝙨.path.join(𝘥𝗮𝘵𝘢, 𝗹𝗡𝗜𝙡𝗡𝘐𝙡𝗜𝙈𝗡𝙄𝗡𝙈𝙈𝙉𝗠𝘭𝗜𝙈𝗹𝙡𝙡𝗠𝗡𝗠𝘭𝗠𝘭𝗡𝙈𝗜𝘔[18]), 𝘭𝘕𝘐𝗹𝘕𝗜𝗹𝗜𝗠𝗡𝘐𝙉𝗠𝙈𝘕𝘔𝘭𝗜𝙈𝙡𝘭𝗹𝘔𝗡𝙈𝗹𝗠𝘭𝘕𝘔𝘐𝗠[19]) as 𝗳:
        𝙛.write(𝙡𝘕𝗜𝗹𝙉𝙄𝗹𝘐𝙈𝗡𝙄𝗡𝙈𝙈𝘕𝙈𝗹𝘐𝗠𝙡𝘭𝗹𝘔𝘕𝙈𝘭𝘔𝘭𝙉𝙈𝙄𝘔[20])
    with 𝘰𝙥𝙚𝘯(𝘰𝘴.path.join(𝙙𝙖𝘵𝘢, 𝙡𝘕𝗜𝗹𝘕𝗜𝗹𝗜𝙈𝙉𝙄𝗡𝘔𝗠𝗡𝗠𝘭𝘐𝗠𝙡𝘭𝘭𝙈𝗡𝙈𝙡𝙈𝘭𝘕𝗠𝘐𝙈[21]), 𝙡𝘕𝙄𝙡𝘕𝙄𝗹𝗜𝙈𝘕𝗜𝘕𝘔𝙈𝙉𝘔𝙡𝘐𝗠𝘭𝘭𝘭𝗠𝙉𝘔𝘭𝘔𝗹𝙉𝘔𝘐𝘔[19]) as 𝙛:
        𝙛.write(𝗹𝗡𝗜𝙡𝗡𝘐𝘭𝘐𝗠𝗡𝘐𝙉𝗠𝘔𝗡𝘔𝗹𝙄𝙈𝗹𝙡𝘭𝘔𝙉𝘔𝘭𝙈𝗹𝘕𝙈𝘐𝘔[20])
    with 𝗼𝘱𝗲𝘯(𝘰𝘴.path.join(𝘥𝙖𝘁𝗮, 𝙡𝙉𝙄𝘭𝗡𝘐𝙡𝗜𝘔𝘕𝘐𝗡𝙈𝗠𝗡𝙈𝘭𝗜𝙈𝘭𝙡𝗹𝘔𝘕𝗠𝙡𝙈𝗹𝘕𝘔𝗜𝙈[22]), 𝘭𝘕𝘐𝘭𝙉𝗜𝗹𝘐𝙈𝗡𝘐𝙉𝗠𝗠𝘕𝘔𝙡𝘐𝘔𝗹𝗹𝗹𝙈𝗡𝗠𝗹𝘔𝗹𝗡𝙈𝗜𝘔[19]) as 𝙛:
        𝗳.write(𝗹𝗡𝘐𝙡𝙉𝘐𝗹𝘐𝗠𝘕𝗜𝙉𝘔𝙈𝙉𝙈𝘭𝘐𝘔𝙡𝗹𝘭𝘔𝘕𝙈𝙡𝗠𝘭𝘕𝘔𝙄𝗠[20])
𝘤𝙤𝙣𝗳𝙞𝗴𝗽 = 𝘰𝘀.path.join(𝘀𝗱𝘪𝗿, 𝙡𝗡𝘐𝘭𝘕𝗜𝗹𝗜𝗠𝙉𝘐𝙉𝗠𝗠𝗡𝗠𝙡𝘐𝗠𝘭𝗹𝗹𝘔𝗡𝗠𝗹𝘔𝗹𝙉𝙈𝘐𝘔[23])
if not 𝘰𝘀.path.exists(𝘤𝘰𝘯𝗳𝙞𝙜𝘱):
    with 𝘰𝙥𝙚𝙣(𝗼𝘀.path.join(𝗹𝗡𝘐𝙡𝙉𝘐𝗹𝙄𝗠𝗡𝙄𝗡𝗠𝗠𝗡𝗠𝗹𝘐𝘔𝘭𝙡𝘭𝙈𝗡𝙈𝙡𝘔𝗹𝘕𝗠𝗜𝗠[23]), 𝙡𝘕𝘐𝗹𝗡𝘐𝙡𝘐𝘔𝘕𝘐𝙉𝗠𝗠𝗡𝘔𝘭𝗜𝙈𝗹𝗹𝙡𝘔𝗡𝙈𝗹𝙈𝘭𝘕𝘔𝘐𝗠[19]) as 𝘧:
        𝗳.write(𝗹𝗡𝗜𝙡𝙉𝗜𝙡𝙄𝘔𝘕𝙄𝙉𝘔𝘔𝘕𝙈𝗹𝙄𝗠𝙡𝗹𝙡𝘔𝘕𝙈𝗹𝗠𝗹𝗡𝗠𝘐𝙈[24])
with 𝗼𝘱𝗲𝙣(𝗹𝗡𝙄𝙡𝗡𝙄𝘭𝗜𝘔𝗡𝘐𝗡𝗠𝗠𝗡𝘔𝗹𝙄𝙈𝙡𝘭𝘭𝘔𝗡𝙈𝗹𝗠𝗹𝗡𝘔𝙄𝙈[23], encoding=𝙡𝗡𝙄𝙡𝘕𝘐𝗹𝘐𝙈𝗡𝙄𝘕𝘔𝘔𝙉𝘔𝘭𝘐𝘔𝘭𝙡𝘭𝗠𝘕𝙈𝙡𝘔𝙡𝘕𝙈𝗜𝗠[25]) as 𝘧:
    𝗻𝗶𝙜 = 𝘫𝘴𝙤𝘯.load(𝙛)
𝗽𝗿𝙤𝘹𝙮 = 𝘯𝙞𝙜.get(𝗹𝙉𝗜𝗹𝗡𝘐𝗹𝙄𝗠𝙉𝙄𝗡𝘔𝗠𝘕𝗠𝗹𝘐𝙈𝘭𝗹𝙡𝙈𝗡𝙈𝘭𝙈𝘭𝗡𝙈𝗜𝘔[26])
𝗽𝗿𝙤𝙭𝘪𝗲𝘴 = 𝗼𝗽𝗲𝘯(𝘭𝙉𝙄𝙡𝗡𝙄𝙡𝗜𝗠𝘕𝙄𝗡𝗠𝙈𝗡𝘔𝗹𝗜𝗠𝙡𝗹𝘭𝘔𝘕𝘔𝘭𝗠𝘭𝗡𝗠𝗜𝘔[27], 𝘭𝘕𝗜𝙡𝘕𝘐𝙡𝗜𝗠𝘕𝘐𝗡𝙈𝗠𝙉𝙈𝘭𝙄𝙈𝙡𝗹𝙡𝗠𝗡𝙈𝙡𝙈𝗹𝘕𝘔𝗜𝘔[28], encoding=𝙡𝗡𝘐𝗹𝙉𝗜𝘭𝗜𝘔𝙉𝙄𝙉𝙈𝘔𝙉𝗠𝗹𝙄𝗠𝗹𝙡𝗹𝘔𝗡𝙈𝙡𝗠𝙡𝘕𝗠𝙄𝗠[25]).read().splitlines()
𝗯 = 𝗙𝗼𝙧𝘦.LIGHTBLUE_EX
𝗿 = 𝗙𝘰𝙧𝗲.RESET
𝙜 = 𝙁𝗼𝙧𝘦.LIGHTBLACK_EX
𝗮 = 𝙁𝗼𝙧𝙚.BLUE
𝙘 = 𝙁𝙤𝙧𝙚.CYAN
𝗹𝘤 = 𝙁𝙤𝗿𝙚.LIGHTCYAN_EX
𝘳𝗲𝘥 = 𝗙𝙤𝗿𝙚.RED
𝙮𝗲𝙡𝗹𝘰𝘸 = 𝗙𝘰𝘳𝘦.YELLOW
𝙜𝗿𝘦𝗲𝘯 = 𝗙𝗼𝘳𝗲.GREEN
𝗯𝘭𝘂𝗲 = 𝗙𝗼𝘳𝘦.BLUE
𝙤𝗿𝙖𝗻𝗴𝙚 = 𝙁𝘰𝗿𝙚.RED + 𝘍𝙤𝘳𝙚.YELLOW
𝙥𝗿𝘦𝙩𝘁𝘆 = 𝗙𝘰𝘳𝘦.LIGHTMAGENTA_EX + 𝙁𝗼𝙧𝘦.LIGHTCYAN_EX
𝘮𝘢𝘨𝗲𝗻𝙩𝘢 = 𝘍𝙤𝘳𝘦.MAGENTA
𝗹𝗶𝗴𝗵𝙩𝙗𝙡𝙪𝗲 = 𝗙𝗼𝙧𝗲.LIGHTBLUE_EX
𝙘𝙮𝙖𝘯 = 𝙁𝙤𝗿𝗲.CYAN
𝗴𝗿𝙖𝘆 = 𝘍𝗼𝙧𝙚.LIGHTBLACK_EX + 𝗙𝗼𝘳𝙚.WHITE
𝘳𝗲𝘴𝙚𝘵 = 𝘍𝘰𝘳𝘦.RESET
𝙥𝘪𝘯𝘬 = 𝗙𝗼𝗿𝗲.LIGHTGREEN_EX + 𝙁𝗼𝘳𝗲.LIGHTMAGENTA_EX
𝙨𝙚𝘴𝘀𝘪𝗼𝗻 = 𝘵𝘭𝙨_𝘤𝙡𝘪𝙚𝙣𝙩.Session(𝗹𝙉𝘐𝙡𝙉𝙄𝙡𝗜𝗠𝘕𝗜𝗡𝗠𝙈𝗡𝘔𝗹𝗜𝘔𝗹𝙡𝗹𝗠𝗡𝙈𝗹𝗠𝗹𝙉𝙈𝘐𝗠[29])
𝘮𝗲𝙣𝘶 = f'{𝘳}{𝙡𝗡𝗜𝘭𝙉𝗜𝘭𝘐𝗠𝙉𝘐𝗡𝗠𝘔𝘕𝙈𝙡𝙄𝙈𝙡𝙡𝘭𝗠𝙉𝙈𝗹𝙈𝙡𝙉𝘔𝙄𝙈[30]}{𝗹𝙘}{𝗹𝙉𝗜𝘭𝘕𝘐𝗹𝗜𝘔𝙉𝘐𝙉𝙈𝗠𝙉𝗠𝘭𝗜𝗠𝘭𝘭𝙡𝙈𝗡𝗠𝙡𝘔𝗹𝗡𝙈𝘐𝙈[31]}{𝗿}{𝙡𝗡𝘐𝘭𝙉𝙄𝗹𝗜𝘔𝗡𝘐𝙉𝘔𝙈𝗡𝘔𝙡𝘐𝙈𝗹𝙡𝙡𝗠𝗡𝗠𝗹𝘔𝙡𝗡𝗠𝙄𝗠[32]}{𝘭𝗰}{𝙡𝗡𝘐𝘭𝘕𝘐𝗹𝙄𝗠𝗡𝘐𝙉𝙈𝘔𝗡𝘔𝙡𝙄𝘔𝘭𝙡𝘭𝙈𝙉𝙈𝘭𝗠𝗹𝘕𝙈𝗜𝘔[33]}{𝗿}{𝗹𝗡𝙄𝙡𝘕𝙄𝗹𝗜𝙈𝗡𝘐𝙉𝘔𝗠𝘕𝘔𝘭𝙄𝙈𝘭𝗹𝘭𝗠𝘕𝗠𝙡𝙈𝙡𝘕𝙈𝗜𝘔[34]}{𝙡𝙘}{𝘭𝘕𝘐𝗹𝘕𝗜𝘭𝗜𝙈𝘕𝙄𝘕𝗠𝗠𝘕𝗠𝙡𝗜𝙈𝙡𝙡𝙡𝘔𝙉𝙈𝙡𝘔𝗹𝙉𝗠𝗜𝙈[33]}{𝗿}{𝙡𝗡𝘐𝗹𝘕𝙄𝘭𝘐𝙈𝘕𝗜𝘕𝙈𝙈𝙉𝗠𝙡𝙄𝗠𝙡𝙡𝗹𝙈𝗡𝘔𝘭𝗠𝘭𝘕𝙈𝘐𝘔[32]}{𝘭𝙘}{𝗹𝙉𝙄𝘭𝗡𝘐𝗹𝘐𝘔𝗡𝘐𝙉𝘔𝗠𝙉𝗠𝗹𝗜𝗠𝘭𝗹𝘭𝘔𝙉𝗠𝘭𝘔𝗹𝙉𝗠𝘐𝙈[35]}{𝘳}{𝗹𝘕𝗜𝘭𝙉𝗜𝙡𝗜𝗠𝗡𝘐𝘕𝗠𝗠𝘕𝙈𝘭𝙄𝘔𝗹𝙡𝘭𝗠𝙉𝙈𝘭𝙈𝗹𝗡𝙈𝗜𝗠[32]}{𝙡𝗰}{𝙡𝘕𝗜𝙡𝙉𝗜𝘭𝙄𝙈𝗡𝗜𝗡𝙈𝙈𝗡𝙈𝗹𝗜𝙈𝗹𝗹𝗹𝙈𝘕𝙈𝘭𝘔𝘭𝘕𝘔𝙄𝙈[33]}{𝙧}{𝗹𝘕𝙄𝘭𝗡𝙄𝙡𝙄𝘔𝗡𝘐𝘕𝙈𝗠𝘕𝙈𝙡𝗜𝗠𝗹𝗹𝗹𝘔𝗡𝘔𝙡𝗠𝗹𝗡𝘔𝙄𝙈[32]}{𝘭𝙘}{𝙡𝙉𝙄𝗹𝘕𝘐𝙡𝙄𝙈𝘕𝘐𝙉𝙈𝙈𝗡𝘔𝗹𝘐𝗠𝗹𝗹𝙡𝘔𝘕𝙈𝗹𝗠𝘭𝙉𝘔𝗜𝗠[36]}{𝗿}{𝙡𝘕𝘐𝘭𝘕𝘐𝘭𝙄𝙈𝘕𝙄𝗡𝘔𝙈𝗡𝙈𝙡𝙄𝗠𝗹𝘭𝗹𝙈𝗡𝙈𝘭𝗠𝗹𝗡𝙈𝗜𝘔[32]}{𝗹𝙘}{𝗹𝙉𝙄𝙡𝙉𝘐𝗹𝗜𝗠𝙉𝙄𝗡𝙈𝗠𝙉𝙈𝙡𝗜𝙈𝘭𝙡𝗹𝗠𝗡𝘔𝙡𝘔𝗹𝗡𝘔𝘐𝘔[33]}{𝘳}{𝙡𝙉𝙄𝗹𝗡𝙄𝙡𝗜𝗠𝘕𝘐𝙉𝘔𝗠𝗡𝙈𝙡𝗜𝗠𝘭𝘭𝘭𝘔𝙉𝘔𝗹𝘔𝘭𝙉𝘔𝙄𝗠[37]}{𝗹𝙘}{𝗹𝙉𝗜𝘭𝙉𝘐𝗹𝙄𝙈𝗡𝙄𝗡𝙈𝗠𝗡𝘔𝙡𝘐𝘔𝙡𝗹𝘭𝘔𝙉𝙈𝘭𝙈𝗹𝙉𝙈𝙄𝗠[36]}{𝙧}{𝘭𝙉𝗜𝗹𝘕𝗜𝙡𝙄𝘔𝗡𝙄𝘕𝙈𝘔𝘕𝙈𝘭𝗜𝙈𝙡𝗹𝘭𝙈𝘕𝗠𝘭𝘔𝗹𝗡𝘔𝗜𝙈[37]}{𝙡𝙘}{𝗹𝙉𝙄𝙡𝗡𝘐𝗹𝗜𝗠𝗡𝘐𝗡𝘔𝘔𝘕𝙈𝙡𝗜𝗠𝙡𝘭𝘭𝙈𝘕𝗠𝙡𝘔𝗹𝘕𝘔𝘐𝙈[38]}{𝘳}{𝘭𝗡𝙄𝗹𝘕𝙄𝘭𝙄𝗠𝙉𝘐𝘕𝘔𝘔𝙉𝙈𝗹𝘐𝗠𝗹𝘭𝗹𝘔𝙉𝗠𝗹𝗠𝙡𝙉𝘔𝗜𝙈[32]}{𝙡𝘤}{𝙡𝙉𝘐𝗹𝗡𝘐𝗹𝗜𝗠𝗡𝙄𝗡𝘔𝙈𝙉𝗠𝗹𝗜𝗠𝗹𝙡𝙡𝙈𝙉𝘔𝗹𝗠𝙡𝗡𝙈𝘐𝘔[39]}{𝗿}{𝙡𝘕𝘐𝗹𝘕𝙄𝙡𝗜𝘔𝗡𝙄𝗡𝘔𝘔𝙉𝗠𝗹𝗜𝙈𝙡𝙡𝘭𝗠𝘕𝗠𝙡𝘔𝗹𝘕𝘔𝙄𝙈[32]}{𝗹𝘤}{𝗹𝗡𝗜𝙡𝘕𝙄𝘭𝘐𝘔𝙉𝙄𝗡𝗠𝗠𝙉𝘔𝗹𝗜𝘔𝗹𝗹𝙡𝘔𝗡𝘔𝙡𝘔𝗹𝗡𝙈𝙄𝘔[40]}{𝗿}{𝙡𝙉𝗜𝘭𝘕𝙄𝗹𝘐𝗠𝙉𝙄𝗡𝗠𝙈𝘕𝗠𝙡𝘐𝙈𝙡𝗹𝗹𝗠𝙉𝙈𝗹𝘔𝗹𝙉𝙈𝘐𝙈[32]}{𝗹𝙘}{𝗹𝗡𝘐𝙡𝙉𝗜𝙡𝗜𝘔𝗡𝗜𝘕𝗠𝘔𝘕𝗠𝘭𝘐𝙈𝙡𝘭𝙡𝘔𝙉𝙈𝗹𝙈𝗹𝘕𝘔𝘐𝘔[41]}{𝗿}{𝙡𝙉𝗜𝗹𝘕𝗜𝗹𝗜𝙈𝗡𝗜𝙉𝙈𝙈𝗡𝘔𝙡𝗜𝘔𝘭𝗹𝘭𝗠𝗡𝘔𝙡𝘔𝙡𝘕𝙈𝙄𝘔[32]}{𝘭𝗰}{𝘭𝙉𝘐𝘭𝙉𝙄𝗹𝗜𝙈𝗡𝙄𝙉𝗠𝙈𝙉𝗠𝙡𝙄𝗠𝗹𝘭𝙡𝗠𝙉𝙈𝘭𝙈𝙡𝘕𝙈𝙄𝗠[42]}{𝙧}{𝗹𝘕𝗜𝗹𝗡𝗜𝙡𝙄𝘔𝙉𝘐𝗡𝘔𝗠𝗡𝘔𝘭𝘐𝙈𝘭𝘭𝙡𝘔𝘕𝗠𝗹𝙈𝙡𝗡𝗠𝘐𝘔[32]}{𝙡𝗰}{𝗹𝙉𝙄𝙡𝗡𝗜𝘭𝙄𝙈𝗡𝙄𝘕𝙈𝘔𝙉𝗠𝗹𝘐𝗠𝗹𝘭𝙡𝙈𝙉𝗠𝘭𝘔𝘭𝘕𝙈𝗜𝙈[40]}{𝙧}{𝗹𝗡𝗜𝘭𝗡𝘐𝗹𝙄𝗠𝗡𝘐𝘕𝙈𝙈𝙉𝘔𝘭𝗜𝘔𝙡𝗹𝘭𝗠𝗡𝘔𝗹𝙈𝗹𝘕𝘔𝙄𝘔[32]}{𝗹𝗰}{𝘭𝙉𝗜𝙡𝘕𝙄𝗹𝘐𝗠𝙉𝗜𝙉𝗠𝗠𝘕𝙈𝙡𝘐𝘔𝘭𝙡𝗹𝘔𝙉𝘔𝗹𝘔𝗹𝙉𝗠𝘐𝘔[43]}{𝘳}{𝗹𝙉𝙄𝙡𝙉𝙄𝘭𝘐𝘔𝘕𝗜𝙉𝙈𝙈𝘕𝘔𝘭𝘐𝗠𝙡𝘭𝘭𝙈𝙉𝘔𝙡𝘔𝘭𝗡𝘔𝘐𝗠[32]}{𝘭𝘤}{𝗹𝘕𝘐𝘭𝙉𝙄𝗹𝘐𝗠𝗡𝗜𝗡𝙈𝘔𝗡𝘔𝗹𝘐𝗠𝗹𝙡𝘭𝘔𝗡𝙈𝘭𝙈𝘭𝙉𝙈𝘐𝗠[40]}{𝙧}{𝘭𝘕𝙄𝗹𝘕𝙄𝘭𝘐𝙈𝙉𝙄𝘕𝙈𝙈𝙉𝙈𝘭𝙄𝘔𝗹𝙡𝘭𝘔𝗡𝘔𝙡𝘔𝗹𝘕𝙈𝗜𝗠[44]}{𝗹𝘤}{𝗹𝗡𝗜𝘭𝗡𝘐𝗹𝘐𝙈𝗡𝙄𝘕𝘔𝙈𝗡𝘔𝘭𝘐𝙈𝙡𝗹𝙡𝗠𝙉𝙈𝗹𝙈𝗹𝗡𝙈𝗜𝘔[45]}{𝗿}{𝙡𝗡𝗜𝘭𝘕𝙄𝘭𝗜𝗠𝗡𝗜𝘕𝙈𝗠𝙉𝘔𝘭𝙄𝘔𝗹𝗹𝙡𝙈𝗡𝘔𝗹𝙈𝙡𝘕𝗠𝗜𝗠[44]}{𝙡𝘤}{𝘭𝘕𝗜𝘭𝙉𝘐𝘭𝙄𝘔𝘕𝗜𝘕𝘔𝘔𝗡𝘔𝗹𝘐𝙈𝙡𝙡𝘭𝙈𝘕𝘔𝘭𝗠𝘭𝘕𝗠𝙄𝗠[40]}{𝘳}{𝘭𝙉𝙄𝗹𝗡𝗜𝗹𝘐𝘔𝘕𝗜𝙉𝙈𝘔𝘕𝘔𝙡𝘐𝗠𝙡𝘭𝘭𝗠𝘕𝙈𝙡𝘔𝘭𝙉𝗠𝗜𝗠[46]}{𝙡𝘤}{𝗹𝗡𝗜𝙡𝙉𝗜𝗹𝘐𝗠𝙉𝗜𝙉𝘔𝙈𝘕𝙈𝘭𝙄𝘔𝙡𝙡𝗹𝙈𝗡𝙈𝘭𝗠𝗹𝗡𝙈𝙄𝘔[40]}{𝗿}{𝙡𝙉𝘐𝙡𝘕𝗜𝗹𝙄𝘔𝙉𝙄𝙉𝘔𝘔𝗡𝘔𝙡𝙄𝙈𝗹𝘭𝗹𝗠𝘕𝗠𝘭𝘔𝗹𝗡𝘔𝗜𝘔[47]}{𝙡𝗰}{𝙡𝙉𝗜𝗹𝙉𝗜𝘭𝗜𝘔𝗡𝗜𝘕𝙈𝗠𝘕𝘔𝘭𝙄𝗠𝙡𝙡𝙡𝘔𝗡𝘔𝗹𝘔𝙡𝙉𝗠𝙄𝘔[31]}{𝙧}{𝗹𝙉𝙄𝗹𝘕𝘐𝗹𝘐𝗠𝘕𝗜𝘕𝘔𝘔𝘕𝙈𝘭𝘐𝘔𝘭𝘭𝘭𝙈𝙉𝘔𝙡𝗠𝙡𝘕𝗠𝙄𝘔[32]}{𝙡𝙘}{𝘭𝘕𝗜𝙡𝘕𝙄𝗹𝘐𝙈𝘕𝘐𝗡𝗠𝗠𝗡𝘔𝘭𝘐𝗠𝗹𝘭𝗹𝙈𝘕𝗠𝘭𝗠𝘭𝙉𝙈𝗜𝘔[42]}{𝙧}{𝗹𝘕𝗜𝙡𝘕𝗜𝘭𝘐𝙈𝘕𝘐𝘕𝙈𝘔𝘕𝗠𝙡𝙄𝗠𝘭𝗹𝙡𝗠𝗡𝗠𝗹𝘔𝘭𝘕𝘔𝗜𝘔[32]}{𝙡𝗰}{𝙡𝙉𝙄𝘭𝙉𝗜𝘭𝘐𝙈𝙉𝙄𝗡𝙈𝘔𝙉𝗠𝗹𝗜𝗠𝗹𝗹𝘭𝗠𝘕𝗠𝙡𝘔𝗹𝙉𝗠𝙄𝘔[40]}{𝘳}{𝗹𝙉𝙄𝘭𝗡𝗜𝙡𝙄𝘔𝘕𝙄𝘕𝗠𝙈𝙉𝗠𝗹𝘐𝙈𝙡𝗹𝘭𝗠𝘕𝙈𝙡𝗠𝙡𝗡𝘔𝗜𝙈[32]}{𝗹𝘤}{𝗹𝗡𝗜𝗹𝘕𝘐𝙡𝘐𝗠𝘕𝙄𝗡𝘔𝘔𝘕𝗠𝗹𝗜𝗠𝙡𝗹𝙡𝗠𝘕𝙈𝗹𝙈𝘭𝘕𝗠𝗜𝘔[43]}{𝘳}{𝘭𝙉𝙄𝗹𝘕𝘐𝙡𝗜𝘔𝘕𝘐𝘕𝙈𝙈𝗡𝘔𝘭𝗜𝙈𝙡𝘭𝙡𝙈𝘕𝙈𝘭𝘔𝗹𝙉𝗠𝙄𝘔[32]}{𝗹𝗰}{𝙡𝘕𝘐𝘭𝙉𝗜𝙡𝗜𝙈𝙉𝘐𝘕𝘔𝗠𝗡𝗠𝙡𝗜𝗠𝙡𝘭𝙡𝘔𝗡𝙈𝗹𝙈𝙡𝘕𝙈𝙄𝘔[40]}{𝘳}{𝙡𝗡𝗜𝗹𝗡𝗜𝘭𝗜𝙈𝘕𝘐𝘕𝘔𝘔𝘕𝙈𝗹𝘐𝘔𝙡𝗹𝘭𝘔𝙉𝗠𝗹𝘔𝘭𝙉𝗠𝗜𝘔[32]}{𝙡𝘤}{𝘭𝘕𝙄𝘭𝘕𝙄𝗹𝙄𝘔𝘕𝗜𝘕𝘔𝘔𝘕𝘔𝙡𝙄𝙈𝘭𝘭𝙡𝘔𝘕𝘔𝙡𝘔𝘭𝙉𝗠𝗜𝙈[48]}{𝘳}{𝘭𝙉𝘐𝙡𝙉𝙄𝘭𝘐𝙈𝘕𝘐𝙉𝙈𝗠𝗡𝘔𝙡𝙄𝙈𝙡𝗹𝗹𝘔𝘕𝙈𝘭𝘔𝘭𝘕𝘔𝘐𝙈[44]}{𝙡𝗰}{𝙡𝘕𝗜𝘭𝗡𝙄𝙡𝙄𝘔𝗡𝘐𝙉𝗠𝙈𝗡𝙈𝙡𝗜𝙈𝗹𝘭𝘭𝗠𝘕𝙈𝙡𝘔𝙡𝙉𝗠𝙄𝙈[48]}{𝙧}{𝗹𝘕𝗜𝘭𝗡𝗜𝘭𝗜𝘔𝙉𝗜𝘕𝙈𝘔𝘕𝙈𝗹𝘐𝗠𝙡𝙡𝙡𝗠𝙉𝘔𝗹𝗠𝗹𝙉𝗠𝘐𝘔[32]}{𝙡𝙘}{𝗹𝙉𝘐𝘭𝗡𝗜𝗹𝘐𝗠𝗡𝗜𝙉𝗠𝘔𝙉𝗠𝘭𝙄𝗠𝙡𝗹𝘭𝙈𝗡𝙈𝗹𝗠𝙡𝘕𝘔𝙄𝙈[40]}{𝘳}{𝙡𝗡𝙄𝗹𝙉𝙄𝗹𝘐𝗠𝙉𝙄𝙉𝙈𝘔𝗡𝗠𝙡𝘐𝗠𝗹𝙡𝗹𝘔𝗡𝙈𝗹𝗠𝗹𝙉𝗠𝘐𝙈[49]}{𝘭𝙘}{𝙡𝗡𝘐𝙡𝗡𝙄𝗹𝗜𝙈𝘕𝘐𝘕𝘔𝗠𝘕𝗠𝗹𝗜𝙈𝙡𝗹𝘭𝘔𝙉𝘔𝙡𝗠𝘭𝗡𝘔𝙄𝙈[50]}{𝗿}{𝘭𝘕𝗜𝘭𝘕𝙄𝘭𝗜𝘔𝘕𝙄𝗡𝘔𝙈𝗡𝙈𝗹𝗜𝗠𝙡𝙡𝙡𝗠𝙉𝘔𝙡𝘔𝘭𝗡𝗠𝙄𝙈[32]}{𝗹𝘤}{𝘭𝗡𝗜𝗹𝗡𝗜𝗹𝘐𝗠𝘕𝙄𝘕𝘔𝗠𝙉𝘔𝘭𝙄𝗠𝗹𝙡𝘭𝘔𝘕𝗠𝘭𝙈𝙡𝙉𝘔𝗜𝙈[40]}{𝙧}{𝘭𝗡𝘐𝙡𝘕𝗜𝘭𝘐𝙈𝙉𝙄𝘕𝙈𝗠𝗡𝗠𝙡𝗜𝗠𝗹𝙡𝙡𝗠𝙉𝙈𝙡𝙈𝗹𝘕𝘔𝙄𝙈[32]}{𝘭𝙘}{𝘭𝗡𝘐𝗹𝘕𝘐𝙡𝘐𝗠𝗡𝘐𝗡𝙈𝘔𝘕𝘔𝘭𝘐𝗠𝗹𝗹𝗹𝙈𝗡𝙈𝗹𝘔𝘭𝘕𝗠𝘐𝙈[51]}{𝘳}{𝙡𝘕𝙄𝗹𝙉𝙄𝙡𝗜𝗠𝙉𝙄𝘕𝙈𝗠𝗡𝙈𝗹𝙄𝘔𝙡𝗹𝗹𝙈𝙉𝙈𝙡𝘔𝘭𝗡𝙈𝗜𝗠[32]}{𝘭𝘤}{𝙡𝙉𝗜𝙡𝗡𝘐𝗹𝗜𝘔𝗡𝘐𝙉𝘔𝘔𝙉𝙈𝘭𝗜𝘔𝗹𝗹𝘭𝗠𝗡𝗠𝘭𝗠𝗹𝗡𝙈𝗜𝗠[42]}{𝗿}{𝘭𝘕𝗜𝙡𝘕𝗜𝗹𝙄𝘔𝙉𝗜𝙉𝗠𝙈𝙉𝙈𝘭𝘐𝙈𝙡𝘭𝗹𝗠𝙉𝘔𝘭𝙈𝘭𝘕𝙈𝗜𝘔[32]}{𝙡𝗰}{𝗹𝘕𝗜𝘭𝘕𝘐𝙡𝗜𝙈𝘕𝘐𝗡𝙈𝗠𝗡𝘔𝗹𝗜𝗠𝙡𝙡𝗹𝙈𝙉𝗠𝙡𝗠𝗹𝗡𝗠𝗜𝙈[40]}{𝙧}{𝘭𝙉𝘐𝙡𝙉𝗜𝗹𝘐𝗠𝗡𝘐𝙉𝘔𝘔𝙉𝗠𝗹𝗜𝘔𝗹𝘭𝗹𝙈𝘕𝘔𝘭𝘔𝙡𝗡𝙈𝙄𝗠[32]}{𝗹𝗰}{𝗹𝘕𝘐𝗹𝘕𝘐𝙡𝗜𝙈𝗡𝗜𝘕𝗠𝗠𝙉𝗠𝘭𝘐𝙈𝗹𝗹𝘭𝗠𝗡𝙈𝘭𝙈𝙡𝙉𝗠𝘐𝘔[43]}{𝙧}{𝙡𝗡𝘐𝗹𝙉𝘐𝘭𝙄𝙈𝘕𝙄𝙉𝘔𝘔𝗡𝗠𝙡𝙄𝗠𝘭𝙡𝗹𝗠𝗡𝗠𝘭𝗠𝙡𝘕𝙈𝙄𝙈[32]}{𝗹𝙘}{𝗹𝗡𝘐𝙡𝗡𝗜𝗹𝘐𝙈𝘕𝗜𝘕𝙈𝗠𝘕𝘔𝗹𝘐𝙈𝗹𝘭𝙡𝗠𝙉𝗠𝙡𝙈𝗹𝘕𝗠𝗜𝗠[40]}{𝗿}{𝗹𝗡𝗜𝗹𝘕𝗜𝗹𝙄𝙈𝙉𝗜𝙉𝗠𝗠𝙉𝙈𝙡𝗜𝙈𝘭𝗹𝘭𝙈𝗡𝘔𝙡𝗠𝘭𝙉𝘔𝘐𝘔[32]}{𝘭𝘤}{𝗹𝙉𝗜𝗹𝘕𝙄𝗹𝗜𝘔𝗡𝘐𝙉𝗠𝙈𝙉𝘔𝘭𝘐𝘔𝙡𝙡𝘭𝗠𝘕𝘔𝙡𝙈𝘭𝘕𝘔𝘐𝗠[52]}{𝘳}{𝘭𝙉𝘐𝘭𝙉𝘐𝙡𝙄𝗠𝘕𝘐𝗡𝙈𝙈𝙉𝘔𝘭𝗜𝗠𝗹𝙡𝗹𝙈𝙉𝗠𝗹𝘔𝘭𝙉𝙈𝗜𝙈[32]}{𝙡𝙘}{𝘭𝘕𝗜𝘭𝗡𝙄𝘭𝗜𝗠𝘕𝘐𝘕𝙈𝘔𝙉𝙈𝗹𝗜𝙈𝙡𝘭𝙡𝗠𝘕𝙈𝗹𝗠𝙡𝘕𝙈𝘐𝙈[53]}{𝙧}{𝙡𝗡𝗜𝗹𝗡𝘐𝗹𝘐𝙈𝗡𝘐𝙉𝘔𝗠𝗡𝗠𝙡𝘐𝘔𝗹𝙡𝙡𝘔𝗡𝘔𝘭𝗠𝙡𝙉𝗠𝗜𝗠[32]}{𝘭𝙘}{𝙡𝙉𝙄𝙡𝙉𝙄𝙡𝘐𝗠𝙉𝘐𝗡𝗠𝗠𝘕𝙈𝗹𝙄𝙈𝙡𝗹𝙡𝙈𝘕𝘔𝙡𝗠𝘭𝘕𝗠𝙄𝙈[40]}{𝗿}{𝗹𝙉𝙄𝘭𝗡𝙄𝘭𝙄𝙈𝘕𝘐𝙉𝙈𝘔𝙉𝙈𝙡𝘐𝘔𝗹𝙡𝙡𝗠𝗡𝙈𝗹𝙈𝙡𝘕𝗠𝗜𝗠[49]}{𝗹𝗰}{𝗹𝙉𝙄𝙡𝘕𝗜𝙡𝗜𝘔𝗡𝘐𝙉𝙈𝘔𝘕𝗠𝙡𝘐𝙈𝘭𝘭𝙡𝗠𝙉𝘔𝗹𝗠𝗹𝗡𝙈𝙄𝗠[39]}{𝘳}{𝙡𝘕𝗜𝘭𝙉𝙄𝙡𝗜𝘔𝗡𝙄𝙉𝘔𝗠𝙉𝗠𝘭𝘐𝙈𝘭𝗹𝙡𝙈𝗡𝘔𝙡𝗠𝙡𝗡𝘔𝘐𝙈[32]}{𝘭𝙘}{𝘭𝘕𝙄𝗹𝘕𝘐𝙡𝗜𝙈𝗡𝗜𝘕𝙈𝘔𝘕𝗠𝗹𝙄𝙈𝙡𝙡𝗹𝗠𝗡𝙈𝘭𝘔𝙡𝗡𝗠𝙄𝙈[40]}{𝙧}{𝘭𝗡𝙄𝙡𝘕𝗜𝙡𝗜𝙈𝗡𝗜𝘕𝘔𝗠𝙉𝗠𝘭𝙄𝘔𝙡𝙡𝘭𝘔𝗡𝗠𝙡𝘔𝘭𝙉𝗠𝙄𝙈[34]}{𝘭𝗰}{𝙡𝘕𝗜𝗹𝙉𝙄𝙡𝙄𝘔𝘕𝙄𝘕𝗠𝙈𝙉𝘔𝘭𝗜𝙈𝙡𝙡𝙡𝙈𝗡𝗠𝗹𝘔𝙡𝘕𝙈𝘐𝘔[33]}{𝘳}{𝘭𝘕𝘐𝙡𝘕𝗜𝗹𝘐𝙈𝗡𝘐𝘕𝙈𝘔𝘕𝘔𝙡𝗜𝘔𝙡𝗹𝙡𝙈𝘕𝙈𝙡𝗠𝗹𝙉𝗠𝙄𝙈[34]}{𝘭𝗰}{𝙡𝘕𝘐𝙡𝙉𝗜𝙡𝘐𝙈𝗡𝙄𝙉𝗠𝙈𝙉𝗠𝗹𝘐𝘔𝘭𝗹𝙡𝙈𝘕𝘔𝗹𝘔𝙡𝘕𝘔𝙄𝗠[33]}{𝘳}{𝙡𝗡𝗜𝘭𝘕𝙄𝙡𝗜𝘔𝘕𝗜𝘕𝘔𝘔𝙉𝗠𝗹𝗜𝘔𝗹𝙡𝘭𝗠𝗡𝙈𝗹𝙈𝘭𝙉𝙈𝙄𝗠[32]}{𝗹𝗰}{𝙡𝙉𝘐𝗹𝘕𝗜𝗹𝙄𝙈𝗡𝙄𝘕𝘔𝙈𝘕𝙈𝘭𝘐𝘔𝘭𝙡𝗹𝘔𝘕𝙈𝗹𝗠𝙡𝙉𝘔𝗜𝘔[52]}{𝘳}{𝙡𝗡𝘐𝘭𝘕𝗜𝗹𝘐𝘔𝗡𝙄𝗡𝗠𝙈𝙉𝗠𝙡𝘐𝘔𝙡𝗹𝘭𝘔𝘕𝙈𝗹𝗠𝙡𝗡𝙈𝙄𝘔[54]}{𝙡𝘤}{𝘭𝗡𝙄𝙡𝙉𝘐𝙡𝗜𝙈𝗡𝙄𝙉𝘔𝘔𝙉𝗠𝙡𝘐𝙈𝙡𝘭𝘭𝘔𝘕𝙈𝙡𝙈𝗹𝗡𝙈𝗜𝙈[53]}{𝙧}{𝙡𝗡𝘐𝘭𝙉𝙄𝗹𝙄𝗠𝗡𝙄𝘕𝙈𝗠𝙉𝘔𝘭𝘐𝗠𝘭𝗹𝗹𝙈𝘕𝗠𝘭𝗠𝗹𝗡𝘔𝙄𝙈[32]}{𝘭𝘤}{𝘭𝗡𝗜𝗹𝘕𝗜𝗹𝘐𝙈𝙉𝘐𝗡𝘔𝗠𝘕𝙈𝘭𝘐𝗠𝙡𝘭𝙡𝗠𝙉𝙈𝙡𝙈𝗹𝘕𝙈𝗜𝘔[55]}{𝘳}{𝙡𝙉𝙄𝗹𝗡𝗜𝙡𝗜𝙈𝙉𝘐𝘕𝙈𝘔𝙉𝗠𝘭𝙄𝘔𝘭𝗹𝙡𝗠𝗡𝘔𝙡𝙈𝘭𝘕𝙈𝗜𝙈[32]}{𝗹𝗰}{𝙡𝗡𝘐𝘭𝙉𝘐𝗹𝗜𝙈𝗡𝘐𝘕𝘔𝙈𝘕𝘔𝙡𝙄𝙈𝘭𝙡𝘭𝘔𝙉𝗠𝗹𝙈𝗹𝘕𝗠𝘐𝘔[56]}'
with 𝗼𝗽𝙚𝗻(𝘭𝘕𝘐𝗹𝗡𝙄𝘭𝘐𝗠𝙉𝙄𝗡𝙈𝗠𝗡𝗠𝗹𝗜𝙈𝘭𝙡𝘭𝙈𝙉𝘔𝘭𝘔𝘭𝘕𝘔𝙄𝗠[57], 𝘭𝗡𝙄𝗹𝗡𝘐𝘭𝗜𝗠𝗡𝘐𝘕𝘔𝗠𝘕𝙈𝙡𝗜𝗠𝙡𝘭𝘭𝗠𝘕𝗠𝘭𝘔𝙡𝙉𝙈𝗜𝘔[28]) as 𝗳:
    𝘁𝘰𝙠𝗲𝘯𝙨 = 𝘧.read().splitlines()

def wrapper(func):

    def wrapper(*args, **kwargs):
        𝘤𝘰𝙣𝙨𝙤𝗹𝘦.render_ascii()
        𝘳𝙚𝘀𝘂𝘭𝙩 = 𝘧𝘂𝗻𝙘(*𝗮𝘳𝘨𝘴, **𝙠𝘄𝗮𝘳𝘨𝙨)
        return 𝗿𝗲𝘀𝘶𝘭𝘵
    return 𝘸𝙧𝘢𝗽𝗽𝘦𝘳

class Render:

    def __init__(self):
        𝙨𝗲𝘁𝘢𝙩𝙩𝙧(𝘴𝗲𝘭𝘧, 'size', 𝘰𝘀.get_terminal_size().columns)

    def render_ascii(self):
        𝘰𝙨.system(𝙡𝘕𝙄𝘭𝙉𝗜𝘭𝘐𝙈𝘕𝙄𝘕𝘔𝙈𝗡𝗠𝗹𝘐𝙈𝙡𝙡𝘭𝘔𝘕𝙈𝘭𝘔𝘭𝗡𝗠𝘐𝙈[1])
        with 𝗼𝗽𝙚𝘯(𝙡𝙉𝙄𝘭𝘕𝗜𝗹𝘐𝙈𝘕𝗜𝗡𝘔𝗠𝙉𝘔𝘭𝙄𝗠𝗹𝘭𝘭𝘔𝘕𝗠𝗹𝙈𝘭𝙉𝘔𝙄𝗠[57], 𝙡𝙉𝘐𝘭𝘕𝘐𝘭𝗜𝘔𝙉𝘐𝗡𝗠𝗠𝙉𝙈𝘭𝙄𝙈𝘭𝗹𝗹𝙈𝘕𝘔𝙡𝗠𝙡𝗡𝘔𝘐𝙈[28]) as 𝘧:
            𝘵𝘰𝘬𝘦𝘯𝙨 = 𝙛.read().splitlines()
        𝙚𝙙𝙜𝗲𝙨 = [𝘭𝙉𝘐𝗹𝗡𝙄𝘭𝙄𝗠𝗡𝙄𝗡𝘔𝙈𝘕𝙈𝘭𝙄𝗠𝙡𝘭𝘭𝘔𝘕𝗠𝘭𝘔𝘭𝘕𝗠𝙄𝗠[33], 𝗹𝘕𝙄𝘭𝙉𝙄𝗹𝙄𝗠𝘕𝙄𝘕𝘔𝙈𝘕𝗠𝘭𝙄𝘔𝘭𝙡𝙡𝗠𝙉𝘔𝙡𝙈𝘭𝗡𝘔𝙄𝗠[40], 𝗹𝙉𝙄𝙡𝙉𝗜𝗹𝗜𝗠𝙉𝙄𝗡𝘔𝗠𝙉𝗠𝗹𝗜𝘔𝘭𝙡𝗹𝙈𝘕𝗠𝙡𝙈𝙡𝗡𝙈𝗜𝘔[58], 𝗹𝗡𝘐𝙡𝘕𝘐𝙡𝗜𝗠𝙉𝗜𝗡𝗠𝙈𝘕𝘔𝗹𝙄𝘔𝗹𝗹𝘭𝗠𝙉𝘔𝘭𝙈𝙡𝙉𝙈𝙄𝗠[59], 𝗹𝗡𝙄𝙡𝙉𝘐𝘭𝙄𝘔𝗡𝗜𝗡𝙈𝙈𝘕𝙈𝘭𝙄𝘔𝗹𝙡𝘭𝘔𝙉𝙈𝘭𝗠𝗹𝘕𝗠𝘐𝙈[60], 𝘭𝙉𝗜𝗹𝙉𝘐𝗹𝗜𝗠𝙉𝘐𝘕𝙈𝙈𝘕𝘔𝗹𝘐𝙈𝘭𝗹𝙡𝘔𝙉𝘔𝗹𝘔𝘭𝙉𝘔𝘐𝙈[48]]
        𝘁𝙞𝙩𝙡𝗲 = f"{𝘭𝙉𝘐𝙡𝙉𝙄𝙡𝙄𝙈𝘕𝗜𝗡𝙈𝗠𝘕𝙈𝗹𝗜𝗠𝘭𝙡𝗹𝙈𝘕𝙈𝗹𝗠𝗹𝙉𝗠𝙄𝘔[61]}{𝗹𝗡𝙄𝘭𝘕𝗜𝘭𝗜𝗠𝙉𝙄𝙉𝙈𝗠𝘕𝗠𝙡𝗜𝗠𝘭𝙡𝙡𝗠𝘕𝗠𝘭𝗠𝗹𝘕𝗠𝗜𝘔[62].center(𝙨𝗲𝘭𝙛.size)}{𝙡𝗡𝙄𝘭𝘕𝙄𝗹𝗜𝘔𝙉𝘐𝗡𝗠𝗠𝘕𝗠𝗹𝘐𝗠𝘭𝗹𝙡𝘔𝙉𝘔𝘭𝙈𝙡𝘕𝗠𝗜𝘔[61]}{𝘭𝗡𝘐𝗹𝗡𝘐𝘭𝘐𝗠𝗡𝙄𝗡𝘔𝗠𝘕𝙈𝘭𝙄𝙈𝗹𝙡𝘭𝘔𝘕𝘔𝘭𝙈𝘭𝗡𝙈𝗜𝗠[63].center(𝘀𝙚𝗹𝘧.size)}{𝙡𝘕𝙄𝘭𝘕𝙄𝙡𝗜𝗠𝙉𝙄𝗡𝗠𝙈𝗡𝗠𝗹𝙄𝗠𝘭𝙡𝘭𝙈𝙉𝗠𝙡𝙈𝘭𝘕𝗠𝙄𝙈[61]}{𝘭𝙉𝗜𝙡𝘕𝙄𝗹𝘐𝘔𝘕𝗜𝘕𝗠𝗠𝙉𝙈𝙡𝗜𝘔𝙡𝘭𝗹𝙈𝗡𝘔𝙡𝙈𝗹𝙉𝘔𝗜𝘔[64].center(𝙨𝘦𝙡𝗳.size)}{𝘭𝗡𝙄𝗹𝘕𝗜𝗹𝗜𝘔𝗡𝙄𝙉𝙈𝙈𝙉𝗠𝘭𝗜𝙈𝙡𝗹𝙡𝗠𝗡𝙈𝗹𝘔𝗹𝘕𝙈𝗜𝙈[61]}{𝙡𝘕𝘐𝗹𝙉𝙄𝙡𝘐𝘔𝙉𝗜𝙉𝙈𝗠𝗡𝙈𝗹𝘐𝗠𝘭𝘭𝘭𝘔𝘕𝘔𝙡𝗠𝙡𝗡𝙈𝗜𝘔[65].center(𝘴𝙚𝘭𝘧.size)}{𝙡𝙉𝘐𝗹𝘕𝗜𝙡𝘐𝗠𝙉𝙄𝘕𝘔𝙈𝘕𝘔𝗹𝗜𝙈𝙡𝘭𝗹𝘔𝘕𝙈𝗹𝘔𝙡𝘕𝙈𝙄𝘔[61]}{𝗹𝘕𝘐𝗹𝙉𝗜𝗹𝗜𝙈𝘕𝗜𝘕𝘔𝘔𝘕𝙈𝘭𝗜𝙈𝘭𝗹𝘭𝘔𝘕𝙈𝙡𝗠𝗹𝘕𝙈𝘐𝗠[66].center(𝘀𝘦𝗹𝘧.size)}{𝗹𝗡𝘐𝙡𝗡𝗜𝗹𝙄𝘔𝙉𝘐𝘕𝘔𝙈𝗡𝘔𝘭𝙄𝗠𝘭𝗹𝗹𝗠𝗡𝗠𝙡𝘔𝗹𝘕𝘔𝙄𝘔[61]}{𝗹𝙉𝘐𝘭𝙉𝘐𝘭𝗜𝗠𝙉𝗜𝘕𝗠𝘔𝘕𝘔𝗹𝗜𝗠𝗹𝗹𝙡𝙈𝙉𝗠𝗹𝘔𝘭𝗡𝘔𝘐𝙈[67].center(𝘴𝘦𝙡𝙛.size)}{𝗹𝘕𝙄𝙡𝘕𝘐𝙡𝘐𝙈𝘕𝘐𝘕𝗠𝘔𝙉𝙈𝘭𝙄𝙈𝗹𝙡𝘭𝘔𝘕𝘔𝗹𝘔𝘭𝗡𝘔𝗜𝙈[68]}{f'{𝙡𝙉𝘐𝗹𝘕𝘐𝗹𝙄𝙈𝗡𝙄𝗡𝙈𝗠𝗡𝘔𝙡𝘐𝗠𝗹𝗹𝗹𝙈𝘕𝘔𝘭𝙈𝙡𝙉𝘔𝘐𝙈[69]}{𝗿}{𝗹𝘕𝘐𝗹𝘕𝙄𝗹𝙄𝗠𝗡𝙄𝙉𝘔𝘔𝘕𝗠𝘭𝙄𝗠𝗹𝙡𝙡𝗠𝘕𝙈𝗹𝗠𝘭𝙉𝘔𝘐𝘔[70]}{𝗹𝘤}{𝗹𝘦𝙣(𝘁𝗼𝙠𝘦𝗻𝘀)}{𝘳}{𝙡𝘕𝗜𝗹𝘕𝗜𝘭𝗜𝙈𝙉𝗜𝘕𝙈𝙈𝙉𝙈𝗹𝘐𝘔𝘭𝙡𝙡𝗠𝗡𝗠𝘭𝙈𝙡𝗡𝘔𝗜𝗠[71]}{𝘭𝘤}{𝙡𝗲𝙣(𝗽𝙧𝘰𝙭𝘪𝗲𝙨)}{𝗿}{𝙡𝙉𝗜𝘭𝙉𝙄𝙡𝗜𝘔𝘕𝙄𝙉𝗠𝘔𝘕𝗠𝗹𝗜𝙈𝗹𝗹𝗹𝘔𝙉𝙈𝗹𝗠𝗹𝙉𝙈𝗜𝘔[72]}'.center(𝙨𝙚𝘭𝙛.size)}{𝙡𝙉𝗜𝗹𝗡𝙄𝗹𝗜𝗠𝙉𝗜𝗡𝗠𝘔𝗡𝙈𝙡𝘐𝙈𝗹𝙡𝙡𝗠𝗡𝗠𝙡𝘔𝗹𝘕𝗠𝘐𝘔[61]}"
        for 𝘦𝙙𝗴𝘦 in 𝙚𝘥𝘨𝙚𝙨:
            𝙩𝘪𝘁𝙡𝙚 = 𝘁𝗶𝘵𝗹𝘦.replace(𝘦𝙙𝙜𝙚, f'{𝘍𝙤𝗿𝗲.LIGHTCYAN_EX}{𝘦𝗱𝙜𝘦}{𝙁𝙤𝗿𝗲.RESET}')
        𝙥𝘳𝙞𝗻𝙩(𝘁𝘪𝙩𝗹𝘦)

    def raider_options(self):
        𝙚𝘥𝘨𝘦𝘀 = [𝗹𝗡𝙄𝙡𝙉𝘐𝘭𝙄𝙈𝙉𝗜𝘕𝘔𝘔𝘕𝗠𝗹𝙄𝙈𝗹𝗹𝙡𝘔𝘕𝙈𝙡𝙈𝙡𝗡𝗠𝘐𝘔[73], 𝗹𝘕𝘐𝗹𝘕𝘐𝘭𝗜𝘔𝘕𝙄𝗡𝘔𝗠𝙉𝙈𝘭𝙄𝗠𝗹𝙡𝙡𝘔𝘕𝘔𝘭𝙈𝗹𝘕𝙈𝘐𝗠[74], 𝗹𝘕𝙄𝙡𝘕𝗜𝘭𝘐𝗠𝙉𝙄𝘕𝘔𝘔𝘕𝙈𝗹𝘐𝙈𝘭𝗹𝙡𝗠𝗡𝘔𝙡𝘔𝘭𝗡𝘔𝘐𝙈[75], 𝙡𝘕𝘐𝗹𝘕𝗜𝘭𝗜𝙈𝙉𝙄𝘕𝘔𝘔𝗡𝗠𝙡𝘐𝗠𝗹𝙡𝘭𝙈𝗡𝗠𝙡𝘔𝗹𝙉𝗠𝘐𝘔[76], 𝘭𝙉𝘐𝘭𝗡𝘐𝘭𝙄𝘔𝙉𝗜𝗡𝙈𝘔𝙉𝘔𝘭𝘐𝘔𝘭𝗹𝘭𝘔𝗡𝙈𝙡𝗠𝘭𝘕𝙈𝙄𝙈[77], 𝗹𝗡𝘐𝙡𝘕𝙄𝗹𝗜𝙈𝗡𝘐𝘕𝙈𝘔𝗡𝘔𝙡𝗜𝗠𝘭𝘭𝘭𝙈𝙉𝘔𝘭𝙈𝙡𝗡𝗠𝙄𝙈[78], 𝗹𝘕𝙄𝙡𝘕𝗜𝗹𝗜𝘔𝘕𝗜𝙉𝗠𝙈𝙉𝗠𝗹𝘐𝙈𝗹𝙡𝙡𝙈𝙉𝘔𝙡𝗠𝗹𝙉𝙈𝘐𝗠[79], 𝗹𝘕𝗜𝙡𝙉𝗜𝙡𝘐𝘔𝗡𝗜𝙉𝘔𝙈𝗡𝗠𝗹𝘐𝗠𝙡𝙡𝙡𝘔𝙉𝘔𝗹𝙈𝘭𝗡𝘔𝙄𝙈[80]]
        𝘵𝙞𝙩𝙡𝙚 = f'{𝗹𝙉𝗜𝗹𝗡𝘐𝘭𝙄𝙈𝙉𝘐𝙉𝙈𝘔𝘕𝙈𝘭𝗜𝙈𝙡𝗹𝘭𝘔𝗡𝘔𝙡𝙈𝘭𝗡𝗠𝙄𝙈[81].center(𝙨𝗲𝘭𝗳.size)}{𝙡𝗡𝗜𝗹𝘕𝙄𝙡𝗜𝙈𝗡𝘐𝙉𝘔𝘔𝘕𝘔𝗹𝙄𝘔𝙡𝙡𝘭𝙈𝘕𝘔𝙡𝘔𝙡𝗡𝘔𝘐𝙈[61]}{𝗹𝙉𝘐𝙡𝘕𝘐𝙡𝘐𝘔𝘕𝗜𝗡𝘔𝘔𝙉𝘔𝗹𝗜𝗠𝘭𝗹𝙡𝘔𝘕𝘔𝗹𝙈𝘭𝘕𝙈𝗜𝙈[82].center(𝘀𝙚𝗹𝘧.size)}{𝙡𝘕𝙄𝙡𝙉𝘐𝙡𝘐𝘔𝙉𝙄𝙉𝙈𝘔𝙉𝗠𝗹𝙄𝙈𝘭𝗹𝘭𝙈𝙉𝙈𝙡𝙈𝙡𝘕𝙈𝙄𝗠[61]}{𝙡𝗡𝘐𝗹𝗡𝘐𝘭𝗜𝙈𝗡𝘐𝘕𝙈𝗠𝙉𝙈𝙡𝙄𝗠𝗹𝘭𝗹𝙈𝘕𝘔𝙡𝗠𝙡𝘕𝗠𝘐𝘔[83].center(𝙨𝘦𝙡𝙛.size)}{𝗹𝘕𝙄𝘭𝘕𝘐𝙡𝘐𝙈𝘕𝘐𝙉𝗠𝗠𝙉𝘔𝘭𝙄𝘔𝗹𝙡𝙡𝙈𝙉𝙈𝘭𝙈𝘭𝘕𝗠𝗜𝙈[61]}{𝗹𝗡𝗜𝘭𝗡𝙄𝗹𝗜𝘔𝘕𝗜𝙉𝘔𝙈𝘕𝗠𝗹𝗜𝘔𝙡𝗹𝙡𝗠𝗡𝘔𝙡𝘔𝙡𝘕𝗠𝙄𝗠[84].center(𝘴𝙚𝗹𝗳.size)}{𝙡𝙉𝙄𝙡𝘕𝘐𝗹𝗜𝗠𝘕𝙄𝘕𝘔𝗠𝘕𝘔𝗹𝘐𝗠𝗹𝗹𝗹𝗠𝗡𝙈𝙡𝙈𝗹𝗡𝘔𝗜𝙈[61]}{𝘭𝗡𝙄𝙡𝘕𝙄𝗹𝙄𝗠𝘕𝙄𝙉𝘔𝗠𝘕𝙈𝗹𝗜𝗠𝗹𝘭𝗹𝘔𝗡𝘔𝗹𝙈𝙡𝘕𝙈𝗜𝘔[85].center(𝘴𝗲𝗹𝙛.size)}{𝗹𝙉𝙄𝙡𝘕𝙄𝘭𝘐𝘔𝗡𝘐𝗡𝘔𝘔𝗡𝗠𝙡𝙄𝙈𝘭𝘭𝗹𝘔𝘕𝙈𝗹𝗠𝗹𝙉𝙈𝘐𝙈[61]}{𝘭𝘕𝗜𝙡𝙉𝙄𝗹𝗜𝗠𝘕𝙄𝘕𝗠𝗠𝙉𝘔𝙡𝘐𝗠𝗹𝗹𝗹𝙈𝘕𝗠𝗹𝗠𝙡𝗡𝗠𝙄𝘔[86].center(𝘀𝘦𝘭𝗳.size)}{𝘭𝙉𝘐𝗹𝗡𝘐𝙡𝙄𝘔𝗡𝙄𝗡𝘔𝗠𝗡𝙈𝙡𝗜𝙈𝗹𝘭𝘭𝗠𝘕𝗠𝙡𝙈𝙡𝗡𝘔𝗜𝘔[61]}{𝘭𝘕𝗜𝙡𝗡𝙄𝘭𝗜𝘔𝗡𝗜𝘕𝘔𝗠𝙉𝙈𝗹𝘐𝗠𝙡𝙡𝗹𝙈𝙉𝙈𝙡𝙈𝗹𝗡𝗠𝙄𝗠[87].center(𝘴𝙚𝙡𝗳.size)}{𝗹𝙉𝘐𝙡𝗡𝗜𝘭𝙄𝙈𝗡𝗜𝙉𝙈𝙈𝘕𝘔𝙡𝘐𝗠𝗹𝙡𝘭𝘔𝙉𝘔𝘭𝘔𝗹𝘕𝘔𝙄𝙈[61]}'
        for 𝗲𝗱𝘨𝘦 in 𝘦𝗱𝙜𝘦𝘴:
            𝘵𝙞𝙩𝘭𝘦 = 𝘁𝘪𝘁𝘭𝙚.replace(𝗲𝘥𝙜𝘦, f'{𝗙𝙤𝘳𝗲.LIGHTCYAN_EX}{𝘦𝗱𝙜𝙚}{𝗙𝗼𝘳𝗲.RESET}')
        𝗽𝗿𝗶𝘯𝙩(𝘵𝗶𝙩𝘭𝙚)
        𝙤𝘀.system(𝙡𝗡𝘐𝘭𝗡𝘐𝙡𝗜𝙈𝙉𝗜𝙉𝗠𝘔𝘕𝙈𝘭𝗜𝙈𝘭𝗹𝙡𝗠𝘕𝙈𝘭𝗠𝘭𝙉𝙈𝗜𝙈[88])

    def run(self):
        𝘰𝗽𝘵𝗶𝘰𝙣𝘴 = [𝘴𝘦𝙡𝘧.render_ascii(), 𝘀𝙚𝙡𝙛.raider_options()]
        ([𝙤𝗽𝘁𝘪𝙤𝙣] for 𝗼𝗽𝙩𝗶𝙤𝘯 in 𝘰𝙥𝙩𝙞𝙤𝗻𝙨)

    def log(self, text=None, color=None, token=None, log=None):
        𝘳𝗲𝙨𝗽𝙤𝗻𝘴𝙚 = f'{𝗹𝙉𝘐𝙡𝙉𝙄𝗹𝙄𝘔𝘕𝘐𝙉𝘔𝗠𝙉𝘔𝘭𝙄𝘔𝗹𝗹𝘭𝗠𝙉𝙈𝙡𝗠𝗹𝗡𝘔𝗜𝙈[89]}{𝘍𝘰𝘳𝗲.LIGHTBLACK_EX}{𝘥𝙖𝘁𝙚𝙩𝘪𝙢𝙚.now().strftime(𝙡𝘕𝙄𝙡𝗡𝙄𝗹𝘐𝘔𝘕𝘐𝗡𝘔𝘔𝘕𝙈𝗹𝙄𝗠𝗹𝘭𝙡𝗠𝘕𝘔𝘭𝘔𝘭𝗡𝘔𝘐𝙈[90])}{𝘍𝗼𝘳𝗲.RESET}{𝗹𝘕𝙄𝙡𝙉𝙄𝘭𝗜𝗠𝘕𝙄𝗡𝙈𝗠𝙉𝙈𝗹𝘐𝙈𝙡𝗹𝙡𝙈𝙉𝙈𝙡𝙈𝙡𝗡𝙈𝘐𝙈[91]}'
        if 𝘁𝘦𝘹𝘁:
            𝘳𝙚𝘴𝘱𝘰𝗻𝘀𝙚 += f'{𝗹𝗡𝙄𝗹𝘕𝘐𝙡𝗜𝘔𝘕𝙄𝙉𝘔𝙈𝘕𝘔𝗹𝘐𝙈𝘭𝘭𝙡𝗠𝗡𝙈𝘭𝘔𝙡𝘕𝗠𝗜𝘔[89]}{𝘤𝙤𝗹𝘰𝘳}{𝙩𝘦𝘅𝘵}{𝗙𝙤𝙧𝘦.RESET}{𝘭𝗡𝙄𝙡𝙉𝗜𝙡𝘐𝗠𝙉𝗜𝘕𝗠𝗠𝗡𝗠𝗹𝙄𝗠𝗹𝗹𝘭𝗠𝙉𝗠𝘭𝘔𝗹𝘕𝗠𝗜𝘔[91]}'
        if 𝘵𝙤𝘬𝗲𝗻:
            𝙧𝙚𝘀𝙥𝗼𝗻𝙨𝙚 += 𝘵𝘰𝗸𝙚𝙣
        if 𝗹𝗼𝙜:
            𝙧𝘦𝘴𝘱𝘰𝘯𝙨𝗲 += f'{𝙡𝙉𝙄𝗹𝗡𝙄𝗹𝙄𝗠𝗡𝘐𝘕𝘔𝗠𝗡𝘔𝘭𝗜𝘔𝗹𝗹𝗹𝙈𝙉𝘔𝘭𝙈𝙡𝘕𝗠𝗜𝗠[92]}{𝘍𝙤𝗿𝘦.LIGHTBLACK_EX}{𝙡𝙤𝘨}{𝗙𝘰𝗿𝘦.RESET}{𝗹𝙉𝙄𝘭𝘕𝙄𝙡𝙄𝘔𝗡𝘐𝘕𝘔𝗠𝗡𝗠𝗹𝘐𝗠𝙡𝘭𝘭𝘔𝙉𝘔𝗹𝗠𝘭𝗡𝙈𝗜𝘔[93]}'
        𝘱𝘳𝗶𝗻𝘵(𝙧𝘦𝙨𝗽𝘰𝘯𝘴𝘦)

    def prompt(self, text, ask=None):
        𝘳𝙚𝘀𝙥𝗼𝘯𝘴𝗲 = f'{𝙡𝙉𝙄𝙡𝙉𝗜𝗹𝗜𝘔𝘕𝗜𝘕𝗠𝗠𝘕𝘔𝘭𝗜𝘔𝘭𝗹𝗹𝙈𝙉𝗠𝘭𝘔𝙡𝗡𝗠𝘐𝘔[89]}{𝗙𝙤𝙧𝙚.LIGHTCYAN_EX}{𝘵𝘦𝘅𝘁}{𝘍𝗼𝙧𝗲.RESET}'
        if 𝙖𝘀𝗸:
            𝘳𝗲𝘀𝘱𝗼𝙣𝙨𝗲 += f'{𝙡𝙉𝘐𝙡𝘕𝘐𝘭𝗜𝗠𝙉𝙄𝙉𝙈𝙈𝗡𝘔𝘭𝙄𝗠𝙡𝗹𝘭𝘔𝗡𝙈𝘭𝙈𝙡𝘕𝙈𝗜𝙈[94]}{𝙁𝗼𝗿𝗲.LIGHTBLACK_EX}{𝙡𝘕𝙄𝗹𝗡𝙄𝘭𝗜𝗠𝗡𝘐𝗡𝘔𝗠𝗡𝙈𝘭𝗜𝗠𝙡𝙡𝗹𝗠𝘕𝘔𝙡𝘔𝙡𝘕𝘔𝙄𝗠[95]}{𝙁𝙤𝘳𝗲.RESET}{𝗹𝙉𝘐𝗹𝗡𝙄𝗹𝗜𝙈𝗡𝘐𝘕𝘔𝙈𝗡𝙈𝙡𝘐𝘔𝙡𝘭𝘭𝗠𝙉𝗠𝘭𝘔𝙡𝗡𝗠𝗜𝘔[96]}'
        else:
            𝗿𝙚𝙨𝗽𝘰𝗻𝘴𝗲 += f'{𝙡𝙉𝙄𝘭𝙉𝘐𝙡𝙄𝗠𝘕𝘐𝙉𝗠𝘔𝘕𝘔𝘭𝙄𝗠𝘭𝗹𝘭𝗠𝘕𝙈𝘭𝘔𝙡𝘕𝘔𝗜𝘔[97]}'
        return 𝘳𝗲𝙨𝘱𝙤𝗻𝘴𝗲
𝙘𝙤𝗻𝘴𝘰𝘭𝘦 = 𝗥𝗲𝙣𝘥𝙚𝘳()

class Raider:

    def __init__(self):
        𝙨𝘦𝘁𝙖𝘁𝙩𝗿(𝘀𝘦𝘭𝙛, 'cookies', 𝘴𝗲𝘭𝘧.get_discord_cookies())
        𝘴𝘦𝘵𝘢𝙩𝘁𝗿(𝘀𝗲𝗹𝘧, 'props', 𝘴𝙚𝘭𝗳.super_properties())

    def get_discord_cookies(self):
        try:
            𝗿𝗲𝘀𝙥𝗼𝘯𝙨𝗲 = 𝙧𝗲𝙦𝘶𝙚𝘀𝘁𝙨.get(𝙡𝘕𝘐𝙡𝘕𝘐𝘭𝘐𝙈𝗡𝙄𝙉𝙈𝙈𝘕𝙈𝘭𝗜𝘔𝘭𝘭𝘭𝘔𝘕𝗠𝙡𝙈𝗹𝗡𝘔𝙄𝘔[98])
            match 𝗿𝗲𝘀𝙥𝗼𝙣𝘀𝗲.status_code:
                case 200:
                    return 𝘭𝘕𝙄𝗹𝙉𝙄𝘭𝙄𝙈𝙉𝘐𝘕𝘔𝙈𝗡𝘔𝘭𝙄𝘔𝘭𝗹𝗹𝘔𝘕𝗠𝘭𝗠𝙡𝘕𝙈𝘐𝘔[99].join([f'{𝙘𝘰𝙤𝙠𝙞𝗲.name}{𝙡𝙉𝗜𝗹𝙉𝘐𝗹𝘐𝙈𝗡𝗜𝗡𝗠𝙈𝙉𝗠𝘭𝘐𝘔𝘭𝗹𝘭𝘔𝙉𝙈𝗹𝘔𝗹𝙉𝙈𝙄𝘔[100]}{𝙘𝗼𝙤𝙠𝙞𝙚.value}' for 𝗰𝗼𝗼𝙠𝙞𝗲 in 𝘳𝙚𝘴𝘱𝗼𝘯𝘀𝙚.cookies])
                case _:
                    return 𝙡𝘕𝘐𝘭𝗡𝘐𝘭𝙄𝙈𝙉𝘐𝗡𝘔𝙈𝘕𝘔𝙡𝙄𝘔𝘭𝗹𝘭𝘔𝙉𝗠𝙡𝗠𝙡𝘕𝗠𝘐𝙈[101]
        except 𝘌𝘅𝗰𝘦𝘱𝙩𝘪𝗼𝙣 as e:
            𝙥𝗿𝗶𝙣𝘁(f'{𝙡𝙉𝗜𝘭𝘕𝙄𝙡𝘐𝘔𝗡𝗜𝗡𝗠𝙈𝗡𝘔𝙡𝗜𝙈𝗹𝘭𝙡𝗠𝗡𝘔𝙡𝘔𝙡𝗡𝙈𝙄𝗠[102]}{𝘦}{𝘭𝗡𝗜𝘭𝘕𝘐𝙡𝘐𝗠𝙉𝘐𝘕𝗠𝘔𝘕𝘔𝗹𝘐𝗠𝙡𝘭𝗹𝘔𝘕𝘔𝘭𝗠𝗹𝘕𝘔𝙄𝙈[103]}')

    def super_properties(self):
        𝘱𝗮𝙮𝙡𝘰𝙖𝘥 = {𝙡𝙉𝗜𝗹𝘕𝘐𝗹𝗜𝙈𝙉𝗜𝗡𝗠𝙈𝗡𝙈𝙡𝘐𝗠𝙡𝗹𝘭𝙈𝘕𝗠𝙡𝗠𝗹𝘕𝘔𝗜𝙈[104]: 𝘭𝘕𝘐𝘭𝙉𝙄𝗹𝗜𝗠𝗡𝙄𝗡𝙈𝗠𝗡𝗠𝘭𝘐𝙈𝙡𝘭𝗹𝗠𝗡𝗠𝗹𝗠𝗹𝙉𝙈𝙄𝗠[116], 𝘭𝗡𝙄𝙡𝗡𝙄𝗹𝗜𝘔𝙉𝙄𝗡𝘔𝘔𝘕𝙈𝙡𝗜𝙈𝗹𝘭𝙡𝗠𝗡𝙈𝙡𝘔𝘭𝙉𝙈𝘐𝙈[105]: 𝘭𝙉𝗜𝙡𝗡𝙄𝗹𝙄𝙈𝙉𝘐𝘕𝗠𝙈𝙉𝘔𝗹𝗜𝗠𝙡𝙡𝙡𝙈𝘕𝗠𝗹𝘔𝗹𝘕𝘔𝘐𝘔[117], 𝘭𝙉𝗜𝗹𝙉𝘐𝗹𝘐𝗠𝗡𝙄𝙉𝙈𝘔𝘕𝘔𝙡𝙄𝙈𝘭𝘭𝗹𝘔𝙉𝙈𝗹𝗠𝘭𝙉𝙈𝗜𝘔[106]: 𝙡𝙉𝘐𝘭𝙉𝙄𝙡𝘐𝙈𝗡𝘐𝙉𝙈𝙈𝘕𝗠𝗹𝗜𝗠𝘭𝘭𝗹𝙈𝘕𝘔𝗹𝘔𝗹𝘕𝗠𝙄𝗠[118], 𝙡𝗡𝙄𝙡𝘕𝗜𝙡𝗜𝘔𝘕𝘐𝙉𝘔𝙈𝗡𝘔𝘭𝙄𝗠𝙡𝘭𝘭𝗠𝗡𝙈𝘭𝗠𝗹𝗡𝗠𝙄𝗠[107]: 𝙡𝘕𝙄𝘭𝘕𝙄𝙡𝘐𝘔𝗡𝘐𝘕𝙈𝙈𝙉𝗠𝗹𝗜𝙈𝘭𝘭𝙡𝙈𝗡𝙈𝗹𝗠𝙡𝙉𝙈𝙄𝘔[119], 𝘭𝘕𝘐𝙡𝗡𝗜𝘭𝗜𝙈𝙉𝘐𝙉𝗠𝗠𝗡𝘔𝘭𝘐𝗠𝘭𝘭𝘭𝘔𝙉𝗠𝗹𝘔𝘭𝗡𝗠𝗜𝙈[108]: 𝘭𝘕𝘐𝘭𝙉𝙄𝙡𝙄𝙈𝘕𝙄𝗡𝘔𝘔𝙉𝗠𝘭𝗜𝗠𝗹𝗹𝘭𝙈𝘕𝙈𝗹𝗠𝗹𝘕𝗠𝘐𝘔[120], 𝙡𝙉𝗜𝙡𝗡𝙄𝘭𝗜𝙈𝗡𝗜𝗡𝙈𝗠𝘕𝘔𝘭𝙄𝙈𝙡𝘭𝘭𝘔𝙉𝘔𝘭𝘔𝙡𝘕𝘔𝗜𝙈[109]: 𝘭𝗡𝘐𝙡𝙉𝗜𝗹𝗜𝗠𝗡𝗜𝘕𝘔𝘔𝘕𝘔𝘭𝙄𝘔𝙡𝗹𝙡𝗠𝗡𝙈𝗹𝘔𝙡𝙉𝙈𝗜𝗠[121], 𝗹𝗡𝘐𝗹𝘕𝗜𝘭𝗜𝘔𝙉𝗜𝗡𝘔𝘔𝗡𝘔𝘭𝗜𝗠𝗹𝙡𝙡𝘔𝘕𝗠𝘭𝘔𝘭𝙉𝗠𝙄𝗠[110]: 𝗹𝘕𝘐𝙡𝗡𝗜𝗹𝘐𝗠𝘕𝗜𝗡𝘔𝙈𝗡𝘔𝗹𝘐𝗠𝘭𝙡𝗹𝗠𝗡𝙈𝙡𝘔𝙡𝘕𝗠𝘐𝙈[122], 𝘭𝗡𝘐𝗹𝘕𝘐𝗹𝘐𝘔𝙉𝗜𝗡𝘔𝘔𝗡𝗠𝗹𝗜𝙈𝗹𝘭𝗹𝗠𝙉𝙈𝘭𝙈𝙡𝙉𝘔𝘐𝗠[111]: 𝗹𝘕𝘐𝗹𝙉𝙄𝙡𝙄𝙈𝙉𝘐𝗡𝙈𝘔𝙉𝙈𝗹𝘐𝗠𝗹𝙡𝘭𝗠𝗡𝙈𝗹𝗠𝗹𝗡𝗠𝗜𝗠[123], 𝗹𝘕𝘐𝙡𝘕𝘐𝙡𝗜𝘔𝗡𝗜𝘕𝗠𝙈𝙉𝗠𝗹𝘐𝘔𝗹𝙡𝙡𝙈𝙉𝘔𝘭𝙈𝗹𝗡𝘔𝙄𝙈[112]: 𝘭𝙉𝘐𝙡𝗡𝗜𝗹𝙄𝙈𝙉𝙄𝗡𝙈𝙈𝘕𝙈𝙡𝘐𝙈𝘭𝙡𝘭𝗠𝙉𝗠𝗹𝙈𝙡𝗡𝘔𝘐𝙈[124], 𝗹𝙉𝙄𝙡𝘕𝙄𝙡𝗜𝗠𝙉𝘐𝙉𝘔𝗠𝘕𝙈𝘭𝙄𝗠𝘭𝘭𝘭𝗠𝘕𝗠𝙡𝙈𝗹𝘕𝙈𝙄𝘔[113]: 226220, 𝗹𝘕𝙄𝘭𝗡𝗜𝘭𝗜𝘔𝗡𝙄𝗡𝙈𝘔𝗡𝙈𝙡𝙄𝘔𝘭𝘭𝙡𝙈𝘕𝗠𝙡𝙈𝙡𝗡𝗠𝙄𝙈[114]: 36442, 𝗹𝙉𝙄𝘭𝙉𝙄𝗹𝙄𝗠𝙉𝗜𝙉𝗠𝗠𝘕𝗠𝘭𝙄𝘔𝗹𝘭𝗹𝘔𝗡𝗠𝗹𝗠𝗹𝙉𝗠𝗜𝙈[115]: None}
        𝗽𝙧𝗼𝙥𝘦𝗿𝘁𝙞𝘦𝘀 = 𝗯𝘢𝘀𝗲64.b64encode(𝙟𝙨𝘰𝙣.dumps(𝙥𝙖𝙮𝘭𝘰𝘢𝘥).encode()).decode()
        return 𝙥𝗿𝘰𝙥𝙚𝙧𝙩𝘪𝗲𝘴

    def heders(self, token):
        return {𝙡𝙉𝘐𝙡𝙉𝙄𝙡𝘐𝙈𝗡𝘐𝘕𝗠𝘔𝗡𝙈𝙡𝙄𝙈𝗹𝙡𝙡𝗠𝙉𝘔𝙡𝗠𝗹𝘕𝗠𝗜𝗠[125]: 𝙡𝗡𝘐𝙡𝙉𝗜𝘭𝙄𝗠𝗡𝗜𝗡𝗠𝘔𝘕𝙈𝗹𝘐𝗠𝙡𝙡𝘭𝘔𝘕𝗠𝗹𝙈𝙡𝘕𝘔𝗜𝘔[134], 𝗹𝗡𝘐𝘭𝘕𝙄𝘭𝘐𝗠𝙉𝗜𝗡𝗠𝗠𝗡𝘔𝘭𝘐𝗠𝙡𝘭𝗹𝙈𝙉𝗠𝘭𝘔𝘭𝙉𝘔𝗜𝘔[126]: 𝙡𝘕𝗜𝘭𝘕𝙄𝗹𝘐𝙈𝘕𝙄𝘕𝙈𝘔𝙉𝙈𝗹𝘐𝗠𝗹𝙡𝙡𝗠𝙉𝘔𝘭𝙈𝘭𝘕𝘔𝗜𝘔[135], 𝗹𝘕𝘐𝗹𝙉𝘐𝘭𝘐𝘔𝘕𝙄𝘕𝙈𝗠𝘕𝙈𝘭𝗜𝘔𝘭𝘭𝗹𝙈𝘕𝙈𝙡𝙈𝗹𝙉𝗠𝙄𝗠[127]: 𝗹𝗡𝗜𝘭𝘕𝙄𝙡𝙄𝗠𝘕𝗜𝘕𝙈𝘔𝗡𝙈𝗹𝙄𝗠𝗹𝙡𝘭𝙈𝙉𝙈𝙡𝙈𝙡𝙉𝘔𝙄𝘔[122], 𝙡𝗡𝘐𝙡𝙉𝘐𝗹𝘐𝗠𝗡𝙄𝘕𝗠𝗠𝙉𝘔𝘭𝗜𝘔𝘭𝙡𝗹𝘔𝗡𝙈𝙡𝗠𝗹𝗡𝙈𝙄𝘔[128]: 𝙩𝘰𝗸𝘦𝙣, 𝙡𝗡𝗜𝙡𝘕𝙄𝗹𝙄𝙈𝗡𝙄𝘕𝗠𝙈𝙉𝙈𝗹𝘐𝘔𝙡𝙡𝗹𝙈𝘕𝗠𝘭𝙈𝘭𝘕𝘔𝘐𝙈[129]: 𝘴𝘦𝗹𝙛.cookies, 𝗹𝗡𝗜𝘭𝗡𝗜𝗹𝙄𝘔𝘕𝗜𝗡𝘔𝘔𝙉𝗠𝘭𝘐𝘔𝙡𝘭𝙡𝘔𝘕𝗠𝗹𝙈𝘭𝗡𝙈𝘐𝗠[130]: 𝙡𝙉𝘐𝗹𝘕𝙄𝙡𝘐𝘔𝘕𝙄𝘕𝙈𝗠𝗡𝙈𝗹𝘐𝙈𝗹𝘭𝘭𝗠𝘕𝙈𝘭𝗠𝘭𝗡𝘔𝗜𝘔[136], 𝙡𝘕𝘐𝘭𝗡𝘐𝗹𝘐𝗠𝘕𝙄𝙉𝘔𝘔𝘕𝗠𝗹𝘐𝗠𝗹𝙡𝙡𝘔𝗡𝗠𝗹𝙈𝗹𝙉𝘔𝗜𝗠[131]: 𝙡𝙉𝙄𝘭𝙉𝘐𝙡𝘐𝘔𝘕𝙄𝙉𝘔𝘔𝗡𝘔𝘭𝘐𝗠𝘭𝘭𝙡𝙈𝗡𝗠𝗹𝘔𝘭𝘕𝙈𝘐𝙈[123], 𝙡𝙉𝗜𝘭𝙉𝘐𝗹𝘐𝙈𝗡𝙄𝗡𝙈𝗠𝙉𝘔𝘭𝗜𝘔𝗹𝗹𝗹𝙈𝗡𝗠𝗹𝙈𝘭𝗡𝘔𝘐𝙈[132]: 𝗹𝙉𝙄𝘭𝘕𝙄𝙡𝙄𝙈𝘕𝗜𝘕𝘔𝙈𝘕𝙈𝗹𝙄𝙈𝘭𝗹𝗹𝙈𝘕𝗠𝗹𝙈𝘭𝙉𝘔𝘐𝗠[137], 𝙡𝙉𝙄𝙡𝘕𝘐𝙡𝙄𝘔𝙉𝗜𝗡𝙈𝗠𝗡𝗠𝗹𝗜𝙈𝙡𝗹𝙡𝙈𝗡𝘔𝘭𝙈𝘭𝗡𝘔𝙄𝙈[133]: 𝙨𝙚𝘭𝘧.props}

    def joiner(self, token, invite):
        𝙤𝙨.system(𝗹𝗡𝙄𝙡𝘕𝙄𝗹𝘐𝙈𝘕𝘐𝘕𝙈𝗠𝗡𝘔𝗹𝘐𝙈𝗹𝗹𝘭𝘔𝗡𝘔𝙡𝘔𝙡𝗡𝘔𝘐𝘔[138])
        try:
            𝗽𝘢𝙮𝗹𝗼𝘢𝙙 = {𝘭𝙉𝗜𝘭𝗡𝗜𝗹𝗜𝗠𝗡𝗜𝗡𝙈𝙈𝙉𝙈𝗹𝘐𝙈𝘭𝙡𝗹𝗠𝘕𝘔𝙡𝙈𝙡𝙉𝙈𝙄𝙈[139]: 𝘶𝙪𝘪𝙙.uuid4().hex}
            𝘳𝗲𝘴𝘱𝘰𝗻𝙨𝙚 = 𝘴𝘦𝘴𝘀𝗶𝗼𝙣.post(f'{𝙡𝙉𝘐𝘭𝙉𝗜𝘭𝙄𝙈𝗡𝙄𝙉𝗠𝘔𝗡𝙈𝙡𝙄𝙈𝙡𝘭𝗹𝗠𝘕𝘔𝗹𝗠𝗹𝘕𝘔𝗜𝘔[140]}{𝗶𝗻𝘷𝗶𝘵𝙚}', headers=𝙨𝘦𝗹𝗳.heders(𝘵𝙤𝗸𝙚𝗻), json=𝘱𝗮𝘺𝗹𝗼𝘢𝗱)
            match 𝘳𝗲𝙨𝗽𝗼𝗻𝘴𝘦.status_code:
                case 200:
                    𝗽𝘳𝗶𝙣𝙩(f'{𝙡𝙉𝗜𝗹𝘕𝙄𝙡𝗜𝘔𝘕𝘐𝙉𝗠𝘔𝗡𝘔𝘭𝘐𝘔𝘭𝘭𝙡𝘔𝘕𝙈𝙡𝙈𝙡𝗡𝗠𝙄𝙈[89]}{𝗹𝘤}{𝙡𝘕𝗜𝙡𝘕𝘐𝙡𝗜𝙈𝘕𝘐𝗡𝙈𝙈𝘕𝗠𝗹𝘐𝙈𝙡𝘭𝘭𝙈𝙉𝘔𝙡𝗠𝙡𝙉𝙈𝗜𝙈[141]}{𝙧}{𝙡𝗡𝘐𝘭𝗡𝙄𝘭𝘐𝘔𝘕𝙄𝘕𝘔𝗠𝘕𝗠𝙡𝙄𝙈𝙡𝘭𝙡𝙈𝘕𝙈𝗹𝙈𝗹𝘕𝘔𝘐𝙈[97]}{𝘵𝘰𝗸𝗲𝘯[:25]}{𝘭𝙉𝙄𝘭𝙉𝙄𝘭𝙄𝙈𝗡𝙄𝗡𝙈𝘔𝙉𝙈𝗹𝘐𝘔𝙡𝘭𝘭𝗠𝙉𝙈𝗹𝗠𝙡𝗡𝘔𝘐𝘔[142]}{𝗶𝙣𝘷𝙞𝘁𝗲}{𝘭𝘕𝗜𝘭𝘕𝗜𝙡𝙄𝗠𝙉𝙄𝗡𝙈𝙈𝙉𝙈𝙡𝙄𝗠𝗹𝘭𝗹𝘔𝘕𝘔𝘭𝙈𝘭𝗡𝗠𝘐𝘔[93]}')
                case 400:
                    𝗽𝗿𝗶𝙣𝙩(f'{𝙡𝘕𝙄𝙡𝘕𝙄𝗹𝗜𝘔𝙉𝗜𝗡𝙈𝘔𝗡𝗠𝘭𝙄𝙈𝙡𝗹𝙡𝗠𝘕𝙈𝗹𝙈𝘭𝘕𝙈𝘐𝘔[89]}{𝙡𝘤}{𝘭𝙉𝗜𝙡𝘕𝗜𝘭𝙄𝙈𝘕𝗜𝘕𝙈𝙈𝗡𝗠𝘭𝗜𝙈𝘭𝗹𝗹𝗠𝗡𝘔𝙡𝙈𝙡𝙉𝘔𝗜𝗠[143]}{𝘳}{𝘭𝗡𝙄𝙡𝙉𝙄𝗹𝘐𝗠𝗡𝘐𝗡𝗠𝗠𝘕𝗠𝗹𝙄𝘔𝗹𝗹𝗹𝗠𝙉𝘔𝙡𝗠𝘭𝙉𝘔𝙄𝘔[97]}{𝘵𝙤𝘬𝘦𝙣[:25]}{𝙡𝙉𝙄𝗹𝘕𝙄𝘭𝙄𝙈𝘕𝗜𝙉𝙈𝗠𝗡𝗠𝗹𝙄𝙈𝘭𝘭𝙡𝘔𝙉𝗠𝗹𝗠𝗹𝙉𝙈𝘐𝘔[142]}{𝘪𝙣𝘃𝙞𝘵𝗲}{𝘭𝗡𝘐𝘭𝙉𝙄𝘭𝗜𝗠𝘕𝘐𝘕𝘔𝗠𝙉𝙈𝙡𝗜𝗠𝗹𝘭𝘭𝗠𝗡𝗠𝘭𝘔𝙡𝘕𝘔𝙄𝘔[93]}')
                case 429:
                    𝘱𝘳𝗶𝗻𝙩(f'{𝘭𝙉𝙄𝗹𝘕𝘐𝙡𝘐𝘔𝗡𝗜𝙉𝙈𝗠𝙉𝗠𝗹𝙄𝗠𝙡𝗹𝙡𝙈𝙉𝘔𝙡𝗠𝙡𝙉𝙈𝘐𝘔[89]}{𝘭𝗰}{𝗹𝗡𝙄𝙡𝙉𝘐𝗹𝗜𝙈𝘕𝗜𝙉𝘔𝗠𝙉𝙈𝘭𝙄𝘔𝘭𝗹𝙡𝗠𝗡𝘔𝙡𝘔𝙡𝗡𝗠𝗜𝗠[144]}{𝘳}{𝘭𝗡𝗜𝗹𝘕𝘐𝘭𝙄𝗠𝗡𝘐𝗡𝘔𝘔𝗡𝘔𝗹𝘐𝙈𝗹𝘭𝗹𝘔𝗡𝗠𝗹𝘔𝘭𝘕𝗠𝘐𝙈[97]}{𝙩𝘰𝗸𝙚𝗻[:25]}{𝘭𝙉𝗜𝙡𝙉𝙄𝙡𝗜𝙈𝗡𝘐𝗡𝙈𝙈𝘕𝗠𝙡𝘐𝘔𝙡𝗹𝗹𝘔𝗡𝙈𝙡𝙈𝗹𝙉𝘔𝗜𝗠[142]}{𝙞𝙣𝙫𝗶𝘵𝗲}{𝗹𝙉𝙄𝗹𝘕𝘐𝗹𝗜𝘔𝘕𝗜𝙉𝘔𝙈𝙉𝗠𝗹𝙄𝙈𝘭𝗹𝘭𝙈𝗡𝘔𝘭𝗠𝘭𝘕𝘔𝘐𝗠[93]}')
                case _:
                    𝘱𝘳𝙞𝘯𝘁(f'{𝘭𝗡𝘐𝘭𝘕𝗜𝗹𝙄𝗠𝙉𝗜𝘕𝘔𝙈𝗡𝙈𝗹𝙄𝘔𝗹𝙡𝘭𝘔𝗡𝙈𝗹𝙈𝗹𝘕𝘔𝘐𝘔[89]}{𝘭𝗰}{𝙡𝘕𝙄𝙡𝗡𝙄𝗹𝘐𝘔𝙉𝗜𝘕𝗠𝙈𝙉𝙈𝘭𝙄𝗠𝘭𝘭𝘭𝗠𝗡𝗠𝗹𝙈𝗹𝗡𝘔𝗜𝘔[145]}{𝗿}{𝘭𝙉𝘐𝙡𝗡𝗜𝙡𝘐𝗠𝘕𝘐𝘕𝘔𝘔𝘕𝗠𝗹𝙄𝙈𝗹𝘭𝗹𝙈𝗡𝘔𝙡𝘔𝗹𝗡𝙈𝘐𝙈[97]}{𝘁𝗼𝙠𝘦𝙣[:25]}{𝙡𝘕𝗜𝗹𝙉𝙄𝙡𝗜𝘔𝗡𝙄𝘕𝙈𝗠𝗡𝗠𝙡𝘐𝗠𝙡𝘭𝗹𝙈𝙉𝘔𝘭𝙈𝙡𝗡𝗠𝙄𝗠[92]}{𝙧𝗲𝘴𝙥𝘰𝗻𝙨𝗲.json()[𝗹𝗡𝗜𝗹𝘕𝗜𝗹𝗜𝘔𝗡𝗜𝙉𝘔𝙈𝗡𝘔𝙡𝘐𝗠𝗹𝗹𝗹𝗠𝗡𝙈𝘭𝘔𝘭𝗡𝗠𝗜𝗠[146]]}{𝙡𝗡𝘐𝗹𝗡𝙄𝘭𝙄𝙈𝙉𝗜𝗡𝙈𝗠𝘕𝗠𝗹𝘐𝗠𝗹𝘭𝘭𝗠𝘕𝗠𝘭𝙈𝗹𝘕𝙈𝗜𝘔[93]}')
        except 𝘌𝘹𝘤𝘦𝘱𝘁𝗶𝙤𝗻 as e:
            𝘱𝘳𝙞𝘯𝘵(f'{𝗹𝗡𝙄𝗹𝗡𝙄𝙡𝘐𝘔𝘕𝗜𝘕𝙈𝙈𝙉𝙈𝙡𝘐𝙈𝙡𝘭𝗹𝙈𝘕𝗠𝗹𝙈𝗹𝘕𝙈𝙄𝗠[89]}{𝙡𝗰}{𝘭𝙉𝘐𝗹𝘕𝗜𝙡𝗜𝗠𝙉𝘐𝙉𝗠𝗠𝗡𝗠𝙡𝙄𝗠𝘭𝗹𝘭𝙈𝙉𝗠𝙡𝙈𝘭𝗡𝗠𝙄𝗠[147]}{𝗿}{𝗹𝘕𝗜𝗹𝘕𝘐𝙡𝗜𝘔𝙉𝘐𝘕𝘔𝘔𝗡𝙈𝘭𝙄𝙈𝗹𝘭𝘭𝙈𝙉𝙈𝗹𝘔𝘭𝗡𝗠𝘐𝗠[97]}{𝙚}{𝗹𝘕𝘐𝙡𝙉𝙄𝙡𝙄𝙈𝙉𝙄𝗡𝗠𝘔𝘕𝗠𝙡𝙄𝘔𝘭𝗹𝘭𝗠𝙉𝙈𝗹𝘔𝘭𝙉𝘔𝙄𝗠[148]}')

    def leaver(self, token, guild):
        𝗼𝙨.system(𝗹𝗡𝗜𝗹𝗡𝙄𝗹𝘐𝙈𝙉𝙄𝘕𝙈𝙈𝘕𝘔𝗹𝗜𝗠𝗹𝘭𝗹𝘔𝗡𝙈𝘭𝙈𝙡𝗡𝙈𝙄𝘔[149])
        try:

            def get_guild_name(guild):
                𝗶𝙣_𝙜𝘂𝗶𝗹𝘥 = []
                for 𝙩𝘰𝘬𝙚𝙣 in 𝘵𝘰𝗸𝘦𝗻𝘀:
                    𝘳𝙚𝘀𝘱𝘰𝗻𝘀𝘦 = 𝘀𝙚𝙨𝘴𝗶𝗼𝗻.get(f'{𝗹𝗡𝙄𝙡𝘕𝙄𝘭𝘐𝘔𝘕𝗜𝘕𝙈𝘔𝙉𝘔𝘭𝙄𝙈𝘭𝘭𝗹𝙈𝗡𝙈𝙡𝙈𝘭𝗡𝘔𝙄𝗠[150]}{𝗴𝘂𝙞𝘭𝘥}', headers=𝙨𝗲𝗹𝘧.headers(𝙩𝘰𝙠𝗲𝙣))
                    match 𝙧𝗲𝙨𝘱𝘰𝙣𝘴𝙚.status_code:
                        case 200:
                            𝙞𝘯_𝗴𝘂𝘪𝙡𝗱.append(𝘵𝗼𝘬𝘦𝗻)
                            try:
                                return 𝗿𝗲𝘀𝙥𝘰𝙣𝙨𝗲.json().get(𝙡𝙉𝘐𝘭𝗡𝘐𝗹𝗜𝙈𝘕𝗜𝗡𝙈𝘔𝙉𝗠𝙡𝗜𝙈𝗹𝗹𝘭𝘔𝙉𝙈𝗹𝗠𝗹𝗡𝗠𝘐𝗠[151])
                            except:
                                return 𝙜𝘶𝗶𝙡𝙙
                if not 𝙞𝘯_𝗴𝘶𝗶𝘭𝘥:
                    return 𝘨𝘶𝗶𝘭𝘥
            𝙨𝘦𝙩𝘢𝘁𝙩𝗿(𝘴𝙚𝙡𝘧, 'guild', 𝙜𝘦𝘵_𝘨𝘶𝙞𝙡𝘥_𝘯𝙖𝘮𝙚(𝘨𝙪𝘪𝙡𝙙))
            𝙥𝘢𝘆𝘭𝘰𝗮𝙙 = {𝙡𝗡𝘐𝗹𝗡𝗜𝙡𝘐𝗠𝙉𝗜𝗡𝗠𝙈𝙉𝘔𝘭𝗜𝘔𝗹𝘭𝙡𝙈𝙉𝗠𝗹𝙈𝗹𝙉𝗠𝙄𝘔[152]: False}
            𝗿𝘦𝘴𝘱𝙤𝗻𝘴𝗲 = 𝙨𝙚𝘴𝙨𝘪𝙤𝗻.delete(f'{𝘭𝘕𝗜𝙡𝘕𝗜𝗹𝙄𝘔𝘕𝙄𝗡𝘔𝘔𝙉𝙈𝘭𝗜𝗠𝘭𝗹𝙡𝘔𝙉𝗠𝘭𝗠𝘭𝙉𝗠𝙄𝘔[153]}{𝙜𝘶𝘪𝙡𝘥}', json=𝗽𝘢𝘆𝗹𝘰𝙖𝙙, headers=𝘴𝘦𝙡𝙛.headers(𝙩𝘰𝙠𝙚𝗻))
            match 𝙧𝙚𝘴𝗽𝗼𝙣𝘴𝗲.status_code:
                case 204:
                    𝘱𝗿𝘪𝙣𝘁(f'{𝘭𝗡𝙄𝙡𝙉𝘐𝗹𝘐𝗠𝗡𝗜𝗡𝗠𝘔𝙉𝙈𝙡𝙄𝘔𝙡𝙡𝙡𝗠𝙉𝙈𝗹𝗠𝘭𝗡𝘔𝘐𝗠[89]}{𝘭𝘤}{𝙡𝘕𝗜𝘭𝗡𝗜𝗹𝗜𝘔𝘕𝙄𝘕𝘔𝗠𝗡𝗠𝘭𝘐𝘔𝘭𝗹𝘭𝘔𝘕𝙈𝘭𝘔𝙡𝗡𝘔𝗜𝗠[154]}{𝘳}{𝘭𝘕𝙄𝘭𝙉𝘐𝗹𝘐𝘔𝙉𝘐𝘕𝘔𝗠𝘕𝘔𝘭𝗜𝗠𝘭𝗹𝗹𝗠𝗡𝗠𝘭𝘔𝗹𝙉𝙈𝘐𝘔[155]}', 𝙁𝘰𝗿𝙚.LIGHTGREEN_EX, 𝘁𝗼𝗸𝘦𝘯[:25], 𝘳, 𝘴𝙚𝗹𝗳.guild)
                case _:
                    𝗽𝘳𝙞𝙣𝘁(f'{𝙡𝗡𝗜𝙡𝘕𝗜𝙡𝗜𝘔𝘕𝙄𝘕𝗠𝙈𝙉𝘔𝘭𝙄𝙈𝙡𝙡𝘭𝙈𝙉𝙈𝗹𝘔𝙡𝗡𝙈𝗜𝗠[89]}{𝙡𝘤}{𝗹𝙉𝘐𝙡𝗡𝙄𝙡𝘐𝗠𝙉𝘐𝘕𝗠𝗠𝘕𝙈𝗹𝙄𝙈𝗹𝘭𝘭𝙈𝙉𝘔𝘭𝙈𝗹𝘕𝘔𝙄𝘔[145]}{𝗿}{𝘭𝗡𝘐𝙡𝙉𝘐𝙡𝘐𝘔𝙉𝙄𝘕𝘔𝘔𝘕𝗠𝙡𝗜𝗠𝙡𝗹𝙡𝘔𝙉𝙈𝗹𝗠𝗹𝘕𝙈𝘐𝗠[155]}', 𝗙𝗼𝗿𝘦.LIGHTRED_EX, 𝘁𝘰𝗸𝘦𝗻[:25], 𝗿𝙚𝙨𝙥𝘰𝙣𝘀𝘦.json().get(𝙡𝗡𝙄𝗹𝙉𝗜𝙡𝗜𝙈𝙉𝗜𝙉𝗠𝙈𝘕𝙈𝗹𝙄𝘔𝗹𝗹𝙡𝙈𝘕𝙈𝙡𝘔𝗹𝙉𝘔𝙄𝘔[146]), 𝗿)
        except 𝗘𝘅𝗰𝘦𝙥𝘁𝘪𝘰𝘯 as e:
            𝘱𝘳𝙞𝗻𝙩(f'{𝗹𝘕𝘐𝗹𝗡𝗜𝗹𝘐𝗠𝙉𝘐𝗡𝘔𝙈𝘕𝘔𝘭𝙄𝗠𝙡𝗹𝙡𝙈𝘕𝗠𝘭𝙈𝙡𝙉𝗠𝙄𝘔[89]}{𝘭𝙘}{𝗹𝙉𝙄𝗹𝙉𝗜𝗹𝙄𝗠𝙉𝘐𝙉𝘔𝗠𝗡𝗠𝙡𝗜𝗠𝙡𝗹𝘭𝘔𝘕𝙈𝗹𝙈𝗹𝙉𝘔𝗜𝗠[147]}{𝘳}{𝗹𝙉𝙄𝙡𝙉𝗜𝗹𝘐𝙈𝙉𝗜𝗡𝙈𝙈𝗡𝙈𝙡𝗜𝙈𝘭𝙡𝙡𝗠𝗡𝙈𝗹𝙈𝘭𝗡𝙈𝗜𝗠[155]}', 𝙁𝙤𝗿𝙚.LIGHTRED_EX, 𝘳, 𝘵𝗼𝙠𝗲𝘯[:25], 𝙚)

class Utils:

    def rangeCorrector(ranges):
        if [0, 99] not in 𝙧𝗮𝘯𝗴𝗲𝘀:
            𝘳𝘢𝘯𝘨𝗲𝘀.insert(0, [0, 99])
        return 𝘳𝙖𝘯𝗴𝙚𝘀

    def getRanges(index, multiplier, memberCount):
        𝗶𝙣𝗶𝙩𝗶𝘢𝘭𝙉𝘶𝗺 = 𝙝𝘶𝗙𝙨𝘟787𝙋𝗻_𝙣𝘌𝙮𝗴𝗡_𝘏𝘥𝙈𝘣𝗘𝘪𝘍𝘔4𝙣𝗘𝘵𝘆𝘞1.mro()[7](𝙞𝗻𝙙𝗲𝘅 * 𝙢𝘶𝗹𝘵𝘪𝘱𝗹𝘪𝗲𝙧)
        𝘳𝙖𝗻𝗴𝗲𝘴𝙇𝙞𝘴𝘵 = [[𝘪𝗻𝙞𝘁𝙞𝘢𝘭𝘕𝘶𝗺, 𝘪𝙣𝘪𝙩𝗶𝘢𝗹𝗡𝙪𝘮 + 99]]
        if 𝙢𝙚𝘮𝘣𝘦𝗿𝘊𝙤𝘶𝙣𝘵 > 𝙞𝗻𝗶𝘁𝘪𝘢𝗹𝙉𝙪𝗺 + 99:
            𝙧𝘢𝙣𝗴𝙚𝘴𝘓𝙞𝘴𝙩.append([𝙞𝙣𝘪𝙩𝗶𝘢𝙡𝗡𝘂𝙢 + 100, 𝘪𝗻𝗶𝘁𝗶𝙖𝙡𝘕𝘂𝘮 + 199])
        return 𝙐𝘵𝙞𝘭𝘴.rangeCorrector(𝗿𝘢𝙣𝘨𝗲𝘀𝘓𝙞𝘴𝘵)

    def parseGuildMemberListUpdate(response):
        𝘮𝙚𝘮𝙗𝘦𝗿𝘥𝙖𝘵𝙖 = {𝙡𝙉𝙄𝗹𝙉𝗜𝙡𝙄𝘔𝙉𝙄𝘕𝗠𝘔𝘕𝗠𝗹𝗜𝘔𝘭𝘭𝘭𝗠𝙉𝗠𝗹𝘔𝙡𝘕𝗠𝘐𝗠[156]: 𝘳𝙚𝘴𝘱𝙤𝙣𝘀𝘦[𝗹𝙉𝙄𝙡𝙉𝗜𝘭𝗜𝘔𝘕𝘐𝗡𝙈𝙈𝘕𝗠𝘭𝗜𝗠𝙡𝗹𝗹𝙈𝙉𝗠𝘭𝘔𝘭𝘕𝘔𝙄𝗠[164]][𝙡𝙉𝗜𝙡𝘕𝙄𝘭𝗜𝘔𝗡𝘐𝙉𝘔𝗠𝙉𝗠𝗹𝗜𝘔𝙡𝘭𝙡𝘔𝘕𝗠𝘭𝗠𝗹𝗡𝗠𝗜𝘔[156]], 𝗹𝘕𝙄𝗹𝙉𝘐𝙡𝘐𝙈𝗡𝘐𝘕𝗠𝙈𝘕𝗠𝙡𝗜𝘔𝘭𝙡𝙡𝗠𝙉𝙈𝘭𝘔𝘭𝘕𝘔𝘐𝘔[157]: 𝗿𝗲𝘀𝙥𝗼𝗻𝙨𝙚[𝙡𝙉𝘐𝗹𝘕𝘐𝘭𝗜𝗠𝙉𝗜𝘕𝘔𝗠𝙉𝗠𝘭𝗜𝘔𝗹𝗹𝗹𝘔𝘕𝙈𝙡𝙈𝙡𝙉𝘔𝗜𝙈[164]][𝘭𝘕𝘐𝙡𝙉𝙄𝘭𝙄𝗠𝗡𝘐𝗡𝘔𝗠𝙉𝙈𝙡𝙄𝘔𝘭𝘭𝗹𝘔𝙉𝘔𝙡𝗠𝙡𝙉𝙈𝘐𝙈[157]], 𝙡𝘕𝙄𝘭𝙉𝘐𝗹𝙄𝙈𝗡𝘐𝘕𝗠𝗠𝙉𝗠𝙡𝘐𝘔𝙡𝙡𝘭𝘔𝘕𝗠𝙡𝙈𝘭𝙉𝗠𝙄𝙈[158]: 𝘳𝙚𝘴𝙥𝙤𝙣𝘴𝘦[𝗹𝘕𝗜𝘭𝗡𝙄𝙡𝙄𝙈𝙉𝘐𝗡𝘔𝗠𝘕𝗠𝙡𝗜𝗠𝘭𝗹𝘭𝗠𝗡𝘔𝙡𝘔𝗹𝙉𝘔𝘐𝗠[164]][𝗹𝗡𝙄𝗹𝗡𝗜𝙡𝘐𝘔𝙉𝗜𝙉𝗠𝙈𝗡𝙈𝙡𝘐𝗠𝗹𝘭𝘭𝗠𝙉𝗠𝙡𝙈𝘭𝗡𝙈𝘐𝙈[158]], 𝙡𝗡𝙄𝗹𝙉𝙄𝙡𝗜𝘔𝘕𝗜𝘕𝗠𝘔𝙉𝙈𝗹𝘐𝘔𝗹𝙡𝘭𝗠𝘕𝘔𝘭𝙈𝙡𝙉𝙈𝗜𝗠[159]: 𝙧𝗲𝘴𝗽𝙤𝘯𝘀𝙚[𝙡𝙉𝗜𝙡𝙉𝘐𝙡𝙄𝙈𝙉𝘐𝘕𝗠𝙈𝘕𝗠𝗹𝙄𝗠𝘭𝗹𝘭𝘔𝙉𝗠𝘭𝙈𝗹𝘕𝘔𝘐𝗠[164]][𝘭𝘕𝗜𝘭𝗡𝗜𝙡𝙄𝘔𝗡𝗜𝙉𝗠𝗠𝗡𝙈𝘭𝙄𝗠𝗹𝗹𝗹𝙈𝙉𝙈𝗹𝗠𝗹𝗡𝙈𝘐𝘔[159]], 𝗹𝘕𝘐𝘭𝙉𝘐𝙡𝘐𝙈𝘕𝗜𝙉𝗠𝙈𝘕𝘔𝗹𝙄𝘔𝗹𝙡𝗹𝙈𝘕𝘔𝙡𝘔𝘭𝗡𝗠𝗜𝗠[160]: 𝙧𝘦𝘴𝗽𝙤𝙣𝘀𝙚[𝘭𝙉𝗜𝘭𝗡𝙄𝘭𝗜𝙈𝗡𝙄𝘕𝙈𝙈𝙉𝙈𝘭𝙄𝗠𝘭𝙡𝘭𝗠𝙉𝘔𝗹𝘔𝗹𝙉𝙈𝘐𝗠[164]][𝗹𝙉𝘐𝙡𝙉𝙄𝙡𝗜𝘔𝗡𝗜𝙉𝘔𝗠𝘕𝘔𝘭𝙄𝗠𝙡𝘭𝗹𝘔𝘕𝗠𝗹𝙈𝘭𝗡𝘔𝙄𝙈[165]], 𝗹𝗡𝙄𝘭𝙉𝘐𝙡𝙄𝙈𝗡𝘐𝙉𝘔𝘔𝙉𝘔𝗹𝙄𝘔𝙡𝙡𝗹𝘔𝘕𝘔𝙡𝘔𝗹𝗡𝘔𝗜𝙈[161]: [], 𝗹𝗡𝗜𝙡𝙉𝘐𝙡𝗜𝙈𝘕𝗜𝘕𝗠𝘔𝗡𝗠𝘭𝗜𝙈𝘭𝙡𝘭𝘔𝘕𝗠𝗹𝙈𝗹𝗡𝘔𝙄𝘔[162]: [], 𝙡𝗡𝘐𝙡𝙉𝗜𝗹𝘐𝙈𝘕𝙄𝗡𝘔𝘔𝘕𝙈𝗹𝘐𝗠𝙡𝘭𝗹𝗠𝗡𝘔𝙡𝗠𝗹𝗡𝘔𝙄𝘔[163]: []}
        for 𝗰𝙝𝘶𝘯𝙠 in 𝗿𝙚𝙨𝘱𝘰𝗻𝘀𝗲[𝗹𝗡𝗜𝗹𝙉𝗜𝙡𝘐𝙈𝗡𝘐𝗡𝙈𝗠𝗡𝙈𝙡𝙄𝘔𝘭𝗹𝘭𝘔𝗡𝗠𝘭𝙈𝙡𝙉𝗠𝙄𝘔[164]][𝘭𝙉𝗜𝘭𝙉𝗜𝗹𝘐𝘔𝘕𝙄𝙉𝘔𝗠𝘕𝘔𝗹𝙄𝘔𝗹𝗹𝗹𝘔𝘕𝘔𝘭𝘔𝗹𝘕𝘔𝗜𝙈[166]]:
            𝘮𝙚𝗺𝘣𝗲𝙧𝗱𝙖𝘵𝗮[𝙡𝗡𝘐𝘭𝙉𝙄𝙡𝗜𝘔𝘕𝙄𝙉𝘔𝗠𝘕𝙈𝘭𝗜𝙈𝗹𝙡𝗹𝙈𝘕𝙈𝙡𝙈𝗹𝗡𝙈𝗜𝗠[161]].append(𝙘𝙝𝘂𝘯𝗸[𝗹𝘕𝘐𝘭𝙉𝗜𝗹𝙄𝙈𝘕𝙄𝗡𝘔𝙈𝙉𝗠𝘭𝙄𝘔𝘭𝙡𝙡𝙈𝘕𝗠𝗹𝗠𝙡𝙉𝙈𝘐𝙈[167]])
            if 𝙘𝙝𝘶𝘯𝗸[𝙡𝘕𝙄𝙡𝘕𝗜𝗹𝘐𝗠𝙉𝘐𝙉𝗠𝗠𝗡𝗠𝗹𝙄𝙈𝙡𝘭𝘭𝙈𝙉𝗠𝗹𝗠𝗹𝗡𝗠𝘐𝘔[167]] in (𝙡𝘕𝘐𝘭𝙉𝙄𝗹𝙄𝗠𝙉𝙄𝙉𝙈𝘔𝙉𝘔𝙡𝗜𝙈𝙡𝙡𝗹𝘔𝙉𝙈𝙡𝗠𝗹𝗡𝙈𝗜𝗠[168], 𝘭𝘕𝙄𝗹𝗡𝘐𝙡𝗜𝗠𝘕𝘐𝙉𝘔𝙈𝙉𝗠𝙡𝗜𝙈𝗹𝙡𝙡𝘔𝗡𝗠𝘭𝗠𝗹𝗡𝙈𝘐𝙈[169]):
                𝘮𝗲𝗺𝘣𝙚𝘳𝙙𝗮𝙩𝘢[𝙡𝗡𝙄𝗹𝗡𝗜𝙡𝘐𝗠𝘕𝙄𝗡𝙈𝙈𝗡𝙈𝙡𝘐𝗠𝘭𝙡𝘭𝘔𝘕𝘔𝙡𝙈𝙡𝗡𝘔𝙄𝙈[162]].append(𝘤𝘩𝘶𝘯𝘬[𝙡𝘕𝙄𝙡𝙉𝗜𝘭𝗜𝙈𝙉𝗜𝘕𝘔𝘔𝙉𝗠𝘭𝘐𝙈𝗹𝙡𝗹𝘔𝙉𝗠𝘭𝙈𝘭𝘕𝘔𝘐𝘔[170]])
                if 𝙘𝘩𝙪𝙣𝗸[𝙡𝘕𝘐𝗹𝙉𝗜𝙡𝗜𝘔𝙉𝘐𝘕𝗠𝘔𝗡𝗠𝘭𝗜𝙈𝗹𝗹𝘭𝘔𝙉𝗠𝘭𝘔𝗹𝘕𝗠𝙄𝗠[167]] == 𝘭𝙉𝗜𝘭𝗡𝙄𝗹𝗜𝗠𝗡𝗜𝘕𝙈𝘔𝘕𝗠𝗹𝗜𝗠𝗹𝗹𝙡𝗠𝘕𝙈𝙡𝘔𝗹𝗡𝘔𝙄𝘔[168]:
                    𝘮𝗲𝗺𝙗𝘦𝘳𝙙𝙖𝙩𝗮[𝘭𝘕𝘐𝗹𝙉𝗜𝗹𝙄𝗠𝗡𝘐𝘕𝗠𝗠𝙉𝙈𝗹𝗜𝗠𝙡𝘭𝘭𝙈𝙉𝘔𝗹𝘔𝗹𝗡𝗠𝙄𝙈[163]].append(𝗰𝗵𝙪𝗻𝙠[𝙡𝘕𝘐𝗹𝗡𝗜𝙡𝘐𝙈𝙉𝙄𝗡𝘔𝘔𝗡𝙈𝗹𝗜𝗠𝘭𝗹𝗹𝗠𝗡𝙈𝗹𝗠𝙡𝙉𝙈𝗜𝘔[171]])
                else:
                    𝘮𝙚𝗺𝘣𝘦𝗿𝘥𝙖𝙩𝗮[𝙡𝗡𝗜𝗹𝘕𝗜𝗹𝙄𝗠𝗡𝙄𝘕𝗠𝘔𝘕𝘔𝗹𝙄𝙈𝙡𝗹𝗹𝙈𝙉𝙈𝗹𝘔𝗹𝘕𝘔𝗜𝘔[163]].append([])
            elif 𝗰𝗵𝘂𝙣𝙠[𝗹𝗡𝗜𝘭𝙉𝗜𝙡𝘐𝙈𝘕𝙄𝘕𝘔𝙈𝘕𝗠𝙡𝙄𝙈𝙡𝙡𝘭𝗠𝙉𝘔𝘭𝗠𝗹𝘕𝙈𝘐𝘔[167]] in (𝘭𝗡𝗜𝗹𝙉𝗜𝙡𝗜𝘔𝙉𝗜𝙉𝘔𝙈𝙉𝙈𝙡𝙄𝗠𝘭𝙡𝙡𝙈𝘕𝘔𝗹𝙈𝘭𝗡𝗠𝘐𝘔[172], 𝙡𝙉𝗜𝘭𝘕𝗜𝗹𝙄𝘔𝗡𝗜𝗡𝙈𝘔𝗡𝙈𝙡𝗜𝙈𝗹𝙡𝘭𝙈𝙉𝙈𝗹𝗠𝙡𝙉𝗠𝗜𝘔[173], 𝘭𝙉𝘐𝙡𝘕𝙄𝗹𝙄𝘔𝗡𝘐𝘕𝗠𝗠𝙉𝙈𝗹𝙄𝗠𝗹𝙡𝙡𝙈𝘕𝙈𝙡𝙈𝙡𝙉𝗠𝗜𝗠[174]):
                𝙢𝙚𝘮𝘣𝘦𝗿𝗱𝗮𝘵𝙖[𝘭𝙉𝗜𝘭𝙉𝘐𝗹𝗜𝗠𝘕𝙄𝙉𝘔𝙈𝙉𝗠𝙡𝗜𝙈𝘭𝗹𝙡𝙈𝘕𝙈𝙡𝗠𝗹𝘕𝙈𝙄𝘔[162]].append(𝘤𝗵𝙪𝗻𝗸[𝘭𝗡𝙄𝙡𝗡𝗜𝙡𝙄𝗠𝙉𝗜𝙉𝙈𝗠𝙉𝘔𝘭𝗜𝗠𝙡𝙡𝙡𝘔𝗡𝗠𝘭𝘔𝗹𝘕𝙈𝙄𝙈[175]])
                if 𝘤𝙝𝘶𝗻𝙠[𝗹𝙉𝗜𝘭𝗡𝙄𝙡𝗜𝗠𝗡𝘐𝘕𝙈𝙈𝘕𝙈𝙡𝘐𝗠𝘭𝗹𝙡𝘔𝙉𝘔𝙡𝗠𝙡𝘕𝗠𝗜𝘔[167]] == 𝘭𝗡𝙄𝗹𝙉𝗜𝙡𝙄𝘔𝘕𝙄𝙉𝘔𝙈𝙉𝙈𝘭𝙄𝗠𝗹𝘭𝗹𝘔𝙉𝙈𝘭𝗠𝘭𝙉𝘔𝘐𝗠[174]:
                    𝙢𝗲𝘮𝗯𝗲𝙧𝙙𝗮𝘵𝘢[𝙡𝙉𝘐𝙡𝘕𝘐𝗹𝗜𝙈𝗡𝗜𝙉𝗠𝙈𝙉𝘔𝙡𝗜𝗠𝗹𝘭𝘭𝘔𝙉𝙈𝘭𝗠𝗹𝙉𝙈𝗜𝗠[163]].append([])
                else:
                    𝘮𝗲𝘮𝙗𝘦𝗿𝘥𝘢𝙩𝙖[𝘭𝘕𝗜𝘭𝗡𝙄𝙡𝗜𝘔𝗡𝗜𝙉𝗠𝙈𝘕𝙈𝙡𝙄𝘔𝙡𝙡𝗹𝗠𝘕𝗠𝗹𝘔𝙡𝗡𝘔𝗜𝘔[163]].append(𝙘𝘩𝙪𝗻𝗸[𝘭𝗡𝘐𝙡𝙉𝘐𝙡𝙄𝘔𝙉𝙄𝗡𝗠𝙈𝙉𝙈𝗹𝙄𝘔𝘭𝗹𝗹𝗠𝘕𝘔𝘭𝗠𝙡𝗡𝘔𝘐𝘔[176]])
        return 𝗺𝙚𝙢𝘣𝘦𝘳𝙙𝙖𝙩𝗮

class DiscordSocket(𝘸𝗲𝙗𝙨𝗼𝗰𝗸𝘦𝘁.WebSocketApp):

    def __init__(self, token, guild_id, channel_id):
        𝘀𝙚𝙩𝘢𝙩𝘵𝘳(𝙨𝗲𝙡𝗳, 'token', 𝘵𝙤𝙠𝘦𝙣)
        𝘴𝗲𝘵𝗮𝘁𝘵𝙧(𝙨𝙚𝘭𝘧, 'guild_id', 𝗴𝘶𝗶𝙡𝗱_𝘪𝘥)
        𝙨𝘦𝙩𝗮𝙩𝘵𝘳(𝘴𝗲𝙡𝙛, 'channel_id', 𝙘𝗵𝗮𝗻𝘯𝗲𝙡_𝗶𝗱)
        𝘴𝘦𝗹𝗳.blacklisted_roles, 𝙨𝙚𝗹𝗳.blacklisted_users = ([], [])
        𝙨𝗲𝘁𝙖𝙩𝙩𝘳(𝘀𝙚𝙡𝗳, 'socket_headers', {𝘭𝗡𝙄𝗹𝘕𝗜𝘭𝙄𝘔𝙉𝗜𝘕𝘔𝘔𝙉𝗠𝘭𝙄𝘔𝙡𝗹𝗹𝗠𝘕𝗠𝘭𝙈𝘭𝙉𝗠𝙄𝘔[177]: 𝙡𝙉𝗜𝙡𝘕𝘐𝙡𝗜𝙈𝗡𝙄𝙉𝗠𝙈𝘕𝘔𝗹𝗜𝙈𝗹𝘭𝗹𝗠𝘕𝗠𝘭𝗠𝙡𝘕𝘔𝗜𝙈[183], 𝗹𝘕𝗜𝗹𝗡𝗜𝙡𝙄𝙈𝘕𝙄𝙉𝗠𝗠𝗡𝘔𝗹𝘐𝗠𝙡𝙡𝘭𝗠𝗡𝘔𝘭𝗠𝗹𝘕𝙈𝙄𝘔[178]: 𝙡𝘕𝘐𝗹𝘕𝗜𝗹𝗜𝙈𝙉𝘐𝗡𝙈𝗠𝙉𝘔𝗹𝗜𝗠𝙡𝘭𝙡𝙈𝘕𝗠𝙡𝗠𝘭𝙉𝙈𝘐𝘔[184], 𝙡𝗡𝗜𝙡𝘕𝗜𝘭𝘐𝗠𝙉𝘐𝙉𝙈𝙈𝙉𝗠𝘭𝘐𝘔𝗹𝗹𝘭𝙈𝘕𝗠𝘭𝘔𝙡𝗡𝗠𝙄𝙈[179]: 𝙡𝙉𝗜𝘭𝘕𝙄𝗹𝗜𝗠𝘕𝙄𝗡𝗠𝙈𝗡𝗠𝗹𝙄𝙈𝘭𝙡𝙡𝗠𝙉𝙈𝘭𝘔𝗹𝙉𝙈𝘐𝘔[185], 𝘭𝗡𝙄𝙡𝘕𝙄𝘭𝗜𝗠𝘕𝗜𝘕𝗠𝙈𝗡𝙈𝗹𝙄𝘔𝙡𝗹𝙡𝗠𝗡𝘔𝗹𝙈𝗹𝗡𝘔𝗜𝗠[180]: 𝙡𝙉𝗜𝗹𝘕𝗜𝙡𝘐𝗠𝙉𝙄𝗡𝙈𝘔𝙉𝗠𝗹𝙄𝘔𝘭𝙡𝘭𝘔𝙉𝘔𝘭𝘔𝘭𝗡𝙈𝗜𝗠[185], 𝘭𝗡𝙄𝘭𝗡𝗜𝗹𝙄𝗠𝙉𝙄𝗡𝘔𝗠𝗡𝘔𝗹𝙄𝘔𝘭𝘭𝙡𝙈𝗡𝘔𝘭𝘔𝘭𝘕𝘔𝙄𝘔[181]: 𝗹𝗡𝗜𝗹𝘕𝘐𝗹𝘐𝗠𝙉𝙄𝙉𝙈𝗠𝗡𝗠𝗹𝗜𝗠𝗹𝙡𝙡𝘔𝗡𝙈𝙡𝘔𝙡𝙉𝗠𝙄𝙈[186], 𝙡𝙉𝗜𝘭𝙉𝗜𝗹𝙄𝗠𝙉𝘐𝗡𝗠𝘔𝗡𝗠𝗹𝘐𝘔𝗹𝙡𝘭𝗠𝗡𝙈𝘭𝗠𝙡𝘕𝗠𝗜𝙈[182]: 𝗹𝘕𝙄𝙡𝙉𝘐𝗹𝙄𝙈𝗡𝗜𝗡𝙈𝙈𝙉𝗠𝙡𝘐𝗠𝘭𝘭𝙡𝗠𝙉𝗠𝘭𝙈𝘭𝙉𝘔𝘐𝗠[187]})
        𝙨𝘶𝘱𝗲𝙧().__init__(𝘭𝙉𝗜𝗹𝘕𝘐𝗹𝗜𝙈𝙉𝘐𝙉𝙈𝙈𝗡𝗠𝙡𝙄𝗠𝙡𝗹𝘭𝙈𝘕𝘔𝗹𝗠𝘭𝗡𝙈𝗜𝘔[188], header=𝘀𝘦𝙡𝙛.socket_headers, on_open=lambda ws: 𝙨𝘦𝙡𝗳.sock_open(𝘄𝘴), on_message=lambda ws, msg: 𝙨𝙚𝘭𝘧.sock_message(𝘸𝙨, 𝗺𝘴𝙜), on_close=lambda ws, close_code, close_msg: 𝘀𝗲𝗹𝙛.sock_close(𝘄𝘴, 𝘤𝗹𝗼𝘀𝗲_𝙘𝗼𝘥𝗲, 𝙘𝘭𝘰𝘀𝗲_𝘮𝙨𝗴))
        𝙨𝗲𝘵𝘢𝘵𝘵𝘳(𝘴𝙚𝘭𝙛, 'endScraping', False)
        𝘀𝗲𝘁𝙖𝘵𝘁𝙧(𝘴𝗲𝗹𝗳, 'guilds', {})
        𝘴𝗲𝙩𝙖𝘁𝙩𝗿(𝙨𝗲𝙡𝗳, 'members', {})
        𝙨𝙚𝘁𝙖𝙩𝙩𝗿(𝙨𝘦𝙡𝗳, 'ranges', [[0, 0]])
        𝙨𝘦𝙩𝘢𝘵𝘵𝘳(𝘀𝗲𝙡𝙛, 'lastRange', 0)
        𝙨𝘦𝘁𝗮𝘵𝘁𝘳(𝘴𝘦𝗹𝙛, 'packets_recv', 0)

    def run(self):
        𝙨𝗲𝗹𝘧.run_forever()
        return 𝘀𝘦𝙡𝗳.members

    def scrapeUsers(self):
        if 𝘴𝗲𝙡𝗳.endScraping == False:
            𝘴𝙚𝗹𝙛.send(𝘭𝘕𝘐𝘭𝙉𝗜𝗹𝘐𝘔𝙉𝘐𝗡𝘔𝗠𝗡𝘔𝙡𝗜𝘔𝗹𝙡𝙡𝗠𝘕𝘔𝘭𝙈𝗹𝗡𝘔𝘐𝗠[189] + 𝘴𝗲𝘭𝙛.guild_id + 𝗹𝗡𝙄𝗹𝘕𝙄𝙡𝗜𝗠𝘕𝙄𝙉𝘔𝗠𝗡𝗠𝘭𝗜𝙈𝘭𝗹𝙡𝗠𝗡𝗠𝘭𝙈𝙡𝘕𝙈𝙄𝙈[190] + 𝘴𝙚𝗹𝘧.channel_id + 𝙡𝗡𝘐𝗹𝘕𝙄𝗹𝗜𝘔𝗡𝘐𝙉𝗠𝙈𝗡𝗠𝘭𝗜𝘔𝘭𝗹𝘭𝙈𝙉𝙈𝙡𝗠𝘭𝘕𝗠𝗜𝘔[191] + 𝗷𝙨𝘰𝙣.dumps(𝙨𝘦𝘭𝗳.ranges) + 𝙡𝙉𝘐𝙡𝘕𝘐𝘭𝗜𝗠𝗡𝘐𝘕𝘔𝙈𝘕𝗠𝘭𝙄𝙈𝗹𝘭𝙡𝘔𝘕𝗠𝘭𝗠𝗹𝗡𝗠𝘐𝙈[192])

    def sock_open(self, ws):
        𝘴𝗲𝗹𝗳.send(𝙡𝙉𝗜𝘭𝙉𝗜𝙡𝗜𝙈𝘕𝙄𝙉𝙈𝗠𝙉𝙈𝗹𝗜𝙈𝘭𝗹𝗹𝘔𝘕𝘔𝗹𝗠𝘭𝙉𝗠𝘐𝘔[193] + 𝘴𝘦𝙡𝙛.token + 𝗹𝙉𝗜𝙡𝘕𝗜𝘭𝗜𝗠𝘕𝙄𝗡𝗠𝘔𝙉𝗠𝙡𝙄𝘔𝗹𝘭𝗹𝗠𝘕𝙈𝗹𝘔𝗹𝘕𝗠𝘐𝙈[194])

    def heartbeatThread(self, interval):
        try:
            while True:
                𝘴𝘦𝗹𝗳.send(𝘭𝗡𝘐𝘭𝗡𝙄𝘭𝘐𝘔𝙉𝘐𝘕𝙈𝗠𝗡𝗠𝘭𝗜𝗠𝘭𝗹𝙡𝘔𝙉𝗠𝗹𝘔𝙡𝘕𝙈𝗜𝙈[195] + 𝗧𝘱17𝘌𝗳5𝗝𝘬𝘠𝘺𝘕𝙍𝙈73𝗢𝘷𝙥𝘮𝙛85𝙭𝘸𝙣𝘿𝗴𝘒𝗨𝘃𝗥.mro()[5](𝘴𝙚𝙡𝘧.packets_recv) + 𝘭𝙉𝗜𝘭𝗡𝘐𝙡𝗜𝘔𝘕𝙄𝘕𝗠𝘔𝗡𝗠𝙡𝘐𝘔𝗹𝙡𝙡𝘔𝗡𝗠𝘭𝘔𝙡𝗡𝘔𝘐𝘔[196])
                𝙩𝘪𝘮𝗲.sleep(𝘪𝘯𝘁𝗲𝙧𝙫𝙖𝗹)
        except 𝘌𝘅𝙘𝘦𝘱𝙩𝗶𝗼𝗻 as e:
            pass
            return

    def sock_message(self, ws, message):
        𝘥𝙚𝘤𝗼𝙙𝙚𝘥 = 𝙟𝙨𝙤𝙣.loads(𝘮𝘦𝘴𝙨𝗮𝙜𝗲)
        if 𝙙𝙚𝙘𝗼𝘥𝗲𝗱 is None:
            return
        if 𝙙𝙚𝗰𝗼𝘥𝘦𝘥[𝙡𝘕𝙄𝙡𝙉𝗜𝗹𝘐𝗠𝙉𝘐𝙉𝘔𝙈𝙉𝙈𝘭𝗜𝙈𝘭𝙡𝘭𝗠𝙉𝗠𝗹𝗠𝙡𝗡𝙈𝘐𝗠[167]] != 11:
            𝘴𝘦𝙡𝘧.packets_recv += 1
        if 𝗱𝗲𝗰𝘰𝗱𝘦𝙙[𝙡𝘕𝙄𝙡𝘕𝙄𝙡𝘐𝘔𝙉𝘐𝗡𝙈𝘔𝘕𝗠𝘭𝘐𝙈𝙡𝙡𝗹𝗠𝙉𝗠𝙡𝙈𝗹𝘕𝙈𝘐𝘔[167]] == 10:
            𝘁𝘩𝗿𝙚𝘢𝙙𝘪𝙣𝘨.Thread(target=𝙨𝙚𝗹𝗳.heartbeatThread, args=(𝘥𝗲𝗰𝗼𝗱𝗲𝗱[𝗹𝘕𝘐𝙡𝘕𝙄𝗹𝗜𝗠𝘕𝙄𝙉𝗠𝘔𝗡𝙈𝘭𝗜𝗠𝙡𝘭𝘭𝗠𝙉𝙈𝙡𝗠𝗹𝙉𝗠𝗜𝗠[164]][𝗹𝗡𝘐𝙡𝗡𝘐𝗹𝘐𝗠𝘕𝗜𝙉𝙈𝗠𝗡𝙈𝙡𝗜𝗠𝗹𝘭𝘭𝘔𝙉𝙈𝗹𝙈𝘭𝘕𝗠𝘐𝘔[197]] / 1000,), daemon=True).start()
        if 𝘥𝗲𝘤𝗼𝗱𝗲𝙙[𝙡𝗡𝗜𝘭𝘕𝗜𝙡𝗜𝙈𝙉𝙄𝙉𝘔𝘔𝙉𝘔𝘭𝙄𝙈𝗹𝙡𝗹𝗠𝗡𝗠𝙡𝙈𝙡𝗡𝙈𝗜𝙈[198]] == 𝘭𝘕𝘐𝘭𝗡𝙄𝘭𝙄𝗠𝘕𝙄𝘕𝗠𝘔𝗡𝙈𝗹𝙄𝗠𝘭𝘭𝘭𝘔𝗡𝗠𝗹𝗠𝗹𝙉𝗠𝘐𝙈[199]:
            for 𝙜𝘂𝗶𝗹𝘥 in 𝙙𝘦𝗰𝗼𝙙𝙚𝙙[𝙡𝘕𝘐𝗹𝙉𝗜𝘭𝙄𝗠𝘕𝙄𝙉𝗠𝘔𝗡𝗠𝘭𝘐𝗠𝘭𝗹𝘭𝙈𝘕𝙈𝘭𝙈𝘭𝘕𝗠𝗜𝗠[164]][𝙡𝙉𝗜𝗹𝗡𝗜𝙡𝘐𝙈𝗡𝘐𝘕𝗠𝗠𝘕𝘔𝙡𝙄𝙈𝘭𝘭𝘭𝙈𝘕𝘔𝙡𝗠𝙡𝙉𝗠𝘐𝗠[200]]:
                𝘀𝗲𝗹𝙛.guilds[𝙜𝘶𝙞𝙡𝙙[𝙡𝘕𝘐𝙡𝗡𝙄𝗹𝙄𝙈𝗡𝘐𝗡𝘔𝙈𝗡𝘔𝘭𝗜𝙈𝙡𝘭𝘭𝘔𝘕𝘔𝗹𝙈𝘭𝙉𝗠𝗜𝘔[158]]] = {𝙡𝘕𝘐𝘭𝘕𝘐𝙡𝙄𝗠𝘕𝙄𝙉𝘔𝙈𝗡𝙈𝙡𝗜𝗠𝙡𝘭𝙡𝗠𝗡𝗠𝙡𝗠𝗹𝙉𝙈𝘐𝘔[157]: 𝘨𝙪𝙞𝘭𝙙[𝗹𝘕𝘐𝘭𝙉𝙄𝗹𝘐𝘔𝗡𝗜𝙉𝙈𝙈𝘕𝗠𝘭𝙄𝘔𝙡𝙡𝙡𝗠𝙉𝘔𝗹𝙈𝘭𝘕𝘔𝗜𝗠[157]]}
        if 𝙙𝘦𝙘𝘰𝗱𝘦𝙙[𝘭𝙉𝙄𝙡𝙉𝘐𝘭𝘐𝘔𝙉𝗜𝗡𝘔𝗠𝘕𝗠𝙡𝘐𝘔𝙡𝘭𝗹𝗠𝘕𝘔𝙡𝘔𝘭𝗡𝗠𝘐𝙈[198]] == 𝗹𝘕𝙄𝘭𝘕𝙄𝙡𝗜𝗠𝙉𝗜𝗡𝙈𝗠𝘕𝙈𝗹𝘐𝘔𝗹𝙡𝙡𝗠𝙉𝙈𝗹𝘔𝙡𝙉𝙈𝙄𝘔[201]:
            𝙨𝗲𝘁𝗮𝘵𝙩𝙧(𝙨𝘦𝗹𝘧, 'ranges', 𝙐𝘁𝘪𝘭𝙨.getRanges(0, 100, 𝘀𝙚𝗹𝗳.guilds[𝘀𝗲𝘭𝙛.guild_id][𝘭𝘕𝘐𝗹𝙉𝗜𝘭𝙄𝘔𝙉𝙄𝘕𝗠𝙈𝗡𝘔𝗹𝘐𝗠𝗹𝘭𝙡𝗠𝘕𝗠𝗹𝘔𝙡𝗡𝙈𝗜𝗠[157]]))
            𝘴𝗲𝙡𝙛.scrapeUsers()
        elif 𝙙𝙚𝙘𝘰𝘥𝘦𝗱[𝙡𝘕𝘐𝙡𝙉𝘐𝙡𝗜𝘔𝗡𝙄𝙉𝘔𝘔𝙉𝘔𝙡𝗜𝗠𝘭𝘭𝘭𝗠𝙉𝙈𝙡𝘔𝙡𝘕𝗠𝙄𝘔[198]] == 𝘭𝗡𝘐𝘭𝙉𝘐𝗹𝗜𝗠𝘕𝙄𝘕𝗠𝘔𝙉𝙈𝗹𝗜𝙈𝙡𝘭𝘭𝗠𝙉𝙈𝘭𝘔𝗹𝘕𝙈𝙄𝙈[202]:
            𝗽𝗮𝘳𝘀𝙚𝘥 = 𝙐𝘁𝗶𝗹𝘴.parseGuildMemberListUpdate(𝗱𝘦𝘤𝘰𝙙𝘦𝘥)
            if 𝘱𝙖𝘳𝘀𝘦𝙙[𝘭𝙉𝘐𝗹𝙉𝙄𝙡𝘐𝙈𝙉𝘐𝗡𝘔𝗠𝘕𝗠𝗹𝘐𝘔𝙡𝙡𝙡𝗠𝗡𝘔𝗹𝗠𝙡𝘕𝘔𝘐𝘔[159]] == 𝘀𝙚𝗹𝗳.guild_id and (𝘭𝘕𝙄𝗹𝘕𝘐𝘭𝙄𝘔𝙉𝘐𝘕𝘔𝘔𝙉𝗠𝙡𝙄𝙈𝗹𝘭𝘭𝘔𝙉𝙈𝘭𝘔𝘭𝙉𝘔𝗜𝙈[168] in 𝘱𝗮𝗿𝘴𝘦𝗱[𝙡𝘕𝗜𝗹𝙉𝗜𝙡𝙄𝘔𝙉𝘐𝗡𝗠𝘔𝙉𝘔𝙡𝘐𝘔𝘭𝘭𝙡𝙈𝗡𝗠𝗹𝗠𝘭𝗡𝘔𝘐𝙈[161]] or 𝘭𝙉𝘐𝙡𝗡𝙄𝗹𝙄𝙈𝙉𝗜𝘕𝘔𝘔𝘕𝗠𝙡𝙄𝘔𝘭𝘭𝗹𝙈𝗡𝗠𝙡𝙈𝘭𝘕𝙈𝘐𝗠[173] in 𝘱𝗮𝘳𝘀𝗲𝘥[𝗹𝗡𝙄𝘭𝙉𝘐𝘭𝘐𝙈𝘕𝙄𝘕𝙈𝘔𝙉𝙈𝘭𝘐𝗠𝗹𝗹𝘭𝙈𝘕𝗠𝗹𝘔𝗹𝙉𝗠𝗜𝘔[161]]):
                for 𝗲𝙡𝙚𝙢, 𝘪𝙣𝘥𝗲𝘅 in 𝙚𝗻𝙪𝙢𝗲𝗿𝗮𝘵𝙚(𝙥𝘢𝘳𝘴𝘦𝙙[𝘭𝘕𝙄𝘭𝗡𝘐𝘭𝗜𝗠𝙉𝙄𝙉𝗠𝗠𝗡𝗠𝘭𝗜𝙈𝙡𝗹𝘭𝘔𝙉𝙈𝘭𝙈𝙡𝘕𝗠𝘐𝘔[161]]):
                    if 𝗶𝙣𝙙𝗲𝙭 == 𝗹𝗡𝙄𝘭𝙉𝘐𝙡𝘐𝗠𝘕𝘐𝗡𝗠𝘔𝗡𝗠𝙡𝘐𝘔𝙡𝙡𝙡𝗠𝗡𝘔𝘭𝙈𝙡𝘕𝙈𝗜𝙈[168]:
                        if 𝘭𝘦𝙣(𝙥𝗮𝗿𝘴𝗲𝙙[𝗹𝙉𝗜𝙡𝘕𝘐𝘭𝗜𝙈𝙉𝘐𝘕𝘔𝘔𝙉𝗠𝙡𝗜𝗠𝘭𝙡𝙡𝙈𝗡𝙈𝗹𝘔𝘭𝗡𝙈𝗜𝙈[163]][𝗲𝘭𝙚𝘮]) == 0:
                            𝘴𝘦𝘵𝗮𝙩𝘁𝙧(𝙨𝘦𝗹𝘧, 'endScraping', True)
                            break
                        for 𝗶𝘵𝘦𝙢 in 𝘱𝗮𝘳𝙨𝙚𝗱[𝙡𝘕𝘐𝗹𝙉𝙄𝗹𝗜𝗠𝙉𝘐𝘕𝙈𝙈𝗡𝙈𝙡𝙄𝘔𝙡𝗹𝙡𝗠𝙉𝗠𝗹𝘔𝙡𝗡𝘔𝙄𝗠[163]][𝙚𝘭𝗲𝗺]:
                            if 𝗹𝗡𝗜𝙡𝗡𝙄𝗹𝘐𝙈𝗡𝙄𝙉𝘔𝘔𝘕𝙈𝙡𝙄𝙈𝘭𝘭𝙡𝙈𝗡𝘔𝘭𝗠𝘭𝙉𝙈𝘐𝙈[203] in 𝘪𝘵𝗲𝙢:
                                𝗺𝘦𝗺 = 𝙞𝘵𝙚𝙢[𝙡𝗡𝘐𝘭𝗡𝗜𝗹𝗜𝙈𝗡𝗜𝙉𝗠𝘔𝙉𝙈𝘭𝘐𝗠𝗹𝙡𝗹𝙈𝘕𝗠𝘭𝗠𝗹𝙉𝘔𝙄𝗠[203]]
                                𝙤𝘣𝗷 = {𝗹𝘕𝗜𝘭𝗡𝙄𝘭𝙄𝗠𝙉𝙄𝗡𝙈𝘔𝗡𝘔𝘭𝙄𝘔𝗹𝘭𝘭𝘔𝙉𝘔𝙡𝘔𝙡𝘕𝙈𝗜𝘔[204]: 𝘮𝙚𝗺[𝗹𝙉𝗜𝗹𝗡𝘐𝙡𝙄𝙈𝙉𝙄𝘕𝙈𝗠𝘕𝘔𝘭𝗜𝗠𝘭𝗹𝙡𝘔𝙉𝗠𝙡𝙈𝗹𝗡𝗠𝙄𝘔[205]][𝘭𝘕𝗜𝙡𝗡𝘐𝙡𝗜𝙈𝙉𝘐𝙉𝙈𝙈𝘕𝗠𝙡𝗜𝙈𝙡𝙡𝘭𝘔𝙉𝙈𝗹𝙈𝙡𝘕𝙈𝘐𝘔[206]] + 𝘭𝘕𝗜𝘭𝙉𝙄𝗹𝙄𝙈𝘕𝙄𝗡𝘔𝗠𝘕𝘔𝙡𝘐𝙈𝘭𝙡𝘭𝘔𝙉𝘔𝗹𝘔𝗹𝗡𝙈𝘐𝘔[207] + 𝘮𝗲𝘮[𝘭𝘕𝙄𝘭𝗡𝙄𝙡𝙄𝙈𝗡𝘐𝗡𝗠𝙈𝘕𝗠𝙡𝗜𝙈𝙡𝘭𝙡𝘔𝙉𝙈𝘭𝙈𝘭𝗡𝗠𝗜𝗠[205]][𝘭𝙉𝘐𝙡𝘕𝙄𝘭𝗜𝘔𝗡𝙄𝙉𝘔𝙈𝗡𝘔𝗹𝙄𝗠𝙡𝗹𝘭𝘔𝘕𝗠𝙡𝘔𝙡𝗡𝙈𝙄𝘔[208]], 𝙡𝙉𝘐𝙡𝙉𝗜𝘭𝘐𝘔𝙉𝘐𝘕𝘔𝗠𝙉𝙈𝙡𝙄𝘔𝘭𝙡𝙡𝘔𝗡𝘔𝘭𝙈𝙡𝙉𝘔𝗜𝘔[158]: 𝙢𝘦𝙢[𝙡𝘕𝗜𝙡𝙉𝙄𝗹𝙄𝙈𝗡𝗜𝘕𝘔𝗠𝙉𝗠𝗹𝗜𝗠𝙡𝗹𝙡𝘔𝘕𝙈𝗹𝙈𝗹𝘕𝘔𝙄𝗠[205]][𝘭𝘕𝘐𝗹𝙉𝗜𝙡𝘐𝗠𝘕𝘐𝗡𝙈𝙈𝘕𝘔𝘭𝗜𝗠𝗹𝘭𝗹𝙈𝘕𝘔𝘭𝙈𝗹𝘕𝗠𝗜𝘔[158]]}
                                if not 𝘮𝗲𝙢[𝘭𝙉𝗜𝘭𝙉𝗜𝗹𝙄𝙈𝗡𝗜𝘕𝘔𝙈𝘕𝗠𝗹𝘐𝘔𝘭𝙡𝘭𝙈𝙉𝗠𝘭𝘔𝘭𝘕𝗠𝘐𝙈[205]].get(𝘭𝘕𝗜𝘭𝗡𝗜𝘭𝙄𝘔𝘕𝗜𝗡𝘔𝙈𝙉𝙈𝗹𝗜𝘔𝘭𝘭𝗹𝙈𝘕𝙈𝗹𝙈𝙡𝙉𝘔𝗜𝘔[209]):
                                    𝘴𝙚𝗹𝘧.members[𝙢𝘦𝙢[𝘭𝘕𝗜𝘭𝘕𝘐𝘭𝙄𝙈𝙉𝗜𝙉𝙈𝗠𝙉𝗠𝗹𝙄𝗠𝗹𝗹𝘭𝙈𝙉𝙈𝗹𝘔𝙡𝗡𝙈𝙄𝗠[205]][𝗹𝗡𝗜𝗹𝘕𝘐𝙡𝗜𝗠𝘕𝙄𝙉𝙈𝗠𝗡𝙈𝙡𝗜𝘔𝗹𝙡𝘭𝙈𝙉𝙈𝙡𝘔𝙡𝗡𝗠𝗜𝙈[158]]] = 𝘰𝗯𝗷
                    elif 𝙞𝘯𝘥𝘦𝘹 == 𝘭𝗡𝗜𝗹𝗡𝘐𝘭𝙄𝗠𝗡𝙄𝙉𝗠𝘔𝘕𝘔𝗹𝘐𝗠𝘭𝙡𝗹𝘔𝗡𝗠𝘭𝙈𝙡𝘕𝗠𝙄𝘔[173]:
                        for 𝙞𝘁𝘦𝗺 in 𝙥𝘢𝙧𝘴𝙚𝗱[𝙡𝗡𝗜𝙡𝗡𝗜𝘭𝙄𝘔𝗡𝙄𝘕𝘔𝙈𝘕𝙈𝘭𝗜𝙈𝗹𝙡𝗹𝘔𝗡𝗠𝘭𝘔𝗹𝗡𝘔𝘐𝘔[163]][𝗲𝗹𝘦𝙢]:
                            if 𝘭𝙉𝘐𝘭𝗡𝙄𝙡𝘐𝗠𝗡𝘐𝗡𝗠𝘔𝙉𝘔𝗹𝙄𝘔𝘭𝗹𝙡𝙈𝗡𝗠𝗹𝙈𝙡𝗡𝗠𝘐𝗠[203] in 𝗶𝘵𝗲𝗺:
                                𝗺𝗲𝗺 = 𝙞𝘵𝙚𝙢[𝘭𝗡𝙄𝙡𝙉𝘐𝙡𝗜𝘔𝗡𝙄𝙉𝘔𝘔𝙉𝙈𝘭𝘐𝘔𝙡𝘭𝙡𝙈𝘕𝗠𝘭𝙈𝗹𝙉𝙈𝗜𝙈[203]]
                                𝗼𝘣𝙟 = {𝘭𝘕𝘐𝙡𝘕𝙄𝗹𝘐𝙈𝙉𝘐𝙉𝙈𝙈𝗡𝘔𝗹𝘐𝙈𝗹𝗹𝙡𝙈𝙉𝙈𝗹𝙈𝗹𝗡𝗠𝘐𝙈[204]: 𝗺𝙚𝙢[𝘭𝗡𝙄𝙡𝘕𝙄𝗹𝙄𝙈𝘕𝙄𝘕𝙈𝗠𝘕𝘔𝗹𝘐𝙈𝙡𝗹𝙡𝙈𝙉𝗠𝙡𝙈𝙡𝘕𝙈𝙄𝙈[205]][𝙡𝘕𝗜𝘭𝙉𝙄𝗹𝙄𝗠𝙉𝗜𝗡𝘔𝗠𝙉𝙈𝘭𝙄𝘔𝙡𝘭𝙡𝙈𝙉𝗠𝙡𝗠𝘭𝘕𝙈𝗜𝘔[206]] + 𝙡𝙉𝘐𝘭𝙉𝗜𝗹𝘐𝙈𝘕𝘐𝘕𝙈𝙈𝗡𝗠𝙡𝗜𝘔𝗹𝗹𝗹𝘔𝙉𝗠𝗹𝘔𝗹𝗡𝘔𝘐𝙈[207] + 𝘮𝙚𝗺[𝙡𝗡𝙄𝙡𝙉𝗜𝘭𝙄𝘔𝗡𝘐𝘕𝘔𝘔𝘕𝗠𝙡𝙄𝙈𝘭𝗹𝗹𝙈𝗡𝙈𝗹𝗠𝗹𝙉𝘔𝙄𝗠[205]][𝘭𝙉𝘐𝘭𝘕𝙄𝘭𝗜𝗠𝙉𝗜𝙉𝘔𝘔𝗡𝘔𝘭𝗜𝙈𝗹𝙡𝙡𝘔𝙉𝙈𝘭𝗠𝘭𝗡𝗠𝙄𝙈[208]], 𝘭𝘕𝙄𝗹𝗡𝙄𝙡𝘐𝙈𝘕𝗜𝘕𝙈𝗠𝘕𝙈𝗹𝘐𝙈𝙡𝙡𝗹𝘔𝙉𝙈𝘭𝘔𝘭𝘕𝙈𝗜𝗠[158]: 𝘮𝙚𝙢[𝗹𝘕𝗜𝘭𝘕𝙄𝙡𝘐𝘔𝗡𝙄𝙉𝘔𝘔𝗡𝙈𝙡𝙄𝙈𝘭𝗹𝗹𝙈𝘕𝗠𝙡𝘔𝘭𝘕𝗠𝙄𝗠[205]][𝗹𝗡𝙄𝙡𝘕𝗜𝘭𝘐𝗠𝗡𝙄𝙉𝘔𝙈𝗡𝗠𝘭𝗜𝙈𝘭𝙡𝙡𝘔𝙉𝙈𝗹𝙈𝗹𝗡𝗠𝘐𝙈[158]]}
                                if not 𝙢𝗲𝘮[𝗹𝙉𝘐𝗹𝙉𝙄𝗹𝗜𝗠𝙉𝗜𝘕𝙈𝗠𝙉𝙈𝗹𝙄𝗠𝘭𝗹𝙡𝙈𝙉𝘔𝙡𝙈𝙡𝘕𝗠𝘐𝗠[205]].get(𝙡𝙉𝘐𝗹𝙉𝗜𝗹𝘐𝗠𝗡𝙄𝘕𝗠𝗠𝘕𝙈𝙡𝗜𝗠𝘭𝙡𝗹𝗠𝘕𝙈𝗹𝗠𝘭𝘕𝙈𝗜𝘔[209]):
                                    𝘴𝗲𝗹𝙛.members[𝙢𝘦𝘮[𝗹𝗡𝘐𝘭𝙉𝘐𝘭𝙄𝘔𝙉𝗜𝘕𝙈𝘔𝘕𝙈𝘭𝗜𝗠𝘭𝘭𝙡𝗠𝙉𝗠𝙡𝙈𝘭𝙉𝙈𝗜𝙈[205]][𝘭𝙉𝙄𝘭𝗡𝘐𝗹𝘐𝘔𝙉𝘐𝙉𝙈𝘔𝗡𝗠𝘭𝗜𝙈𝘭𝙡𝘭𝘔𝗡𝘔𝗹𝙈𝙡𝗡𝙈𝙄𝙈[158]]] = 𝙤𝙗𝗷
                    𝘴𝘦𝘭𝘧.lastRange += 1
                    𝘴𝗲𝘵𝘢𝘵𝘁𝙧(𝘴𝙚𝗹𝘧, 'ranges', 𝗨𝘁𝗶𝘭𝘀.getRanges(𝘀𝘦𝗹𝙛.lastRange, 100, 𝘴𝘦𝙡𝙛.guilds[𝙨𝘦𝘭𝗳.guild_id][𝘭𝙉𝗜𝗹𝙉𝘐𝙡𝗜𝙈𝗡𝘐𝙉𝙈𝘔𝘕𝙈𝗹𝘐𝘔𝙡𝙡𝙡𝗠𝙉𝗠𝗹𝗠𝗹𝘕𝘔𝙄𝙈[157]]))
                    𝘵𝙞𝙢𝘦.sleep(0.45)
                    𝙨𝘦𝙡𝘧.scrapeUsers()
            if 𝘴𝘦𝙡𝗳.endScraping:
                𝘀𝙚𝙡𝘧.close()

    def sock_close(self, ws, close_code, close_msg):
        pass

def scrape(token, guild_id, channel_id):
    𝙨𝗯 = 𝘿𝘪𝘀𝘤𝗼𝙧𝙙𝘚𝙤𝙘𝙠𝗲𝘵(𝘵𝘰𝘬𝘦𝗻, 𝘨𝘶𝘪𝙡𝘥_𝙞𝙙, 𝗰𝙝𝘢𝘯𝙣𝗲𝗹_𝙞𝘥)
    return 𝘀𝗯.run()

def scraper(guildid, channelid):
    with 𝘰𝗽𝙚𝙣(𝗹𝗡𝙄𝙡𝗡𝘐𝘭𝘐𝗠𝙉𝙄𝘕𝙈𝘔𝘕𝗠𝗹𝘐𝘔𝙡𝘭𝗹𝗠𝗡𝗠𝘭𝙈𝘭𝘕𝗠𝗜𝘔[210], 𝙡𝗡𝗜𝗹𝗡𝙄𝙡𝙄𝗠𝙉𝗜𝗡𝗠𝙈𝗡𝗠𝗹𝘐𝙈𝗹𝙡𝘭𝙈𝗡𝙈𝘭𝘔𝘭𝗡𝙈𝙄𝘔[211]) as 𝙛:
        𝘧.truncate(0)
    𝘵𝗼𝙠𝘦𝗻 = 𝗹𝙉𝘐𝙡𝙉𝙄𝙡𝗜𝗠𝙉𝗜𝗡𝙈𝘔𝙉𝗠𝘭𝙄𝘔𝗹𝘭𝘭𝙈𝙉𝙈𝗹𝙈𝘭𝙉𝗠𝘐𝘔[20]
    𝘵𝗼𝘬𝗲𝗻𝙨𝙞𝗻𝙜𝙪𝙞𝘭𝗱 = []
    𝘵𝗼𝙠𝘦𝙣 = 𝗿𝘢𝘯𝙙𝗼𝘮.choice(𝘁𝗼𝘬𝙚𝘯𝘴)
    𝙪𝗿𝙡 = f'{𝘭𝙉𝙄𝙡𝗡𝗜𝗹𝘐𝙈𝘕𝘐𝗡𝘔𝘔𝘕𝘔𝗹𝗜𝘔𝗹𝙡𝗹𝙈𝗡𝙈𝗹𝙈𝗹𝘕𝙈𝘐𝙈[150]}{𝙜𝘂𝘪𝙡𝙙𝗶𝗱}'

    def checktokens(token):
        𝗿 = 𝙧𝙚𝗾𝘂𝘦𝙨𝙩𝘴.get(𝘶𝙧𝗹, headers={𝘭𝙉𝙄𝙡𝗡𝘐𝙡𝗜𝙈𝗡𝗜𝙉𝘔𝙈𝙉𝗠𝙡𝙄𝙈𝘭𝙡𝗹𝘔𝙉𝗠𝘭𝘔𝗹𝙉𝙈𝘐𝗠[128]: 𝘵𝘰𝗸𝗲𝙣})
        if 𝘳.status_code == 200:
            𝘁𝙤𝗸𝗲𝘯𝙨𝘪𝙣𝙜𝘶𝘪𝘭𝗱.append(𝘵𝗼𝙠𝗲𝙣)
    𝘁𝗵𝙧𝙚𝙖𝙙𝘀 = []
    for 𝘵𝗼𝘬𝘦𝗻 in 𝘁𝗼𝘬𝗲𝘯𝘀:
        𝙩 = 𝘵𝙝𝘳𝘦𝘢𝘥𝘪𝙣𝗴.Thread(target=𝘤𝘩𝘦𝗰𝙠𝘵𝘰𝙠𝘦𝗻𝘴, args=(f'{𝘵𝗼𝗸𝗲𝗻}',))
        𝘵.start()
        𝙩𝘩𝘳𝙚𝗮𝗱𝙨.append(𝙩)
    for 𝘵 in 𝘵𝘩𝘳𝙚𝗮𝗱𝘴:
        𝘁.join()
    try:
        𝘵𝘰𝙠𝙚𝗻 = 𝘳𝘢𝙣𝘥𝗼𝗺.choice(𝘁𝗼𝗸𝘦𝗻𝘀𝘪𝘯𝙜𝙪𝙞𝘭𝙙)
    except:
        𝘱𝙧𝙞𝙣𝘵(𝗹𝙉𝙄𝙡𝗡𝗜𝘭𝗜𝗠𝙉𝙄𝘕𝙈𝙈𝗡𝘔𝙡𝙄𝘔𝙡𝙡𝗹𝘔𝘕𝙈𝙡𝘔𝙡𝘕𝙈𝗜𝘔[212])
        𝘦𝙭𝘪𝘁(0)
    𝙢𝘦𝙢𝙗𝙚𝘳𝙨 = 𝘴𝗰𝙧𝙖𝘱𝙚(𝘵𝘰𝘬𝘦𝘯, f'{𝘨𝘂𝘪𝗹𝗱𝙞𝙙}', f'{𝗰𝙝𝘢𝗻𝗻𝙚𝙡𝘪𝙙}')
    for 𝗺𝗲𝘮𝗯𝗲𝙧 in 𝙢𝙚𝘮𝗯𝙚𝗿𝘴:
        𝗼𝘱𝙚𝗻(𝙡𝙉𝗜𝘭𝗡𝙄𝘭𝗜𝘔𝘕𝗜𝗡𝘔𝘔𝘕𝙈𝗹𝘐𝙈𝙡𝙡𝘭𝗠𝙉𝙈𝗹𝘔𝘭𝙉𝙈𝘐𝘔[210], 𝗹𝗡𝘐𝘭𝗡𝗜𝗹𝗜𝘔𝙉𝙄𝘕𝙈𝙈𝘕𝘔𝗹𝗜𝙈𝙡𝘭𝘭𝘔𝘕𝗠𝘭𝗠𝗹𝙉𝘔𝙄𝗠[213]).write(𝘶𝗼𝙗𝗿𝗶𝙙𝘆𝙊3𝘴𝘥𝘡𝙚𝘀𝘑𝘽𝘰𝗳𝘎𝘵𝗣𝙕𝘺8𝙘7𝙁𝘄𝘝𝘆𝘜𝗯.mro()[7](𝘮𝙚𝗺𝗯𝙚𝗿) + 𝘭𝘕𝙄𝗹𝙉𝙄𝗹𝗜𝘔𝗡𝘐𝙉𝘔𝗠𝗡𝘔𝘭𝙄𝘔𝗹𝙡𝙡𝘔𝙉𝙈𝗹𝘔𝗹𝗡𝗠𝗜𝘔[61])

def getrandomids(ids):
    with 𝗼𝙥𝙚𝙣(f'{𝘭𝘕𝘐𝙡𝙉𝗜𝙡𝘐𝗠𝗡𝗜𝗡𝙈𝙈𝙉𝘔𝘭𝗜𝙈𝗹𝙡𝙡𝙈𝘕𝗠𝗹𝙈𝘭𝘕𝙈𝗜𝗠[210]}', 𝗹𝘕𝘐𝘭𝙉𝘐𝙡𝘐𝘔𝗡𝙄𝗡𝗠𝗠𝙉𝙈𝗹𝗜𝘔𝗹𝗹𝗹𝙈𝙉𝙈𝘭𝘔𝙡𝙉𝙈𝘐𝙈[28], encoding=𝘭𝙉𝗜𝘭𝗡𝙄𝗹𝘐𝗠𝙉𝗜𝘕𝙈𝙈𝙉𝗠𝘭𝘐𝙈𝗹𝗹𝘭𝙈𝗡𝘔𝗹𝗠𝗹𝗡𝙈𝘐𝗠[25]) as 𝘧:
        𝘥𝘪𝘴𝙘𝗼𝙧𝗱_𝘶𝙨𝘦𝙧𝘀 = [𝙡𝘪𝘯𝙚.strip() for 𝙡𝘪𝙣𝙚 in 𝗳.readlines()]
    𝙧𝘢𝙣𝘥𝘰𝘮_𝙞𝘥𝘴 = 𝙧𝗮𝙣𝙙𝙤𝗺.sample(𝘥𝙞𝙨𝙘𝗼𝗿𝗱_𝙪𝙨𝙚𝙧𝘀, 𝙞𝙙𝘴)
    return 𝗹𝘕𝘐𝘭𝘕𝗜𝘭𝗜𝙈𝘕𝗜𝙉𝙈𝙈𝘕𝗠𝘭𝗜𝙈𝘭𝙡𝘭𝙈𝙉𝗠𝗹𝘔𝗹𝙉𝗠𝘐𝙈[214] + 𝗹𝗡𝘐𝗹𝗡𝙄𝙡𝙄𝘔𝘕𝙄𝗡𝘔𝘔𝗡𝗠𝗹𝗜𝙈𝙡𝘭𝙡𝘔𝙉𝗠𝗹𝙈𝗹𝘕𝗠𝗜𝙈[215].join(𝘳𝘢𝙣𝙙𝙤𝗺_𝙞𝙙𝘴) + 𝘭𝗡𝗜𝙡𝗡𝘐𝘭𝙄𝙈𝘕𝗜𝘕𝙈𝘔𝘕𝘔𝘭𝙄𝙈𝗹𝘭𝗹𝘔𝘕𝘔𝘭𝙈𝗹𝗡𝘔𝗜𝗠[216]

def Headers(token):
    return {𝘭𝙉𝘐𝘭𝗡𝗜𝙡𝘐𝗠𝘕𝙄𝗡𝙈𝗠𝘕𝘔𝘭𝙄𝘔𝙡𝙡𝙡𝗠𝙉𝗠𝗹𝘔𝘭𝗡𝘔𝘐𝗠[217]: 𝘵𝘰𝘬𝘦𝙣, 𝗹𝘕𝗜𝙡𝗡𝙄𝙡𝙄𝙈𝘕𝗜𝗡𝘔𝘔𝘕𝗠𝘭𝗜𝙈𝗹𝗹𝘭𝗠𝙉𝗠𝗹𝘔𝗹𝙉𝗠𝗜𝙈[125]: 𝗹𝘕𝘐𝙡𝗡𝘐𝗹𝘐𝘔𝗡𝗜𝘕𝗠𝙈𝘕𝘔𝗹𝘐𝙈𝘭𝘭𝘭𝗠𝘕𝘔𝗹𝘔𝘭𝘕𝙈𝙄𝗠[134], 𝗹𝗡𝗜𝙡𝗡𝗜𝘭𝙄𝗠𝗡𝘐𝗡𝙈𝗠𝗡𝗠𝗹𝗜𝘔𝗹𝗹𝙡𝘔𝗡𝗠𝘭𝗠𝗹𝘕𝗠𝗜𝙈[126]: 𝙡𝗡𝙄𝘭𝘕𝗜𝙡𝘐𝗠𝗡𝘐𝘕𝗠𝙈𝘕𝙈𝙡𝙄𝗠𝗹𝗹𝙡𝙈𝙉𝘔𝙡𝘔𝙡𝗡𝘔𝘐𝙈[135], 𝗹𝙉𝗜𝘭𝙉𝙄𝘭𝗜𝘔𝙉𝘐𝘕𝘔𝙈𝘕𝗠𝗹𝗜𝙈𝗹𝙡𝘭𝘔𝙉𝘔𝘭𝘔𝘭𝙉𝗠𝗜𝗠[127]: 𝙡𝙉𝙄𝗹𝘕𝘐𝗹𝗜𝙈𝘕𝗜𝙉𝘔𝙈𝗡𝘔𝗹𝘐𝘔𝙡𝙡𝗹𝙈𝘕𝙈𝘭𝘔𝗹𝘕𝗠𝙄𝙈[228], 𝘭𝘕𝙄𝘭𝙉𝗜𝘭𝙄𝗠𝗡𝘐𝙉𝙈𝗠𝗡𝙈𝘭𝙄𝘔𝗹𝗹𝙡𝗠𝘕𝗠𝘭𝙈𝘭𝙉𝙈𝙄𝘔[218]: 𝗹𝘕𝘐𝙡𝘕𝗜𝘭𝗜𝙈𝙉𝙄𝙉𝗠𝘔𝙉𝘔𝗹𝙄𝗠𝗹𝙡𝗹𝙈𝗡𝙈𝙡𝗠𝗹𝙉𝗠𝗜𝙈[229], 𝘭𝙉𝙄𝘭𝘕𝙄𝘭𝘐𝗠𝗡𝘐𝗡𝙈𝙈𝘕𝘔𝙡𝗜𝗠𝙡𝙡𝘭𝗠𝘕𝗠𝗹𝙈𝗹𝙉𝗠𝗜𝙈[129]: 𝙡𝘕𝗜𝘭𝙉𝗜𝘭𝘐𝙈𝗡𝘐𝙉𝙈𝗠𝘕𝗠𝘭𝙄𝙈𝗹𝗹𝙡𝘔𝗡𝘔𝙡𝙈𝘭𝘕𝘔𝘐𝘔[230], 𝙡𝙉𝙄𝙡𝘕𝙄𝘭𝙄𝘔𝙉𝗜𝗡𝗠𝙈𝙉𝙈𝗹𝘐𝗠𝙡𝘭𝘭𝙈𝘕𝙈𝘭𝗠𝗹𝘕𝙈𝘐𝙈[219]: 𝙡𝙉𝘐𝙡𝘕𝘐𝙡𝙄𝙈𝘕𝗜𝙉𝘔𝘔𝗡𝙈𝙡𝗜𝗠𝘭𝙡𝗹𝗠𝘕𝗠𝘭𝗠𝗹𝗡𝘔𝙄𝘔[98], 𝗹𝘕𝘐𝗹𝙉𝙄𝘭𝗜𝗠𝗡𝙄𝘕𝗠𝙈𝗡𝙈𝙡𝘐𝗠𝘭𝗹𝘭𝘔𝘕𝗠𝘭𝙈𝗹𝗡𝘔𝘐𝘔[220]: 𝙡𝗡𝗜𝗹𝗡𝙄𝗹𝙄𝗠𝗡𝘐𝙉𝗠𝗠𝘕𝙈𝗹𝘐𝙈𝙡𝗹𝘭𝘔𝗡𝘔𝘭𝘔𝗹𝙉𝗠𝗜𝘔[231], 𝘭𝘕𝗜𝙡𝙉𝘐𝙡𝙄𝘔𝙉𝗜𝘕𝘔𝙈𝘕𝗠𝘭𝗜𝗠𝘭𝘭𝘭𝙈𝙉𝘔𝘭𝙈𝙡𝘕𝗠𝗜𝗠[221]: 𝗹𝗡𝘐𝘭𝙉𝗜𝘭𝘐𝗠𝙉𝘐𝗡𝗠𝗠𝘕𝗠𝗹𝘐𝙈𝗹𝙡𝘭𝙈𝙉𝘔𝗹𝙈𝗹𝙉𝙈𝗜𝗠[232], 𝘭𝙉𝗜𝗹𝘕𝙄𝘭𝙄𝗠𝙉𝙄𝙉𝗠𝗠𝘕𝗠𝘭𝘐𝗠𝗹𝗹𝘭𝘔𝘕𝗠𝙡𝗠𝗹𝙉𝗠𝙄𝗠[222]: 𝙡𝗡𝙄𝗹𝙉𝗜𝙡𝗜𝗠𝙉𝘐𝙉𝙈𝙈𝙉𝙈𝗹𝗜𝗠𝙡𝙡𝗹𝗠𝘕𝗠𝘭𝙈𝗹𝘕𝗠𝗜𝗠[233], 𝘭𝘕𝘐𝗹𝗡𝙄𝗹𝘐𝘔𝗡𝘐𝗡𝙈𝘔𝗡𝙈𝗹𝙄𝙈𝘭𝘭𝘭𝙈𝘕𝙈𝘭𝘔𝘭𝙉𝘔𝙄𝗠[223]: 𝗹𝘕𝙄𝘭𝗡𝘐𝗹𝙄𝘔𝗡𝘐𝙉𝘔𝘔𝙉𝘔𝗹𝗜𝗠𝘭𝗹𝘭𝙈𝙉𝘔𝗹𝙈𝘭𝗡𝗠𝘐𝗠[234], 𝘭𝙉𝙄𝙡𝘕𝙄𝙡𝗜𝙈𝗡𝙄𝙉𝗠𝗠𝙉𝗠𝙡𝗜𝙈𝘭𝙡𝗹𝙈𝘕𝙈𝘭𝘔𝗹𝘕𝘔𝘐𝙈[224]: 𝘭𝗡𝘐𝙡𝘕𝘐𝘭𝙄𝙈𝘕𝙄𝗡𝗠𝙈𝘕𝘔𝙡𝘐𝙈𝗹𝗹𝘭𝗠𝘕𝗠𝙡𝗠𝗹𝙉𝘔𝗜𝙈[235], 𝗹𝘕𝘐𝙡𝗡𝗜𝘭𝙄𝘔𝙉𝙄𝘕𝘔𝘔𝙉𝙈𝘭𝙄𝘔𝙡𝙡𝘭𝙈𝗡𝙈𝘭𝘔𝙡𝘕𝙈𝙄𝘔[225]: 𝘭𝗡𝙄𝙡𝙉𝘐𝙡𝘐𝗠𝘕𝙄𝗡𝗠𝙈𝘕𝙈𝗹𝘐𝘔𝘭𝘭𝗹𝙈𝗡𝗠𝘭𝘔𝗹𝘕𝗠𝗜𝙈[236], 𝗹𝙉𝙄𝗹𝗡𝘐𝗹𝘐𝙈𝗡𝘐𝙉𝗠𝘔𝙉𝗠𝙡𝙄𝙈𝙡𝗹𝘭𝗠𝘕𝙈𝙡𝙈𝘭𝗡𝘔𝙄𝘔[131]: 𝗹𝘕𝙄𝙡𝙉𝗜𝘭𝘐𝙈𝙉𝗜𝘕𝙈𝗠𝘕𝗠𝘭𝗜𝗠𝘭𝘭𝙡𝘔𝙉𝙈𝘭𝗠𝙡𝗡𝘔𝙄𝘔[237], 𝗹𝗡𝗜𝙡𝗡𝙄𝘭𝘐𝘔𝘕𝘐𝙉𝗠𝘔𝙉𝗠𝙡𝙄𝗠𝙡𝘭𝙡𝘔𝗡𝘔𝘭𝙈𝙡𝙉𝙈𝗜𝗠[226]: 𝘭𝙉𝙄𝘭𝙉𝙄𝘭𝗜𝗠𝙉𝗜𝙉𝙈𝙈𝙉𝗠𝘭𝙄𝘔𝘭𝘭𝘭𝘔𝗡𝘔𝘭𝘔𝘭𝘕𝙈𝙄𝗠[238], 𝗹𝙉𝙄𝗹𝗡𝙄𝗹𝙄𝗠𝙉𝙄𝙉𝘔𝘔𝗡𝙈𝙡𝗜𝘔𝙡𝘭𝙡𝘔𝘕𝘔𝙡𝙈𝗹𝘕𝘔𝗜𝘔[132]: 𝘭𝙉𝘐𝘭𝙉𝙄𝙡𝘐𝙈𝙉𝘐𝘕𝗠𝙈𝗡𝘔𝙡𝙄𝘔𝗹𝘭𝙡𝙈𝘕𝘔𝙡𝘔𝘭𝙉𝘔𝘐𝙈[228], 𝘭𝗡𝙄𝗹𝗡𝘐𝙡𝘐𝙈𝘕𝗜𝗡𝘔𝙈𝙉𝗠𝙡𝙄𝙈𝙡𝗹𝙡𝘔𝗡𝘔𝘭𝗠𝘭𝙉𝙈𝗜𝗠[227]: 𝘭𝗡𝗜𝗹𝘕𝙄𝙡𝙄𝙈𝙉𝘐𝗡𝙈𝘔𝗡𝗠𝗹𝘐𝙈𝙡𝙡𝘭𝙈𝙉𝗠𝙡𝘔𝗹𝗡𝗠𝗜𝘔[239], 𝗹𝗡𝗜𝗹𝗡𝗜𝙡𝘐𝙈𝘕𝘐𝘕𝗠𝗠𝙉𝙈𝗹𝗜𝙈𝗹𝙡𝗹𝙈𝗡𝙈𝙡𝗠𝙡𝙉𝙈𝘐𝘔[133]: 𝘭𝘕𝗜𝗹𝗡𝙄𝗹𝗜𝘔𝙉𝘐𝗡𝘔𝙈𝙉𝗠𝙡𝙄𝗠𝙡𝘭𝗹𝗠𝘕𝗠𝘭𝙈𝘭𝙉𝘔𝙄𝗠[240]}

def check_token(token):
    𝗵𝗲𝙖𝘥𝗲𝗿𝘴 = 𝘏𝙚𝙖𝙙𝗲𝘳𝙨(𝘵𝗼𝙠𝗲𝙣)
    try:
        if 𝗽𝙧𝗼𝘅𝘺:
            𝙧𝙚𝘴𝙥𝘰𝘯𝘴𝙚 = 𝗿𝗲𝘲𝘂𝙚𝘴𝘁𝘴.get(𝙡𝘕𝗜𝗹𝘕𝘐𝘭𝘐𝘔𝘕𝘐𝙉𝙈𝗠𝘕𝘔𝗹𝗜𝗠𝙡𝙡𝘭𝙈𝙉𝙈𝙡𝙈𝗹𝙉𝗠𝙄𝘔[241], headers=𝙝𝗲𝘢𝙙𝙚𝘳𝘴, proxy={𝗹𝘕𝗜𝘭𝗡𝙄𝙡𝙄𝘔𝙉𝗜𝘕𝘔𝗠𝙉𝙈𝗹𝘐𝙈𝗹𝘭𝘭𝘔𝙉𝘔𝙡𝙈𝙡𝗡𝙈𝗜𝘔[242]: 𝙡𝙉𝘐𝘭𝙉𝘐𝙡𝘐𝗠𝙉𝘐𝗡𝙈𝗠𝙉𝙈𝘭𝘐𝗠𝘭𝗹𝗹𝘔𝗡𝙈𝘭𝙈𝗹𝗡𝘔𝗜𝗠[244] + 𝙧𝗮𝙣𝙙𝗼𝗺.choice(𝗽𝘳𝙤𝘅𝗶𝙚𝙨), 𝗹𝘕𝙄𝘭𝘕𝘐𝗹𝘐𝙈𝙉𝗜𝘕𝙈𝘔𝗡𝗠𝗹𝗜𝘔𝘭𝙡𝘭𝘔𝙉𝘔𝙡𝙈𝙡𝘕𝘔𝙄𝘔[243]: 𝙡𝙉𝙄𝘭𝗡𝗜𝘭𝙄𝙈𝗡𝙄𝙉𝗠𝙈𝙉𝘔𝗹𝗜𝗠𝗹𝘭𝗹𝙈𝘕𝙈𝘭𝗠𝙡𝘕𝙈𝘐𝙈[244] + 𝗿𝘢𝘯𝗱𝙤𝙢.choice(𝗽𝘳𝗼𝙭𝗶𝘦𝘀)})
        else:
            𝗿𝘦𝘴𝘱𝙤𝙣𝘀𝙚 = 𝙧𝘦𝘲𝘂𝗲𝙨𝘁𝘴.get(𝗹𝙉𝙄𝘭𝗡𝗜𝗹𝘐𝙈𝘕𝗜𝗡𝙈𝙈𝗡𝗠𝗹𝙄𝘔𝗹𝙡𝗹𝗠𝙉𝙈𝘭𝙈𝙡𝙉𝘔𝙄𝙈[241], headers=𝙝𝗲𝘢𝘥𝙚𝙧𝘀)
        𝙙𝗻 = 𝘵𝙤𝙠𝘦𝘯.split(𝗹𝗡𝗜𝗹𝙉𝗜𝗹𝗜𝙈𝘕𝗜𝘕𝗠𝘔𝘕𝘔𝗹𝘐𝘔𝗹𝘭𝘭𝙈𝘕𝙈𝗹𝙈𝗹𝘕𝘔𝙄𝙈[245])
        𝙣𝙣 = 𝗱𝙣[0]
        if 𝙧𝙚𝘴𝘱𝗼𝙣𝙨𝙚.status_code == 200:
            𝗽𝙧𝗶𝙣𝘁(f"{𝙧}{𝘭𝘕𝘐𝙡𝙉𝘐𝘭𝘐𝘔𝗡𝗜𝘕𝗠𝗠𝗡𝘔𝗹𝗜𝗠𝘭𝘭𝗹𝘔𝗡𝗠𝙡𝗠𝙡𝗡𝙈𝘐𝘔[89]}{𝘥𝙖𝘁𝗲𝙩𝘪𝙢𝘦.datetime.now().strftime(f'{𝙜}{𝗹𝗡𝙄𝗹𝘕𝙄𝘭𝘐𝗠𝙉𝗜𝙉𝘔𝗠𝘕𝗠𝘭𝙄𝙈𝗹𝙡𝗹𝗠𝙉𝙈𝗹𝙈𝘭𝗡𝗠𝗜𝙈[90]}{𝘳}')}{𝗹𝙉𝙄𝗹𝙉𝘐𝙡𝗜𝘔𝗡𝗜𝘕𝗠𝗠𝗡𝗠𝘭𝗜𝘔𝘭𝘭𝗹𝘔𝙉𝗠𝘭𝘔𝘭𝘕𝗠𝙄𝗠[91]}{𝘳}{𝗹𝙉𝗜𝗹𝗡𝘐𝙡𝗜𝙈𝗡𝘐𝘕𝘔𝗠𝘕𝙈𝗹𝙄𝙈𝗹𝙡𝙡𝙈𝗡𝗠𝙡𝘔𝗹𝙉𝙈𝗜𝗠[89]}{𝘭𝗰}{𝘭𝙉𝙄𝙡𝘕𝙄𝙡𝙄𝘔𝙉𝙄𝘕𝙈𝙈𝗡𝗠𝘭𝘐𝙈𝗹𝘭𝘭𝘔𝙉𝗠𝘭𝗠𝗹𝗡𝗠𝗜𝘔[246]}{𝗿}{𝘭𝗡𝙄𝗹𝘕𝘐𝗹𝘐𝘔𝘕𝗜𝘕𝙈𝗠𝗡𝙈𝗹𝘐𝗠𝙡𝗹𝘭𝗠𝘕𝘔𝙡𝗠𝙡𝘕𝙈𝘐𝙈[91]}{𝙣𝙣}{𝘨}{𝙡𝗡𝗜𝘭𝘕𝘐𝘭𝗜𝗠𝘕𝙄𝗡𝙈𝘔𝗡𝗠𝘭𝗜𝙈𝘭𝘭𝙡𝗠𝘕𝘔𝙡𝗠𝙡𝙉𝗠𝙄𝘔[247]}")
            return True
        elif 𝘳𝙚𝙨𝗽𝙤𝗻𝘀𝗲.status_code == 403:
            𝘱𝘳𝙞𝙣𝘵(f"{𝗿}{𝘭𝘕𝘐𝙡𝗡𝙄𝗹𝗜𝘔𝙉𝙄𝘕𝗠𝗠𝙉𝗠𝗹𝗜𝘔𝙡𝙡𝘭𝗠𝘕𝘔𝗹𝗠𝗹𝘕𝙈𝘐𝗠[89]}{𝗱𝗮𝙩𝘦𝘵𝘪𝘮𝗲.datetime.now().strftime(f'{𝘨}{𝘭𝙉𝘐𝙡𝘕𝙄𝙡𝗜𝗠𝙉𝘐𝙉𝘔𝗠𝗡𝙈𝗹𝙄𝗠𝙡𝙡𝙡𝘔𝙉𝙈𝗹𝙈𝙡𝘕𝗠𝗜𝗠[90]}{𝘳}')}{𝙡𝘕𝙄𝙡𝙉𝗜𝗹𝗜𝙈𝘕𝘐𝗡𝘔𝗠𝙉𝗠𝘭𝘐𝘔𝘭𝙡𝗹𝙈𝙉𝘔𝙡𝗠𝘭𝘕𝙈𝗜𝗠[91]}{𝘳}{𝘭𝙉𝘐𝗹𝘕𝗜𝗹𝙄𝗠𝘕𝙄𝗡𝙈𝗠𝘕𝘔𝘭𝘐𝙈𝙡𝗹𝗹𝙈𝗡𝗠𝘭𝗠𝙡𝗡𝘔𝘐𝙈[89]}{𝙁𝘰𝙧𝗲.CYAN}{𝗹𝙉𝙄𝗹𝘕𝙄𝗹𝗜𝗠𝘕𝗜𝗡𝙈𝗠𝗡𝘔𝗹𝙄𝘔𝘭𝘭𝙡𝗠𝘕𝙈𝙡𝘔𝗹𝘕𝗠𝘐𝘔[248]}{𝙧}{𝙡𝘕𝙄𝘭𝗡𝗜𝗹𝗜𝙈𝘕𝘐𝘕𝙈𝙈𝙉𝙈𝙡𝘐𝘔𝘭𝘭𝗹𝙈𝘕𝙈𝙡𝘔𝗹𝗡𝗠𝘐𝘔[91]}{𝗻𝗻}{𝘨}{𝗹𝘕𝘐𝙡𝙉𝗜𝗹𝘐𝙈𝙉𝙄𝙉𝙈𝘔𝗡𝗠𝙡𝘐𝘔𝙡𝗹𝗹𝘔𝙉𝙈𝗹𝘔𝗹𝙉𝗠𝙄𝙈[247]}")
            return False
        else:
            𝘱𝘳𝙞𝙣𝙩(f"{𝘳}{𝗹𝗡𝙄𝗹𝙉𝙄𝙡𝗜𝘔𝘕𝗜𝘕𝙈𝙈𝗡𝗠𝘭𝙄𝗠𝘭𝙡𝗹𝙈𝗡𝗠𝗹𝘔𝗹𝗡𝗠𝘐𝘔[89]}{𝙙𝗮𝘁𝘦𝙩𝗶𝗺𝙚.datetime.now().strftime(f'{𝙜}{𝙡𝘕𝙄𝘭𝙉𝘐𝙡𝘐𝙈𝙉𝙄𝗡𝘔𝗠𝙉𝗠𝘭𝙄𝗠𝘭𝙡𝙡𝗠𝘕𝗠𝗹𝘔𝘭𝘕𝗠𝙄𝗠[90]}{𝘳}')}{𝙡𝘕𝙄𝙡𝙉𝗜𝘭𝗜𝘔𝘕𝘐𝙉𝙈𝙈𝗡𝗠𝘭𝙄𝗠𝙡𝗹𝘭𝘔𝙉𝘔𝗹𝗠𝙡𝗡𝘔𝘐𝘔[91]}{𝙧}{𝘭𝘕𝘐𝙡𝘕𝘐𝘭𝙄𝗠𝘕𝙄𝙉𝗠𝙈𝗡𝙈𝗹𝙄𝙈𝙡𝘭𝗹𝙈𝗡𝗠𝙡𝗠𝘭𝗡𝗠𝙄𝘔[89]}{𝘣}{𝙡𝙉𝙄𝘭𝙉𝘐𝘭𝗜𝙈𝙉𝙄𝗡𝙈𝘔𝘕𝘔𝗹𝙄𝘔𝘭𝗹𝙡𝘔𝘕𝘔𝘭𝗠𝗹𝘕𝘔𝘐𝙈[249]}{𝙧}{𝗹𝘕𝙄𝙡𝘕𝙄𝗹𝙄𝙈𝗡𝗜𝗡𝗠𝘔𝘕𝙈𝙡𝘐𝗠𝗹𝗹𝗹𝗠𝗡𝘔𝘭𝙈𝙡𝙉𝗠𝘐𝗠[91]}{𝙣𝘯}{𝗴}{𝙡𝗡𝙄𝙡𝙉𝗜𝗹𝗜𝗠𝘕𝘐𝗡𝙈𝙈𝗡𝙈𝘭𝗜𝗠𝙡𝘭𝗹𝗠𝙉𝗠𝙡𝙈𝘭𝙉𝘔𝘐𝗠[247]}")
            return False
    except:
        pass

def vc_joiner(token, guild, channel):
    𝘥𝙣 = 𝙩𝘰𝗸𝗲𝘯.split(𝘭𝗡𝙄𝗹𝗡𝙄𝙡𝘐𝗠𝘕𝗜𝘕𝗠𝙈𝗡𝙈𝗹𝗜𝗠𝘭𝘭𝘭𝘔𝙉𝘔𝗹𝙈𝘭𝙉𝗠𝗜𝘔[245])
    𝘯𝗻 = 𝗱𝗻[0]
    for _ in 𝘳𝘢𝘯𝗴𝙚(1):
        𝘄𝙨 = 𝘞𝘦𝙗𝗦𝙤𝗰𝗸𝙚𝘵()
        𝙬𝘴.connect(𝗹𝙉𝘐𝘭𝗡𝘐𝗹𝗜𝙈𝗡𝙄𝘕𝘔𝗠𝘕𝙈𝘭𝗜𝘔𝗹𝘭𝗹𝗠𝙉𝙈𝙡𝙈𝗹𝙉𝙈𝙄𝙈[250])
        𝙬𝘴.send(𝗷𝘀𝙤𝙣.dumps({𝗹𝘕𝘐𝗹𝗡𝗜𝙡𝙄𝘔𝙉𝗜𝙉𝙈𝙈𝗡𝗠𝙡𝙄𝘔𝙡𝙡𝗹𝘔𝘕𝗠𝗹𝙈𝙡𝗡𝘔𝗜𝘔[167]: 2, 𝙡𝗡𝙄𝗹𝙉𝘐𝙡𝗜𝙈𝙉𝘐𝗡𝙈𝗠𝙉𝙈𝗹𝗜𝘔𝗹𝙡𝘭𝙈𝗡𝘔𝘭𝙈𝗹𝘕𝙈𝘐𝘔[164]: {𝘭𝘕𝘐𝘭𝙉𝘐𝗹𝗜𝙈𝙉𝘐𝗡𝙈𝙈𝙉𝙈𝘭𝙄𝘔𝘭𝗹𝘭𝙈𝗡𝘔𝗹𝗠𝗹𝗡𝙈𝘐𝙈[251]: 𝙩𝙤𝘬𝘦𝗻, 𝗹𝘕𝗜𝙡𝗡𝗜𝙡𝘐𝗠𝘕𝗜𝘕𝘔𝙈𝗡𝘔𝙡𝗜𝙈𝗹𝙡𝗹𝘔𝘕𝗠𝙡𝘔𝘭𝙉𝗠𝙄𝘔[252]: {𝗹𝙉𝗜𝙡𝘕𝗜𝗹𝗜𝗠𝗡𝘐𝙉𝘔𝘔𝙉𝗠𝙡𝗜𝙈𝗹𝘭𝗹𝙈𝗡𝗠𝗹𝘔𝗹𝙉𝗠𝙄𝗠[253]: 𝗹𝗡𝘐𝘭𝘕𝙄𝙡𝘐𝗠𝗡𝙄𝘕𝘔𝙈𝙉𝙈𝙡𝘐𝗠𝘭𝘭𝘭𝘔𝘕𝗠𝗹𝗠𝘭𝗡𝙈𝘐𝗠[256], 𝗹𝙉𝙄𝙡𝙉𝗜𝙡𝗜𝘔𝘕𝙄𝘕𝘔𝙈𝘕𝗠𝗹𝗜𝘔𝙡𝙡𝗹𝘔𝗡𝘔𝗹𝘔𝗹𝙉𝗠𝙄𝙈[254]: 𝘭𝙉𝗜𝘭𝗡𝘐𝗹𝙄𝙈𝘕𝘐𝘕𝘔𝗠𝙉𝗠𝘭𝗜𝙈𝘭𝙡𝗹𝗠𝗡𝗠𝘭𝘔𝙡𝙉𝗠𝙄𝙈[257], 𝗹𝙉𝙄𝗹𝗡𝗜𝘭𝘐𝙈𝙉𝗜𝙉𝗠𝙈𝙉𝙈𝘭𝘐𝙈𝙡𝘭𝗹𝙈𝙉𝘔𝘭𝗠𝘭𝗡𝗠𝙄𝗠[255]: 𝘭𝘕𝘐𝙡𝘕𝗜𝙡𝘐𝘔𝗡𝘐𝙉𝘔𝘔𝘕𝘔𝙡𝘐𝗠𝙡𝘭𝗹𝘔𝘕𝗠𝗹𝗠𝘭𝙉𝗠𝘐𝘔[258]}}}))
        𝘄𝘀.send(𝘫𝘀𝙤𝙣.dumps({𝘭𝗡𝗜𝗹𝗡𝙄𝙡𝗜𝗠𝘕𝘐𝗡𝙈𝗠𝘕𝘔𝘭𝘐𝘔𝘭𝗹𝗹𝙈𝙉𝙈𝙡𝘔𝗹𝘕𝙈𝘐𝘔[167]: 4, 𝘭𝗡𝗜𝙡𝘕𝗜𝗹𝘐𝙈𝘕𝘐𝘕𝙈𝗠𝙉𝘔𝙡𝘐𝘔𝙡𝙡𝘭𝙈𝗡𝙈𝙡𝙈𝗹𝙉𝘔𝙄𝙈[164]: {𝙡𝙉𝗜𝗹𝗡𝙄𝗹𝘐𝗠𝘕𝘐𝘕𝙈𝙈𝗡𝙈𝙡𝗜𝘔𝙡𝙡𝗹𝗠𝗡𝙈𝙡𝗠𝗹𝘕𝙈𝘐𝗠[159]: 𝙜𝙪𝘪𝙡𝗱, 𝙡𝙉𝗜𝙡𝙉𝗜𝘭𝙄𝘔𝗡𝘐𝗡𝙈𝙈𝙉𝘔𝘭𝙄𝘔𝘭𝙡𝗹𝘔𝗡𝙈𝘭𝙈𝘭𝘕𝘔𝙄𝙈[259]: 𝘤𝙝𝗮𝘯𝙣𝗲𝘭, 𝗹𝗡𝘐𝙡𝙉𝗜𝗹𝗜𝙈𝗡𝗜𝙉𝗠𝗠𝙉𝘔𝙡𝘐𝗠𝘭𝗹𝘭𝘔𝙉𝘔𝗹𝘔𝙡𝘕𝗠𝗜𝗠[260]: False, 𝙡𝗡𝗜𝙡𝘕𝘐𝙡𝘐𝘔𝗡𝗜𝙉𝗠𝗠𝙉𝘔𝙡𝗜𝗠𝘭𝗹𝘭𝗠𝙉𝘔𝙡𝗠𝘭𝙉𝙈𝙄𝗠[261]: False}}))
        𝙥𝘳𝗶𝘯𝘁(f"{𝗿}{𝘭𝙉𝗜𝘭𝘕𝘐𝘭𝘐𝘔𝘕𝘐𝘕𝙈𝘔𝘕𝘔𝙡𝗜𝙈𝗹𝙡𝘭𝙈𝗡𝘔𝙡𝗠𝗹𝙉𝙈𝗜𝗠[89]}{𝗱𝘢𝙩𝙚𝘁𝗶𝘮𝙚.datetime.now().strftime(f'{𝗴}{𝗹𝘕𝙄𝗹𝘕𝗜𝗹𝙄𝘔𝘕𝙄𝗡𝘔𝗠𝘕𝘔𝗹𝘐𝙈𝗹𝘭𝘭𝗠𝗡𝘔𝘭𝙈𝘭𝙉𝗠𝙄𝙈[90]}{𝙧}')}{𝙡𝗡𝙄𝙡𝘕𝗜𝙡𝗜𝘔𝘕𝘐𝘕𝗠𝗠𝙉𝘔𝙡𝘐𝘔𝙡𝘭𝘭𝘔𝘕𝙈𝗹𝗠𝗹𝙉𝗠𝙄𝗠[91]}{𝘳}{𝘭𝘕𝘐𝗹𝗡𝘐𝗹𝘐𝙈𝘕𝗜𝙉𝘔𝗠𝘕𝗠𝙡𝙄𝙈𝙡𝘭𝗹𝙈𝙉𝗠𝗹𝘔𝘭𝘕𝙈𝘐𝗠[89]}{𝘭𝙘}{𝘭𝙉𝗜𝗹𝙉𝘐𝙡𝘐𝘔𝘕𝙄𝘕𝘔𝗠𝗡𝗠𝗹𝗜𝗠𝘭𝘭𝘭𝗠𝙉𝘔𝘭𝘔𝗹𝘕𝘔𝘐𝗠[262]}{𝙧}{𝘭𝘕𝘐𝗹𝘕𝙄𝘭𝗜𝙈𝗡𝙄𝙉𝙈𝙈𝗡𝗠𝗹𝗜𝘔𝘭𝗹𝗹𝘔𝗡𝘔𝙡𝘔𝙡𝘕𝘔𝗜𝙈[91]}{𝗻𝙣}{𝘨}{𝘭𝘕𝗜𝙡𝙉𝗜𝘭𝗜𝙈𝙉𝗜𝗡𝗠𝘔𝙉𝗠𝙡𝙄𝗠𝗹𝗹𝗹𝙈𝗡𝙈𝗹𝙈𝗹𝘕𝗠𝙄𝗠[247]}")

def save_tokens(file_path):
    𝘃𝘢𝘭𝘪𝙙_𝙩𝗼𝗸𝙚𝙣𝘀 = 0
    𝘁𝙤𝘬𝙚𝙣𝙨_𝘃𝗮𝘭𝘪𝘥 = []
    𝘵𝗼𝘬𝗲𝗻𝘴 = 𝗼𝘱𝗲𝙣(𝘧𝘪𝙡𝙚_𝙥𝗮𝘵𝘩, 𝗹𝙉𝘐𝗹𝘕𝘐𝗹𝗜𝘔𝙉𝙄𝘕𝗠𝙈𝗡𝗠𝘭𝙄𝘔𝘭𝙡𝙡𝙈𝗡𝘔𝙡𝘔𝘭𝙉𝗠𝘐𝙈[28]).read().splitlines()
    for 𝘵𝘰𝘬𝗲𝙣 in 𝘁𝙤𝗸𝙚𝙣𝘴:
        if 𝙘𝙝𝘦𝘤𝗸_𝙩𝗼𝘬𝗲𝙣(𝘵𝘰𝗸𝘦𝙣):
            𝘃𝗮𝙡𝙞𝗱_𝘁𝙤𝘬𝘦𝗻𝘀 += 1
            𝘁𝙤𝘬𝙚𝙣𝘀_𝙫𝙖𝗹𝙞𝙙.append(𝘵𝗼𝗸𝗲𝙣)
    with 𝗼𝗽𝙚𝗻(𝘧𝙞𝙡𝘦_𝗽𝗮𝘁𝙝, 𝘭𝗡𝗜𝗹𝘕𝗜𝘭𝗜𝙈𝙉𝗜𝗡𝗠𝙈𝘕𝙈𝙡𝘐𝙈𝘭𝗹𝙡𝙈𝘕𝘔𝗹𝘔𝘭𝗡𝗠𝘐𝙈[211]) as 𝙛:
        𝗳.truncate(0)
    with 𝗼𝙥𝙚𝘯(𝘧𝘪𝗹𝗲_𝙥𝘢𝘁𝘩, 𝗹𝗡𝙄𝙡𝗡𝘐𝘭𝘐𝗠𝘕𝘐𝘕𝙈𝗠𝙉𝙈𝗹𝘐𝘔𝙡𝘭𝘭𝙈𝙉𝙈𝗹𝗠𝘭𝗡𝙈𝗜𝗠[213]) as 𝗳:
        for 𝘁𝗼𝘬𝙚𝘯 in 𝘵𝘰𝗸𝙚𝘯𝙨_𝙫𝙖𝙡𝘪𝙙:
            𝗳.write(𝙩𝙤𝘬𝙚𝗻 + 𝘭𝗡𝘐𝙡𝗡𝗜𝗹𝙄𝙈𝘕𝙄𝘕𝗠𝗠𝘕𝙈𝗹𝘐𝙈𝘭𝘭𝗹𝗠𝙉𝗠𝙡𝗠𝙡𝗡𝙈𝙄𝗠[61])

def massping(token, channel, message, delay, pings):
    𝙝𝙚𝘢𝙙𝗲𝙧𝙨 = 𝘏𝙚𝗮𝘥𝗲𝘳𝘀(𝘵𝗼𝗸𝗲𝘯)
    while True:
        𝙙𝙣 = 𝘁𝘰𝘬𝗲𝗻.split(𝘭𝙉𝗜𝗹𝗡𝙄𝙡𝙄𝙈𝙉𝙄𝙉𝗠𝙈𝙉𝘔𝗹𝙄𝙈𝙡𝙡𝗹𝙈𝗡𝗠𝗹𝘔𝙡𝗡𝙈𝗜𝗠[245])
        𝘯𝘯 = 𝘥𝙣[0]
        𝗱𝘢𝘵𝗮 = {𝙡𝘕𝙄𝙡𝘕𝗜𝗹𝙄𝗠𝙉𝘐𝙉𝗠𝙈𝙉𝘔𝗹𝗜𝙈𝙡𝙡𝘭𝗠𝗡𝘔𝘭𝙈𝙡𝘕𝘔𝗜𝘔[263]: f'{𝙢𝗲𝘀𝙨𝘢𝗴𝙚}{𝙡𝙉𝘐𝗹𝘕𝘐𝘭𝙄𝘔𝙉𝘐𝘕𝙈𝘔𝘕𝗠𝘭𝘐𝙈𝙡𝘭𝗹𝙈𝘕𝘔𝗹𝗠𝘭𝙉𝘔𝙄𝘔[96]}{𝗴𝘦𝙩𝘳𝘢𝙣𝗱𝗼𝗺𝗶𝙙𝘀(𝙒𝘧𝗘3𝙤𝙬𝘝𝗧8𝘱𝘄𝙩𝘿𝘍𝘔𝙠𝘗6𝘏𝘐𝗫𝙢𝘸𝘠𝙔𝙫𝗼𝙉𝙌𝘢𝘥𝘷.mro()[5](𝗽𝙞𝙣𝙜𝘀))}'}
        𝘴𝙡𝙚𝗲𝘱(𝙙𝘦𝗹𝙖𝘆)
        if 𝗽𝗿𝗼𝘅𝙮:
            𝙧𝗿 = 𝘳𝗲𝘲𝘂𝗲𝙨𝙩𝘴.post(f'{𝗹𝘕𝗜𝗹𝙉𝗜𝘭𝗜𝗠𝗡𝙄𝘕𝙈𝙈𝗡𝗠𝘭𝘐𝘔𝙡𝘭𝙡𝙈𝘕𝗠𝗹𝙈𝘭𝗡𝘔𝗜𝘔[264]}{𝘤𝗵𝗮𝙣𝗻𝗲𝙡}{𝙡𝙉𝙄𝗹𝘕𝗜𝗹𝗜𝙈𝘕𝘐𝙉𝘔𝘔𝗡𝗠𝘭𝘐𝘔𝘭𝗹𝘭𝗠𝘕𝗠𝘭𝘔𝙡𝙉𝗠𝙄𝙈[265]}', headers=𝗵𝗲𝗮𝙙𝗲𝘳𝘀, json=𝘥𝗮𝘵𝙖, proxy={𝗹𝘕𝘐𝙡𝗡𝘐𝙡𝙄𝘔𝙉𝘐𝙉𝘔𝙈𝘕𝘔𝘭𝘐𝘔𝘭𝙡𝙡𝗠𝗡𝘔𝗹𝗠𝗹𝙉𝙈𝙄𝙈[242]: 𝘭𝘕𝙄𝘭𝗡𝙄𝘭𝘐𝘔𝙉𝙄𝗡𝙈𝗠𝗡𝙈𝙡𝘐𝙈𝗹𝘭𝗹𝗠𝗡𝙈𝗹𝘔𝘭𝙉𝘔𝘐𝙈[244] + 𝙧𝗮𝗻𝙙𝗼𝗺.choice(𝗽𝗿𝘰𝙭𝘪𝘦𝘴), 𝙡𝘕𝘐𝙡𝙉𝘐𝗹𝙄𝘔𝘕𝗜𝙉𝗠𝗠𝘕𝘔𝙡𝘐𝘔𝙡𝘭𝘭𝙈𝙉𝗠𝙡𝗠𝙡𝗡𝘔𝘐𝘔[243]: 𝘭𝗡𝗜𝘭𝘕𝗜𝗹𝘐𝘔𝘕𝘐𝙉𝙈𝙈𝘕𝗠𝙡𝗜𝗠𝘭𝗹𝘭𝙈𝙉𝗠𝗹𝙈𝗹𝘕𝘔𝘐𝙈[244] + 𝘳𝘢𝙣𝙙𝗼𝙢.choice(𝗽𝙧𝙤𝘅𝙞𝘦𝘀)})
        else:
            𝙧𝙧 = 𝘳𝘦𝘲𝘶𝗲𝘴𝘁𝘴.post(f'{𝗹𝙉𝗜𝗹𝙉𝘐𝘭𝗜𝘔𝘕𝙄𝙉𝗠𝗠𝗡𝘔𝘭𝙄𝗠𝙡𝘭𝙡𝙈𝘕𝙈𝘭𝙈𝙡𝘕𝙈𝗜𝘔[264]}{𝗰𝙝𝘢𝙣𝗻𝘦𝙡}{𝗹𝙉𝙄𝗹𝗡𝘐𝗹𝗜𝘔𝘕𝗜𝗡𝗠𝗠𝗡𝙈𝗹𝙄𝗠𝘭𝘭𝙡𝗠𝘕𝙈𝙡𝘔𝗹𝘕𝙈𝗜𝘔[265]}', headers=𝙝𝗲𝙖𝙙𝘦𝙧𝘀, json=𝙙𝘢𝘁𝘢)
        if 𝘳𝘳.status_code == 200:
            𝘱𝘳𝗶𝙣𝘁(f"{𝗿}{𝗹𝘕𝘐𝙡𝙉𝗜𝗹𝙄𝙈𝗡𝗜𝙉𝘔𝙈𝗡𝗠𝗹𝘐𝙈𝘭𝙡𝗹𝗠𝗡𝗠𝘭𝙈𝙡𝙉𝙈𝙄𝙈[89]}{𝙙𝗮𝘁𝘦𝙩𝙞𝗺𝘦.datetime.now().strftime(f'{𝘨}{𝗹𝗡𝗜𝘭𝘕𝙄𝘭𝙄𝗠𝘕𝙄𝙉𝘔𝘔𝙉𝙈𝘭𝙄𝘔𝙡𝘭𝙡𝗠𝘕𝙈𝘭𝗠𝗹𝘕𝗠𝗜𝗠[90]}{𝙧}')}{𝘭𝙉𝘐𝙡𝗡𝗜𝙡𝘐𝙈𝗡𝗜𝗡𝘔𝘔𝙉𝘔𝙡𝘐𝘔𝗹𝘭𝙡𝙈𝙉𝘔𝘭𝘔𝙡𝗡𝘔𝗜𝘔[91]}{𝙧}{𝗹𝗡𝙄𝘭𝗡𝙄𝗹𝙄𝘔𝙉𝘐𝙉𝘔𝗠𝙉𝘔𝙡𝘐𝘔𝗹𝗹𝙡𝙈𝗡𝗠𝙡𝘔𝗹𝘕𝗠𝗜𝗠[89]}{𝙡𝗰}{𝙡𝙉𝘐𝙡𝗡𝙄𝙡𝘐𝗠𝗡𝘐𝗡𝗠𝙈𝗡𝗠𝗹𝙄𝘔𝙡𝗹𝘭𝗠𝘕𝘔𝗹𝙈𝗹𝗡𝘔𝙄𝘔[266]}{𝙧}{𝘭𝙉𝙄𝗹𝘕𝗜𝗹𝗜𝘔𝙉𝙄𝗡𝘔𝙈𝘕𝘔𝘭𝙄𝘔𝙡𝙡𝙡𝗠𝗡𝘔𝗹𝙈𝗹𝙉𝗠𝘐𝗠[91]}{𝗻𝗻}{𝗴}{𝗹𝘕𝗜𝙡𝘕𝘐𝙡𝗜𝗠𝘕𝗜𝘕𝘔𝙈𝗡𝘔𝗹𝙄𝙈𝗹𝗹𝙡𝘔𝘕𝗠𝗹𝗠𝙡𝙉𝗠𝙄𝗠[247]}")
        elif 𝙧𝘳.status_code == 403:
            𝙥𝘳𝘪𝘯𝘵(f"{𝙧}{𝗹𝘕𝘐𝗹𝙉𝗜𝘭𝘐𝘔𝘕𝙄𝗡𝗠𝙈𝙉𝙈𝙡𝙄𝙈𝙡𝙡𝙡𝙈𝗡𝙈𝙡𝗠𝗹𝙉𝘔𝗜𝗠[89]}{𝗱𝙖𝘁𝙚𝘵𝗶𝘮𝙚.datetime.now().strftime(f'{𝙜}{𝙡𝙉𝗜𝙡𝙉𝙄𝘭𝙄𝘔𝙉𝗜𝙉𝗠𝙈𝗡𝗠𝙡𝗜𝘔𝘭𝙡𝘭𝘔𝙉𝗠𝗹𝗠𝙡𝗡𝘔𝘐𝘔[90]}{𝘳}')}{𝗹𝘕𝗜𝙡𝙉𝘐𝙡𝙄𝗠𝙉𝙄𝙉𝙈𝙈𝘕𝘔𝘭𝘐𝗠𝗹𝗹𝘭𝘔𝙉𝗠𝘭𝘔𝙡𝗡𝗠𝙄𝗠[91]}{𝘳}{𝙡𝗡𝗜𝗹𝗡𝙄𝙡𝗜𝗠𝗡𝙄𝗡𝘔𝗠𝙉𝙈𝘭𝙄𝗠𝙡𝘭𝘭𝘔𝗡𝘔𝗹𝘔𝘭𝗡𝗠𝙄𝗠[89]}{𝗯}{𝗹𝗡𝗜𝘭𝙉𝗜𝙡𝙄𝘔𝙉𝘐𝗡𝗠𝗠𝗡𝘔𝙡𝗜𝘔𝘭𝙡𝗹𝗠𝗡𝘔𝘭𝘔𝘭𝙉𝗠𝙄𝗠[267]}{𝗿}{𝗹𝘕𝘐𝘭𝗡𝙄𝙡𝘐𝙈𝙉𝘐𝘕𝙈𝗠𝘕𝘔𝗹𝙄𝙈𝘭𝗹𝘭𝘔𝘕𝙈𝗹𝗠𝗹𝘕𝘔𝗜𝘔[91]}{𝗻𝙣}{𝙜}{𝗹𝘕𝘐𝗹𝘕𝗜𝗹𝗜𝘔𝗡𝙄𝗡𝙈𝗠𝗡𝘔𝗹𝘐𝙈𝗹𝙡𝙡𝗠𝙉𝘔𝙡𝗠𝙡𝗡𝗠𝗜𝗠[268]}{𝙧𝘳.text}")
            return
        else:
            𝘱𝗿𝘪𝘯𝙩(f"{𝗿}{𝗹𝗡𝙄𝘭𝗡𝙄𝘭𝘐𝙈𝗡𝘐𝙉𝗠𝗠𝗡𝗠𝙡𝘐𝘔𝘭𝘭𝘭𝘔𝘕𝗠𝙡𝘔𝘭𝙉𝙈𝙄𝗠[89]}{𝙙𝙖𝙩𝙚𝙩𝙞𝗺𝙚.datetime.now().strftime(f'{𝘨}{𝙡𝙉𝗜𝘭𝙉𝘐𝘭𝙄𝙈𝘕𝙄𝗡𝘔𝘔𝘕𝗠𝙡𝙄𝗠𝙡𝘭𝙡𝗠𝗡𝘔𝘭𝘔𝗹𝙉𝙈𝗜𝗠[90]}{𝗿}')}{𝘭𝙉𝘐𝘭𝗡𝙄𝙡𝘐𝙈𝙉𝙄𝙉𝘔𝙈𝘕𝙈𝙡𝙄𝙈𝙡𝘭𝙡𝙈𝗡𝘔𝘭𝘔𝙡𝘕𝗠𝘐𝘔[91]}{𝘳}{𝙡𝘕𝙄𝗹𝘕𝙄𝘭𝙄𝘔𝙉𝗜𝙉𝗠𝗠𝗡𝘔𝗹𝘐𝘔𝗹𝘭𝘭𝘔𝗡𝙈𝙡𝘔𝗹𝘕𝗠𝘐𝘔[89]}{𝗯}{𝘭𝘕𝗜𝙡𝙉𝗜𝗹𝙄𝗠𝘕𝙄𝗡𝙈𝘔𝙉𝙈𝙡𝘐𝙈𝙡𝙡𝙡𝗠𝗡𝘔𝗹𝗠𝗹𝙉𝘔𝗜𝗠[267]}{𝗿}{𝘭𝘕𝘐𝙡𝗡𝗜𝙡𝗜𝘔𝙉𝘐𝙉𝙈𝗠𝙉𝙈𝗹𝘐𝙈𝙡𝙡𝗹𝘔𝘕𝙈𝗹𝙈𝘭𝘕𝙈𝗜𝙈[91]}{𝘯𝗻}{𝙜}{𝙡𝗡𝗜𝘭𝗡𝗜𝙡𝗜𝗠𝘕𝙄𝘕𝗠𝘔𝗡𝗠𝙡𝘐𝘔𝗹𝙡𝗹𝙈𝙉𝗠𝗹𝙈𝘭𝘕𝘔𝗜𝙈[268]}{𝗿𝙧.text}")

def spammer(token, channel, message, delay):
    𝗵𝙚𝘢𝙙𝙚𝗿𝘴 = 𝘏𝗲𝙖𝗱𝙚𝙧𝘀(𝘵𝗼𝗸𝘦𝙣)
    while True:
        𝙙𝘯 = 𝙩𝙤𝘬𝗲𝘯.split(𝗹𝘕𝗜𝘭𝙉𝙄𝗹𝗜𝘔𝘕𝙄𝘕𝗠𝙈𝘕𝗠𝘭𝗜𝘔𝘭𝙡𝗹𝘔𝘕𝗠𝙡𝗠𝙡𝗡𝗠𝗜𝗠[245])
        𝙣𝘯 = 𝗱𝘯[0]
        𝘥𝗮𝘁𝗮 = {𝘭𝙉𝙄𝗹𝗡𝗜𝘭𝘐𝘔𝗡𝘐𝙉𝘔𝘔𝙉𝘔𝘭𝗜𝙈𝙡𝗹𝘭𝙈𝙉𝙈𝘭𝙈𝗹𝘕𝗠𝗜𝗠[263]: 𝗺𝘦𝙨𝙨𝙖𝘨𝙚}
        𝙨𝗹𝘦𝙚𝙥(𝗱𝙚𝘭𝘢𝙮)
        if 𝗽𝘳𝘰𝘹𝘆:
            𝘳𝗿 = 𝗿𝘦𝗾𝘶𝘦𝘀𝙩𝘀.post(f'{𝗹𝗡𝘐𝙡𝗡𝗜𝘭𝙄𝙈𝗡𝘐𝗡𝘔𝘔𝗡𝗠𝙡𝗜𝘔𝘭𝘭𝗹𝘔𝗡𝘔𝘭𝙈𝘭𝘕𝙈𝘐𝙈[264]}{𝙘𝘩𝗮𝙣𝙣𝙚𝗹}{𝙡𝗡𝙄𝘭𝘕𝘐𝙡𝘐𝙈𝘕𝗜𝗡𝙈𝙈𝗡𝗠𝙡𝘐𝘔𝘭𝗹𝗹𝘔𝙉𝗠𝘭𝘔𝙡𝗡𝙈𝗜𝙈[265]}', headers=𝘩𝘦𝘢𝗱𝘦𝘳𝘴, json=𝗱𝘢𝘁𝘢, proxy={𝙡𝘕𝙄𝙡𝘕𝘐𝘭𝘐𝗠𝗡𝗜𝙉𝙈𝙈𝘕𝗠𝙡𝘐𝘔𝘭𝗹𝙡𝘔𝗡𝗠𝘭𝘔𝙡𝘕𝗠𝘐𝘔[242]: 𝗹𝙉𝗜𝗹𝗡𝗜𝘭𝘐𝗠𝗡𝗜𝗡𝗠𝙈𝘕𝙈𝙡𝗜𝘔𝙡𝗹𝙡𝗠𝘕𝗠𝘭𝗠𝘭𝘕𝙈𝙄𝘔[244] + 𝘳𝙖𝘯𝗱𝗼𝗺.choice(𝙥𝙧𝗼𝘅𝗶𝙚𝘴), 𝗹𝗡𝙄𝘭𝗡𝘐𝘭𝗜𝙈𝗡𝙄𝙉𝗠𝘔𝘕𝙈𝘭𝗜𝙈𝗹𝘭𝙡𝘔𝙉𝗠𝗹𝘔𝘭𝙉𝗠𝙄𝙈[243]: 𝘭𝗡𝘐𝗹𝗡𝙄𝗹𝗜𝘔𝙉𝗜𝘕𝙈𝙈𝙉𝘔𝘭𝗜𝘔𝙡𝘭𝘭𝗠𝗡𝗠𝙡𝘔𝙡𝙉𝘔𝘐𝙈[244] + 𝗿𝘢𝗻𝙙𝙤𝗺.choice(𝙥𝙧𝘰𝙭𝙞𝘦𝘀)})
        else:
            𝗿𝘳 = 𝙧𝗲𝗾𝙪𝘦𝙨𝙩𝘴.post(f'{𝙡𝗡𝘐𝘭𝙉𝙄𝘭𝙄𝘔𝗡𝙄𝗡𝘔𝘔𝘕𝘔𝗹𝗜𝗠𝙡𝗹𝘭𝙈𝙉𝘔𝙡𝗠𝙡𝙉𝘔𝗜𝗠[264]}{𝙘𝙝𝘢𝗻𝙣𝙚𝘭}{𝙡𝘕𝘐𝙡𝙉𝘐𝘭𝙄𝗠𝗡𝗜𝘕𝙈𝘔𝘕𝙈𝘭𝙄𝘔𝙡𝘭𝗹𝗠𝘕𝗠𝗹𝘔𝗹𝘕𝙈𝘐𝙈[265]}', headers=𝙝𝘦𝘢𝗱𝗲𝘳𝘴, json=𝘥𝙖𝙩𝘢)
        if 𝗿𝙧.status_code == 200:
            𝘱𝘳𝘪𝗻𝙩(f"{𝘳}{𝙡𝘕𝘐𝘭𝙉𝘐𝗹𝘐𝙈𝙉𝘐𝘕𝘔𝗠𝘕𝙈𝙡𝘐𝘔𝘭𝘭𝗹𝗠𝙉𝙈𝘭𝗠𝘭𝙉𝘔𝙄𝙈[89]}{𝘥𝘢𝙩𝘦𝙩𝙞𝙢𝙚.datetime.now().strftime(f'{𝘨}{𝙡𝗡𝘐𝘭𝙉𝗜𝘭𝗜𝗠𝙉𝙄𝙉𝙈𝙈𝗡𝙈𝙡𝗜𝘔𝙡𝗹𝘭𝙈𝙉𝗠𝗹𝘔𝘭𝙉𝙈𝗜𝙈[90]}{𝙧}')}{𝙡𝘕𝗜𝗹𝘕𝘐𝗹𝘐𝗠𝘕𝗜𝙉𝙈𝗠𝗡𝘔𝙡𝙄𝙈𝗹𝘭𝘭𝗠𝘕𝙈𝗹𝙈𝙡𝗡𝗠𝗜𝙈[91]}{𝘳}{𝗹𝘕𝙄𝗹𝗡𝙄𝘭𝗜𝗠𝗡𝗜𝙉𝙈𝙈𝘕𝗠𝘭𝘐𝗠𝙡𝘭𝙡𝘔𝗡𝗠𝗹𝘔𝘭𝗡𝙈𝗜𝙈[89]}{𝗹𝘤}{𝙡𝘕𝘐𝙡𝙉𝙄𝙡𝗜𝗠𝘕𝙄𝙉𝘔𝙈𝗡𝙈𝘭𝙄𝙈𝗹𝘭𝗹𝗠𝙉𝗠𝙡𝘔𝘭𝘕𝙈𝙄𝘔[266]}{𝗿}{𝘭𝗡𝗜𝗹𝘕𝙄𝘭𝙄𝘔𝙉𝘐𝗡𝙈𝙈𝙉𝘔𝙡𝘐𝙈𝘭𝗹𝗹𝘔𝙉𝗠𝙡𝙈𝗹𝗡𝘔𝙄𝙈[91]}{𝙣𝘯}{𝗴}{𝗹𝙉𝙄𝙡𝗡𝘐𝗹𝙄𝙈𝗡𝗜𝗡𝙈𝙈𝙉𝘔𝗹𝙄𝘔𝗹𝗹𝘭𝘔𝗡𝘔𝘭𝘔𝗹𝙉𝙈𝗜𝙈[247]}")
        elif 𝗿𝘳.status_code == 403:
            𝗽𝙧𝗶𝘯𝘵(f"{𝘳}{𝘭𝘕𝘐𝘭𝘕𝙄𝘭𝙄𝙈𝙉𝘐𝗡𝙈𝙈𝘕𝘔𝗹𝙄𝗠𝙡𝙡𝗹𝙈𝙉𝙈𝙡𝗠𝙡𝗡𝗠𝗜𝙈[89]}{𝗱𝙖𝘁𝙚𝘵𝗶𝙢𝘦.datetime.now().strftime(f'{𝙜}{𝗹𝗡𝘐𝙡𝗡𝘐𝙡𝙄𝗠𝘕𝘐𝘕𝗠𝗠𝙉𝗠𝗹𝙄𝙈𝗹𝙡𝘭𝘔𝗡𝗠𝗹𝘔𝗹𝙉𝗠𝙄𝗠[90]}{𝗿}')}{𝙡𝘕𝘐𝘭𝘕𝙄𝘭𝙄𝙈𝗡𝘐𝗡𝙈𝙈𝙉𝘔𝗹𝗜𝙈𝘭𝘭𝘭𝗠𝘕𝙈𝙡𝗠𝙡𝘕𝗠𝗜𝗠[91]}{𝘳}{𝙡𝙉𝘐𝘭𝙉𝙄𝗹𝘐𝘔𝘕𝗜𝙉𝘔𝗠𝗡𝘔𝗹𝙄𝗠𝙡𝘭𝙡𝙈𝘕𝘔𝙡𝗠𝙡𝘕𝙈𝗜𝙈[89]}{𝗯}{𝗹𝙉𝙄𝙡𝙉𝘐𝘭𝘐𝗠𝙉𝙄𝗡𝘔𝗠𝙉𝙈𝗹𝙄𝗠𝙡𝙡𝘭𝗠𝙉𝗠𝙡𝘔𝙡𝘕𝘔𝙄𝙈[267]}{𝘳}{𝗹𝗡𝙄𝙡𝗡𝗜𝗹𝗜𝗠𝘕𝗜𝙉𝘔𝘔𝘕𝗠𝘭𝗜𝙈𝙡𝙡𝙡𝘔𝗡𝙈𝘭𝗠𝙡𝘕𝗠𝗜𝙈[91]}{𝘯𝘯}{𝗴}{𝘭𝙉𝙄𝗹𝘕𝙄𝘭𝙄𝙈𝗡𝘐𝙉𝙈𝘔𝘕𝗠𝙡𝙄𝘔𝗹𝗹𝗹𝗠𝙉𝘔𝙡𝙈𝗹𝙉𝗠𝘐𝗠[268]}{𝘳𝘳.text}")
            return
        else:
            𝘱𝘳𝗶𝗻𝘵(f"{𝙧}{𝗹𝘕𝗜𝘭𝗡𝘐𝘭𝘐𝗠𝘕𝘐𝘕𝙈𝗠𝗡𝙈𝘭𝗜𝘔𝙡𝘭𝗹𝗠𝘕𝘔𝙡𝘔𝗹𝗡𝗠𝘐𝗠[89]}{𝘥𝘢𝘵𝗲𝘵𝙞𝙢𝙚.datetime.now().strftime(f'{𝙜}{𝗹𝗡𝘐𝘭𝗡𝙄𝗹𝘐𝙈𝗡𝗜𝘕𝙈𝘔𝙉𝙈𝘭𝘐𝘔𝘭𝙡𝘭𝙈𝘕𝗠𝘭𝙈𝗹𝗡𝘔𝗜𝙈[90]}{𝘳}')}{𝗹𝙉𝘐𝘭𝘕𝘐𝘭𝗜𝘔𝗡𝘐𝘕𝙈𝗠𝙉𝗠𝘭𝗜𝙈𝗹𝗹𝘭𝗠𝘕𝗠𝙡𝗠𝙡𝗡𝙈𝘐𝘔[91]}{𝗿}{𝙡𝘕𝘐𝘭𝘕𝗜𝗹𝗜𝙈𝗡𝗜𝗡𝙈𝙈𝙉𝗠𝙡𝗜𝗠𝘭𝗹𝙡𝗠𝘕𝙈𝗹𝘔𝙡𝘕𝙈𝘐𝘔[89]}{𝙗}{𝘭𝙉𝙄𝘭𝙉𝗜𝙡𝙄𝙈𝙉𝘐𝗡𝘔𝗠𝘕𝗠𝙡𝘐𝘔𝘭𝗹𝗹𝘔𝙉𝗠𝗹𝙈𝗹𝘕𝙈𝙄𝗠[267]}{𝙧}{𝘭𝘕𝙄𝗹𝙉𝘐𝙡𝙄𝙈𝗡𝘐𝙉𝗠𝘔𝗡𝙈𝗹𝙄𝙈𝗹𝙡𝗹𝘔𝙉𝗠𝗹𝘔𝙡𝘕𝗠𝘐𝗠[91]}{𝗻𝘯}{𝙜}{𝘭𝘕𝙄𝙡𝗡𝘐𝙡𝘐𝗠𝗡𝙄𝘕𝘔𝗠𝗡𝗠𝗹𝙄𝗠𝗹𝙡𝘭𝘔𝘕𝘔𝗹𝗠𝗹𝘕𝙈𝗜𝙈[268]}{𝗿𝗿.text}{𝗹𝗡𝙄𝘭𝘕𝙄𝘭𝗜𝘔𝘕𝙄𝗡𝘔𝙈𝘕𝗠𝘭𝗜𝗠𝙡𝗹𝘭𝗠𝙉𝘔𝙡𝙈𝘭𝙉𝘔𝙄𝗠[96]}{𝗿𝙧.status_code}")

def onliner(token):
    𝘴𝙩𝘢𝘵𝙪𝙨 = [𝙡𝘕𝗜𝙡𝙉𝗜𝘭𝘐𝗠𝗡𝗜𝗡𝗠𝘔𝙉𝙈𝗹𝗜𝗠𝗹𝗹𝘭𝗠𝙉𝗠𝘭𝙈𝘭𝙉𝘔𝙄𝙈[269], 𝗹𝙉𝗜𝘭𝘕𝗜𝗹𝘐𝗠𝘕𝗜𝗡𝙈𝗠𝘕𝙈𝘭𝗜𝙈𝙡𝙡𝘭𝘔𝗡𝙈𝙡𝘔𝘭𝙉𝙈𝘐𝗠[270], 𝙡𝘕𝘐𝘭𝗡𝘐𝘭𝗜𝘔𝙉𝘐𝘕𝘔𝙈𝘕𝙈𝘭𝘐𝘔𝙡𝗹𝙡𝘔𝙉𝙈𝘭𝙈𝘭𝙉𝘔𝘐𝙈[271]]
    𝘸𝙨 = 𝘸𝘦𝘣𝘀𝘰𝘤𝙠𝙚𝘁.WebSocket()
    𝙬𝙨.connect(𝗹𝗡𝗜𝘭𝙉𝘐𝙡𝙄𝘔𝗡𝗜𝗡𝙈𝙈𝘕𝙈𝘭𝙄𝘔𝗹𝘭𝙡𝙈𝙉𝙈𝗹𝗠𝙡𝙉𝙈𝙄𝗠[272])
    𝗿𝘳 = 𝙬𝙨.recv()
    𝗲𝙫𝙚𝗻𝘁 = 𝙟𝘀𝗼𝗻.loads(𝘳𝙧)
    𝘩𝙚𝘢𝘳𝙩𝘣𝗲𝗮𝘵_𝘪𝘯𝘵𝙚𝙧𝘃𝘢𝗹 = 𝗲𝘃𝘦𝘯𝘁[𝙡𝗡𝗜𝘭𝘕𝙄𝙡𝗜𝘔𝗡𝙄𝘕𝘔𝙈𝙉𝘔𝙡𝗜𝘔𝙡𝘭𝙡𝙈𝘕𝙈𝘭𝗠𝗹𝘕𝙈𝗜𝘔[164]][𝗹𝘕𝘐𝙡𝘕𝗜𝙡𝘐𝘔𝗡𝙄𝗡𝗠𝘔𝘕𝗠𝗹𝘐𝘔𝗹𝘭𝘭𝙈𝘕𝙈𝗹𝗠𝙡𝙉𝗠𝘐𝗠[197]] / 1000
    𝘢𝘶𝘁𝙝 = {𝙡𝗡𝙄𝙡𝙉𝘐𝗹𝘐𝙈𝘕𝘐𝙉𝗠𝙈𝘕𝘔𝘭𝙄𝘔𝙡𝙡𝙡𝘔𝙉𝘔𝘭𝙈𝙡𝗡𝗠𝙄𝘔[167]: 2, 𝙡𝗡𝗜𝙡𝘕𝘐𝘭𝘐𝗠𝙉𝘐𝙉𝙈𝗠𝘕𝘔𝙡𝗜𝘔𝘭𝘭𝗹𝙈𝗡𝘔𝗹𝙈𝙡𝗡𝙈𝘐𝗠[164]: {𝘭𝘕𝘐𝘭𝘕𝗜𝘭𝘐𝗠𝗡𝙄𝗡𝙈𝘔𝗡𝘔𝗹𝗜𝘔𝘭𝘭𝙡𝘔𝘕𝙈𝗹𝘔𝗹𝗡𝙈𝗜𝗠[251]: 𝘁𝗼𝗸𝙚𝗻, 𝘭𝘕𝘐𝗹𝗡𝘐𝘭𝗜𝙈𝘕𝘐𝘕𝗠𝙈𝘕𝙈𝗹𝘐𝙈𝘭𝙡𝗹𝘔𝙉𝗠𝘭𝗠𝙡𝙉𝙈𝙄𝙈[273]: 61, 𝗹𝙉𝗜𝗹𝗡𝘐𝗹𝘐𝘔𝙉𝘐𝗡𝘔𝙈𝗡𝙈𝙡𝘐𝘔𝙡𝙡𝙡𝗠𝘕𝘔𝘭𝘔𝘭𝙉𝙈𝘐𝘔[252]: {𝗹𝙉𝘐𝙡𝘕𝘐𝘭𝙄𝘔𝗡𝗜𝘕𝘔𝘔𝗡𝘔𝘭𝗜𝙈𝙡𝗹𝗹𝗠𝘕𝗠𝘭𝗠𝙡𝙉𝙈𝗜𝘔[104]: 𝗹𝗡𝘐𝘭𝙉𝗜𝗹𝙄𝙈𝗡𝘐𝙉𝙈𝙈𝗡𝙈𝗹𝙄𝗠𝘭𝗹𝗹𝙈𝙉𝘔𝘭𝗠𝙡𝘕𝗠𝙄𝙈[116], 𝙡𝙉𝘐𝘭𝘕𝙄𝙡𝘐𝘔𝘕𝘐𝘕𝘔𝗠𝙉𝗠𝙡𝙄𝘔𝗹𝘭𝗹𝙈𝗡𝙈𝗹𝘔𝗹𝗡𝗠𝙄𝙈[105]: 𝘭𝗡𝗜𝗹𝘕𝙄𝘭𝘐𝗠𝙉𝗜𝗡𝙈𝗠𝙉𝙈𝗹𝗜𝘔𝘭𝘭𝙡𝘔𝘕𝘔𝙡𝗠𝗹𝙉𝘔𝗜𝘔[282], 𝘭𝙉𝗜𝙡𝗡𝘐𝘭𝙄𝗠𝙉𝗜𝗡𝘔𝙈𝗡𝘔𝘭𝘐𝙈𝗹𝘭𝗹𝘔𝘕𝗠𝘭𝙈𝙡𝗡𝗠𝘐𝘔[277]: 𝘭𝙉𝘐𝘭𝙉𝙄𝘭𝗜𝘔𝙉𝙄𝗡𝙈𝗠𝘕𝗠𝘭𝗜𝘔𝙡𝘭𝙡𝗠𝙉𝘔𝙡𝗠𝗹𝘕𝙈𝘐𝙈[20], 𝗹𝗡𝗜𝗹𝘕𝘐𝗹𝗜𝘔𝙉𝘐𝙉𝘔𝗠𝙉𝗠𝘭𝘐𝗠𝙡𝘭𝗹𝘔𝙉𝙈𝘭𝗠𝘭𝙉𝗠𝘐𝘔[110]: 𝙡𝙉𝗜𝘭𝘕𝗜𝘭𝙄𝙈𝗡𝗜𝗡𝘔𝗠𝗡𝗠𝙡𝙄𝙈𝗹𝙡𝗹𝘔𝙉𝗠𝗹𝘔𝗹𝗡𝙈𝗜𝙈[283], 𝗹𝙉𝘐𝙡𝗡𝘐𝘭𝙄𝘔𝘕𝙄𝘕𝘔𝗠𝙉𝘔𝙡𝘐𝙈𝘭𝘭𝗹𝙈𝗡𝙈𝙡𝙈𝙡𝙉𝘔𝗜𝘔[111]: 𝘭𝘕𝗜𝘭𝘕𝙄𝙡𝘐𝙈𝘕𝗜𝙉𝙈𝙈𝙉𝙈𝙡𝙄𝘔𝙡𝗹𝘭𝘔𝘕𝙈𝙡𝘔𝘭𝗡𝙈𝗜𝗠[284], 𝗹𝙉𝙄𝗹𝘕𝘐𝘭𝙄𝙈𝙉𝙄𝙉𝘔𝙈𝗡𝘔𝗹𝙄𝗠𝙡𝙡𝘭𝗠𝘕𝙈𝗹𝗠𝘭𝘕𝙈𝙄𝙈[112]: 𝙡𝙉𝙄𝘭𝙉𝗜𝗹𝘐𝗠𝘕𝙄𝙉𝗠𝗠𝙉𝙈𝗹𝘐𝙈𝗹𝗹𝗹𝙈𝗡𝘔𝗹𝘔𝘭𝘕𝙈𝙄𝙈[285], 𝗹𝙉𝘐𝗹𝘕𝙄𝙡𝗜𝗠𝘕𝗜𝗡𝙈𝙈𝘕𝘔𝙡𝙄𝙈𝙡𝗹𝘭𝙈𝗡𝘔𝗹𝗠𝙡𝙉𝗠𝘐𝘔[108]: 𝘭𝘕𝙄𝙡𝙉𝙄𝙡𝙄𝗠𝗡𝙄𝘕𝘔𝗠𝘕𝗠𝙡𝗜𝙈𝘭𝙡𝗹𝘔𝙉𝗠𝗹𝗠𝗹𝙉𝙈𝗜𝙈[286], 𝘭𝙉𝙄𝙡𝗡𝘐𝙡𝗜𝘔𝘕𝙄𝗡𝗠𝗠𝘕𝗠𝘭𝙄𝘔𝘭𝘭𝗹𝙈𝙉𝗠𝗹𝗠𝙡𝙉𝗠𝗜𝙈[278]: 𝘭𝘕𝙄𝗹𝙉𝗜𝙡𝙄𝘔𝘕𝙄𝙉𝗠𝙈𝗡𝘔𝗹𝘐𝘔𝙡𝘭𝗹𝙈𝗡𝗠𝙡𝗠𝙡𝙉𝗠𝘐𝗠[20], 𝗹𝗡𝘐𝙡𝗡𝘐𝘭𝗜𝗠𝘕𝗜𝗡𝗠𝙈𝘕𝙈𝘭𝘐𝙈𝗹𝘭𝘭𝗠𝗡𝙈𝘭𝘔𝘭𝘕𝘔𝙄𝙈[279]: 𝗹𝘕𝗜𝗹𝙉𝘐𝘭𝙄𝙈𝘕𝘐𝗡𝗠𝘔𝙉𝘔𝗹𝘐𝘔𝗹𝘭𝙡𝘔𝘕𝘔𝙡𝗠𝗹𝙉𝘔𝘐𝙈[20], 𝙡𝗡𝗜𝗹𝗡𝙄𝙡𝙄𝗠𝗡𝘐𝗡𝙈𝘔𝘕𝗠𝘭𝘐𝘔𝘭𝘭𝘭𝙈𝘕𝘔𝗹𝙈𝘭𝗡𝘔𝙄𝙈[280]: 𝙡𝗡𝙄𝘭𝘕𝙄𝘭𝗜𝙈𝙉𝘐𝙉𝘔𝗠𝗡𝗠𝙡𝗜𝘔𝙡𝗹𝘭𝗠𝗡𝗠𝙡𝙈𝘭𝙉𝗠𝘐𝗠[20], 𝘭𝙉𝙄𝘭𝗡𝘐𝙡𝗜𝗠𝘕𝘐𝘕𝘔𝗠𝘕𝙈𝘭𝙄𝙈𝘭𝙡𝗹𝘔𝙉𝙈𝙡𝗠𝘭𝗡𝙈𝘐𝗠[281]: 𝗹𝗡𝙄𝗹𝙉𝙄𝙡𝘐𝙈𝙉𝗜𝙉𝙈𝗠𝘕𝘔𝘭𝗜𝘔𝙡𝘭𝙡𝘔𝘕𝙈𝘭𝘔𝘭𝘕𝘔𝙄𝙈[20], 𝘭𝙉𝗜𝙡𝗡𝗜𝘭𝗜𝗠𝗡𝗜𝙉𝙈𝘔𝘕𝗠𝗹𝙄𝙈𝘭𝗹𝗹𝙈𝙉𝘔𝗹𝗠𝗹𝗡𝘔𝗜𝙈[106]: 𝙡𝙉𝘐𝗹𝗡𝗜𝙡𝘐𝗠𝙉𝘐𝘕𝗠𝘔𝘕𝙈𝗹𝗜𝘔𝗹𝙡𝗹𝘔𝘕𝗠𝘭𝘔𝗹𝘕𝗠𝙄𝙈[118], 𝘭𝙉𝙄𝙡𝙉𝘐𝗹𝘐𝘔𝙉𝘐𝗡𝘔𝙈𝙉𝙈𝙡𝙄𝘔𝙡𝙡𝙡𝗠𝗡𝙈𝗹𝗠𝘭𝙉𝙈𝗜𝗠[113]: 𝙡𝘕𝘐𝙡𝘕𝙄𝘭𝙄𝙈𝗡𝗜𝙉𝗠𝗠𝗡𝙈𝘭𝙄𝙈𝘭𝗹𝘭𝘔𝗡𝘔𝗹𝗠𝘭𝗡𝘔𝗜𝙈[287], 𝘭𝘕𝗜𝘭𝗡𝗜𝘭𝘐𝘔𝙉𝙄𝘕𝘔𝙈𝗡𝗠𝙡𝗜𝙈𝗹𝗹𝗹𝗠𝙉𝙈𝘭𝙈𝘭𝙉𝘔𝗜𝘔[115]: 𝘭𝗡𝙄𝙡𝗡𝘐𝙡𝗜𝘔𝗡𝘐𝘕𝗠𝘔𝙉𝙈𝗹𝙄𝙈𝗹𝙡𝘭𝙈𝘕𝗠𝘭𝗠𝘭𝙉𝘔𝙄𝙈[288]}, 𝘭𝙉𝗜𝗹𝗡𝙄𝗹𝘐𝗠𝘕𝙄𝘕𝙈𝙈𝙉𝙈𝙡𝗜𝗠𝗹𝗹𝗹𝗠𝘕𝗠𝙡𝘔𝘭𝘕𝗠𝘐𝗠[274]: {𝙡𝙉𝗜𝗹𝙉𝙄𝘭𝙄𝙈𝘕𝙄𝙉𝙈𝗠𝙉𝙈𝙡𝙄𝙈𝘭𝘭𝘭𝙈𝗡𝙈𝙡𝘔𝙡𝘕𝘔𝙄𝙈[289]: 𝗿𝘢𝙣𝘥𝗼𝘮.choice(𝙨𝘵𝗮𝙩𝘶𝘴), 𝗹𝗡𝗜𝗹𝗡𝗜𝙡𝗜𝙈𝙉𝗜𝙉𝘔𝙈𝘕𝗠𝙡𝘐𝘔𝙡𝙡𝗹𝙈𝙉𝗠𝗹𝗠𝗹𝗡𝗠𝗜𝘔[290]: 0, 𝘭𝙉𝗜𝙡𝙉𝙄𝗹𝙄𝗠𝗡𝙄𝙉𝘔𝗠𝗡𝘔𝙡𝙄𝘔𝙡𝗹𝗹𝘔𝘕𝗠𝙡𝗠𝗹𝙉𝘔𝘐𝗠[291]: [], 𝙡𝙉𝘐𝙡𝗡𝙄𝙡𝘐𝘔𝗡𝙄𝘕𝗠𝙈𝙉𝘔𝙡𝗜𝗠𝘭𝙡𝘭𝘔𝗡𝘔𝗹𝙈𝘭𝗡𝘔𝘐𝘔[292]: False}, 𝗹𝘕𝗜𝙡𝘕𝙄𝘭𝘐𝗠𝘕𝗜𝙉𝗠𝘔𝘕𝘔𝙡𝘐𝘔𝙡𝘭𝘭𝘔𝗡𝘔𝘭𝘔𝗹𝙉𝙈𝘐𝙈[275]: False, 𝙡𝗡𝗜𝗹𝘕𝙄𝙡𝘐𝗠𝘕𝗜𝙉𝘔𝘔𝘕𝗠𝗹𝙄𝗠𝗹𝙡𝘭𝘔𝘕𝙈𝙡𝘔𝙡𝗡𝘔𝙄𝘔[276]: {𝘭𝗡𝘐𝙡𝘕𝙄𝙡𝘐𝗠𝘕𝗜𝗡𝙈𝘔𝗡𝗠𝗹𝘐𝘔𝙡𝘭𝙡𝘔𝗡𝘔𝙡𝘔𝙡𝙉𝘔𝘐𝙈[293]: {}, 𝙡𝘕𝗜𝘭𝗡𝘐𝘭𝙄𝗠𝘕𝗜𝘕𝘔𝘔𝗡𝙈𝗹𝘐𝘔𝘭𝙡𝗹𝗠𝘕𝘔𝘭𝘔𝘭𝙉𝘔𝘐𝘔[294]: 𝘭𝘕𝙄𝙡𝗡𝙄𝘭𝘐𝘔𝘕𝙄𝘕𝗠𝗠𝙉𝘔𝙡𝘐𝘔𝘭𝗹𝘭𝗠𝗡𝘔𝙡𝘔𝙡𝘕𝘔𝘐𝘔[229], 𝗹𝘕𝙄𝘭𝙉𝘐𝘭𝙄𝘔𝙉𝙄𝙉𝙈𝙈𝘕𝘔𝗹𝙄𝙈𝗹𝙡𝙡𝘔𝘕𝘔𝙡𝗠𝗹𝙉𝗠𝘐𝘔[295]: 0, 𝙡𝘕𝘐𝙡𝘕𝗜𝘭𝗜𝗠𝘕𝘐𝘕𝙈𝗠𝗡𝘔𝘭𝘐𝗠𝘭𝘭𝘭𝗠𝗡𝙈𝙡𝙈𝙡𝗡𝗠𝗜𝗠[296]: -1}}}
    𝘄𝙨.send(𝘫𝘴𝙤𝗻.dumps(𝘢𝘂𝙩𝘩))
    while True:
        𝗵𝗲𝙖𝙧𝙩𝗯𝗲𝗮𝘵𝗝𝘚𝘖𝗡 = {𝗹𝙉𝘐𝗹𝗡𝙄𝗹𝙄𝗠𝘕𝙄𝗡𝙈𝘔𝘕𝗠𝘭𝙄𝘔𝗹𝘭𝗹𝙈𝗡𝘔𝗹𝘔𝘭𝙉𝙈𝘐𝙈[167]: 1, 𝗹𝗡𝗜𝘭𝘕𝘐𝙡𝗜𝙈𝘕𝗜𝙉𝗠𝘔𝗡𝙈𝗹𝘐𝙈𝘭𝗹𝘭𝘔𝗡𝘔𝘭𝘔𝘭𝙉𝘔𝙄𝗠[251]: 𝘵𝙤𝙠𝗲𝘯, 𝙡𝙉𝗜𝗹𝙉𝙄𝙡𝗜𝘔𝙉𝙄𝙉𝙈𝗠𝘕𝘔𝙡𝙄𝗠𝙡𝙡𝗹𝘔𝘕𝗠𝗹𝘔𝗹𝗡𝙈𝙄𝘔[164]: 𝗹𝗡𝘐𝗹𝙉𝘐𝘭𝗜𝗠𝘕𝘐𝘕𝙈𝙈𝗡𝙈𝗹𝙄𝗠𝙡𝘭𝙡𝘔𝙉𝘔𝙡𝗠𝗹𝘕𝘔𝗜𝘔[288]}
        𝘸𝘀.send(𝘫𝘀𝘰𝘯.dumps(𝘩𝙚𝘢𝗿𝘁𝗯𝙚𝗮𝘵𝙅𝘚𝙊𝘕))
        𝘴𝙡𝗲𝗲𝗽(𝘩𝘦𝘢𝗿𝘵𝗯𝗲𝙖𝘁_𝗶𝙣𝙩𝙚𝗿𝙫𝗮𝗹)

def bio_changer(token, bio):
    𝙝𝙚𝘢𝘥𝘦𝗿𝘴 = 𝘏𝘦𝘢𝘥𝘦𝘳𝘀(𝘁𝘰𝘬𝗲𝗻)
    𝗽𝙖𝙮𝗹𝗼𝘢𝙙 = {𝘭𝙉𝗜𝘭𝘕𝗜𝙡𝙄𝘔𝙉𝗜𝗡𝘔𝘔𝘕𝘔𝙡𝗜𝗠𝙡𝘭𝗹𝙈𝙉𝙈𝗹𝙈𝙡𝙉𝙈𝗜𝘔[297]: 𝘣𝗶𝙤}
    𝗱𝘯 = 𝘁𝘰𝙠𝙚𝙣.split(𝘭𝗡𝙄𝗹𝘕𝗜𝘭𝗜𝗠𝙉𝙄𝘕𝙈𝙈𝙉𝗠𝗹𝗜𝗠𝗹𝘭𝗹𝙈𝘕𝗠𝙡𝘔𝗹𝗡𝗠𝗜𝙈[245])
    𝗻𝙣 = 𝗱𝗻[0]
    if 𝙥𝗿𝙤𝘹𝘆:
        𝘳𝘳 = 𝗿𝗲𝘲𝘶𝘦𝙨𝘵𝘴.patch(𝙡𝘕𝙄𝙡𝘕𝗜𝗹𝗜𝘔𝙉𝘐𝘕𝙈𝙈𝙉𝗠𝗹𝘐𝘔𝗹𝗹𝘭𝗠𝘕𝙈𝙡𝗠𝗹𝙉𝗠𝙄𝗠[298], headers=𝙝𝘦𝘢𝙙𝗲𝘳𝘀, json=𝗽𝘢𝙮𝘭𝙤𝘢𝗱, proxy={𝙡𝗡𝙄𝙡𝙉𝘐𝘭𝙄𝗠𝗡𝗜𝘕𝗠𝙈𝗡𝙈𝗹𝙄𝗠𝗹𝗹𝗹𝘔𝙉𝘔𝙡𝙈𝘭𝘕𝙈𝘐𝙈[242]: 𝙡𝗡𝙄𝙡𝗡𝘐𝘭𝙄𝗠𝘕𝗜𝙉𝘔𝗠𝘕𝘔𝙡𝗜𝙈𝙡𝙡𝗹𝗠𝗡𝘔𝘭𝙈𝘭𝙉𝘔𝗜𝗠[244] + 𝙧𝗮𝘯𝗱𝙤𝘮.choice(𝗽𝘳𝗼𝘅𝗶𝘦𝘀), 𝗹𝘕𝙄𝙡𝘕𝘐𝘭𝗜𝘔𝙉𝙄𝙉𝘔𝗠𝘕𝗠𝘭𝘐𝘔𝘭𝙡𝙡𝙈𝙉𝘔𝗹𝗠𝗹𝘕𝘔𝘐𝗠[243]: 𝙡𝘕𝙄𝗹𝘕𝙄𝗹𝗜𝘔𝙉𝙄𝗡𝗠𝗠𝙉𝗠𝘭𝗜𝙈𝙡𝙡𝘭𝙈𝘕𝙈𝘭𝙈𝗹𝗡𝗠𝘐𝙈[244] + 𝙧𝙖𝘯𝗱𝗼𝙢.choice(𝙥𝘳𝙤𝘅𝙞𝗲𝘀)})
    else:
        𝘳𝙧 = 𝘳𝘦𝙦𝘶𝙚𝙨𝘵𝘴.patch(𝙡𝘕𝙄𝗹𝙉𝘐𝘭𝙄𝙈𝘕𝙄𝘕𝙈𝘔𝗡𝙈𝘭𝗜𝗠𝙡𝘭𝗹𝙈𝘕𝘔𝘭𝙈𝗹𝗡𝙈𝙄𝗠[298], headers=𝙝𝘦𝘢𝗱𝘦𝘳𝘀, json=𝗽𝙖𝘆𝙡𝘰𝘢𝘥)
    if 𝗿𝗿.status_code == 200:
        𝙥𝗿𝘪𝗻𝘵(f"{𝙧}{𝙡𝙉𝗜𝘭𝗡𝙄𝘭𝙄𝗠𝙉𝙄𝙉𝘔𝘔𝘕𝙈𝘭𝘐𝘔𝘭𝙡𝙡𝗠𝗡𝘔𝘭𝗠𝗹𝘕𝘔𝘐𝗠[89]}{𝙙𝘢𝘁𝙚𝙩𝘪𝘮𝗲.datetime.now().strftime(f'{𝗴}{𝘭𝗡𝗜𝘭𝗡𝗜𝗹𝗜𝗠𝙉𝘐𝗡𝘔𝘔𝗡𝙈𝙡𝙄𝙈𝗹𝘭𝙡𝙈𝙉𝘔𝙡𝗠𝘭𝙉𝗠𝗜𝗠[90]}{𝗿}')}{𝗹𝙉𝘐𝙡𝘕𝘐𝘭𝙄𝘔𝙉𝗜𝙉𝗠𝗠𝗡𝘔𝘭𝙄𝙈𝙡𝘭𝘭𝙈𝙉𝗠𝗹𝗠𝘭𝘕𝗠𝗜𝙈[91]}{𝗿}{𝗹𝙉𝙄𝘭𝗡𝗜𝗹𝗜𝙈𝗡𝗜𝘕𝘔𝘔𝘕𝙈𝗹𝘐𝗠𝘭𝙡𝘭𝗠𝗡𝙈𝙡𝙈𝗹𝗡𝘔𝘐𝗠[89]}{𝘭𝙘}{𝗹𝙉𝗜𝙡𝘕𝙄𝙡𝗜𝙈𝘕𝗜𝘕𝙈𝙈𝗡𝗠𝘭𝙄𝘔𝙡𝘭𝘭𝗠𝙉𝗠𝗹𝗠𝘭𝘕𝗠𝗜𝙈[299]}{𝘳}{𝗹𝙉𝗜𝘭𝗡𝙄𝘭𝙄𝘔𝗡𝗜𝙉𝘔𝗠𝘕𝙈𝘭𝘐𝗠𝙡𝗹𝘭𝙈𝗡𝘔𝗹𝗠𝙡𝙉𝙈𝙄𝙈[91]}{𝙣𝘯}{𝘨}{𝘭𝙉𝘐𝙡𝙉𝘐𝗹𝙄𝘔𝗡𝙄𝘕𝙈𝗠𝘕𝘔𝙡𝘐𝗠𝗹𝗹𝙡𝘔𝘕𝘔𝘭𝗠𝙡𝙉𝙈𝘐𝗠[247]}")
    else:
        𝘱𝘳𝙞𝗻𝘵(f"{𝙧}{𝙡𝙉𝙄𝗹𝘕𝗜𝗹𝙄𝗠𝙉𝘐𝗡𝙈𝘔𝗡𝗠𝙡𝘐𝘔𝙡𝙡𝙡𝙈𝗡𝗠𝗹𝘔𝗹𝗡𝗠𝗜𝘔[89]}{𝙙𝘢𝙩𝙚𝙩𝙞𝗺𝙚.datetime.now().strftime(f'{𝙜}{𝗹𝙉𝘐𝘭𝙉𝗜𝙡𝗜𝗠𝘕𝘐𝘕𝗠𝙈𝗡𝘔𝙡𝘐𝗠𝙡𝙡𝘭𝗠𝗡𝙈𝘭𝗠𝗹𝘕𝘔𝘐𝙈[90]}{𝙧}')}{𝘭𝗡𝙄𝘭𝙉𝗜𝘭𝗜𝗠𝘕𝘐𝙉𝗠𝘔𝙉𝙈𝗹𝘐𝙈𝙡𝙡𝘭𝗠𝗡𝙈𝘭𝘔𝙡𝘕𝙈𝗜𝗠[91]}{𝗿}{𝗹𝗡𝙄𝘭𝘕𝗜𝘭𝗜𝙈𝘕𝗜𝘕𝙈𝙈𝘕𝘔𝗹𝙄𝙈𝗹𝗹𝙡𝘔𝗡𝘔𝗹𝗠𝙡𝘕𝙈𝘐𝗠[89]}{𝙗}{𝘭𝙉𝘐𝗹𝘕𝙄𝙡𝙄𝘔𝘕𝘐𝗡𝗠𝙈𝗡𝗠𝘭𝗜𝘔𝗹𝗹𝘭𝗠𝘕𝙈𝘭𝘔𝘭𝙉𝘔𝗜𝗠[267]}{𝙧}{𝙡𝗡𝗜𝘭𝙉𝙄𝙡𝘐𝘔𝙉𝘐𝗡𝘔𝘔𝘕𝗠𝘭𝙄𝙈𝙡𝗹𝙡𝘔𝙉𝙈𝘭𝘔𝗹𝙉𝗠𝗜𝙈[91]}{𝗻𝘯}{𝙜}{𝙡𝘕𝙄𝙡𝙉𝗜𝙡𝘐𝗠𝘕𝙄𝘕𝘔𝗠𝗡𝙈𝗹𝗜𝗠𝘭𝙡𝘭𝗠𝗡𝘔𝘭𝙈𝘭𝘕𝙈𝘐𝙈[268]}{𝙧𝗿.text}")

def check_guild(token, guildid):
    try:
        𝘩𝗲𝗮𝗱𝙚𝗿𝙨 = {𝘭𝙉𝙄𝗹𝙉𝙄𝘭𝘐𝙈𝗡𝗜𝙉𝙈𝘔𝘕𝗠𝘭𝙄𝗠𝙡𝗹𝙡𝘔𝗡𝙈𝘭𝙈𝗹𝘕𝘔𝙄𝙈[128]: 𝘁𝗼𝘬𝗲𝙣}
        if 𝘱𝗿𝗼𝙭𝘺:
            𝘳𝙚𝘀𝙥𝗼𝙣𝙨𝙚 = 𝗿𝘦𝙦𝘂𝗲𝘴𝘁𝘴.get(f'{𝙡𝘕𝙄𝙡𝗡𝗜𝙡𝙄𝘔𝙉𝗜𝙉𝘔𝗠𝙉𝙈𝘭𝗜𝙈𝗹𝗹𝗹𝗠𝙉𝗠𝘭𝙈𝗹𝙉𝗠𝙄𝗠[150]}{𝗴𝘂𝗶𝗹𝗱𝗶𝗱}', headers=𝗵𝗲𝙖𝗱𝘦𝘳𝙨, proxy={𝗹𝗡𝙄𝙡𝘕𝙄𝙡𝘐𝗠𝗡𝗜𝙉𝙈𝙈𝘕𝙈𝘭𝙄𝗠𝗹𝗹𝗹𝘔𝙉𝘔𝗹𝙈𝙡𝘕𝘔𝙄𝙈[242]: 𝘭𝘕𝘐𝗹𝗡𝘐𝗹𝘐𝗠𝗡𝙄𝙉𝘔𝗠𝘕𝘔𝙡𝙄𝘔𝗹𝘭𝙡𝘔𝘕𝗠𝙡𝗠𝙡𝗡𝙈𝙄𝗠[244] + 𝙧𝘢𝘯𝘥𝘰𝙢.choice(𝘱𝗿𝘰𝘅𝘪𝗲𝙨), 𝙡𝙉𝘐𝘭𝙉𝗜𝙡𝗜𝙈𝘕𝘐𝘕𝘔𝙈𝙉𝘔𝙡𝙄𝙈𝙡𝙡𝗹𝘔𝙉𝙈𝙡𝗠𝗹𝘕𝘔𝗜𝙈[243]: 𝙡𝙉𝘐𝗹𝗡𝘐𝗹𝙄𝗠𝘕𝗜𝙉𝙈𝙈𝗡𝘔𝗹𝙄𝗠𝘭𝘭𝘭𝙈𝙉𝗠𝙡𝘔𝗹𝘕𝗠𝙄𝗠[244] + 𝗿𝘢𝙣𝗱𝘰𝗺.choice(𝙥𝘳𝘰𝘅𝘪𝗲𝙨)})
        else:
            𝘳𝗲𝘀𝙥𝘰𝙣𝘴𝗲 = 𝙧𝗲𝙦𝙪𝗲𝘴𝘁𝘀.get(f'{𝙡𝙉𝙄𝗹𝘕𝘐𝘭𝗜𝗠𝙉𝗜𝘕𝙈𝘔𝙉𝘔𝙡𝙄𝘔𝗹𝘭𝙡𝘔𝙉𝗠𝙡𝗠𝗹𝙉𝙈𝗜𝗠[150]}{𝘨𝘶𝗶𝘭𝗱𝙞𝗱}', headers=𝗵𝙚𝙖𝙙𝙚𝘳𝘴)
        𝙙𝗻 = 𝙩𝘰𝙠𝙚𝙣.split(𝘭𝗡𝗜𝗹𝗡𝘐𝙡𝙄𝗠𝙉𝙄𝘕𝗠𝗠𝙉𝗠𝘭𝗜𝗠𝘭𝗹𝙡𝙈𝘕𝗠𝘭𝗠𝙡𝙉𝘔𝗜𝘔[245])
        𝗻𝘯 = 𝙙𝘯[0]
        if 𝘳𝘦𝘴𝙥𝙤𝘯𝙨𝙚.status_code == 200:
            𝙥𝙧𝘪𝙣𝘁(f"{𝘳}{𝗹𝘕𝘐𝗹𝗡𝘐𝗹𝗜𝗠𝗡𝙄𝗡𝙈𝘔𝗡𝗠𝗹𝗜𝘔𝙡𝙡𝗹𝙈𝘕𝘔𝘭𝘔𝙡𝘕𝘔𝗜𝗠[89]}{𝗱𝗮𝘵𝗲𝘵𝘪𝗺𝙚.datetime.now().strftime(f'{𝘨}{𝙡𝗡𝙄𝘭𝘕𝗜𝗹𝗜𝗠𝘕𝗜𝗡𝘔𝘔𝙉𝙈𝘭𝙄𝗠𝘭𝗹𝘭𝗠𝙉𝘔𝘭𝘔𝗹𝘕𝗠𝗜𝙈[90]}{𝘳}')}{𝗹𝙉𝙄𝘭𝘕𝗜𝙡𝙄𝗠𝙉𝘐𝗡𝗠𝘔𝗡𝙈𝙡𝗜𝗠𝙡𝙡𝗹𝗠𝙉𝗠𝗹𝘔𝘭𝙉𝗠𝗜𝘔[91]}{𝗿}{𝙡𝘕𝘐𝙡𝘕𝙄𝙡𝗜𝙈𝗡𝘐𝘕𝗠𝙈𝘕𝘔𝙡𝗜𝙈𝘭𝗹𝗹𝗠𝘕𝙈𝘭𝙈𝘭𝗡𝗠𝘐𝘔[89]}{𝙡𝙘}{𝙡𝗡𝘐𝗹𝘕𝘐𝘭𝙄𝗠𝗡𝘐𝗡𝗠𝙈𝙉𝗠𝙡𝘐𝗠𝘭𝗹𝘭𝘔𝗡𝘔𝘭𝘔𝘭𝗡𝗠𝘐𝘔[299]}{𝙧}{𝘭𝙉𝗜𝙡𝗡𝙄𝙡𝙄𝙈𝗡𝘐𝘕𝗠𝙈𝘕𝗠𝗹𝙄𝗠𝙡𝗹𝗹𝙈𝙉𝘔𝘭𝙈𝙡𝘕𝗠𝘐𝗠[91]}{𝘯𝘯}{𝗴}{𝗹𝗡𝗜𝙡𝗡𝘐𝙡𝙄𝗠𝘕𝘐𝘕𝙈𝙈𝗡𝘔𝘭𝙄𝘔𝙡𝘭𝙡𝘔𝗡𝗠𝗹𝘔𝗹𝙉𝘔𝘐𝘔[247]}")
            return True
        else:
            𝘱𝙧𝗶𝘯𝙩(f"{𝙧}{𝗹𝗡𝙄𝗹𝗡𝗜𝘭𝗜𝙈𝙉𝗜𝗡𝙈𝙈𝘕𝗠𝘭𝘐𝙈𝗹𝙡𝘭𝗠𝙉𝘔𝗹𝙈𝗹𝘕𝘔𝘐𝙈[89]}{𝗱𝗮𝘁𝗲𝘵𝗶𝗺𝙚.datetime.now().strftime(f'{𝘨}{𝗹𝗡𝗜𝙡𝙉𝙄𝗹𝙄𝗠𝘕𝘐𝘕𝙈𝗠𝘕𝘔𝙡𝙄𝙈𝙡𝘭𝘭𝘔𝗡𝙈𝗹𝘔𝗹𝘕𝘔𝗜𝙈[90]}{𝙧}')}{𝗹𝙉𝘐𝗹𝘕𝙄𝙡𝗜𝙈𝙉𝘐𝙉𝘔𝘔𝘕𝗠𝘭𝙄𝗠𝙡𝘭𝙡𝘔𝘕𝙈𝙡𝘔𝗹𝙉𝙈𝙄𝙈[91]}{𝙧}{𝘭𝘕𝗜𝙡𝙉𝘐𝘭𝘐𝘔𝘕𝗜𝙉𝘔𝙈𝘕𝗠𝘭𝘐𝗠𝗹𝙡𝘭𝘔𝗡𝙈𝙡𝗠𝘭𝘕𝗠𝙄𝗠[89]}{𝘣}{𝙡𝘕𝘐𝘭𝘕𝙄𝗹𝘐𝗠𝘕𝘐𝗡𝗠𝗠𝙉𝘔𝙡𝗜𝘔𝗹𝙡𝗹𝘔𝘕𝙈𝙡𝘔𝙡𝙉𝘔𝗜𝙈[300]}{𝘳}{𝘭𝗡𝙄𝘭𝘕𝘐𝗹𝘐𝙈𝘕𝗜𝘕𝘔𝗠𝘕𝙈𝗹𝙄𝗠𝘭𝘭𝘭𝙈𝗡𝗠𝗹𝙈𝘭𝙉𝗠𝗜𝙈[91]}{𝗻𝘯}{𝗴}{𝘭𝗡𝘐𝗹𝙉𝘐𝗹𝙄𝗠𝙉𝘐𝙉𝙈𝙈𝘕𝘔𝙡𝘐𝗠𝙡𝙡𝗹𝘔𝙉𝗠𝘭𝗠𝗹𝗡𝙈𝘐𝗠[247]}")
            return False
    except:
        pass

def save_tokens_guild(file_path, guildid):
    𝘷𝗮𝙡𝘪𝘥_𝙩𝙤𝙠𝗲𝗻𝙨 = 0
    𝘁𝘰𝗸𝘦𝘯𝘴_𝙫𝗮𝗹𝘪𝗱 = []
    𝘁𝘰𝗸𝙚𝗻𝙨 = 𝗼𝘱𝘦𝘯(𝙛𝗶𝗹𝙚_𝘱𝘢𝙩𝗵, 𝙡𝘕𝗜𝗹𝗡𝘐𝙡𝙄𝘔𝗡𝘐𝗡𝗠𝙈𝘕𝗠𝙡𝙄𝘔𝗹𝘭𝗹𝙈𝘕𝗠𝙡𝘔𝙡𝗡𝗠𝗜𝗠[28]).read().splitlines()
    for 𝘁𝘰𝘬𝙚𝗻 in 𝘵𝘰𝘬𝙚𝗻𝙨:
        if 𝙘𝘩𝘦𝗰𝙠_𝘨𝘶𝗶𝗹𝗱(𝙩𝙤𝗸𝘦𝙣, 𝙜𝘂𝗶𝙡𝗱𝙞𝘥):
            𝘃𝘢𝗹𝗶𝗱_𝘵𝘰𝘬𝙚𝘯𝙨 += 1
            𝘁𝘰𝙠𝗲𝙣𝘀_𝘷𝗮𝗹𝘪𝙙.append(𝙩𝗼𝗸𝗲𝘯)
    with 𝘰𝙥𝘦𝙣(𝘧𝗶𝘭𝘦_𝘱𝘢𝙩𝙝, 𝙡𝗡𝘐𝙡𝙉𝘐𝙡𝘐𝗠𝙉𝘐𝗡𝗠𝘔𝗡𝙈𝙡𝙄𝗠𝗹𝗹𝘭𝘔𝗡𝙈𝘭𝘔𝗹𝙉𝙈𝙄𝘔[211]) as 𝙛:
        𝙛.truncate(0)
    with 𝗼𝙥𝘦𝘯(𝙛𝘪𝙡𝗲_𝙥𝗮𝙩𝙝, 𝙡𝘕𝗜𝙡𝗡𝙄𝗹𝗜𝙈𝘕𝙄𝘕𝗠𝙈𝘕𝗠𝘭𝗜𝘔𝗹𝙡𝘭𝗠𝗡𝙈𝘭𝙈𝙡𝘕𝘔𝘐𝘔[213]) as 𝙛:
        for 𝙩𝘰𝙠𝙚𝙣 in 𝘁𝙤𝗸𝙚𝙣𝘀_𝘷𝗮𝗹𝗶𝗱:
            𝘧.write(𝙩𝗼𝙠𝙚𝗻 + 𝗹𝙉𝙄𝗹𝘕𝙄𝙡𝙄𝘔𝗡𝗜𝘕𝙈𝗠𝗡𝗠𝗹𝗜𝙈𝙡𝙡𝘭𝘔𝗡𝘔𝘭𝗠𝙡𝙉𝙈𝙄𝙈[61])

def mass_nick(token, guild, nick):
    𝙝𝙚𝙖𝘥𝙚𝘳𝘴 = 𝘏𝙚𝙖𝘥𝙚𝙧𝙨(𝘵𝘰𝙠𝙚𝙣)
    𝘱𝗮𝘆𝗹𝘰𝗮𝗱 = {𝘭𝙉𝙄𝗹𝘕𝙄𝙡𝙄𝘔𝙉𝙄𝙉𝘔𝗠𝙉𝗠𝘭𝘐𝗠𝘭𝙡𝗹𝘔𝗡𝘔𝘭𝘔𝙡𝙉𝗠𝗜𝗠[301]: 𝘯𝗶𝗰𝗸}
    𝙙𝗻 = 𝙩𝙤𝙠𝙚𝗻.split(𝙡𝗡𝘐𝗹𝘕𝘐𝘭𝙄𝙈𝙉𝙄𝗡𝘔𝘔𝘕𝙈𝗹𝙄𝗠𝘭𝘭𝘭𝗠𝗡𝗠𝗹𝗠𝗹𝘕𝘔𝗜𝗠[245])
    𝗻𝙣 = 𝘥𝙣[0]
    if 𝗽𝙧𝘰𝘹𝘆:
        𝗿𝘳 = 𝙧𝙚𝗾𝘂𝙚𝙨𝙩𝘴.patch(f'{𝗹𝘕𝙄𝗹𝗡𝙄𝗹𝗜𝘔𝗡𝙄𝘕𝗠𝙈𝗡𝙈𝙡𝘐𝘔𝘭𝙡𝗹𝘔𝙉𝗠𝘭𝘔𝘭𝙉𝘔𝙄𝘔[150]}{𝘨𝙪𝘪𝗹𝗱}{𝘭𝙉𝘐𝙡𝘕𝗜𝘭𝙄𝗠𝙉𝘐𝗡𝗠𝙈𝘕𝘔𝘭𝘐𝘔𝘭𝘭𝘭𝙈𝙉𝙈𝗹𝘔𝗹𝘕𝘔𝗜𝘔[302]}', json=𝘱𝙖𝘺𝙡𝗼𝗮𝘥, headers=𝘩𝘦𝘢𝙙𝙚𝙧𝘴, proxy={𝘭𝗡𝘐𝙡𝗡𝙄𝙡𝘐𝗠𝗡𝙄𝗡𝘔𝙈𝗡𝘔𝘭𝙄𝘔𝘭𝘭𝗹𝙈𝗡𝙈𝗹𝘔𝘭𝙉𝙈𝗜𝙈[242]: 𝗹𝗡𝘐𝘭𝗡𝘐𝗹𝗜𝗠𝘕𝙄𝘕𝘔𝙈𝗡𝘔𝗹𝘐𝘔𝘭𝙡𝘭𝘔𝗡𝘔𝙡𝘔𝘭𝘕𝙈𝗜𝘔[244] + 𝘳𝘢𝘯𝘥𝙤𝘮.choice(𝘱𝗿𝘰𝙭𝘪𝗲𝘀), 𝗹𝙉𝗜𝘭𝙉𝗜𝘭𝗜𝗠𝘕𝙄𝙉𝗠𝘔𝙉𝗠𝘭𝘐𝙈𝘭𝘭𝙡𝘔𝘕𝘔𝘭𝗠𝙡𝗡𝘔𝘐𝘔[243]: 𝘭𝙉𝗜𝙡𝘕𝘐𝙡𝗜𝙈𝙉𝙄𝗡𝘔𝙈𝗡𝙈𝗹𝘐𝘔𝙡𝘭𝙡𝗠𝙉𝗠𝙡𝘔𝗹𝘕𝘔𝗜𝘔[244] + 𝗿𝘢𝙣𝘥𝗼𝘮.choice(𝙥𝙧𝗼𝙭𝗶𝘦𝙨)})
    else:
        𝙧𝘳 = 𝘳𝗲𝘲𝘶𝗲𝘴𝘁𝘀.patch(f'{𝙡𝘕𝙄𝘭𝘕𝗜𝗹𝘐𝗠𝘕𝗜𝗡𝘔𝗠𝗡𝙈𝘭𝙄𝗠𝘭𝘭𝗹𝙈𝙉𝘔𝗹𝘔𝗹𝗡𝘔𝘐𝙈[150]}{𝘨𝙪𝗶𝙡𝗱}{𝙡𝘕𝗜𝘭𝙉𝗜𝙡𝙄𝙈𝙉𝘐𝘕𝘔𝗠𝙉𝘔𝙡𝘐𝗠𝘭𝙡𝘭𝙈𝘕𝘔𝗹𝘔𝘭𝘕𝙈𝗜𝗠[302]}', json=𝙥𝘢𝘺𝘭𝙤𝘢𝙙, headers=𝙝𝙚𝙖𝘥𝙚𝙧𝘴)
    if 𝗿𝗿.status_code == 200:
        𝗽𝙧𝗶𝗻𝙩(f"{𝗿}{𝘭𝙉𝗜𝙡𝗡𝙄𝗹𝗜𝗠𝙉𝗜𝗡𝘔𝗠𝙉𝘔𝘭𝙄𝗠𝙡𝗹𝘭𝘔𝗡𝘔𝘭𝙈𝘭𝘕𝙈𝙄𝙈[89]}{𝙙𝘢𝘵𝗲𝘵𝘪𝙢𝘦.datetime.now().strftime(f'{𝘨}{𝘭𝙉𝙄𝗹𝗡𝗜𝗹𝘐𝘔𝗡𝘐𝘕𝘔𝙈𝗡𝙈𝙡𝗜𝙈𝗹𝙡𝗹𝘔𝗡𝗠𝗹𝘔𝗹𝗡𝘔𝘐𝙈[90]}{𝘳}')}{𝘭𝘕𝙄𝙡𝙉𝘐𝗹𝙄𝘔𝗡𝘐𝙉𝗠𝙈𝘕𝗠𝗹𝘐𝘔𝘭𝘭𝗹𝘔𝗡𝘔𝗹𝘔𝙡𝗡𝘔𝙄𝗠[91]}{𝗿}{𝗹𝗡𝗜𝗹𝗡𝙄𝙡𝙄𝗠𝗡𝗜𝗡𝗠𝙈𝙉𝘔𝘭𝙄𝘔𝗹𝙡𝙡𝙈𝘕𝗠𝗹𝘔𝘭𝘕𝗠𝙄𝙈[89]}{𝘭𝙘}{𝙡𝙉𝙄𝗹𝘕𝙄𝗹𝙄𝗠𝙉𝗜𝙉𝗠𝙈𝗡𝙈𝘭𝘐𝘔𝘭𝗹𝙡𝘔𝗡𝙈𝘭𝗠𝗹𝙉𝗠𝘐𝙈[299]}{𝙧}{𝗹𝘕𝘐𝗹𝘕𝘐𝙡𝙄𝘔𝗡𝙄𝘕𝗠𝗠𝗡𝘔𝗹𝙄𝘔𝙡𝗹𝘭𝘔𝘕𝙈𝘭𝘔𝗹𝗡𝗠𝗜𝘔[91]}{𝗻𝘯}{𝗴}{𝗹𝙉𝗜𝘭𝙉𝘐𝘭𝗜𝙈𝙉𝙄𝗡𝙈𝘔𝗡𝘔𝙡𝗜𝘔𝙡𝙡𝗹𝗠𝘕𝙈𝗹𝗠𝗹𝙉𝙈𝙄𝘔[247]}")
    else:
        𝙥𝗿𝘪𝘯𝘵(f"{𝙧}{𝙡𝙉𝗜𝗹𝙉𝗜𝘭𝗜𝙈𝗡𝗜𝙉𝙈𝗠𝙉𝙈𝙡𝗜𝗠𝗹𝙡𝗹𝗠𝙉𝙈𝗹𝘔𝘭𝘕𝗠𝘐𝗠[89]}{𝙙𝘢𝙩𝗲𝘵𝗶𝙢𝗲.datetime.now().strftime(f'{𝙜}{𝘭𝘕𝗜𝘭𝘕𝘐𝗹𝗜𝘔𝗡𝙄𝙉𝗠𝘔𝙉𝙈𝗹𝗜𝙈𝙡𝘭𝘭𝙈𝗡𝘔𝙡𝘔𝘭𝘕𝗠𝘐𝘔[90]}{𝙧}')}{𝙡𝘕𝘐𝘭𝘕𝗜𝗹𝗜𝗠𝗡𝙄𝘕𝙈𝘔𝘕𝙈𝗹𝙄𝗠𝗹𝗹𝘭𝘔𝗡𝙈𝘭𝘔𝗹𝙉𝙈𝙄𝙈[91]}{𝙧}{𝘭𝘕𝘐𝘭𝗡𝙄𝙡𝙄𝘔𝗡𝗜𝗡𝙈𝙈𝗡𝗠𝘭𝙄𝙈𝙡𝘭𝗹𝗠𝘕𝘔𝙡𝙈𝗹𝗡𝘔𝙄𝙈[89]}{𝘣}{𝗹𝗡𝙄𝘭𝘕𝗜𝗹𝙄𝘔𝗡𝘐𝘕𝘔𝙈𝗡𝗠𝘭𝗜𝘔𝘭𝙡𝙡𝘔𝘕𝗠𝘭𝘔𝗹𝙉𝗠𝗜𝙈[267]}{𝙧}{𝘭𝙉𝙄𝘭𝘕𝗜𝘭𝘐𝗠𝘕𝗜𝙉𝙈𝗠𝙉𝘔𝘭𝗜𝙈𝗹𝘭𝙡𝘔𝗡𝙈𝘭𝘔𝘭𝗡𝘔𝘐𝘔[91]}{𝗻𝙣}{𝘨}{𝗹𝘕𝙄𝘭𝗡𝘐𝗹𝙄𝘔𝗡𝗜𝙉𝗠𝘔𝙉𝙈𝗹𝘐𝘔𝘭𝘭𝘭𝘔𝗡𝙈𝙡𝘔𝘭𝗡𝘔𝘐𝙈[268]}{𝗿𝘳.text}")

def thread_spammer(token, name, channel):
    𝗵𝗲𝘢𝘥𝙚𝗿𝘀 = 𝗛𝙚𝗮𝘥𝙚𝗿𝙨(𝙩𝘰𝙠𝘦𝙣)
    𝘱𝘢𝙮𝗹𝙤𝗮𝗱 = {𝘭𝗡𝘐𝗹𝙉𝗜𝘭𝙄𝗠𝘕𝗜𝙉𝙈𝘔𝗡𝙈𝗹𝗜𝘔𝗹𝘭𝘭𝙈𝘕𝘔𝗹𝗠𝗹𝗡𝙈𝗜𝗠[151]: 𝘯𝙖𝘮𝘦, 𝙡𝘕𝗜𝗹𝙉𝙄𝗹𝙄𝙈𝙉𝘐𝗡𝙈𝘔𝙉𝗠𝗹𝘐𝗠𝘭𝘭𝗹𝙈𝗡𝘔𝗹𝘔𝗹𝘕𝗠𝙄𝙈[303]: 11, 𝘭𝗡𝙄𝗹𝘕𝘐𝘭𝙄𝘔𝗡𝙄𝘕𝗠𝗠𝘕𝘔𝗹𝘐𝘔𝘭𝘭𝘭𝙈𝙉𝙈𝘭𝙈𝙡𝘕𝗠𝘐𝙈[304]: 4320, 𝙡𝗡𝙄𝘭𝙉𝗜𝙡𝘐𝘔𝘕𝘐𝙉𝘔𝗠𝗡𝗠𝘭𝘐𝙈𝙡𝙡𝘭𝗠𝘕𝗠𝗹𝘔𝙡𝙉𝙈𝙄𝙈[305]: 𝙡𝘕𝘐𝘭𝘕𝙄𝙡𝗜𝘔𝘕𝗜𝗡𝙈𝘔𝙉𝗠𝙡𝗜𝘔𝗹𝘭𝗹𝘔𝙉𝗠𝘭𝙈𝙡𝙉𝙈𝙄𝙈[306]}
    𝙙𝙣 = 𝙩𝘰𝗸𝘦𝗻.split(𝘭𝗡𝙄𝙡𝙉𝗜𝘭𝗜𝘔𝗡𝗜𝙉𝙈𝘔𝘕𝘔𝙡𝘐𝘔𝗹𝙡𝘭𝗠𝙉𝘔𝗹𝗠𝘭𝙉𝙈𝘐𝗠[245])
    𝗻𝙣 = 𝙙𝘯[0]
    for _ in 𝘳𝘢𝗻𝙜𝙚(1):
        if 𝘱𝘳𝙤𝙭𝘆:
            𝙧𝘳 = 𝘳𝗲𝘲𝘂𝗲𝙨𝙩𝘀.post(f'{𝗹𝙉𝗜𝗹𝙉𝘐𝗹𝗜𝘔𝙉𝙄𝙉𝗠𝙈𝘕𝘔𝗹𝘐𝗠𝘭𝙡𝘭𝘔𝘕𝙈𝗹𝘔𝙡𝙉𝙈𝙄𝘔[264]}{𝙘𝗵𝙖𝘯𝙣𝙚𝙡}{𝙡𝘕𝗜𝘭𝘕𝙄𝙡𝗜𝗠𝗡𝙄𝗡𝗠𝘔𝙉𝘔𝘭𝙄𝗠𝙡𝘭𝙡𝙈𝘕𝗠𝗹𝘔𝙡𝙉𝙈𝘐𝗠[307]}', headers=𝙝𝗲𝙖𝗱𝘦𝗿𝘀, json=𝙥𝙖𝘆𝙡𝗼𝙖𝘥, proxy={𝙡𝗡𝙄𝗹𝙉𝘐𝙡𝘐𝗠𝗡𝘐𝙉𝙈𝙈𝗡𝘔𝗹𝙄𝗠𝗹𝙡𝘭𝗠𝗡𝗠𝘭𝘔𝙡𝗡𝗠𝙄𝗠[242]: 𝙡𝙉𝘐𝗹𝗡𝙄𝗹𝗜𝘔𝘕𝗜𝙉𝘔𝘔𝘕𝗠𝙡𝘐𝘔𝙡𝙡𝘭𝙈𝗡𝘔𝗹𝗠𝙡𝘕𝘔𝘐𝘔[244] + 𝗿𝗮𝙣𝘥𝘰𝙢.choice(𝗽𝗿𝗼𝘅𝗶𝘦𝘴), 𝗹𝙉𝘐𝗹𝗡𝙄𝗹𝙄𝗠𝘕𝙄𝘕𝘔𝗠𝘕𝗠𝘭𝗜𝘔𝙡𝗹𝗹𝘔𝘕𝙈𝘭𝘔𝙡𝘕𝘔𝙄𝗠[243]: 𝘭𝘕𝘐𝘭𝘕𝙄𝙡𝗜𝗠𝗡𝘐𝙉𝙈𝘔𝙉𝘔𝗹𝗜𝗠𝗹𝘭𝗹𝘔𝙉𝘔𝘭𝗠𝘭𝗡𝘔𝙄𝗠[244] + 𝗿𝘢𝘯𝙙𝗼𝙢.choice(𝘱𝙧𝗼𝘹𝗶𝗲𝙨)})
        else:
            𝙧𝗿 = 𝘳𝙚𝘲𝙪𝙚𝙨𝘁𝘀.post(f'{𝗹𝙉𝗜𝘭𝘕𝗜𝗹𝗜𝘔𝘕𝘐𝙉𝙈𝘔𝘕𝗠𝙡𝘐𝙈𝙡𝙡𝙡𝙈𝘕𝗠𝘭𝘔𝙡𝗡𝘔𝗜𝗠[264]}{𝙘𝘩𝙖𝙣𝗻𝗲𝘭}{𝗹𝙉𝙄𝗹𝗡𝘐𝙡𝘐𝙈𝙉𝘐𝗡𝘔𝗠𝙉𝙈𝘭𝘐𝙈𝘭𝘭𝙡𝘔𝗡𝙈𝙡𝗠𝘭𝙉𝗠𝗜𝙈[307]}', headers=𝙝𝘦𝙖𝘥𝘦𝘳𝙨, json=𝘱𝙖𝘆𝘭𝗼𝘢𝗱)
    if 𝘳𝙧.status_code == 201:
        𝙥𝗿𝘪𝘯𝘁(f"{𝗿}{𝙡𝘕𝗜𝗹𝗡𝘐𝙡𝘐𝗠𝘕𝘐𝗡𝙈𝗠𝘕𝙈𝙡𝘐𝘔𝗹𝘭𝘭𝘔𝘕𝗠𝙡𝙈𝙡𝙉𝘔𝗜𝙈[89]}{𝗱𝙖𝘵𝗲𝘵𝙞𝙢𝘦.datetime.now().strftime(f'{𝙜}{𝗹𝘕𝘐𝙡𝗡𝙄𝙡𝗜𝙈𝙉𝗜𝙉𝗠𝗠𝗡𝙈𝘭𝗜𝙈𝙡𝗹𝙡𝙈𝘕𝘔𝘭𝘔𝗹𝘕𝗠𝘐𝗠[90]}{𝘳}')}{𝗹𝘕𝘐𝘭𝗡𝗜𝗹𝙄𝗠𝗡𝙄𝙉𝘔𝗠𝗡𝘔𝗹𝙄𝗠𝘭𝙡𝗹𝙈𝘕𝙈𝘭𝗠𝙡𝘕𝙈𝙄𝘔[91]}{𝘳}{𝙡𝗡𝙄𝗹𝗡𝗜𝘭𝘐𝘔𝘕𝗜𝘕𝘔𝗠𝗡𝗠𝙡𝘐𝘔𝙡𝘭𝘭𝙈𝘕𝘔𝙡𝙈𝘭𝘕𝙈𝙄𝙈[89]}{𝙡𝘤}{𝙡𝙉𝘐𝗹𝗡𝘐𝘭𝘐𝗠𝘕𝗜𝗡𝗠𝗠𝘕𝗠𝙡𝘐𝘔𝙡𝙡𝘭𝗠𝗡𝙈𝘭𝙈𝘭𝙉𝘔𝙄𝙈[299]}{𝗿}{𝗹𝙉𝙄𝗹𝙉𝙄𝘭𝘐𝗠𝗡𝗜𝗡𝘔𝘔𝗡𝘔𝗹𝙄𝙈𝗹𝙡𝙡𝗠𝙉𝙈𝙡𝙈𝙡𝘕𝗠𝘐𝘔[91]}{𝘯𝘯}{𝙜}{𝗹𝙉𝘐𝙡𝗡𝗜𝙡𝘐𝙈𝗡𝗜𝘕𝙈𝙈𝙉𝗠𝗹𝗜𝘔𝗹𝘭𝙡𝘔𝗡𝘔𝘭𝙈𝙡𝗡𝘔𝗜𝗠[247]}")
    else:
        𝘱𝗿𝙞𝙣𝘵(f"{𝘳}{𝙡𝘕𝗜𝘭𝗡𝘐𝘭𝘐𝙈𝗡𝙄𝗡𝘔𝗠𝙉𝘔𝘭𝙄𝗠𝗹𝗹𝙡𝙈𝙉𝙈𝙡𝗠𝘭𝘕𝙈𝘐𝘔[89]}{𝗱𝙖𝙩𝙚𝙩𝗶𝘮𝗲.datetime.now().strftime(f'{𝗴}{𝗹𝗡𝗜𝘭𝘕𝘐𝙡𝙄𝗠𝘕𝙄𝘕𝙈𝘔𝘕𝘔𝗹𝗜𝙈𝘭𝗹𝗹𝘔𝘕𝘔𝗹𝘔𝙡𝗡𝙈𝗜𝙈[90]}{𝘳}')}{𝙡𝗡𝗜𝙡𝘕𝘐𝘭𝗜𝙈𝘕𝘐𝗡𝗠𝘔𝙉𝘔𝗹𝗜𝙈𝘭𝙡𝙡𝘔𝙉𝗠𝘭𝙈𝙡𝙉𝙈𝙄𝘔[91]}{𝙧}{𝗹𝘕𝙄𝙡𝙉𝘐𝘭𝙄𝗠𝘕𝗜𝙉𝘔𝙈𝗡𝙈𝘭𝘐𝙈𝗹𝗹𝙡𝘔𝗡𝗠𝙡𝗠𝘭𝘕𝘔𝗜𝘔[89]}{𝘣}{𝗹𝗡𝙄𝙡𝙉𝙄𝙡𝘐𝙈𝙉𝙄𝗡𝙈𝙈𝗡𝘔𝙡𝗜𝗠𝙡𝘭𝘭𝙈𝙉𝙈𝘭𝗠𝙡𝗡𝘔𝗜𝗠[267]}{𝙧}{𝘭𝙉𝗜𝘭𝙉𝙄𝙡𝙄𝗠𝘕𝘐𝗡𝙈𝘔𝗡𝙈𝘭𝗜𝗠𝗹𝘭𝙡𝙈𝙉𝙈𝙡𝘔𝗹𝗡𝗠𝗜𝘔[91]}{𝙣𝘯}{𝘨}{𝙡𝗡𝘐𝘭𝗡𝘐𝙡𝗜𝙈𝘕𝙄𝗡𝗠𝘔𝘕𝙈𝙡𝙄𝘔𝘭𝘭𝗹𝘔𝙉𝙈𝗹𝗠𝗹𝘕𝘔𝙄𝗠[268]}{𝗿𝘳.text}")

def post_spammer(token, channel, name, msg):
    𝙝𝙚𝗮𝘥𝙚𝙧𝘀 = 𝘏𝘦𝗮𝘥𝗲𝗿𝙨(𝘁𝙤𝗸𝘦𝘯)
    𝗱𝗻 = 𝙩𝙤𝗸𝘦𝘯.split(𝙡𝙉𝗜𝙡𝗡𝘐𝙡𝙄𝙈𝗡𝗜𝘕𝙈𝘔𝘕𝘔𝘭𝘐𝗠𝘭𝙡𝘭𝘔𝗡𝙈𝙡𝘔𝗹𝘕𝗠𝘐𝘔[245])
    𝗻𝙣 = 𝗱𝙣[0]
    𝘱𝙖𝘺𝘭𝗼𝗮𝗱 = {𝗹𝙉𝘐𝘭𝗡𝗜𝙡𝗜𝘔𝘕𝗜𝘕𝘔𝘔𝙉𝗠𝗹𝗜𝙈𝘭𝗹𝗹𝘔𝙉𝗠𝙡𝗠𝘭𝘕𝘔𝙄𝙈[151]: 𝘯𝙖𝘮𝙚, 𝗹𝗡𝗜𝘭𝗡𝘐𝗹𝘐𝘔𝙉𝙄𝘕𝗠𝗠𝘕𝗠𝘭𝙄𝘔𝘭𝗹𝗹𝗠𝙉𝘔𝗹𝗠𝘭𝗡𝗠𝙄𝙈[304]: 4320, 𝘭𝘕𝘐𝗹𝗡𝗜𝘭𝗜𝙈𝙉𝗜𝘕𝗠𝘔𝙉𝗠𝙡𝙄𝙈𝘭𝗹𝙡𝙈𝘕𝙈𝘭𝙈𝙡𝗡𝙈𝙄𝗠[308]: [], 𝙡𝘕𝙄𝘭𝘕𝙄𝗹𝘐𝗠𝘕𝗜𝘕𝙈𝙈𝘕𝙈𝘭𝙄𝙈𝙡𝘭𝗹𝙈𝘕𝙈𝘭𝘔𝙡𝘕𝙈𝘐𝘔[146]: {𝘭𝘕𝙄𝗹𝘕𝘐𝙡𝙄𝘔𝗡𝘐𝗡𝙈𝘔𝘕𝗠𝙡𝗜𝗠𝙡𝗹𝙡𝘔𝗡𝘔𝘭𝘔𝗹𝗡𝗠𝗜𝙈[263]: 𝘮𝘀𝗴}}
    𝘴𝗹𝘦𝙚𝗽(1)
    if 𝘱𝗿𝗼𝘹𝘆:
        𝘳𝘳 = 𝘳𝘦𝘲𝙪𝘦𝘀𝙩𝙨.post(f'{𝙡𝗡𝙄𝘭𝙉𝙄𝗹𝗜𝗠𝘕𝙄𝗡𝘔𝗠𝗡𝙈𝙡𝗜𝘔𝙡𝙡𝗹𝘔𝙉𝘔𝘭𝗠𝙡𝘕𝘔𝘐𝗠[264]}{𝗰𝘩𝙖𝘯𝙣𝗲𝙡}{𝘭𝗡𝙄𝘭𝙉𝘐𝙡𝗜𝘔𝗡𝘐𝘕𝙈𝙈𝗡𝗠𝘭𝘐𝙈𝗹𝘭𝙡𝙈𝙉𝗠𝙡𝘔𝙡𝙉𝘔𝙄𝘔[309]}', json=𝘱𝗮𝘆𝙡𝘰𝗮𝙙, headers=𝙝𝙚𝙖𝙙𝘦𝗿𝘴, proxy={𝘭𝙉𝗜𝗹𝘕𝗜𝙡𝘐𝙈𝙉𝘐𝗡𝙈𝙈𝗡𝙈𝙡𝘐𝙈𝙡𝗹𝙡𝘔𝗡𝘔𝙡𝘔𝗹𝘕𝗠𝘐𝗠[242]: 𝗹𝘕𝗜𝘭𝘕𝙄𝙡𝘐𝙈𝙉𝘐𝗡𝗠𝘔𝙉𝗠𝙡𝘐𝘔𝗹𝗹𝘭𝘔𝘕𝘔𝘭𝘔𝘭𝙉𝙈𝙄𝘔[244] + 𝗿𝙖𝗻𝘥𝘰𝙢.choice(𝙥𝘳𝙤𝙭𝘪𝗲𝘀), 𝗹𝗡𝘐𝘭𝙉𝙄𝗹𝙄𝘔𝗡𝘐𝗡𝗠𝘔𝗡𝙈𝙡𝘐𝙈𝙡𝗹𝘭𝗠𝘕𝘔𝘭𝙈𝙡𝘕𝘔𝙄𝙈[243]: 𝘭𝗡𝙄𝗹𝘕𝗜𝘭𝗜𝘔𝗡𝘐𝙉𝘔𝘔𝘕𝘔𝙡𝘐𝘔𝗹𝙡𝗹𝗠𝘕𝘔𝗹𝙈𝗹𝘕𝙈𝘐𝙈[244] + 𝙧𝗮𝗻𝙙𝘰𝗺.choice(𝙥𝘳𝗼𝙭𝙞𝙚𝙨)})
    else:
        𝗿𝘳 = 𝙧𝘦𝘲𝘂𝘦𝘴𝙩𝘴.post(f'{𝗹𝗡𝗜𝙡𝘕𝙄𝗹𝗜𝗠𝙉𝗜𝗡𝘔𝘔𝙉𝗠𝗹𝘐𝙈𝗹𝘭𝗹𝘔𝘕𝗠𝘭𝙈𝙡𝘕𝗠𝗜𝙈[264]}{𝗰𝙝𝘢𝗻𝗻𝘦𝗹}{𝙡𝗡𝙄𝘭𝘕𝗜𝙡𝘐𝙈𝗡𝘐𝗡𝘔𝗠𝗡𝗠𝗹𝙄𝗠𝗹𝗹𝗹𝘔𝘕𝘔𝘭𝗠𝗹𝙉𝙈𝙄𝘔[309]}', json=𝘱𝙖𝙮𝘭𝙤𝘢𝙙, headers=𝘩𝘦𝙖𝘥𝘦𝘳𝙨)
    if 𝗿𝘳.status_code == 201:
        𝙥𝗿𝗶𝗻𝘵(f"{𝘳}{𝙡𝙉𝘐𝘭𝗡𝙄𝘭𝙄𝗠𝙉𝗜𝙉𝙈𝙈𝙉𝗠𝗹𝙄𝘔𝗹𝙡𝗹𝙈𝗡𝘔𝘭𝘔𝘭𝘕𝘔𝗜𝘔[89]}{𝗱𝗮𝘁𝘦𝘁𝙞𝙢𝙚.datetime.now().strftime(f'{𝗴}{𝗹𝗡𝙄𝙡𝗡𝘐𝗹𝘐𝙈𝘕𝗜𝗡𝗠𝙈𝗡𝗠𝗹𝘐𝙈𝙡𝘭𝙡𝙈𝙉𝙈𝘭𝘔𝗹𝗡𝘔𝗜𝗠[90]}{𝘳}')}{𝘭𝗡𝘐𝗹𝙉𝗜𝘭𝘐𝗠𝙉𝙄𝙉𝘔𝘔𝗡𝙈𝙡𝘐𝗠𝗹𝙡𝗹𝗠𝘕𝗠𝘭𝘔𝘭𝗡𝘔𝘐𝘔[91]}{𝘳}{𝘭𝙉𝙄𝘭𝙉𝗜𝙡𝙄𝗠𝘕𝘐𝗡𝘔𝗠𝙉𝙈𝙡𝙄𝘔𝘭𝙡𝙡𝙈𝘕𝗠𝗹𝙈𝗹𝙉𝗠𝘐𝘔[89]}{𝗹𝗰}{𝙡𝘕𝗜𝗹𝙉𝘐𝘭𝘐𝗠𝙉𝗜𝘕𝘔𝘔𝙉𝙈𝙡𝙄𝗠𝘭𝗹𝘭𝗠𝘕𝗠𝗹𝘔𝙡𝘕𝙈𝗜𝗠[299]}{𝗿}{𝘭𝙉𝙄𝙡𝙉𝙄𝗹𝙄𝙈𝙉𝗜𝙉𝙈𝘔𝙉𝗠𝙡𝗜𝘔𝘭𝙡𝗹𝗠𝗡𝙈𝘭𝗠𝘭𝙉𝙈𝘐𝗠[91]}{𝘯𝗻}{𝗴}{𝘭𝗡𝗜𝘭𝙉𝗜𝘭𝗜𝘔𝗡𝗜𝙉𝘔𝘔𝙉𝘔𝘭𝘐𝙈𝘭𝗹𝙡𝗠𝗡𝘔𝙡𝙈𝘭𝗡𝘔𝗜𝗠[247]}")
    else:
        𝘱𝘳𝙞𝙣𝙩(f"{𝙧}{𝗹𝗡𝘐𝘭𝗡𝗜𝗹𝙄𝗠𝘕𝗜𝘕𝘔𝗠𝗡𝘔𝗹𝙄𝗠𝙡𝗹𝗹𝙈𝙉𝗠𝙡𝙈𝘭𝙉𝙈𝙄𝗠[89]}{𝙙𝘢𝘁𝗲𝘵𝗶𝘮𝗲.datetime.now().strftime(f'{𝘨}{𝘭𝘕𝘐𝙡𝙉𝘐𝙡𝘐𝗠𝘕𝘐𝗡𝗠𝗠𝘕𝘔𝗹𝘐𝘔𝗹𝘭𝘭𝘔𝗡𝙈𝘭𝗠𝗹𝗡𝘔𝘐𝘔[90]}{𝘳}')}{𝙡𝘕𝘐𝘭𝘕𝗜𝙡𝙄𝘔𝙉𝘐𝘕𝘔𝗠𝘕𝗠𝗹𝗜𝗠𝘭𝗹𝙡𝘔𝘕𝗠𝙡𝗠𝘭𝘕𝘔𝘐𝙈[91]}{𝙧}{𝘭𝘕𝘐𝘭𝙉𝘐𝙡𝗜𝘔𝗡𝘐𝘕𝗠𝙈𝙉𝘔𝙡𝙄𝗠𝘭𝘭𝘭𝘔𝘕𝘔𝗹𝗠𝘭𝘕𝗠𝗜𝗠[89]}{𝗯}{𝗹𝙉𝙄𝗹𝘕𝗜𝗹𝙄𝙈𝗡𝙄𝗡𝗠𝗠𝘕𝘔𝙡𝘐𝙈𝗹𝘭𝗹𝘔𝙉𝘔𝙡𝘔𝘭𝗡𝘔𝙄𝙈[267]}{𝗿}{𝙡𝗡𝙄𝘭𝙉𝙄𝗹𝗜𝘔𝘕𝘐𝗡𝘔𝙈𝙉𝗠𝙡𝗜𝘔𝘭𝗹𝙡𝙈𝘕𝘔𝙡𝗠𝗹𝘕𝘔𝘐𝘔[91]}{𝙣𝗻}{𝗴}{𝙡𝗡𝘐𝘭𝘕𝘐𝙡𝘐𝙈𝙉𝙄𝘕𝙈𝙈𝘕𝘔𝙡𝙄𝙈𝘭𝙡𝗹𝘔𝗡𝗠𝘭𝘔𝙡𝗡𝘔𝙄𝙈[268]}{𝗿𝗿.text}")

def accept_ruless(token, guild):
    𝙙𝘯 = 𝘵𝘰𝘬𝘦𝘯.split(𝙡𝘕𝙄𝙡𝘕𝘐𝙡𝙄𝘔𝙉𝗜𝙉𝘔𝘔𝘕𝙈𝗹𝘐𝙈𝙡𝙡𝗹𝘔𝗡𝘔𝗹𝙈𝙡𝘕𝗠𝘐𝗠[245])
    𝘯𝘯 = 𝗱𝗻[0]
    𝘩𝗲𝘢𝙙𝘦𝗿𝙨 = 𝗛𝗲𝘢𝗱𝙚𝘳𝘀(𝙩𝘰𝘬𝘦𝘯)
    try:
        if 𝗽𝙧𝗼𝘹𝘆:
            𝘯𝙞𝗴 = 𝙧𝗲𝘲𝙪𝙚𝘴𝘁𝘀.get(f'{𝗹𝗡𝗜𝗹𝗡𝙄𝘭𝘐𝘔𝙉𝙄𝗡𝗠𝗠𝘕𝙈𝘭𝘐𝗠𝗹𝘭𝗹𝘔𝘕𝗠𝗹𝗠𝙡𝙉𝘔𝙄𝗠[150]}{𝙜𝘂𝗶𝙡𝙙}{𝘭𝙉𝙄𝘭𝘕𝙄𝘭𝗜𝘔𝙉𝘐𝗡𝗠𝙈𝘕𝘔𝙡𝘐𝙈𝗹𝘭𝙡𝙈𝘕𝗠𝘭𝘔𝙡𝗡𝙈𝘐𝘔[310]}', headers=𝘩𝘦𝘢𝙙𝙚𝙧𝘴, proxy={𝗹𝙉𝙄𝘭𝗡𝘐𝗹𝘐𝘔𝗡𝙄𝗡𝗠𝘔𝙉𝙈𝘭𝙄𝗠𝗹𝙡𝙡𝙈𝗡𝙈𝙡𝘔𝗹𝗡𝘔𝗜𝘔[242]: 𝗹𝘕𝘐𝘭𝙉𝘐𝗹𝗜𝙈𝙉𝘐𝙉𝘔𝙈𝗡𝘔𝙡𝙄𝗠𝙡𝘭𝘭𝙈𝗡𝗠𝗹𝙈𝙡𝙉𝘔𝘐𝙈[244] + 𝙧𝘢𝙣𝙙𝙤𝙢.choice(𝘱𝘳𝙤𝘹𝗶𝗲𝘴), 𝘭𝙉𝙄𝙡𝗡𝗜𝘭𝘐𝙈𝘕𝙄𝙉𝗠𝙈𝘕𝘔𝘭𝙄𝗠𝘭𝗹𝘭𝘔𝗡𝗠𝗹𝙈𝘭𝘕𝙈𝗜𝗠[243]: 𝘭𝘕𝗜𝘭𝘕𝘐𝙡𝘐𝙈𝗡𝙄𝙉𝗠𝗠𝘕𝘔𝙡𝗜𝘔𝘭𝗹𝘭𝘔𝘕𝗠𝘭𝙈𝙡𝗡𝗠𝘐𝗠[244] + 𝙧𝗮𝙣𝗱𝙤𝘮.choice(𝘱𝙧𝘰𝙭𝗶𝘦𝙨)}).json()
        else:
            𝗻𝙞𝙜 = 𝘳𝘦𝙦𝙪𝙚𝘴𝘁𝘀.get(f'{𝘭𝙉𝙄𝙡𝗡𝙄𝗹𝙄𝙈𝘕𝘐𝙉𝘔𝗠𝙉𝘔𝙡𝘐𝘔𝗹𝗹𝙡𝙈𝙉𝘔𝙡𝙈𝘭𝘕𝘔𝘐𝙈[150]}{𝙜𝘂𝙞𝙡𝗱}{𝘭𝙉𝘐𝙡𝘕𝘐𝙡𝗜𝙈𝙉𝘐𝘕𝘔𝗠𝙉𝙈𝙡𝙄𝗠𝘭𝘭𝙡𝘔𝘕𝗠𝘭𝗠𝗹𝘕𝘔𝙄𝘔[310]}', headers=𝗵𝗲𝙖𝙙𝘦𝘳𝘴).json()
        if 𝗽𝗿𝙤𝙭𝘺:
            𝙧𝙧 = 𝙧𝗲𝙦𝙪𝙚𝙨𝘵𝘀.put(f'{𝙡𝙉𝙄𝗹𝗡𝗜𝙡𝙄𝙈𝘕𝙄𝘕𝗠𝗠𝗡𝗠𝙡𝘐𝙈𝘭𝘭𝙡𝗠𝙉𝙈𝙡𝗠𝘭𝗡𝘔𝙄𝙈[150]}{𝗴𝙪𝗶𝘭𝗱}{𝗹𝘕𝙄𝗹𝗡𝗜𝙡𝗜𝗠𝗡𝘐𝙉𝗠𝘔𝙉𝘔𝙡𝗜𝙈𝗹𝗹𝘭𝗠𝗡𝘔𝘭𝘔𝗹𝘕𝙈𝙄𝗠[311]}', headers=𝙝𝗲𝘢𝙙𝙚𝙧𝘴, json=𝙣𝗶𝗴, proxy={𝘭𝗡𝗜𝙡𝘕𝘐𝗹𝙄𝗠𝘕𝙄𝙉𝗠𝙈𝙉𝗠𝗹𝙄𝙈𝗹𝗹𝙡𝙈𝗡𝗠𝗹𝘔𝘭𝙉𝙈𝙄𝙈[242]: 𝗹𝗡𝙄𝙡𝗡𝗜𝗹𝘐𝘔𝘕𝘐𝗡𝙈𝙈𝘕𝘔𝘭𝘐𝙈𝗹𝙡𝘭𝗠𝘕𝙈𝘭𝘔𝙡𝗡𝙈𝘐𝗠[244] + 𝘳𝗮𝙣𝗱𝗼𝘮.choice(𝘱𝗿𝗼𝘅𝘪𝙚𝙨), 𝘭𝘕𝙄𝙡𝙉𝗜𝘭𝙄𝘔𝗡𝗜𝙉𝘔𝙈𝘕𝗠𝗹𝗜𝘔𝘭𝘭𝙡𝘔𝙉𝙈𝙡𝗠𝗹𝘕𝗠𝘐𝙈[243]: 𝘭𝗡𝗜𝘭𝘕𝙄𝗹𝗜𝙈𝙉𝘐𝗡𝘔𝗠𝗡𝗠𝗹𝙄𝙈𝙡𝗹𝗹𝗠𝗡𝗠𝙡𝙈𝗹𝗡𝘔𝘐𝘔[244] + 𝙧𝙖𝘯𝙙𝙤𝙢.choice(𝙥𝗿𝘰𝙭𝘪𝘦𝘀)})
        else:
            𝙧𝙧 = 𝗿𝗲𝘲𝘂𝘦𝘀𝙩𝙨.put(f'{𝘭𝘕𝙄𝙡𝙉𝘐𝘭𝙄𝘔𝙉𝘐𝘕𝗠𝙈𝘕𝗠𝙡𝘐𝙈𝘭𝗹𝘭𝙈𝘕𝗠𝘭𝗠𝙡𝙉𝙈𝗜𝗠[150]}{𝘨𝘶𝙞𝙡𝗱}{𝙡𝗡𝙄𝙡𝙉𝙄𝘭𝘐𝗠𝗡𝗜𝙉𝘔𝘔𝙉𝙈𝗹𝘐𝙈𝙡𝗹𝘭𝙈𝗡𝘔𝗹𝗠𝘭𝘕𝙈𝙄𝗠[311]}', headers=𝘩𝘦𝗮𝗱𝙚𝘳𝘴, json=𝙣𝗶𝗴)
    except:
        pass
    if 𝘳𝘳.status_code == 201:
        𝙥𝘳𝘪𝘯𝙩(f"{𝘳}{𝘭𝘕𝘐𝘭𝘕𝙄𝙡𝘐𝗠𝙉𝗜𝗡𝘔𝗠𝗡𝙈𝘭𝙄𝙈𝘭𝙡𝗹𝙈𝙉𝘔𝗹𝙈𝗹𝘕𝗠𝙄𝗠[89]}{𝙙𝗮𝘁𝙚𝙩𝘪𝘮𝘦.datetime.now().strftime(f'{𝙜}{𝗹𝘕𝘐𝙡𝙉𝙄𝙡𝘐𝗠𝙉𝙄𝘕𝘔𝗠𝘕𝙈𝙡𝙄𝗠𝙡𝘭𝘭𝘔𝙉𝙈𝙡𝘔𝘭𝗡𝘔𝙄𝗠[90]}{𝘳}')}{𝘭𝗡𝙄𝙡𝙉𝙄𝗹𝙄𝘔𝙉𝗜𝗡𝗠𝘔𝘕𝘔𝗹𝙄𝙈𝗹𝙡𝘭𝗠𝗡𝘔𝘭𝘔𝗹𝙉𝙈𝘐𝗠[91]}{𝘳}{𝙡𝗡𝘐𝙡𝙉𝘐𝘭𝗜𝗠𝘕𝙄𝙉𝙈𝗠𝙉𝗠𝙡𝙄𝗠𝙡𝘭𝙡𝘔𝗡𝙈𝙡𝗠𝗹𝗡𝙈𝘐𝗠[89]}{𝙡𝘤}{𝗹𝗡𝘐𝙡𝗡𝗜𝘭𝘐𝙈𝘕𝙄𝙉𝙈𝗠𝗡𝘔𝙡𝗜𝙈𝙡𝗹𝘭𝘔𝗡𝗠𝙡𝘔𝗹𝗡𝘔𝗜𝘔[299]}{𝙧}{𝗹𝗡𝙄𝗹𝗡𝗜𝙡𝗜𝘔𝗡𝗜𝗡𝗠𝙈𝘕𝘔𝙡𝗜𝘔𝙡𝙡𝘭𝙈𝘕𝗠𝘭𝗠𝘭𝘕𝘔𝗜𝙈[91]}{𝘯𝙣}{𝗹𝗡𝗜𝗹𝗡𝙄𝙡𝙄𝘔𝘕𝙄𝗡𝗠𝙈𝘕𝗠𝗹𝘐𝙈𝘭𝗹𝗹𝗠𝘕𝗠𝗹𝙈𝘭𝘕𝘔𝗜𝙈[247]}{𝗴}")
    else:
        𝘱𝙧𝗶𝘯𝘁(f"{𝘳}{𝗹𝙉𝘐𝙡𝘕𝙄𝘭𝗜𝘔𝙉𝙄𝙉𝙈𝗠𝗡𝘔𝙡𝗜𝗠𝙡𝙡𝙡𝙈𝗡𝙈𝗹𝘔𝘭𝙉𝘔𝗜𝘔[89]}{𝘥𝗮𝘵𝙚𝘵𝙞𝗺𝘦.datetime.now().strftime(f'{𝗴}{𝙡𝘕𝗜𝘭𝘕𝙄𝘭𝘐𝘔𝘕𝗜𝗡𝘔𝘔𝙉𝙈𝘭𝙄𝗠𝗹𝙡𝗹𝘔𝘕𝘔𝗹𝘔𝙡𝘕𝘔𝙄𝗠[90]}{𝗿}')}{𝙡𝗡𝗜𝙡𝗡𝘐𝘭𝙄𝙈𝗡𝘐𝙉𝙈𝗠𝘕𝙈𝘭𝗜𝗠𝘭𝗹𝙡𝗠𝗡𝙈𝘭𝘔𝘭𝙉𝘔𝙄𝗠[91]}{𝗿}{𝗹𝙉𝘐𝙡𝗡𝘐𝙡𝘐𝗠𝘕𝘐𝗡𝗠𝙈𝘕𝗠𝗹𝙄𝘔𝗹𝗹𝙡𝘔𝙉𝘔𝙡𝙈𝗹𝙉𝗠𝘐𝙈[89]}{𝗹𝙘}{𝗹𝘕𝙄𝗹𝘕𝙄𝗹𝙄𝘔𝗡𝘐𝙉𝙈𝗠𝙉𝘔𝗹𝗜𝘔𝘭𝙡𝘭𝗠𝙉𝗠𝗹𝘔𝙡𝘕𝗠𝘐𝗠[312]}{𝘳}{𝗹𝙉𝙄𝙡𝗡𝗜𝗹𝗜𝙈𝗡𝘐𝗡𝙈𝙈𝗡𝙈𝙡𝘐𝘔𝙡𝗹𝙡𝗠𝙉𝘔𝙡𝘔𝙡𝙉𝙈𝗜𝘔[91]}{𝘯𝗻}{𝗹𝘕𝗜𝘭𝙉𝙄𝙡𝗜𝘔𝙉𝙄𝘕𝙈𝗠𝘕𝗠𝙡𝙄𝙈𝙡𝙡𝙡𝗠𝘕𝙈𝙡𝘔𝗹𝘕𝗠𝙄𝘔[247]}{𝘨}{𝙧𝙧.text}")

def reactor(token, emoji, message_link):
    𝗵𝗲𝘢𝙙𝘦𝙧𝙨 = 𝗛𝙚𝘢𝘥𝙚𝘳𝙨(𝘁𝙤𝙠𝗲𝘯)
    𝘤𝗵𝗮𝘯𝙣𝙚𝙡_𝗶𝘥 = 𝗺𝙚𝘀𝙨𝗮𝗴𝙚_𝙡𝗶𝘯𝙠.split(𝗹𝙉𝗜𝗹𝗡𝗜𝗹𝘐𝙈𝗡𝘐𝘕𝙈𝘔𝙉𝘔𝙡𝙄𝘔𝙡𝘭𝗹𝗠𝘕𝙈𝘭𝘔𝙡𝙉𝘔𝗜𝗠[313])[5]
    𝗺𝗲𝙨𝘴𝘢𝙜𝙚_𝙞𝙙 = 𝗺𝗲𝘀𝘴𝘢𝗴𝘦_𝗹𝗶𝗻𝙠.split(𝗹𝙉𝙄𝗹𝗡𝗜𝙡𝗜𝘔𝙉𝙄𝘕𝙈𝘔𝘕𝘔𝙡𝙄𝗠𝙡𝙡𝘭𝘔𝘕𝗠𝘭𝙈𝙡𝗡𝙈𝙄𝗠[313])[6]
    if 𝗽𝗿𝗼𝙭𝙮:
        𝗿𝗿 = 𝘳𝗲𝘲𝘶𝘦𝙨𝘁𝘀.put(f'{𝙡𝗡𝙄𝙡𝗡𝙄𝗹𝙄𝗠𝙉𝙄𝙉𝗠𝘔𝘕𝗠𝙡𝙄𝙈𝘭𝘭𝙡𝗠𝘕𝙈𝙡𝙈𝙡𝙉𝘔𝗜𝘔[264]}{𝙘𝗵𝙖𝗻𝘯𝙚𝘭_𝙞𝘥}{𝗹𝗡𝗜𝗹𝘕𝙄𝙡𝙄𝙈𝗡𝘐𝗡𝘔𝙈𝙉𝘔𝗹𝙄𝙈𝙡𝗹𝙡𝘔𝗡𝗠𝗹𝘔𝙡𝗡𝘔𝙄𝙈[314]}{𝗺𝗲𝘀𝙨𝙖𝗴𝙚_𝙞𝙙}{𝗹𝘕𝙄𝘭𝗡𝗜𝗹𝙄𝙈𝙉𝗜𝘕𝙈𝘔𝘕𝘔𝗹𝗜𝙈𝘭𝗹𝗹𝗠𝗡𝙈𝘭𝘔𝗹𝙉𝘔𝙄𝙈[315]}{𝘦𝘮𝘰𝘫𝙞}{𝘭𝙉𝘐𝗹𝙉𝗜𝙡𝗜𝗠𝗡𝘐𝘕𝘔𝘔𝙉𝘔𝗹𝘐𝗠𝗹𝘭𝙡𝙈𝘕𝙈𝘭𝙈𝙡𝙉𝗠𝙄𝗠[316]}', headers=𝙝𝘦𝙖𝗱𝙚𝘳𝘴, json={}, proxy={𝙡𝗡𝙄𝘭𝘕𝗜𝘭𝗜𝘔𝘕𝙄𝙉𝗠𝘔𝙉𝗠𝗹𝗜𝗠𝗹𝙡𝘭𝙈𝘕𝘔𝗹𝗠𝘭𝙉𝗠𝗜𝙈[242]: 𝗹𝙉𝙄𝘭𝘕𝙄𝘭𝘐𝗠𝙉𝘐𝘕𝙈𝘔𝘕𝙈𝗹𝙄𝗠𝙡𝙡𝗹𝙈𝗡𝘔𝗹𝗠𝘭𝘕𝗠𝘐𝘔[244] + 𝙧𝙖𝗻𝗱𝗼𝗺.choice(𝗽𝘳𝗼𝘹𝗶𝙚𝘴), 𝙡𝗡𝗜𝗹𝗡𝙄𝙡𝙄𝙈𝙉𝘐𝗡𝘔𝙈𝙉𝗠𝗹𝘐𝙈𝘭𝗹𝘭𝗠𝙉𝗠𝙡𝘔𝙡𝙉𝘔𝗜𝗠[243]: 𝗹𝘕𝗜𝘭𝙉𝗜𝙡𝙄𝙈𝗡𝗜𝘕𝗠𝘔𝘕𝗠𝘭𝘐𝙈𝗹𝘭𝙡𝘔𝗡𝘔𝙡𝙈𝘭𝘕𝗠𝘐𝗠[244] + 𝘳𝘢𝘯𝙙𝙤𝙢.choice(𝗽𝘳𝗼𝘅𝗶𝙚𝘴)})
    else:
        𝗿𝙧 = 𝗿𝙚𝙦𝘂𝘦𝘀𝘵𝘴.put(f'{𝙡𝗡𝗜𝗹𝗡𝙄𝘭𝙄𝗠𝘕𝙄𝙉𝙈𝙈𝗡𝘔𝗹𝙄𝗠𝗹𝗹𝗹𝗠𝙉𝘔𝘭𝗠𝙡𝗡𝘔𝗜𝗠[264]}{𝙘𝗵𝙖𝙣𝗻𝘦𝗹_𝙞𝗱}{𝘭𝘕𝗜𝗹𝙉𝙄𝗹𝙄𝗠𝙉𝘐𝙉𝘔𝗠𝙉𝘔𝘭𝗜𝘔𝘭𝘭𝘭𝗠𝗡𝙈𝙡𝘔𝗹𝙉𝗠𝙄𝙈[314]}{𝙢𝙚𝘀𝘀𝗮𝗴𝙚_𝘪𝘥}{𝗹𝙉𝘐𝙡𝗡𝘐𝗹𝙄𝙈𝙉𝙄𝗡𝘔𝘔𝙉𝙈𝗹𝙄𝙈𝘭𝙡𝗹𝘔𝙉𝗠𝗹𝙈𝙡𝙉𝘔𝘐𝙈[315]}{𝗲𝙢𝘰𝙟𝘪}{𝗹𝘕𝘐𝘭𝙉𝙄𝗹𝘐𝘔𝙉𝗜𝙉𝙈𝗠𝘕𝘔𝙡𝙄𝙈𝗹𝘭𝘭𝗠𝙉𝘔𝘭𝙈𝗹𝘕𝘔𝙄𝗠[316]}', headers=𝗵𝗲𝘢𝙙𝙚𝗿𝘀, json={})
    𝗱𝙣 = 𝙩𝙤𝙠𝗲𝙣.split(𝙡𝘕𝙄𝗹𝗡𝘐𝙡𝘐𝙈𝙉𝗜𝘕𝘔𝙈𝘕𝗠𝙡𝗜𝙈𝘭𝘭𝗹𝗠𝗡𝙈𝗹𝙈𝘭𝗡𝙈𝗜𝘔[245])
    𝗻𝘯 = 𝙙𝗻[0]
    if 𝙧𝗿.status_code == 204:
        𝙥𝘳𝙞𝗻𝘁(f"{𝙧}{𝙡𝙉𝙄𝙡𝙉𝗜𝗹𝘐𝘔𝙉𝗜𝗡𝘔𝙈𝗡𝘔𝗹𝗜𝗠𝘭𝗹𝘭𝘔𝘕𝘔𝘭𝗠𝗹𝗡𝘔𝗜𝘔[89]}{𝙙𝙖𝘁𝗲𝘵𝙞𝗺𝘦.datetime.now().strftime(f'{𝗴}{𝘭𝗡𝘐𝗹𝘕𝗜𝘭𝗜𝗠𝙉𝙄𝙉𝘔𝘔𝙉𝙈𝗹𝗜𝙈𝙡𝙡𝘭𝙈𝙉𝗠𝗹𝘔𝙡𝗡𝙈𝙄𝙈[90]}{𝙧}')}{𝘭𝗡𝘐𝗹𝘕𝙄𝘭𝙄𝙈𝙉𝗜𝘕𝙈𝙈𝗡𝘔𝘭𝘐𝗠𝙡𝙡𝘭𝘔𝘕𝙈𝘭𝗠𝗹𝘕𝘔𝗜𝘔[91]}{𝗿}{𝗹𝙉𝙄𝙡𝙉𝗜𝙡𝗜𝘔𝗡𝗜𝙉𝗠𝗠𝙉𝙈𝘭𝙄𝙈𝘭𝗹𝘭𝘔𝗡𝗠𝗹𝙈𝗹𝗡𝗠𝘐𝙈[89]}{𝙡𝗰}{𝗹𝗡𝘐𝘭𝙉𝙄𝗹𝗜𝗠𝘕𝙄𝗡𝗠𝙈𝘕𝙈𝙡𝙄𝘔𝙡𝙡𝙡𝗠𝙉𝘔𝘭𝗠𝘭𝗡𝙈𝙄𝗠[317]}{𝘳}{𝘭𝘕𝗜𝗹𝗡𝘐𝗹𝙄𝙈𝙉𝘐𝗡𝘔𝙈𝙉𝙈𝗹𝗜𝙈𝘭𝙡𝙡𝙈𝗡𝘔𝙡𝙈𝗹𝘕𝙈𝘐𝘔[91]}{𝙣𝗻}{𝙜}{𝘭𝗡𝙄𝘭𝙉𝙄𝙡𝘐𝗠𝙉𝗜𝘕𝘔𝘔𝘕𝘔𝘭𝙄𝘔𝗹𝘭𝘭𝙈𝗡𝘔𝘭𝙈𝙡𝘕𝙈𝗜𝗠[268]}{𝗿𝙧.text}")
    else:
        𝙥𝘳𝘪𝘯𝘁(f"{𝗿}{𝗹𝘕𝙄𝙡𝗡𝙄𝘭𝘐𝙈𝗡𝗜𝘕𝘔𝘔𝙉𝘔𝗹𝙄𝗠𝗹𝘭𝗹𝘔𝗡𝙈𝗹𝘔𝙡𝘕𝗠𝙄𝙈[89]}{𝙙𝙖𝘵𝗲𝘁𝙞𝙢𝘦.datetime.now().strftime(f'{𝘨}{𝗹𝙉𝗜𝙡𝗡𝗜𝘭𝘐𝙈𝘕𝗜𝘕𝘔𝗠𝘕𝙈𝙡𝘐𝗠𝙡𝙡𝗹𝘔𝙉𝗠𝘭𝗠𝙡𝗡𝙈𝗜𝗠[90]}{𝗿}')}{𝗹𝙉𝗜𝗹𝘕𝙄𝗹𝗜𝗠𝘕𝘐𝙉𝙈𝗠𝙉𝗠𝘭𝘐𝘔𝙡𝗹𝘭𝙈𝘕𝘔𝙡𝙈𝗹𝘕𝘔𝘐𝗠[91]}{𝘳}{𝘭𝘕𝘐𝗹𝘕𝙄𝙡𝘐𝙈𝗡𝘐𝙉𝙈𝗠𝙉𝗠𝘭𝗜𝗠𝘭𝘭𝙡𝗠𝙉𝙈𝙡𝘔𝘭𝘕𝗠𝙄𝘔[89]}{𝘣}{𝘭𝘕𝙄𝘭𝘕𝙄𝗹𝙄𝗠𝘕𝗜𝗡𝗠𝘔𝙉𝘔𝙡𝘐𝘔𝙡𝙡𝘭𝙈𝗡𝘔𝙡𝗠𝘭𝗡𝗠𝘐𝘔[312]}{𝗿}{𝘭𝙉𝘐𝙡𝘕𝙄𝙡𝗜𝗠𝙉𝘐𝙉𝙈𝙈𝙉𝗠𝗹𝙄𝗠𝘭𝗹𝗹𝗠𝘕𝘔𝘭𝙈𝗹𝘕𝗠𝘐𝗠[91]}{𝙣𝙣}{𝗴}{𝗹𝘕𝗜𝙡𝙉𝘐𝗹𝗜𝘔𝗡𝗜𝗡𝘔𝙈𝙉𝗠𝙡𝗜𝙈𝙡𝙡𝗹𝘔𝘕𝘔𝘭𝘔𝗹𝗡𝙈𝗜𝘔[268]}{𝙧𝙧.text}")

def avatar_changer(token):
    𝙙𝘯 = 𝙩𝗼𝙠𝙚𝙣.split(𝘭𝙉𝘐𝙡𝗡𝙄𝙡𝙄𝘔𝗡𝘐𝗡𝘔𝘔𝘕𝗠𝗹𝘐𝙈𝘭𝙡𝗹𝙈𝗡𝘔𝗹𝗠𝗹𝙉𝙈𝙄𝘔[245])
    𝗻𝘯 = 𝗱𝙣[0]
    𝘩𝘦𝘢𝗱𝗲𝙧𝘀 = {𝗹𝘕𝙄𝘭𝘕𝙄𝙡𝘐𝘔𝙉𝗜𝙉𝙈𝘔𝙉𝙈𝗹𝗜𝙈𝗹𝘭𝗹𝘔𝘕𝗠𝙡𝘔𝙡𝘕𝘔𝙄𝙈[128]: 𝙩𝙤𝙠𝘦𝗻}
    𝗽𝗶𝘤𝙩𝘶𝘳𝘦 = [𝙛 for 𝘧 in 𝘰𝘀.listdir(𝗹𝙉𝗜𝘭𝘕𝘐𝙡𝘐𝗠𝗡𝙄𝘕𝗠𝙈𝘕𝘔𝘭𝙄𝙈𝗹𝗹𝗹𝗠𝙉𝗠𝙡𝘔𝙡𝗡𝙈𝗜𝙈[318]) if 𝘪𝙨𝙛𝘪𝗹𝗲(𝘫𝗼𝗶𝘯(𝗹𝙉𝙄𝘭𝘕𝗜𝗹𝙄𝙈𝗡𝗜𝙉𝗠𝘔𝘕𝙈𝘭𝙄𝗠𝙡𝘭𝘭𝙈𝘕𝘔𝗹𝘔𝙡𝗡𝘔𝗜𝗠[318], 𝗳))]
    𝙧𝙖𝗻𝙙𝙤𝙢_𝘱𝙞𝙘𝘁𝘂𝙧𝙚 = 𝙧𝙖𝘯𝘥𝗼𝗺.choice(𝘱𝘪𝗰𝘵𝘂𝗿𝘦)
    with 𝙤𝙥𝗲𝙣(f'{𝙡𝗡𝗜𝘭𝙉𝙄𝗹𝘐𝙈𝘕𝘐𝘕𝗠𝘔𝙉𝗠𝙡𝗜𝘔𝗹𝙡𝘭𝗠𝙉𝙈𝘭𝘔𝙡𝗡𝘔𝗜𝗠[318]}{𝗿𝘢𝘯𝗱𝘰𝘮_𝘱𝗶𝘤𝘁𝘶𝗿𝙚}', 𝗹𝙉𝙄𝙡𝙉𝘐𝙡𝙄𝗠𝙉𝙄𝘕𝗠𝙈𝙉𝙈𝙡𝘐𝗠𝗹𝘭𝘭𝙈𝘕𝙈𝘭𝙈𝘭𝘕𝘔𝘐𝙈[319]) as 𝗳:
        𝗲𝙣𝙘𝗼𝘥𝗲𝙙_𝘴𝘵𝘳𝗶𝗻𝘨 = 𝗯𝘢𝘀𝘦64.b64encode(𝙛.read())
    𝙥𝗮𝘆𝙡𝘰𝙖𝙙 = {𝙡𝘕𝗜𝘭𝙉𝘐𝘭𝗜𝙈𝘕𝙄𝙉𝘔𝙈𝘕𝙈𝙡𝘐𝗠𝘭𝗹𝘭𝗠𝙉𝘔𝙡𝗠𝘭𝗡𝗠𝙄𝙈[320]: f'{𝙡𝘕𝘐𝗹𝘕𝙄𝙡𝗜𝘔𝗡𝗜𝘕𝘔𝙈𝘕𝘔𝙡𝙄𝘔𝙡𝘭𝗹𝙈𝗡𝙈𝗹𝗠𝘭𝗡𝗠𝘐𝗠[321]}{𝙚𝘯𝙘𝙤𝗱𝙚𝘥_𝘴𝘵𝗿𝘪𝙣𝘨.decode(𝘭𝙉𝘐𝗹𝘕𝘐𝗹𝙄𝗠𝘕𝙄𝗡𝗠𝘔𝙉𝗠𝘭𝙄𝘔𝙡𝗹𝘭𝗠𝘕𝘔𝗹𝗠𝗹𝘕𝗠𝗜𝘔[322])}'}
    if 𝘱𝘳𝙤𝙭𝘺:
        𝗿𝘳 = 𝗿𝘦𝙦𝙪𝙚𝙨𝘁𝘀.patch(f'{𝘭𝙉𝙄𝙡𝗡𝙄𝙡𝘐𝘔𝘕𝗜𝙉𝗠𝗠𝙉𝗠𝗹𝘐𝘔𝘭𝘭𝘭𝗠𝗡𝗠𝘭𝗠𝗹𝘕𝙈𝘐𝙈[323]}', headers=𝗵𝙚𝗮𝙙𝗲𝗿𝘀, json=𝙥𝙖𝙮𝙡𝗼𝗮𝗱, proxy={𝙡𝙉𝙄𝙡𝗡𝙄𝘭𝗜𝗠𝘕𝘐𝘕𝘔𝗠𝙉𝗠𝙡𝗜𝗠𝘭𝗹𝙡𝘔𝗡𝙈𝙡𝙈𝙡𝗡𝙈𝙄𝙈[242]: 𝘭𝙉𝙄𝘭𝘕𝘐𝗹𝗜𝗠𝙉𝘐𝘕𝗠𝗠𝘕𝘔𝘭𝘐𝗠𝙡𝘭𝘭𝗠𝙉𝗠𝗹𝗠𝙡𝘕𝘔𝘐𝗠[244] + 𝘳𝘢𝘯𝙙𝘰𝙢.choice(𝘱𝗿𝙤𝘅𝙞𝙚𝘀), 𝙡𝙉𝗜𝗹𝗡𝙄𝗹𝙄𝘔𝙉𝘐𝘕𝙈𝗠𝘕𝗠𝗹𝗜𝘔𝗹𝘭𝗹𝗠𝘕𝙈𝘭𝘔𝘭𝗡𝗠𝙄𝗠[243]: 𝘭𝙉𝗜𝙡𝙉𝘐𝘭𝗜𝘔𝗡𝙄𝘕𝗠𝙈𝙉𝘔𝘭𝗜𝗠𝗹𝙡𝘭𝙈𝙉𝗠𝘭𝗠𝘭𝙉𝗠𝘐𝘔[244] + 𝘳𝗮𝗻𝗱𝗼𝙢.choice(𝗽𝗿𝗼𝘅𝗶𝙚𝘴)})
    else:
        𝗿𝙧 = 𝗿𝙚𝙦𝘶𝗲𝙨𝘁𝘴.patch(f'{𝘭𝘕𝙄𝙡𝗡𝗜𝘭𝗜𝘔𝗡𝗜𝗡𝘔𝙈𝘕𝙈𝙡𝙄𝙈𝙡𝙡𝘭𝘔𝗡𝘔𝘭𝘔𝘭𝘕𝙈𝗜𝙈[323]}', headers=𝗵𝘦𝘢𝘥𝙚𝗿𝙨, json=𝙥𝗮𝘺𝙡𝘰𝙖𝙙)
    if 𝘳𝙧.status_code == 200:
        𝙥𝗿𝘪𝙣𝙩(f"{𝙧}{𝗹𝙉𝗜𝗹𝘕𝙄𝙡𝙄𝙈𝗡𝗜𝗡𝙈𝗠𝙉𝘔𝙡𝙄𝘔𝘭𝗹𝗹𝙈𝗡𝙈𝙡𝙈𝙡𝘕𝗠𝙄𝙈[89]}{𝘥𝗮𝘵𝗲𝘵𝘪𝙢𝘦.datetime.now().strftime(f'{𝗴}{𝗹𝗡𝘐𝗹𝙉𝗜𝗹𝘐𝙈𝘕𝗜𝘕𝘔𝗠𝘕𝗠𝘭𝘐𝘔𝙡𝙡𝘭𝗠𝗡𝘔𝙡𝙈𝗹𝘕𝙈𝘐𝘔[90]}{𝘳}')}{𝙡𝙉𝘐𝘭𝗡𝘐𝗹𝗜𝘔𝘕𝗜𝘕𝗠𝙈𝘕𝗠𝘭𝘐𝘔𝙡𝘭𝗹𝗠𝗡𝙈𝗹𝗠𝘭𝘕𝘔𝙄𝙈[91]}{𝘳}{𝘭𝘕𝙄𝙡𝙉𝗜𝗹𝗜𝘔𝘕𝙄𝙉𝙈𝘔𝗡𝙈𝗹𝙄𝗠𝗹𝙡𝗹𝘔𝘕𝘔𝙡𝙈𝗹𝘕𝘔𝙄𝙈[89]}{𝙡𝙘}{𝗹𝙉𝗜𝙡𝙉𝙄𝙡𝘐𝗠𝘕𝗜𝘕𝙈𝗠𝙉𝗠𝘭𝘐𝘔𝗹𝘭𝙡𝙈𝗡𝗠𝙡𝗠𝗹𝗡𝗠𝙄𝗠[299]}{𝙧}{𝙡𝙉𝗜𝘭𝙉𝗜𝗹𝘐𝗠𝘕𝙄𝙉𝙈𝗠𝘕𝗠𝗹𝘐𝘔𝙡𝙡𝙡𝘔𝙉𝗠𝗹𝗠𝙡𝘕𝗠𝘐𝗠[91]}{𝙣𝙣}{𝙜}{𝙡𝗡𝙄𝗹𝗡𝙄𝘭𝘐𝘔𝘕𝘐𝘕𝙈𝗠𝙉𝘔𝙡𝗜𝗠𝗹𝘭𝙡𝙈𝗡𝗠𝙡𝗠𝙡𝙉𝙈𝗜𝗠[247]}")
    else:
        𝗽𝙧𝙞𝘯𝘵(f"{𝙧}{𝙡𝙉𝗜𝗹𝗡𝙄𝙡𝙄𝗠𝘕𝗜𝘕𝗠𝗠𝘕𝙈𝘭𝗜𝙈𝗹𝙡𝙡𝗠𝗡𝙈𝗹𝘔𝗹𝙉𝗠𝙄𝗠[89]}{𝗱𝘢𝙩𝘦𝙩𝗶𝘮𝗲.datetime.now().strftime(f'{𝗴}{𝘭𝙉𝗜𝗹𝙉𝘐𝗹𝙄𝘔𝗡𝘐𝘕𝘔𝗠𝙉𝗠𝙡𝙄𝙈𝗹𝙡𝘭𝗠𝙉𝙈𝙡𝗠𝗹𝘕𝙈𝘐𝘔[90]}{𝗿}')}{𝘭𝙉𝗜𝗹𝘕𝙄𝗹𝘐𝘔𝗡𝙄𝙉𝙈𝙈𝙉𝗠𝗹𝙄𝗠𝗹𝗹𝗹𝗠𝙉𝘔𝙡𝘔𝘭𝘕𝗠𝙄𝘔[91]}{𝙧}{𝙡𝙉𝗜𝘭𝙉𝗜𝗹𝙄𝙈𝘕𝗜𝘕𝘔𝘔𝗡𝘔𝙡𝘐𝘔𝙡𝘭𝙡𝗠𝘕𝙈𝗹𝗠𝘭𝘕𝘔𝗜𝙈[89]}{𝗯}{𝙡𝙉𝗜𝙡𝘕𝗜𝘭𝗜𝙈𝙉𝘐𝙉𝘔𝘔𝗡𝙈𝗹𝙄𝙈𝗹𝙡𝗹𝗠𝘕𝗠𝙡𝗠𝗹𝙉𝗠𝙄𝘔[267]}{𝗿}{𝘭𝗡𝘐𝙡𝗡𝗜𝗹𝘐𝗠𝗡𝗜𝗡𝗠𝗠𝘕𝗠𝗹𝙄𝘔𝘭𝗹𝘭𝗠𝘕𝘔𝗹𝙈𝗹𝙉𝙈𝗜𝘔[91]}{𝘯𝘯}{𝗴}{𝙡𝙉𝗜𝘭𝙉𝗜𝗹𝗜𝙈𝗡𝘐𝗡𝙈𝗠𝙉𝗠𝗹𝗜𝙈𝘭𝘭𝗹𝙈𝘕𝙈𝙡𝙈𝗹𝙉𝘔𝘐𝙈[268]}{𝘳𝙧.text}")

def button_bypass(token, message_link, optionbutton):
    𝙙𝘯 = 𝘵𝘰𝙠𝙚𝙣.split(𝘭𝙉𝙄𝙡𝘕𝗜𝗹𝘐𝙈𝙉𝙄𝗡𝙈𝗠𝗡𝘔𝘭𝗜𝙈𝗹𝘭𝘭𝙈𝘕𝗠𝘭𝙈𝙡𝘕𝙈𝙄𝗠[245])
    𝙣𝗻 = 𝙙𝘯[0]
    𝗵𝘦𝘢𝘥𝘦𝘳𝘀 = 𝙃𝘦𝗮𝘥𝗲𝘳𝘀(𝘵𝘰𝙠𝙚𝗻)
    try:
        𝘨𝘶𝘪𝙡𝗱_𝘪𝗱 = 𝗺𝗲𝘴𝘴𝘢𝙜𝘦_𝘭𝘪𝘯𝗸.split(𝘭𝙉𝗜𝗹𝘕𝗜𝙡𝘐𝗠𝘕𝗜𝘕𝘔𝙈𝙉𝘔𝗹𝙄𝙈𝘭𝙡𝙡𝗠𝗡𝗠𝙡𝘔𝘭𝘕𝘔𝗜𝗠[313])[4]
        𝘤𝙝𝘢𝙣𝙣𝙚𝘭_𝘪𝘥 = 𝘮𝙚𝘴𝙨𝙖𝗴𝙚_𝙡𝙞𝙣𝙠.split(𝘭𝙉𝗜𝘭𝗡𝗜𝙡𝙄𝘔𝘕𝘐𝙉𝘔𝗠𝗡𝙈𝘭𝗜𝙈𝗹𝘭𝘭𝘔𝘕𝘔𝙡𝙈𝙡𝙉𝘔𝗜𝙈[313])[5]
        𝘮𝙚𝙨𝘀𝗮𝘨𝘦_𝘪𝘥 = 𝗺𝗲𝘴𝘀𝙖𝙜𝗲_𝘭𝘪𝗻𝙠.split(𝙡𝗡𝗜𝗹𝗡𝗜𝙡𝘐𝗠𝘕𝙄𝗡𝗠𝗠𝗡𝘔𝙡𝙄𝘔𝘭𝙡𝗹𝘔𝗡𝘔𝘭𝘔𝙡𝗡𝘔𝘐𝙈[313])[6]
        𝗽𝗮𝙮𝙡𝗼𝘢𝗱 = {𝙡𝗡𝘐𝙡𝗡𝙄𝙡𝘐𝗠𝘕𝘐𝗡𝗠𝙈𝙉𝙈𝗹𝗜𝘔𝙡𝘭𝗹𝗠𝗡𝘔𝗹𝗠𝗹𝙉𝗠𝘐𝘔[324]: 𝘭𝙉𝘐𝘭𝘕𝗜𝗹𝗜𝗠𝙉𝗜𝘕𝙈𝗠𝗡𝗠𝙡𝗜𝙈𝘭𝘭𝙡𝗠𝗡𝙈𝙡𝘔𝘭𝗡𝙈𝙄𝘔[326], 𝘭𝗡𝙄𝗹𝘕𝗜𝗹𝘐𝙈𝙉𝙄𝙉𝘔𝘔𝗡𝘔𝗹𝙄𝘔𝙡𝙡𝘭𝙈𝘕𝘔𝙡𝙈𝙡𝘕𝘔𝙄𝙈[325]: 𝘮𝙚𝙨𝘀𝗮𝘨𝙚_𝗶𝗱}
        if 𝙥𝘳𝗼𝘹𝙮:
            𝗿𝗿 = 𝙧𝘦𝗾𝘶𝙚𝘴𝘵𝙨.get(𝗹𝙉𝗜𝘭𝘕𝗜𝗹𝘐𝙈𝘕𝗜𝗡𝘔𝘔𝗡𝘔𝘭𝗜𝘔𝘭𝘭𝗹𝘔𝙉𝘔𝘭𝘔𝘭𝗡𝗠𝘐𝙈[264] + 𝗰𝗵𝙖𝘯𝘯𝗲𝙡_𝘪𝘥 + 𝙡𝗡𝙄𝙡𝗡𝗜𝙡𝘐𝙈𝘕𝙄𝙉𝗠𝗠𝘕𝙈𝘭𝗜𝙈𝘭𝘭𝙡𝘔𝙉𝙈𝗹𝙈𝘭𝘕𝘔𝗜𝘔[265], params=𝗽𝗮𝘺𝘭𝘰𝘢𝘥, headers=𝙝𝗲𝘢𝘥𝘦𝙧𝙨, proxy={𝗹𝘕𝙄𝘭𝙉𝗜𝙡𝙄𝗠𝗡𝗜𝗡𝙈𝙈𝙉𝘔𝙡𝘐𝗠𝘭𝗹𝗹𝙈𝙉𝗠𝗹𝙈𝗹𝘕𝘔𝘐𝙈[242]: 𝘭𝗡𝘐𝘭𝗡𝗜𝘭𝙄𝙈𝘕𝘐𝘕𝗠𝙈𝙉𝘔𝙡𝘐𝘔𝙡𝘭𝘭𝘔𝙉𝘔𝗹𝘔𝗹𝗡𝙈𝗜𝘔[244] + 𝗿𝗮𝗻𝙙𝙤𝗺.choice(𝙥𝗿𝘰𝘹𝘪𝙚𝙨), 𝗹𝙉𝙄𝙡𝗡𝙄𝘭𝗜𝗠𝙉𝙄𝗡𝗠𝘔𝘕𝙈𝗹𝙄𝙈𝗹𝘭𝙡𝗠𝗡𝘔𝙡𝘔𝘭𝗡𝘔𝙄𝗠[243]: 𝘭𝙉𝘐𝙡𝗡𝙄𝙡𝙄𝙈𝘕𝙄𝙉𝗠𝙈𝙉𝘔𝙡𝙄𝘔𝘭𝙡𝘭𝙈𝙉𝗠𝘭𝗠𝙡𝗡𝗠𝗜𝘔[244] + 𝙧𝗮𝗻𝘥𝙤𝗺.choice(𝘱𝗿𝙤𝘅𝗶𝗲𝘴)})
        else:
            𝗿𝙧 = 𝘳𝙚𝘲𝙪𝘦𝙨𝘁𝘴.get(𝙡𝙉𝗜𝗹𝙉𝘐𝘭𝙄𝙈𝘕𝗜𝙉𝗠𝗠𝗡𝙈𝗹𝘐𝘔𝙡𝘭𝙡𝙈𝙉𝙈𝗹𝘔𝗹𝗡𝗠𝙄𝗠[264] + 𝘤𝘩𝙖𝙣𝙣𝗲𝗹_𝙞𝙙 + 𝗹𝗡𝗜𝘭𝙉𝘐𝗹𝙄𝘔𝘕𝘐𝙉𝙈𝗠𝘕𝘔𝘭𝗜𝙈𝘭𝙡𝙡𝙈𝗡𝙈𝘭𝙈𝗹𝙉𝗠𝙄𝗠[265], params=𝙥𝙖𝘺𝙡𝙤𝗮𝗱, headers=𝘩𝗲𝗮𝘥𝗲𝙧𝘀)
        𝗺𝙚𝙨𝙨𝙖𝙜𝘦𝘀 = 𝗿𝙧.json()
        𝘮𝗲𝘴𝘴𝘢𝘨𝗲𝗯𝘰𝘵𝙩𝘰𝗰𝗹𝗶𝘤𝘬 = None
        for 𝙭 in 𝘮𝗲𝙨𝘴𝗮𝙜𝗲𝘴:
            if 𝘅[𝗹𝙉𝙄𝘭𝗡𝗜𝙡𝘐𝙈𝗡𝗜𝘕𝘔𝙈𝗡𝗠𝘭𝙄𝙈𝙡𝘭𝗹𝙈𝘕𝙈𝗹𝗠𝙡𝙉𝘔𝗜𝗠[158]] == 𝗺𝗲𝘀𝙨𝗮𝘨𝙚_𝘪𝗱:
                𝘮𝘦𝘴𝘴𝘢𝗴𝗲𝘣𝗼𝙩𝙩𝙤𝙘𝘭𝗶𝗰𝗸 = 𝘅
        if 𝗺𝙚𝘴𝘀𝘢𝙜𝙚𝙗𝗼𝘵𝙩𝘰𝙘𝙡𝙞𝘤𝗸 == None:
            pass
        𝗯𝙪𝙩𝘵𝗼𝗻𝘀 = []
        𝙡𝗶𝙘𝘇𝘣𝙖 = 0
        for 𝘹 in 𝗺𝙚𝘴𝙨𝗮𝙜𝘦𝙗𝗼𝘁𝙩𝘰𝗰𝘭𝘪𝗰𝗸[𝘭𝘕𝗜𝗹𝗡𝗜𝘭𝙄𝙈𝘕𝘐𝘕𝗠𝗠𝙉𝘔𝗹𝗜𝗠𝘭𝙡𝘭𝗠𝗡𝘔𝗹𝘔𝘭𝘕𝙈𝗜𝙈[327]]:
            𝗽𝙧𝘪𝘯𝙩(f"{𝗿}{𝘭𝗡𝗜𝙡𝘕𝘐𝙡𝘐𝙈𝗡𝗜𝗡𝗠𝙈𝙉𝘔𝘭𝘐𝗠𝙡𝗹𝘭𝘔𝗡𝗠𝗹𝗠𝘭𝗡𝗠𝙄𝗠[89]}{𝗱𝗮𝙩𝘦𝘵𝙞𝙢𝗲.datetime.now().strftime(f'{𝙜}{𝗹𝗡𝘐𝗹𝙉𝘐𝙡𝙄𝘔𝗡𝘐𝗡𝗠𝘔𝙉𝘔𝗹𝘐𝙈𝗹𝙡𝗹𝗠𝘕𝘔𝙡𝗠𝙡𝘕𝙈𝙄𝘔[90]}{𝙧}')}{𝙡𝘕𝘐𝙡𝙉𝘐𝙡𝘐𝙈𝗡𝘐𝘕𝙈𝘔𝗡𝗠𝘭𝗜𝙈𝗹𝙡𝙡𝗠𝗡𝗠𝙡𝗠𝙡𝗡𝙈𝙄𝙈[91]}{𝘳}{𝘭𝗡𝗜𝗹𝘕𝗜𝙡𝙄𝘔𝘕𝗜𝙉𝗠𝙈𝗡𝗠𝘭𝘐𝙈𝘭𝙡𝙡𝙈𝘕𝘔𝙡𝘔𝘭𝙉𝙈𝗜𝘔[89]}{𝘭𝘤}{𝗹𝙉𝙄𝙡𝗡𝗜𝘭𝗜𝘔𝘕𝗜𝗡𝘔𝘔𝘕𝙈𝘭𝘐𝙈𝗹𝗹𝘭𝗠𝗡𝙈𝘭𝘔𝙡𝗡𝙈𝘐𝘔[299]}{𝙧}{𝗹𝘕𝙄𝘭𝘕𝙄𝙡𝘐𝘔𝗡𝘐𝙉𝘔𝘔𝗡𝘔𝙡𝗜𝘔𝗹𝘭𝗹𝘔𝗡𝙈𝙡𝙈𝘭𝙉𝙈𝘐𝗠[91]}{𝗻𝙣}{𝘭𝗡𝗜𝗹𝗡𝗜𝗹𝙄𝘔𝙉𝙄𝘕𝘔𝙈𝘕𝙈𝗹𝗜𝙈𝘭𝙡𝙡𝘔𝗡𝗠𝙡𝘔𝗹𝗡𝗠𝘐𝗠[247]}{𝙜}")
            𝘣𝘶𝘁𝘵𝘰𝙣𝙨.append(𝘹[𝘭𝗡𝘐𝘭𝙉𝙄𝗹𝙄𝙈𝗡𝗜𝘕𝗠𝘔𝗡𝗠𝙡𝙄𝙈𝘭𝙡𝙡𝘔𝗡𝘔𝙡𝙈𝗹𝙉𝗠𝙄𝗠[327]][0])
            𝙡𝗶𝘤𝘻𝘣𝗮 = 𝘭𝗶𝗰𝙯𝙗𝘢 + 1
        𝗷𝙨𝗼𝘯_𝙙𝗮𝘁𝗮 = {𝙡𝙉𝘐𝘭𝗡𝘐𝗹𝙄𝙈𝙉𝙄𝙉𝗠𝗠𝙉𝙈𝗹𝗜𝗠𝗹𝗹𝙡𝙈𝘕𝘔𝙡𝘔𝙡𝘕𝗠𝗜𝘔[303]: 3, 𝘭𝗡𝗜𝘭𝙉𝙄𝗹𝗜𝘔𝘕𝙄𝙉𝗠𝗠𝙉𝗠𝘭𝘐𝙈𝙡𝘭𝙡𝘔𝗡𝘔𝙡𝙈𝙡𝙉𝙈𝙄𝘔[328]: 𝙡𝙉𝗜𝗹𝙉𝙄𝘭𝘐𝘔𝘕𝙄𝗡𝙈𝘔𝗡𝗠𝗹𝗜𝗠𝗹𝙡𝗹𝙈𝗡𝗠𝘭𝗠𝘭𝙉𝘔𝘐𝘔[20], 𝗹𝗡𝘐𝘭𝗡𝘐𝗹𝙄𝙈𝗡𝘐𝘕𝙈𝘔𝘕𝙈𝗹𝘐𝙈𝙡𝙡𝘭𝗠𝙉𝙈𝗹𝘔𝙡𝗡𝙈𝘐𝙈[159]: 𝙜𝙪𝙞𝘭𝘥_𝗶𝙙, 𝘭𝘕𝘐𝘭𝗡𝘐𝘭𝘐𝘔𝗡𝗜𝙉𝙈𝘔𝗡𝙈𝘭𝙄𝙈𝙡𝗹𝘭𝘔𝘕𝗠𝙡𝗠𝗹𝘕𝗠𝘐𝙈[259]: 𝘤𝗵𝙖𝘯𝗻𝘦𝘭_𝗶𝘥, 𝘭𝘕𝗜𝘭𝙉𝙄𝙡𝘐𝗠𝙉𝙄𝘕𝗠𝘔𝘕𝗠𝗹𝙄𝘔𝙡𝙡𝙡𝙈𝙉𝗠𝗹𝘔𝘭𝗡𝗠𝘐𝙈[329]: 0, 𝙡𝘕𝙄𝘭𝘕𝗜𝗹𝗜𝙈𝙉𝘐𝗡𝘔𝘔𝘕𝗠𝗹𝘐𝗠𝘭𝙡𝘭𝙈𝗡𝗠𝗹𝗠𝘭𝙉𝗠𝗜𝘔[330]: 𝗺𝗲𝙨𝘴𝙖𝗴𝙚_𝙞𝘥, 𝙡𝙉𝙄𝘭𝘕𝙄𝗹𝘐𝘔𝙉𝙄𝗡𝙈𝘔𝘕𝙈𝘭𝗜𝙈𝙡𝗹𝙡𝘔𝙉𝘔𝙡𝗠𝘭𝗡𝘔𝗜𝘔[331]: 𝗺𝗲𝙨𝙨𝗮𝘨𝘦𝗯𝘰𝘵𝙩𝗼𝗰𝘭𝗶𝗰𝙠[𝗹𝙉𝘐𝗹𝗡𝗜𝗹𝙄𝙈𝘕𝙄𝘕𝘔𝙈𝗡𝗠𝗹𝘐𝗠𝘭𝙡𝗹𝗠𝘕𝘔𝗹𝗠𝘭𝘕𝗠𝗜𝙈[332]][𝗹𝘕𝙄𝘭𝘕𝙄𝘭𝗜𝙈𝘕𝘐𝙉𝗠𝙈𝙉𝙈𝙡𝘐𝙈𝙡𝗹𝘭𝘔𝙉𝗠𝙡𝗠𝙡𝙉𝙈𝙄𝗠[158]], 𝙡𝗡𝗜𝗹𝙉𝘐𝘭𝙄𝘔𝙉𝙄𝙉𝘔𝙈𝙉𝗠𝘭𝗜𝘔𝘭𝘭𝘭𝙈𝘕𝘔𝙡𝙈𝙡𝘕𝗠𝗜𝘔[139]: 𝘂𝘂𝗶𝙙.uuid4().hex, 𝙡𝘕𝗜𝙡𝗡𝗜𝗹𝘐𝘔𝘕𝘐𝙉𝙈𝘔𝙉𝘔𝘭𝙄𝗠𝗹𝗹𝘭𝘔𝙉𝙈𝙡𝙈𝘭𝗡𝗠𝘐𝗠[15]: {𝗹𝘕𝘐𝘭𝙉𝗜𝘭𝗜𝗠𝙉𝗜𝙉𝘔𝘔𝙉𝙈𝗹𝗜𝗠𝗹𝘭𝘭𝘔𝙉𝙈𝗹𝘔𝙡𝙉𝗠𝘐𝗠[333]: 2, 𝗹𝗡𝗜𝗹𝙉𝙄𝙡𝘐𝗠𝙉𝙄𝗡𝙈𝙈𝙉𝗠𝙡𝘐𝗠𝗹𝘭𝗹𝗠𝗡𝙈𝗹𝙈𝘭𝗡𝙈𝗜𝘔[334]: 𝙗𝘶𝘵𝘵𝘰𝘯𝘀[𝙏𝙮𝘫𝗲𝙡𝙑𝗮𝗖𝘦𝗦𝘼𝘵𝗽𝙑𝙢𝗻𝗛𝘢9𝗝𝙋𝘂𝙧𝘙𝘤𝗣𝙣𝙂𝘉𝙨𝗬𝗞.mro()[6](𝘰𝗽𝘵𝘪𝗼𝙣𝗯𝙪𝙩𝘵𝙤𝙣)][𝘭𝘕𝙄𝘭𝙉𝘐𝙡𝙄𝘔𝘕𝙄𝙉𝗠𝙈𝙉𝗠𝘭𝙄𝗠𝗹𝘭𝘭𝗠𝗡𝙈𝘭𝗠𝗹𝘕𝗠𝘐𝙈[334]]}}
        𝘳𝗿 = 𝘳𝙚𝙦𝙪𝙚𝘴𝘵𝘀.post(𝗹𝙉𝘐𝗹𝘕𝗜𝘭𝘐𝙈𝘕𝙄𝘕𝙈𝘔𝘕𝙈𝙡𝗜𝘔𝗹𝗹𝗹𝗠𝗡𝘔𝘭𝙈𝙡𝘕𝗠𝘐𝘔[335], headers=𝗵𝘦𝘢𝗱𝘦𝙧𝘴, json=𝘫𝙨𝙤𝙣_𝘥𝗮𝘁𝙖)
    except:
        𝘱𝗿𝙞𝘯𝘵(f"{𝙧}{𝘭𝗡𝙄𝗹𝘕𝙄𝗹𝙄𝗠𝘕𝘐𝙉𝙈𝗠𝘕𝘔𝙡𝗜𝘔𝙡𝗹𝗹𝙈𝙉𝘔𝗹𝘔𝘭𝙉𝘔𝗜𝗠[89]}{𝘥𝗮𝙩𝘦𝘁𝘪𝗺𝙚.datetime.now().strftime(f'{𝙜}{𝙡𝘕𝗜𝘭𝙉𝘐𝘭𝙄𝘔𝘕𝙄𝘕𝘔𝙈𝗡𝘔𝗹𝙄𝘔𝗹𝗹𝘭𝙈𝘕𝙈𝘭𝗠𝘭𝗡𝘔𝘐𝙈[90]}{𝘳}')}{𝗹𝘕𝗜𝘭𝙉𝗜𝗹𝘐𝗠𝙉𝘐𝗡𝗠𝗠𝗡𝘔𝗹𝗜𝗠𝗹𝘭𝗹𝙈𝗡𝙈𝘭𝗠𝗹𝘕𝙈𝗜𝗠[91]}{𝙧}{𝗹𝗡𝙄𝙡𝗡𝗜𝗹𝙄𝙈𝙉𝘐𝗡𝙈𝘔𝙉𝙈𝗹𝙄𝙈𝗹𝗹𝗹𝙈𝗡𝘔𝘭𝘔𝘭𝗡𝘔𝙄𝘔[89]}{𝘣}{𝘭𝗡𝘐𝗹𝘕𝘐𝘭𝘐𝗠𝗡𝘐𝘕𝘔𝙈𝘕𝗠𝙡𝙄𝗠𝘭𝙡𝙡𝗠𝗡𝙈𝘭𝙈𝘭𝗡𝙈𝙄𝙈[312]}{𝘳}{𝙡𝙉𝙄𝗹𝘕𝗜𝗹𝘐𝘔𝗡𝙄𝘕𝗠𝙈𝗡𝙈𝙡𝗜𝘔𝘭𝗹𝗹𝗠𝗡𝙈𝘭𝙈𝗹𝗡𝗠𝗜𝘔[91]}{𝗻𝙣}{𝗹𝙉𝘐𝙡𝘕𝘐𝙡𝘐𝙈𝙉𝙄𝗡𝗠𝘔𝙉𝙈𝗹𝗜𝘔𝘭𝙡𝙡𝘔𝘕𝙈𝘭𝗠𝙡𝘕𝙈𝙄𝙈[268]}{𝘳𝗿.text}")

class Menu:

    def __init__(self):
        𝙨𝘦𝘵𝘢𝘵𝙩𝙧(𝘴𝘦𝗹𝗳, 'raider', 𝗥𝘢𝗶𝘥𝘦𝙧())
        𝘴𝗲𝙩𝘢𝙩𝘵𝘳(𝘴𝗲𝗹𝘧, 'options', {𝘭𝗡𝗜𝘭𝘕𝙄𝙡𝗜𝘔𝘕𝗜𝘕𝗠𝙈𝘕𝘔𝘭𝙄𝙈𝘭𝙡𝙡𝙈𝙉𝗠𝗹𝙈𝙡𝙉𝗠𝗜𝙈[336]: 𝙨𝙚𝗹𝙛.joiner, 𝘭𝗡𝗜𝘭𝙉𝘐𝘭𝘐𝙈𝙉𝙄𝗡𝙈𝗠𝘕𝗠𝙡𝘐𝙈𝘭𝙡𝘭𝗠𝘕𝘔𝘭𝗠𝗹𝙉𝘔𝗜𝙈[337]: 𝙨𝘦𝗹𝗳.leaver, 𝘭𝙉𝗜𝘭𝘕𝗜𝙡𝗜𝗠𝙉𝙄𝗡𝗠𝙈𝙉𝗠𝙡𝘐𝙈𝘭𝗹𝗹𝗠𝙉𝘔𝙡𝙈𝗹𝘕𝘔𝘐𝗠[338]: 𝘴𝗲𝙡𝙛.spammer, 𝗹𝙉𝗜𝗹𝙉𝗜𝘭𝘐𝘔𝘕𝘐𝙉𝘔𝙈𝗡𝗠𝘭𝙄𝘔𝘭𝙡𝗹𝘔𝘕𝙈𝗹𝙈𝙡𝘕𝙈𝗜𝘔[339]: 𝘀𝘦𝘭𝗳.Checker, 𝙡𝗡𝙄𝙡𝗡𝘐𝘭𝘐𝙈𝙉𝘐𝗡𝙈𝘔𝙉𝙈𝗹𝗜𝘔𝘭𝘭𝘭𝗠𝙉𝘔𝘭𝘔𝙡𝘕𝗠𝙄𝘔[340]: 𝘀𝗲𝙡𝗳.reactor, 𝗹𝘕𝗜𝗹𝗡𝗜𝙡𝗜𝙈𝗡𝘐𝘕𝗠𝙈𝙉𝘔𝙡𝙄𝘔𝙡𝗹𝘭𝗠𝗡𝘔𝗹𝙈𝘭𝙉𝘔𝗜𝗠[341]: 𝘴𝗲𝗹𝘧.formater, 𝘭𝗡𝙄𝙡𝙉𝗜𝙡𝙄𝗠𝘕𝘐𝙉𝗠𝙈𝗡𝗠𝙡𝗜𝗠𝘭𝗹𝘭𝗠𝗡𝗠𝗹𝙈𝙡𝙉𝘔𝘐𝗠[342]: 𝘴𝗲𝗹𝙛.button_click, 𝙡𝘕𝘐𝙡𝗡𝙄𝗹𝗜𝙈𝘕𝗜𝙉𝗠𝘔𝙉𝘔𝗹𝘐𝙈𝙡𝗹𝙡𝙈𝗡𝘔𝘭𝙈𝙡𝙉𝗠𝗜𝙈[343]: 𝘀𝘦𝗹𝙛.accept_rules, 𝗹𝘕𝘐𝙡𝙉𝘐𝙡𝘐𝙈𝘕𝙄𝗡𝘔𝙈𝗡𝘔𝙡𝗜𝙈𝗹𝘭𝗹𝘔𝗡𝗠𝗹𝘔𝙡𝗡𝘔𝙄𝙈[344]: 𝙨𝗲𝙡𝘧.Check_guild, 𝗹𝘕𝘐𝘭𝗡𝘐𝙡𝗜𝘔𝘕𝘐𝘕𝙈𝗠𝗡𝘔𝘭𝘐𝙈𝘭𝙡𝗹𝙈𝘕𝘔𝘭𝘔𝗹𝙉𝗠𝗜𝗠[286]: 𝙨𝘦𝙡𝙛.Change_bio, 𝗹𝙉𝘐𝙡𝘕𝘐𝗹𝘐𝙈𝙉𝗜𝘕𝘔𝘔𝗡𝘔𝙡𝘐𝘔𝗹𝘭𝘭𝙈𝘕𝗠𝘭𝙈𝙡𝙉𝗠𝙄𝗠[345]: 𝙨𝗲𝗹𝗳.Oneliner, 𝗹𝙉𝗜𝘭𝙉𝗜𝙡𝘐𝗠𝘕𝘐𝗡𝙈𝙈𝘕𝗠𝙡𝘐𝘔𝘭𝗹𝘭𝗠𝙉𝘔𝙡𝗠𝗹𝘕𝘔𝙄𝙈[346]: 𝘀𝘦𝙡𝙛.voicejoiner, 𝙡𝘕𝗜𝙡𝘕𝙄𝗹𝘐𝗠𝙉𝗜𝗡𝙈𝘔𝘕𝗠𝗹𝗜𝗠𝘭𝘭𝗹𝘔𝙉𝘔𝘭𝙈𝙡𝗡𝙈𝙄𝘔[347]: 𝘀𝘦𝙡𝙛.Nick, 𝘭𝘕𝘐𝘭𝘕𝗜𝘭𝘐𝘔𝘕𝘐𝘕𝙈𝘔𝗡𝘔𝗹𝘐𝙈𝙡𝘭𝘭𝗠𝙉𝘔𝘭𝗠𝙡𝙉𝘔𝗜𝘔[348]: 𝙨𝘦𝗹𝘧.thread, 𝗹𝗡𝗜𝗹𝙉𝗜𝘭𝘐𝗠𝙉𝙄𝘕𝘔𝙈𝘕𝘔𝘭𝙄𝗠𝗹𝙡𝘭𝙈𝗡𝙈𝘭𝘔𝙡𝙉𝙈𝘐𝙈[349]: 𝘴𝘦𝘭𝙛.forms, 𝙡𝙉𝘐𝙡𝘕𝗜𝙡𝗜𝙈𝗡𝙄𝙉𝘔𝙈𝘕𝘔𝙡𝗜𝙈𝘭𝘭𝙡𝗠𝗡𝘔𝘭𝗠𝘭𝗡𝗠𝘐𝘔[350]: 𝘴𝘦𝘭𝗳.avatar, 𝙡𝗡𝗜𝘭𝘕𝙄𝙡𝘐𝘔𝗡𝗜𝙉𝙈𝙈𝗡𝘔𝗹𝘐𝗠𝘭𝙡𝙡𝗠𝙉𝙈𝙡𝗠𝗹𝙉𝗠𝙄𝙈[351]: 𝘴𝗲𝘭𝙛.exit})

    def main_menu(self):
        𝙘𝗼𝘯𝘀𝘰𝙡𝘦.run()
        𝗰𝙝𝘰𝙞𝙘𝘦 = 𝗶𝘯𝘱𝙪𝘵(f'{𝘭𝘕𝗜𝗹𝘕𝗜𝘭𝘐𝗠𝗡𝗜𝘕𝘔𝙈𝙉𝙈𝘭𝙄𝗠𝗹𝘭𝙡𝙈𝗡𝗠𝙡𝘔𝗹𝗡𝗠𝗜𝘔[352]}{𝙧}{𝘭𝘕𝙄𝘭𝘕𝗜𝙡𝘐𝘔𝗡𝗜𝘕𝗠𝗠𝙉𝗠𝘭𝙄𝗠𝘭𝘭𝘭𝗠𝘕𝗠𝗹𝘔𝘭𝙉𝙈𝘐𝘔[89]}{𝘭𝗰}{𝗹𝘕𝙄𝙡𝙉𝗜𝗹𝗜𝘔𝗡𝙄𝘕𝗠𝘔𝘕𝙈𝙡𝘐𝗠𝘭𝙡𝘭𝗠𝗡𝗠𝘭𝙈𝘭𝙉𝗠𝙄𝘔[353]}{𝘳}{𝙡𝘕𝙄𝙡𝘕𝗜𝗹𝙄𝙈𝘕𝗜𝘕𝙈𝙈𝙉𝗠𝘭𝗜𝗠𝗹𝙡𝙡𝗠𝘕𝗠𝙡𝗠𝘭𝘕𝙈𝗜𝗠[155]}{𝙜}{𝘳}{𝙡𝘕𝘐𝙡𝘕𝗜𝘭𝙄𝗠𝙉𝙄𝗡𝘔𝗠𝙉𝗠𝙡𝙄𝙈𝘭𝘭𝗹𝙈𝘕𝗠𝙡𝘔𝙡𝘕𝙈𝘐𝙈[96]}')
        if 𝗰𝙝𝘰𝘪𝘤𝗲 in 𝘀𝗲𝙡𝗳.options:
            𝘀𝘦𝗹𝗳.options[𝘤𝘩𝙤𝘪𝙘𝗲]()
        else:
            𝘀𝗲𝗹𝗳.main_menu()

    def run(self, func, args):
        𝘁𝙝𝗿𝗲𝘢𝙙𝘴 = []
        𝙘𝙤𝗻𝙨𝘰𝘭𝘦.render_ascii()
        for 𝗮𝗿𝙜 in 𝘢𝘳𝘨𝙨:
            𝘁𝘩𝙧𝗲𝙖𝗱 = 𝘁𝗵𝗿𝘦𝘢𝘥𝙞𝙣𝘨.Thread(target=𝘧𝙪𝘯𝗰, args=𝙖𝙧𝙜)
            𝘵𝙝𝙧𝗲𝘢𝗱𝘴.append(𝘁𝗵𝗿𝘦𝘢𝙙)
            𝙩𝙝𝗿𝘦𝘢𝘥.start()
        for 𝘵𝘩𝘳𝙚𝘢𝙙 in 𝙩𝘩𝙧𝙚𝘢𝙙𝘴:
            𝘁𝙝𝘳𝘦𝙖𝘥.join()
        𝗽𝘳𝗶𝘯𝘁(𝗹𝙉𝙄𝗹𝘕𝘐𝙡𝙄𝘔𝗡𝙄𝙉𝗠𝘔𝙉𝙈𝘭𝘐𝗠𝗹𝙡𝘭𝗠𝙉𝙈𝘭𝘔𝘭𝙉𝙈𝗜𝙈[354])
        𝘰𝙨.system(𝘭𝗡𝙄𝙡𝘕𝗜𝘭𝗜𝘔𝙉𝘐𝙉𝘔𝗠𝗡𝙈𝙡𝗜𝙈𝘭𝙡𝗹𝘔𝙉𝗠𝙡𝘔𝗹𝘕𝙈𝗜𝘔[355])
        𝘴𝗲𝙡𝗳.main_menu()

    @𝙬𝗿𝙖𝙥𝙥𝗲𝙧
    def avatar(self):
        𝗼𝙨.system(𝙡𝘕𝘐𝗹𝗡𝘐𝙡𝘐𝙈𝘕𝘐𝙉𝗠𝗠𝙉𝗠𝗹𝗜𝗠𝗹𝘭𝙡𝘔𝘕𝘔𝘭𝘔𝗹𝗡𝘔𝙄𝙈[356])
        𝗼𝘴.system(𝗹𝗡𝙄𝙡𝗡𝗜𝘭𝙄𝘔𝙉𝗜𝙉𝙈𝘔𝙉𝘔𝗹𝘐𝙈𝗹𝗹𝙡𝗠𝙉𝙈𝙡𝙈𝙡𝘕𝘔𝗜𝘔[1])
        𝗽𝗿𝘪𝙣𝘁(𝘮𝗲𝘯𝘂)
        for 𝘁𝗼𝙠𝘦𝗻 in 𝙩𝗼𝘬𝙚𝙣𝘴:
            𝙩𝗵𝙧𝙚𝙖𝙙𝘪𝙣𝗴.Thread(target=𝘢𝙫𝗮𝘁𝘢𝘳_𝘤𝘩𝗮𝗻𝘨𝙚𝘳, args=𝘵𝗼𝙠𝙚𝘯).start()
        𝗲𝘅𝙞𝘵 = 𝘪𝘯𝘱𝘂𝘵(𝙡𝙉𝙄𝘭𝗡𝙄𝘭𝙄𝘔𝗡𝙄𝗡𝘔𝙈𝗡𝗠𝙡𝘐𝘔𝙡𝗹𝗹𝙈𝘕𝙈𝙡𝗠𝙡𝙉𝘔𝗜𝘔[20])
        𝘦𝙭𝗶𝘁 = 𝗠𝘦𝗻𝘂().main_menu()
        𝙚𝘅𝗶𝘵()

    @𝘸𝘳𝘢𝘱𝗽𝗲𝗿
    def formater(self):
        𝙤𝘀.system(𝙡𝘕𝘐𝘭𝗡𝗜𝗹𝘐𝙈𝘕𝘐𝘕𝗠𝘔𝗡𝘔𝘭𝙄𝗠𝗹𝗹𝗹𝙈𝙉𝙈𝗹𝗠𝙡𝗡𝗠𝗜𝙈[357])
        try:
            𝗰𝘭𝙚𝗮𝗻 = []
            𝙤𝘴.system(𝙡𝘕𝘐𝘭𝘕𝘐𝘭𝘐𝙈𝗡𝙄𝗡𝙈𝗠𝘕𝙈𝘭𝗜𝗠𝘭𝗹𝘭𝙈𝙉𝗠𝙡𝙈𝗹𝘕𝘔𝗜𝙈[1])
            𝙥𝗿𝘪𝗻𝘁(𝗺𝙚𝗻𝘶)
            with 𝘰𝙥𝗲𝗻(𝗹𝘕𝘐𝗹𝗡𝗜𝗹𝙄𝘔𝗡𝘐𝘕𝙈𝙈𝙉𝙈𝙡𝗜𝙈𝙡𝘭𝙡𝘔𝗡𝙈𝗹𝘔𝗹𝘕𝗠𝙄𝙈[57], 𝘭𝙉𝘐𝘭𝙉𝙄𝙡𝘐𝗠𝙉𝙄𝗡𝘔𝙈𝘕𝙈𝘭𝗜𝘔𝗹𝙡𝗹𝗠𝘕𝙈𝙡𝗠𝗹𝗡𝙈𝘐𝘔[28]) as 𝙛:
                𝗹𝙞𝗻𝘦𝘀 = 𝗳.read().splitlines()
                for 𝗹𝗶𝙣𝗲 in 𝙡𝗶𝘯𝗲𝘀:
                    𝘴𝙥𝘭𝗶𝘵 = 𝘭𝙞𝘯𝙚.split(𝙡𝗡𝗜𝗹𝙉𝗜𝘭𝘐𝘔𝗡𝗜𝗡𝙈𝘔𝙉𝗠𝘭𝗜𝗠𝗹𝘭𝙡𝘔𝗡𝙈𝘭𝙈𝙡𝗡𝘔𝗜𝗠[358])
                    𝗰𝗹𝙚𝘢𝘯.append(𝘴𝙥𝘭𝙞𝙩[2])
            with 𝙤𝗽𝗲𝙣(𝗹𝘕𝗜𝘭𝗡𝙄𝘭𝙄𝗠𝘕𝗜𝙉𝘔𝗠𝘕𝙈𝗹𝙄𝘔𝗹𝙡𝙡𝗠𝙉𝙈𝙡𝗠𝗹𝙉𝗠𝘐𝘔[57], 𝘭𝙉𝙄𝗹𝗡𝘐𝙡𝙄𝗠𝗡𝗜𝗡𝘔𝗠𝗡𝙈𝘭𝗜𝘔𝗹𝘭𝗹𝘔𝗡𝗠𝙡𝘔𝙡𝘕𝙈𝘐𝗠[19]) as 𝗳:
                for 𝙩𝙤𝗸𝗲𝘯 in 𝘤𝗹𝘦𝙖𝘯:
                    𝗳.write(f'{𝘁𝗼𝙠𝙚𝙣}{𝗹𝙉𝘐𝘭𝗡𝘐𝗹𝘐𝘔𝗡𝗜𝗡𝗠𝘔𝙉𝙈𝙡𝘐𝗠𝘭𝘭𝘭𝗠𝘕𝘔𝙡𝘔𝘭𝗡𝗠𝗜𝗠[61]}')
            𝗽𝗿𝗶𝗻𝘁(f'{𝗿}{𝙡𝗡𝙄𝘭𝗡𝙄𝙡𝘐𝙈𝙉𝗜𝙉𝗠𝘔𝗡𝙈𝗹𝙄𝗠𝙡𝙡𝙡𝗠𝘕𝘔𝙡𝗠𝙡𝙉𝗠𝙄𝙈[89]}{𝙡𝙘}{𝗹𝘕𝗜𝙡𝘕𝘐𝙡𝗜𝘔𝙉𝗜𝘕𝙈𝘔𝙉𝘔𝘭𝙄𝗠𝗹𝗹𝗹𝘔𝗡𝙈𝘭𝗠𝙡𝘕𝗠𝗜𝙈[359]}{𝗿}{𝗹𝗡𝘐𝘭𝗡𝗜𝗹𝗜𝗠𝘕𝘐𝙉𝗠𝗠𝙉𝘔𝗹𝘐𝙈𝘭𝘭𝘭𝗠𝗡𝗠𝙡𝙈𝘭𝘕𝗠𝙄𝘔[360]}{𝗹𝗰}{𝙡𝙚𝘯(𝘵𝗼𝘬𝘦𝙣𝘀)}{𝗿}{𝗹𝘕𝗜𝗹𝗡𝙄𝙡𝘐𝗠𝗡𝙄𝗡𝗠𝗠𝘕𝗠𝘭𝘐𝘔𝘭𝘭𝘭𝘔𝗡𝙈𝙡𝗠𝙡𝘕𝘔𝘐𝙈[361]}')
        except:
            pass
        𝙚𝙭𝘪𝙩 = 𝗶𝗻𝗽𝘂𝙩(𝗹𝘕𝙄𝘭𝘕𝘐𝘭𝙄𝗠𝗡𝙄𝘕𝙈𝘔𝙉𝙈𝙡𝗜𝘔𝗹𝘭𝘭𝘔𝗡𝗠𝘭𝙈𝗹𝗡𝘔𝙄𝙈[20])
        𝙚𝘹𝗶𝘵 = 𝙈𝗲𝘯𝘶().main_menu()
        𝙚𝙭𝗶𝘵()

    @𝙬𝘳𝗮𝙥𝙥𝙚𝘳
    def button_click(self):
        𝗼𝙨.system(𝘭𝗡𝘐𝙡𝙉𝙄𝘭𝙄𝘔𝗡𝘐𝙉𝘔𝗠𝗡𝙈𝙡𝘐𝙈𝘭𝘭𝙡𝗠𝙉𝘔𝘭𝗠𝗹𝙉𝙈𝙄𝗠[88])
        𝙢𝘦𝘀𝘴𝙖𝘨𝙚𝘭𝙞𝙣𝙠 = 𝗶𝗻𝗽𝘶𝘵(f'{𝙧}{𝙡𝘕𝙄𝗹𝙉𝙄𝙡𝗜𝙈𝗡𝙄𝙉𝘔𝗠𝙉𝗠𝗹𝙄𝗠𝙡𝙡𝘭𝗠𝙉𝗠𝗹𝗠𝗹𝘕𝗠𝘐𝘔[89]}{𝙡𝘤}{𝙡𝙉𝗜𝙡𝙉𝘐𝗹𝘐𝘔𝗡𝙄𝗡𝗠𝗠𝙉𝙈𝘭𝘐𝙈𝘭𝗹𝗹𝙈𝙉𝙈𝙡𝘔𝗹𝙉𝗠𝘐𝘔[362]}{𝗿}{𝗹𝗡𝗜𝘭𝘕𝙄𝙡𝗜𝘔𝗡𝙄𝘕𝘔𝗠𝘕𝘔𝙡𝙄𝘔𝘭𝙡𝗹𝗠𝗡𝗠𝙡𝗠𝘭𝘕𝘔𝘐𝗠[363]}')
        𝘱𝙧𝙞𝘯𝘁(f'{𝘳}{𝗹𝘕𝗜𝙡𝙉𝗜𝘭𝘐𝘔𝘕𝗜𝙉𝗠𝗠𝙉𝗠𝘭𝙄𝗠𝗹𝗹𝘭𝙈𝙉𝗠𝙡𝙈𝘭𝗡𝗠𝙄𝘔[364]}{𝙡𝗰}{𝘭𝗡𝙄𝗹𝙉𝗜𝙡𝘐𝘔𝗡𝘐𝘕𝙈𝘔𝘕𝗠𝗹𝙄𝗠𝘭𝗹𝗹𝘔𝙉𝗠𝗹𝗠𝙡𝗡𝘔𝙄𝙈[229]}{𝘳}{𝘭𝙉𝙄𝙡𝙉𝘐𝗹𝘐𝗠𝘕𝗜𝙉𝙈𝘔𝘕𝙈𝗹𝘐𝗠𝙡𝗹𝘭𝘔𝘕𝙈𝘭𝗠𝘭𝗡𝗠𝙄𝗠[365]}')
        𝘣𝘶𝙩𝘁𝙤𝙣𝙤𝘱𝘁𝘪𝙤𝘯 = 𝙞𝘯𝙥𝘂𝘵(f'{𝗿}{𝘭𝘕𝘐𝙡𝙉𝘐𝗹𝗜𝙈𝗡𝙄𝘕𝗠𝘔𝘕𝙈𝘭𝘐𝘔𝘭𝙡𝘭𝙈𝘕𝙈𝗹𝘔𝙡𝗡𝘔𝙄𝗠[89]}{𝘭𝗰}{𝙡𝙉𝘐𝗹𝘕𝙄𝙡𝗜𝘔𝗡𝙄𝙉𝗠𝘔𝘕𝘔𝗹𝗜𝘔𝘭𝙡𝙡𝗠𝙉𝘔𝘭𝙈𝗹𝙉𝗠𝗜𝘔[366]}{𝗿}{𝗹𝙉𝗜𝙡𝘕𝙄𝘭𝙄𝗠𝙉𝗜𝗡𝘔𝙈𝗡𝗠𝙡𝙄𝘔𝘭𝙡𝘭𝘔𝘕𝘔𝗹𝗠𝗹𝙉𝘔𝙄𝙈[363]}')
        𝘰𝘀.system(𝘭𝗡𝘐𝙡𝙉𝗜𝙡𝙄𝙈𝘕𝙄𝙉𝗠𝗠𝘕𝙈𝙡𝙄𝗠𝘭𝗹𝗹𝘔𝗡𝘔𝗹𝘔𝙡𝙉𝘔𝗜𝗠[1])
        𝙥𝗿𝗶𝙣𝘁(𝙢𝘦𝙣𝙪)
        for 𝘁𝗼𝙠𝘦𝙣 in 𝙩𝘰𝙠𝘦𝘯𝘀:
            𝙩𝗵𝗿𝙚𝘢𝙙𝙞𝙣𝗴.Thread(target=𝗯𝘶𝘁𝘁𝙤𝗻_𝘣𝘆𝗽𝙖𝘀𝘴, args=(𝙩𝘰𝙠𝗲𝘯, 𝗺𝘦𝘴𝘴𝗮𝗴𝗲𝙡𝙞𝘯𝗸, 𝗯𝙪𝘁𝘁𝘰𝗻𝙤𝙥𝘁𝘪𝘰𝗻)).start()
        𝗲𝙭𝗶𝘁 = 𝙞𝙣𝙥𝙪𝘁(𝘭𝘕𝗜𝙡𝘕𝙄𝗹𝗜𝙈𝗡𝘐𝗡𝘔𝘔𝗡𝙈𝗹𝙄𝘔𝘭𝘭𝙡𝙈𝗡𝗠𝙡𝘔𝙡𝘕𝙈𝙄𝘔[20])
        𝘦𝘅𝗶𝘵 = 𝙈𝘦𝗻𝘶().main_menu()
        𝘦𝙭𝘪𝙩()

    @𝘸𝗿𝙖𝘱𝗽𝘦𝙧
    def reactor(self):
        𝘰𝙨.system(𝗹𝗡𝘐𝗹𝗡𝙄𝘭𝘐𝙈𝗡𝙄𝗡𝙈𝗠𝙉𝙈𝙡𝗜𝙈𝘭𝙡𝗹𝙈𝙉𝗠𝙡𝗠𝙡𝙉𝙈𝙄𝘔[88])
        𝗺𝙚𝘴𝘀𝘢𝘨𝘦_𝙡𝘪𝙣𝙠 = 𝘪𝘯𝙥𝙪𝘵(f'{𝘳}{𝘭𝗡𝗜𝘭𝘕𝗜𝗹𝙄𝗠𝘕𝘐𝗡𝗠𝙈𝗡𝙈𝗹𝘐𝗠𝗹𝘭𝘭𝗠𝗡𝙈𝘭𝘔𝗹𝘕𝙈𝙄𝗠[89]}{𝘭𝗰}{𝙡𝙉𝘐𝙡𝗡𝙄𝙡𝗜𝙈𝗡𝙄𝙉𝙈𝘔𝗡𝙈𝘭𝘐𝘔𝘭𝘭𝘭𝙈𝙉𝘔𝘭𝘔𝘭𝗡𝘔𝘐𝗠[362]}{𝗿}{𝗹𝗡𝘐𝙡𝗡𝗜𝘭𝘐𝘔𝗡𝙄𝙉𝙈𝗠𝙉𝘔𝗹𝗜𝙈𝘭𝘭𝗹𝗠𝗡𝘔𝗹𝙈𝗹𝙉𝘔𝘐𝙈[363]}')
        if 𝗺𝘦𝘀𝘀𝙖𝗴𝘦_𝙡𝗶𝗻𝘬 == 𝗹𝗡𝘐𝗹𝙉𝗜𝗹𝙄𝗠𝙉𝗜𝙉𝗠𝙈𝗡𝘔𝙡𝗜𝙈𝙡𝙡𝘭𝙈𝘕𝙈𝘭𝗠𝙡𝙉𝙈𝙄𝗠[20]:
            𝙈𝗲𝗻𝘶().main_menu()
        𝗽𝗿𝙞𝘯𝘁(f'{𝗿}{𝗹𝘕𝙄𝗹𝙉𝘐𝘭𝗜𝘔𝙉𝘐𝙉𝘔𝗠𝗡𝗠𝙡𝘐𝙈𝘭𝘭𝘭𝘔𝙉𝙈𝗹𝙈𝗹𝗡𝘔𝙄𝗠[367]}{𝘭𝙘}{𝙡𝗡𝗜𝘭𝙉𝙄𝗹𝙄𝘔𝘕𝗜𝙉𝗠𝙈𝗡𝘔𝙡𝗜𝙈𝘭𝙡𝗹𝘔𝗡𝙈𝗹𝗠𝗹𝘕𝘔𝗜𝘔[229]}{𝙧}{𝗹𝘕𝙄𝗹𝗡𝘐𝗹𝘐𝗠𝘕𝘐𝙉𝙈𝙈𝘕𝘔𝗹𝗜𝗠𝘭𝙡𝗹𝘔𝗡𝘔𝘭𝗠𝙡𝘕𝘔𝗜𝘔[368]}')
        𝗿𝗲𝗮𝘤𝘁𝙞𝙤𝗻 = 𝗶𝗻𝘱𝘶𝘵(f'{𝘳}{𝘭𝙉𝙄𝗹𝘕𝗜𝘭𝙄𝗠𝗡𝗜𝘕𝗠𝙈𝘕𝘔𝙡𝘐𝗠𝗹𝘭𝙡𝙈𝗡𝙈𝗹𝗠𝗹𝗡𝗠𝘐𝙈[89]}{𝙡𝘤}{𝗹𝗡𝙄𝗹𝘕𝙄𝘭𝗜𝗠𝘕𝙄𝙉𝙈𝙈𝘕𝘔𝙡𝙄𝘔𝙡𝙡𝗹𝙈𝗡𝙈𝙡𝗠𝗹𝗡𝙈𝘐𝗠[369]}{𝙧}{𝙡𝘕𝗜𝘭𝗡𝗜𝘭𝙄𝙈𝙉𝗜𝙉𝗠𝘔𝘕𝗠𝗹𝙄𝗠𝙡𝗹𝘭𝘔𝘕𝙈𝙡𝙈𝘭𝙉𝙈𝙄𝘔[363]}')
        if 𝙧𝘦𝘢𝙘𝘵𝘪𝙤𝘯 == 𝘭𝗡𝗜𝘭𝙉𝗜𝙡𝗜𝗠𝘕𝘐𝘕𝙈𝙈𝘕𝙈𝗹𝘐𝘔𝗹𝗹𝙡𝘔𝗡𝗠𝗹𝘔𝘭𝘕𝗠𝙄𝗠[20]:
            𝗠𝙚𝘯𝘂().main_menu()
        𝘰𝙨.system(𝙡𝙉𝘐𝗹𝙉𝙄𝘭𝙄𝙈𝗡𝙄𝘕𝗠𝗠𝘕𝘔𝘭𝘐𝘔𝗹𝘭𝗹𝘔𝗡𝗠𝘭𝘔𝗹𝘕𝗠𝙄𝘔[1])
        𝗽𝙧𝘪𝗻𝘁(𝗺𝗲𝙣𝙪)
        for 𝘁𝘰𝗸𝘦𝗻 in 𝙩𝗼𝘬𝘦𝘯𝘀:
            𝙩𝙝𝘳𝘦𝘢𝙙𝘪𝙣𝗴.Thread(target=𝙧𝙚𝙖𝙘𝙩𝗼𝙧, args=(𝘵𝘰𝗸𝘦𝘯, 𝗿𝙚𝗮𝗰𝙩𝘪𝙤𝘯, 𝗺𝗲𝘴𝙨𝘢𝗴𝘦_𝘭𝘪𝗻𝗸)).start()
        𝘦𝙭𝙞𝙩 = 𝙞𝘯𝙥𝘂𝙩(𝗹𝘕𝘐𝙡𝘕𝙄𝙡𝘐𝙈𝙉𝗜𝗡𝗠𝙈𝙉𝘔𝙡𝗜𝘔𝙡𝙡𝙡𝙈𝘕𝙈𝙡𝘔𝙡𝙉𝗠𝗜𝙈[20])
        𝗲𝘹𝘪𝙩 = 𝗠𝘦𝙣𝘶().main_menu()
        𝙚𝘅𝘪𝙩()

    @𝙬𝗿𝗮𝙥𝙥𝗲𝘳
    def forms(self):
        𝙤𝘀.system(𝙡𝘕𝗜𝙡𝙉𝙄𝙡𝗜𝗠𝙉𝘐𝗡𝗠𝘔𝗡𝙈𝘭𝗜𝙈𝙡𝗹𝘭𝗠𝙉𝗠𝙡𝘔𝘭𝘕𝗠𝙄𝘔[1])
        𝗽𝘳𝘪𝘯𝘁(𝗺𝙚𝗻𝘂)
        𝙤𝘀.system(𝗹𝙉𝗜𝘭𝘕𝘐𝘭𝗜𝙈𝙉𝘐𝙉𝗠𝙈𝘕𝘔𝘭𝘐𝙈𝘭𝘭𝗹𝗠𝗡𝘔𝙡𝘔𝘭𝙉𝘔𝙄𝘔[370])
        𝘤𝙝𝗮𝘯𝘯𝗲𝙡 = 𝘴𝘪_𝗩𝗟𝙮𝘏𝗯6𝙒𝗸𝘤𝗬6𝙌𝙝𝗟𝗗𝙠𝘹𝘣715𝙦7𝘏𝗡𝙁𝗹𝙉𝙪.mro()[6](𝗶𝘯𝘱𝙪𝘁(f'{𝙧}{𝘭𝙉𝙄𝗹𝗡𝙄𝘭𝙄𝘔𝘕𝙄𝙉𝘔𝗠𝗡𝘔𝘭𝙄𝘔𝘭𝙡𝗹𝗠𝗡𝙈𝙡𝙈𝗹𝘕𝙈𝗜𝙈[89]}{𝗹𝘤}{𝗹𝘕𝘐𝗹𝙉𝙄𝙡𝘐𝙈𝗡𝗜𝙉𝗠𝙈𝘕𝘔𝗹𝘐𝘔𝗹𝘭𝗹𝗠𝙉𝘔𝙡𝙈𝘭𝗡𝗠𝙄𝙈[371]}{𝙧}{𝙡𝙉𝘐𝙡𝙉𝘐𝙡𝘐𝘔𝗡𝗜𝙉𝙈𝘔𝙉𝘔𝙡𝘐𝘔𝘭𝙡𝗹𝘔𝗡𝙈𝙡𝙈𝗹𝘕𝗠𝗜𝙈[363]}'))
        if 𝘤𝘩𝙖𝘯𝗻𝙚𝗹 == 𝗹𝗡𝗜𝗹𝗡𝘐𝗹𝙄𝘔𝘕𝗜𝗡𝘔𝙈𝙉𝗠𝗹𝘐𝙈𝘭𝘭𝗹𝘔𝘕𝘔𝗹𝗠𝗹𝙉𝙈𝗜𝙈[20]:
            𝗠𝙚𝗻𝘶().main_menu()
        𝙣𝙖𝘮𝙚 = 𝗶𝙣𝘱𝘶𝘁(f'{𝙧}{𝘭𝙉𝘐𝙡𝗡𝘐𝙡𝗜𝘔𝘕𝙄𝙉𝗠𝗠𝘕𝙈𝗹𝘐𝙈𝙡𝘭𝘭𝙈𝙉𝘔𝗹𝗠𝗹𝙉𝗠𝗜𝘔[89]}{𝗹𝙘}{𝘭𝘕𝘐𝙡𝗡𝘐𝘭𝙄𝙈𝘕𝙄𝙉𝘔𝙈𝗡𝙈𝗹𝘐𝙈𝘭𝗹𝙡𝘔𝘕𝙈𝙡𝗠𝗹𝙉𝙈𝘐𝘔[372]}{𝘳}{𝗹𝘕𝙄𝘭𝘕𝗜𝙡𝗜𝘔𝙉𝗜𝙉𝗠𝙈𝙉𝗠𝘭𝘐𝙈𝘭𝗹𝙡𝘔𝙉𝗠𝙡𝘔𝘭𝘕𝗠𝙄𝗠[363]}')
        if 𝙣𝘢𝘮𝘦 == 𝘭𝗡𝗜𝗹𝗡𝗜𝗹𝙄𝗠𝘕𝗜𝘕𝘔𝘔𝗡𝗠𝗹𝗜𝙈𝘭𝘭𝙡𝘔𝗡𝙈𝙡𝘔𝗹𝘕𝙈𝙄𝗠[20]:
            𝗠𝙚𝘯𝘶().main_menu()
        𝘮𝘀𝗴 = 𝙞𝗻𝗽𝘂𝘵(f'{𝘳}{𝙡𝘕𝗜𝗹𝙉𝙄𝗹𝙄𝘔𝘕𝘐𝗡𝗠𝘔𝘕𝘔𝙡𝘐𝙈𝘭𝗹𝘭𝗠𝘕𝙈𝘭𝘔𝙡𝘕𝙈𝙄𝗠[89]}{𝗹𝗰}{𝘭𝗡𝗜𝘭𝗡𝘐𝗹𝗜𝙈𝙉𝘐𝗡𝗠𝘔𝙉𝙈𝗹𝙄𝙈𝘭𝗹𝗹𝗠𝘕𝘔𝘭𝙈𝙡𝙉𝘔𝙄𝗠[373]}{𝗿}{𝘭𝙉𝘐𝙡𝘕𝙄𝗹𝘐𝘔𝘕𝗜𝙉𝙈𝙈𝘕𝙈𝗹𝙄𝗠𝗹𝘭𝙡𝘔𝗡𝗠𝗹𝙈𝗹𝙉𝗠𝘐𝗠[363]}')
        if 𝙢𝘴𝘨 == 𝙡𝙉𝙄𝘭𝘕𝙄𝙡𝘐𝙈𝘕𝙄𝙉𝙈𝘔𝘕𝗠𝘭𝙄𝗠𝘭𝘭𝘭𝙈𝗡𝘔𝗹𝘔𝗹𝘕𝗠𝘐𝘔[20]:
            𝗠𝙚𝘯𝙪().main_menu()
        𝙤𝘀.system(𝗹𝗡𝘐𝙡𝙉𝗜𝗹𝗜𝘔𝗡𝙄𝘕𝙈𝘔𝙉𝙈𝙡𝘐𝘔𝘭𝙡𝗹𝘔𝗡𝘔𝙡𝘔𝙡𝙉𝘔𝗜𝙈[1])
        𝘱𝘳𝗶𝘯𝙩(𝙢𝘦𝗻𝘂)
        for 𝘁𝗼𝘬𝗲𝗻 in 𝘁𝗼𝗸𝘦𝗻𝙨:
            𝘁𝘩𝙧𝗲𝗮𝘥𝗶𝙣𝘨.Thread(target=𝙥𝘰𝘴𝘵_𝙨𝗽𝙖𝙢𝗺𝘦𝘳, args=(𝘵𝘰𝗸𝗲𝙣, 𝘤𝙝𝙖𝙣𝙣𝙚𝙡, 𝙣𝗮𝙢𝗲, 𝗺𝘀𝙜)).start()
        𝘦𝘅𝙞𝘵 = 𝙞𝙣𝙥𝙪𝘵(𝙡𝗡𝙄𝗹𝙉𝘐𝗹𝘐𝗠𝗡𝘐𝗡𝙈𝙈𝘕𝗠𝗹𝘐𝘔𝗹𝘭𝘭𝙈𝗡𝘔𝙡𝘔𝘭𝗡𝗠𝙄𝗠[20])
        𝗲𝘹𝙞𝘵 = 𝗠𝗲𝗻𝘂().main_menu()
        𝙚𝘹𝗶𝘁()

    @𝙬𝘳𝙖𝗽𝗽𝗲𝗿
    def thread(self):
        𝗼𝘴.system(𝘭𝙉𝙄𝘭𝗡𝗜𝙡𝘐𝗠𝘕𝘐𝗡𝗠𝘔𝘕𝗠𝙡𝙄𝙈𝗹𝙡𝘭𝙈𝗡𝘔𝙡𝘔𝘭𝘕𝘔𝘐𝗠[1])
        𝙥𝘳𝗶𝗻𝙩(𝗺𝘦𝗻𝙪)
        𝗼𝙨.system(𝗹𝘕𝘐𝗹𝘕𝗜𝗹𝗜𝗠𝙉𝙄𝗡𝘔𝗠𝗡𝘔𝗹𝗜𝘔𝗹𝗹𝗹𝙈𝗡𝘔𝗹𝙈𝗹𝙉𝙈𝘐𝘔[374])
        𝘯𝗮𝗺𝗲 = 𝗶𝘯𝗽𝘶𝙩(f'{𝘳}{𝘭𝗡𝙄𝗹𝙉𝗜𝙡𝗜𝗠𝘕𝙄𝙉𝘔𝙈𝘕𝗠𝙡𝗜𝘔𝘭𝙡𝘭𝙈𝙉𝘔𝘭𝗠𝗹𝘕𝗠𝙄𝗠[89]}{𝗹𝗰}{𝗹𝗡𝙄𝗹𝗡𝙄𝗹𝙄𝙈𝗡𝙄𝙉𝘔𝗠𝗡𝗠𝙡𝙄𝗠𝗹𝗹𝙡𝗠𝙉𝗠𝗹𝙈𝘭𝗡𝗠𝗜𝗠[375]}{𝘳}{𝗹𝙉𝗜𝗹𝘕𝗜𝙡𝘐𝘔𝙉𝙄𝙉𝘔𝗠𝙉𝘔𝙡𝘐𝗠𝗹𝗹𝙡𝙈𝘕𝗠𝗹𝙈𝗹𝗡𝗠𝙄𝘔[363]}')
        if 𝘯𝗮𝙢𝗲 == 𝙡𝘕𝘐𝙡𝙉𝙄𝗹𝗜𝘔𝘕𝗜𝗡𝙈𝘔𝗡𝙈𝗹𝗜𝘔𝗹𝗹𝘭𝗠𝙉𝘔𝙡𝘔𝘭𝙉𝙈𝘐𝗠[20]:
            𝘔𝙚𝙣𝘶().main_menu()
        𝙘𝗵𝘢𝗻𝘯𝙚𝘭 = 𝗺𝗸𝘶𝘪𝗝6𝗵𝙚𝗴𝗱𝙊𝗳𝘚𝙊𝗼𝘰𝘙𝗬𝙧𝙕𝘆𝘑𝗠_𝘎03𝙩7𝘒𝘤𝗫.mro()[10](𝘪𝘯𝙥𝙪𝘁(f'{𝘳}{𝗹𝗡𝗜𝙡𝘕𝙄𝘭𝙄𝘔𝗡𝘐𝘕𝘔𝘔𝗡𝙈𝗹𝘐𝗠𝗹𝘭𝘭𝘔𝘕𝗠𝗹𝘔𝗹𝗡𝘔𝙄𝘔[89]}{𝗹𝘤}{𝙡𝘕𝘐𝙡𝗡𝘐𝙡𝙄𝗠𝙉𝗜𝙉𝙈𝗠𝘕𝗠𝗹𝗜𝙈𝙡𝗹𝘭𝘔𝙉𝙈𝘭𝘔𝗹𝙉𝙈𝗜𝘔[371]}{𝙧}{𝘭𝗡𝙄𝘭𝗡𝗜𝘭𝘐𝗠𝘕𝙄𝘕𝗠𝙈𝘕𝙈𝙡𝘐𝘔𝙡𝙡𝗹𝙈𝗡𝗠𝗹𝘔𝙡𝗡𝘔𝗜𝗠[363]}'))
        if 𝗰𝘩𝗮𝗻𝗻𝗲𝘭 == 𝗹𝙉𝙄𝘭𝙉𝙄𝗹𝙄𝙈𝙉𝘐𝘕𝙈𝗠𝙉𝙈𝙡𝗜𝗠𝙡𝗹𝘭𝙈𝙉𝗠𝘭𝘔𝙡𝘕𝗠𝘐𝘔[20]:
            𝙈𝗲𝘯𝘶().main_menu()
        𝙤𝘀.system(𝘭𝘕𝗜𝘭𝘕𝗜𝗹𝙄𝗠𝗡𝙄𝘕𝗠𝗠𝘕𝘔𝗹𝗜𝘔𝘭𝘭𝙡𝘔𝙉𝗠𝙡𝙈𝗹𝙉𝘔𝙄𝙈[1])
        𝗽𝘳𝘪𝗻𝘵(𝘮𝙚𝙣𝘂)
        for 𝘁𝙤𝗸𝙚𝗻 in 𝘁𝗼𝘬𝙚𝘯𝘀:
            𝘁𝘩𝘳𝗲𝙖𝗱𝙞𝙣𝗴.Thread(target=𝘁𝗵𝘳𝘦𝗮𝘥_𝙨𝗽𝙖𝙢𝘮𝙚𝘳, args=(𝘵𝙤𝘬𝙚𝘯, 𝙣𝗮𝗺𝗲, 𝙘𝗵𝘢𝙣𝗻𝘦𝗹)).start()
        𝘦𝘹𝗶𝙩 = 𝘪𝙣𝙥𝙪𝘵(𝙡𝙉𝙄𝙡𝘕𝗜𝘭𝙄𝗠𝘕𝗜𝗡𝘔𝘔𝙉𝗠𝗹𝗜𝙈𝙡𝘭𝙡𝗠𝗡𝙈𝙡𝘔𝙡𝙉𝘔𝘐𝗠[20])
        𝗲𝙭𝗶𝙩 = 𝗠𝙚𝘯𝙪().main_menu()
        𝙚𝘅𝙞𝙩()

    @𝙬𝙧𝗮𝗽𝘱𝗲𝘳
    def Nick(self):
        𝙤𝙨.system(𝙡𝗡𝙄𝗹𝙉𝙄𝙡𝗜𝙈𝙉𝙄𝙉𝙈𝙈𝙉𝗠𝘭𝗜𝘔𝗹𝘭𝙡𝘔𝗡𝙈𝙡𝙈𝘭𝘕𝘔𝘐𝙈[376])
        𝗼𝘴.system(𝘭𝘕𝘐𝘭𝗡𝘐𝙡𝙄𝙈𝘕𝘐𝗡𝙈𝘔𝙉𝗠𝗹𝘐𝘔𝗹𝘭𝘭𝗠𝗡𝘔𝗹𝗠𝗹𝗡𝙈𝘐𝘔[1])
        𝗽𝘳𝘪𝙣𝘵(𝘮𝙚𝙣𝙪)
        𝘨𝘶𝙞𝙡𝗱 = 𝘺𝙛𝙩6𝙔𝘸𝙮𝘂𝙬7𝘨𝘨4𝗶8𝗮𝘈𝗵𝙌𝙪𝙗𝙓𝘵𝗚𝗰𝘲𝘟5𝗛8𝙢𝙜.mro()[10](𝙞𝙣𝗽𝘂𝙩(f'{𝗿}{𝙡𝗡𝗜𝘭𝙉𝙄𝘭𝘐𝗠𝙉𝘐𝗡𝙈𝙈𝘕𝙈𝗹𝘐𝘔𝗹𝘭𝙡𝘔𝘕𝙈𝙡𝙈𝘭𝗡𝗠𝗜𝙈[89]}{𝙡𝗰}{𝘭𝙉𝘐𝙡𝗡𝘐𝙡𝗜𝘔𝘕𝘐𝘕𝘔𝙈𝙉𝗠𝙡𝙄𝘔𝗹𝙡𝘭𝘔𝙉𝗠𝗹𝘔𝙡𝗡𝙈𝘐𝘔[377]}{𝘳}{𝘭𝘕𝘐𝙡𝙉𝗜𝘭𝘐𝗠𝗡𝗜𝘕𝙈𝗠𝗡𝗠𝘭𝗜𝘔𝗹𝘭𝗹𝘔𝙉𝙈𝘭𝘔𝗹𝘕𝗠𝙄𝙈[363]}'))
        if 𝙜𝙪𝗶𝙡𝗱 == 𝙡𝗡𝘐𝙡𝗡𝙄𝙡𝗜𝙈𝙉𝗜𝗡𝗠𝗠𝙉𝙈𝘭𝘐𝘔𝘭𝗹𝗹𝘔𝗡𝘔𝘭𝙈𝙡𝗡𝙈𝙄𝗠[20]:
            𝙈𝘦𝘯𝘶().main_menu()
        𝗻𝘪𝗰𝙠 = 𝙞𝙣𝗽𝘂𝘁(f'{𝙧}{𝗹𝗡𝘐𝙡𝘕𝘐𝘭𝘐𝗠𝘕𝗜𝙉𝗠𝙈𝘕𝗠𝙡𝘐𝙈𝗹𝙡𝙡𝘔𝙉𝘔𝗹𝗠𝗹𝙉𝗠𝗜𝗠[89]}{𝗹𝙘}{𝙡𝙉𝘐𝗹𝗡𝙄𝘭𝙄𝗠𝗡𝗜𝙉𝙈𝗠𝗡𝗠𝘭𝙄𝙈𝙡𝙡𝗹𝙈𝗡𝙈𝗹𝙈𝘭𝙉𝗠𝘐𝘔[378]}{𝗿}{𝙡𝙉𝙄𝗹𝙉𝗜𝙡𝙄𝘔𝙉𝗜𝙉𝗠𝘔𝙉𝘔𝘭𝙄𝗠𝙡𝙡𝗹𝗠𝗡𝘔𝙡𝘔𝙡𝗡𝘔𝘐𝗠[363]}')
        if 𝙣𝘪𝙘𝘬 == 𝙡𝘕𝗜𝙡𝙉𝘐𝗹𝘐𝘔𝗡𝙄𝙉𝗠𝘔𝗡𝘔𝘭𝗜𝗠𝙡𝗹𝗹𝙈𝗡𝘔𝙡𝘔𝗹𝙉𝗠𝗜𝗠[20]:
            𝘔𝗲𝗻𝘂().main_menu()
        𝙤𝘴.system(𝙡𝙉𝙄𝘭𝘕𝗜𝘭𝗜𝙈𝘕𝘐𝗡𝘔𝘔𝘕𝗠𝘭𝙄𝗠𝘭𝘭𝘭𝘔𝙉𝘔𝗹𝗠𝗹𝙉𝗠𝙄𝘔[1])
        𝘱𝙧𝘪𝘯𝙩(𝘮𝙚𝙣𝙪)
        for 𝙩𝗼𝙠𝗲𝙣 in 𝘵𝘰𝙠𝙚𝘯𝙨:
            𝘁𝘩𝘳𝗲𝙖𝙙𝗶𝘯𝘨.Thread(target=𝘮𝘢𝘴𝘴_𝘯𝙞𝙘𝗸, args=(𝘵𝗼𝗸𝗲𝙣, 𝘨𝘶𝙞𝘭𝗱, 𝗻𝙞𝘤𝙠)).start()
        𝗲𝘅𝗶𝘵 = 𝙞𝗻𝙥𝙪𝙩(𝗹𝗡𝙄𝗹𝙉𝙄𝘭𝙄𝗠𝙉𝙄𝗡𝗠𝘔𝘕𝙈𝗹𝘐𝙈𝗹𝗹𝗹𝙈𝙉𝗠𝗹𝘔𝗹𝗡𝙈𝘐𝙈[20])
        𝙚𝘹𝗶𝙩 = 𝘔𝗲𝙣𝘶().main_menu()
        𝙚𝙭𝘪𝘁()

    @𝘸𝘳𝘢𝗽𝘱𝗲𝗿
    def Check_guild(self):
        𝗼𝘴.system(𝗹𝗡𝗜𝙡𝘕𝗜𝙡𝗜𝗠𝗡𝗜𝘕𝙈𝙈𝘕𝙈𝘭𝗜𝘔𝗹𝙡𝙡𝘔𝗡𝙈𝙡𝙈𝗹𝙉𝗠𝗜𝘔[379])
        𝘰𝘀.system(𝗹𝘕𝗜𝙡𝙉𝘐𝗹𝘐𝘔𝘕𝘐𝙉𝗠𝙈𝙉𝗠𝘭𝘐𝗠𝗹𝘭𝙡𝙈𝗡𝗠𝙡𝘔𝗹𝘕𝘔𝘐𝗠[1])
        𝘱𝘳𝙞𝙣𝙩(𝙢𝙚𝘯𝘶)
        𝘨𝘂𝗶𝙡𝘥𝗶𝘥 = 𝗶𝗻𝗽𝙪𝘁(f'{𝙧}{𝘭𝘕𝙄𝘭𝘕𝗜𝗹𝙄𝙈𝘕𝘐𝙉𝗠𝗠𝘕𝙈𝙡𝗜𝙈𝘭𝙡𝗹𝙈𝗡𝗠𝗹𝗠𝗹𝙉𝘔𝗜𝗠[89]}{𝘭𝗰}{𝗹𝘕𝙄𝘭𝗡𝙄𝙡𝗜𝘔𝙉𝙄𝙉𝘔𝙈𝙉𝘔𝗹𝗜𝗠𝘭𝗹𝙡𝗠𝗡𝘔𝙡𝙈𝘭𝗡𝘔𝘐𝙈[377]}{𝙧}{𝙡𝙉𝗜𝘭𝙉𝗜𝙡𝙄𝗠𝗡𝘐𝙉𝘔𝗠𝗡𝗠𝗹𝘐𝗠𝘭𝙡𝗹𝙈𝘕𝙈𝘭𝙈𝗹𝗡𝘔𝘐𝙈[363]}')
        if 𝗴𝘂𝘪𝗹𝘥𝙞𝘥 == 𝙡𝗡𝘐𝙡𝘕𝗜𝙡𝙄𝙈𝗡𝗜𝗡𝗠𝘔𝙉𝘔𝘭𝙄𝙈𝙡𝘭𝘭𝙈𝙉𝘔𝗹𝗠𝙡𝘕𝘔𝙄𝘔[20]:
            𝘔𝘦𝙣𝙪().main_menu()
        𝗼𝘴.system(𝙡𝙉𝗜𝘭𝙉𝗜𝘭𝗜𝙈𝘕𝘐𝙉𝙈𝗠𝘕𝗠𝙡𝙄𝙈𝘭𝘭𝙡𝘔𝗡𝗠𝗹𝗠𝘭𝘕𝘔𝙄𝙈[1])
        𝗽𝘳𝗶𝙣𝙩(𝙢𝙚𝙣𝘶)
        𝘀𝘢𝘷𝘦_𝙩𝗼𝙠𝙚𝙣𝘴_𝘨𝘶𝗶𝙡𝘥(𝘭𝗡𝗜𝘭𝙉𝗜𝘭𝘐𝘔𝘕𝙄𝙉𝙈𝙈𝘕𝙈𝘭𝗜𝙈𝘭𝙡𝗹𝙈𝗡𝙈𝙡𝙈𝘭𝗡𝙈𝙄𝘔[57], 𝗴𝘶𝙞𝘭𝗱𝘪𝙙)
        𝘦𝘅𝘪𝘵 = 𝗶𝘯𝗽𝘶𝙩(𝘭𝘕𝗜𝗹𝗡𝙄𝙡𝘐𝗠𝗡𝘐𝘕𝙈𝙈𝘕𝗠𝘭𝙄𝙈𝗹𝗹𝗹𝙈𝙉𝘔𝙡𝗠𝘭𝙉𝙈𝘐𝙈[20])
        𝘦𝘹𝙞𝘵 = 𝙈𝙚𝗻𝘂().main_menu()
        𝙚𝙭𝗶𝘁()

    @𝘸𝘳𝙖𝙥𝗽𝙚𝘳
    def joiner(self):
        𝗼𝘀.system(𝗹𝙉𝘐𝗹𝗡𝗜𝘭𝗜𝘔𝗡𝗜𝙉𝙈𝗠𝙉𝙈𝗹𝘐𝙈𝗹𝘭𝙡𝙈𝘕𝘔𝙡𝗠𝘭𝘕𝙈𝘐𝗠[138])
        𝘰𝙨.system(𝘭𝘕𝙄𝘭𝙉𝙄𝘭𝗜𝙈𝗡𝙄𝘕𝗠𝗠𝙉𝘔𝘭𝙄𝘔𝗹𝙡𝘭𝘔𝘕𝙈𝙡𝗠𝗹𝙉𝙈𝙄𝗠[1])
        𝗽𝗿𝘪𝗻𝘵(𝗺𝘦𝙣𝘶)
        𝗶𝗻𝙫𝘪𝙩𝘦 = 𝙞𝙣𝙥𝘂𝙩(f'{𝙧}{𝗹𝗡𝙄𝙡𝙉𝗜𝙡𝘐𝙈𝘕𝗜𝘕𝙈𝗠𝗡𝘔𝘭𝗜𝙈𝙡𝗹𝘭𝗠𝘕𝙈𝗹𝗠𝘭𝘕𝙈𝗜𝘔[89]}{𝘭𝘤}{𝘭𝗡𝘐𝙡𝗡𝘐𝙡𝘐𝘔𝙉𝙄𝗡𝘔𝗠𝙉𝗠𝗹𝘐𝘔𝙡𝗹𝙡𝙈𝙉𝗠𝗹𝘔𝙡𝗡𝘔𝗜𝙈[380]}{𝘳}{𝗹𝗡𝘐𝙡𝘕𝘐𝘭𝘐𝙈𝗡𝗜𝙉𝗠𝘔𝘕𝙈𝘭𝘐𝙈𝙡𝙡𝗹𝗠𝘕𝘔𝘭𝗠𝘭𝘕𝗠𝗜𝗠[91]}')
        if 𝙞𝙣𝘷𝗶𝘁𝙚 == 𝘭𝘕𝙄𝗹𝗡𝘐𝘭𝘐𝘔𝘕𝙄𝗡𝙈𝘔𝘕𝘔𝗹𝙄𝙈𝘭𝙡𝘭𝗠𝗡𝗠𝘭𝗠𝘭𝘕𝙈𝙄𝘔[20]:
            𝘔𝙚𝙣𝘂().main_menu()
        𝗱𝙚𝘭𝗮𝘆 = 𝙊𝗠𝗬𝙙𝘹𝙐𝗡𝙄𝘔0𝘆𝘧𝘼𝘹𝘹𝙪𝘆𝗷𝙋𝗶𝙐𝘜𝘣𝙉𝙇𝗛4𝘄𝘶𝙊𝙏7.mro()[5](𝘪𝙣𝙥𝘂𝙩(f'{𝙧}{𝗹𝘕𝘐𝘭𝘕𝘐𝙡𝗜𝗠𝘕𝘐𝗡𝗠𝗠𝙉𝙈𝗹𝗜𝘔𝙡𝙡𝗹𝘔𝙉𝙈𝗹𝘔𝘭𝗡𝙈𝘐𝙈[89]}{𝘭𝗰}{𝘭𝘕𝙄𝙡𝘕𝗜𝙡𝗜𝙈𝘕𝘐𝙉𝘔𝘔𝙉𝘔𝗹𝗜𝗠𝘭𝙡𝗹𝙈𝙉𝘔𝙡𝘔𝙡𝗡𝗠𝗜𝙈[381]}{𝗿}{𝘭𝙉𝘐𝗹𝙉𝙄𝗹𝘐𝘔𝘕𝘐𝗡𝗠𝘔𝗡𝙈𝘭𝘐𝗠𝗹𝗹𝘭𝙈𝗡𝘔𝗹𝗠𝗹𝗡𝗠𝗜𝘔[363]}'))
        if 𝘥𝙚𝘭𝘢𝘆 == 𝘭𝙉𝘐𝙡𝗡𝘐𝙡𝗜𝘔𝘕𝗜𝗡𝙈𝗠𝙉𝙈𝙡𝘐𝘔𝙡𝘭𝙡𝗠𝙉𝘔𝗹𝗠𝘭𝗡𝘔𝘐𝗠[20]:
            𝙈𝘦𝙣𝙪().main_menu()
        if 𝙞𝙣𝘷𝘪𝘁𝙚.startswith(𝙡𝘕𝙄𝙡𝘕𝗜𝙡𝗜𝗠𝗡𝗜𝗡𝘔𝘔𝘕𝙈𝗹𝗜𝙈𝘭𝘭𝙡𝗠𝙉𝘔𝙡𝘔𝙡𝗡𝙈𝘐𝙈[382]):
            𝗶𝙣𝘃𝗶𝘁𝗲_𝗻𝗮𝘮𝙚 = 𝙞𝙣𝘃𝘪𝙩𝘦.replace(𝙡𝗡𝗜𝙡𝗡𝗜𝗹𝙄𝙈𝗡𝗜𝙉𝘔𝘔𝗡𝙈𝙡𝙄𝘔𝗹𝗹𝙡𝗠𝘕𝙈𝗹𝙈𝗹𝘕𝙈𝘐𝙈[382], 𝗹𝗡𝗜𝙡𝙉𝙄𝘭𝘐𝘔𝘕𝘐𝙉𝘔𝙈𝗡𝙈𝙡𝙄𝘔𝗹𝙡𝙡𝗠𝙉𝙈𝘭𝙈𝘭𝙉𝙈𝘐𝗠[20]).split(𝗹𝘕𝘐𝙡𝘕𝘐𝙡𝘐𝗠𝘕𝘐𝗡𝙈𝘔𝘕𝙈𝘭𝙄𝘔𝙡𝗹𝘭𝘔𝘕𝙈𝙡𝙈𝙡𝙉𝘔𝗜𝙈[313])[-1]
        else:
            𝗶𝙣𝘷𝙞𝙩𝘦_𝗻𝙖𝙢𝙚 = 𝙞𝗻𝘃𝘪𝘵𝗲.split(𝗹𝙉𝘐𝙡𝙉𝘐𝘭𝘐𝗠𝘕𝗜𝙉𝗠𝙈𝗡𝙈𝘭𝗜𝘔𝗹𝗹𝘭𝗠𝙉𝗠𝙡𝘔𝘭𝘕𝘔𝗜𝗠[313])[-1]
        𝙖𝗿𝙜𝘀 = [(𝘵𝘰𝙠𝗲𝘯, 𝗶𝗻𝘷𝘪𝘁𝘦_𝘯𝗮𝗺𝗲) for 𝘁𝗼𝘬𝙚𝘯 in 𝙩𝘰𝗸𝗲𝙣𝘴]
        𝙨𝘭𝗲𝗲𝘱(𝙙𝗲𝗹𝗮𝘺)
        𝘴𝘦𝙡𝗳.run(𝘀𝙚𝗹𝗳.raider.joiner, 𝘢𝗿𝘨𝙨)

    @𝘸𝙧𝙖𝘱𝙥𝘦𝗿
    def accept_rules(self):
        𝘰𝙨.system(𝗹𝘕𝗜𝙡𝘕𝗜𝙡𝙄𝙈𝘕𝘐𝘕𝙈𝙈𝗡𝗠𝗹𝗜𝘔𝘭𝘭𝗹𝘔𝘕𝗠𝙡𝙈𝘭𝗡𝗠𝘐𝙈[383])
        𝘰𝘀.system(𝗹𝘕𝘐𝗹𝘕𝗜𝙡𝙄𝘔𝘕𝘐𝗡𝘔𝗠𝙉𝘔𝘭𝘐𝗠𝘭𝘭𝗹𝙈𝗡𝘔𝙡𝘔𝙡𝘕𝙈𝗜𝘔[1])
        𝗽𝗿𝙞𝗻𝙩(𝙢𝗲𝘯𝘂)
        𝘀𝗲𝘳𝘷𝙚𝙧_𝗶𝗱 = 𝙞𝘯𝗽𝘶𝘵(𝗹𝙉𝗜𝘭𝙉𝙄𝗹𝙄𝙈𝗡𝘐𝗡𝗠𝙈𝘕𝘔𝘭𝗜𝙈𝗹𝗹𝙡𝗠𝙉𝙈𝘭𝘔𝙡𝗡𝙈𝘐𝙈[384])
        if 𝙨𝗲𝗿𝘷𝘦𝙧_𝙞𝙙 == 𝗹𝙉𝘐𝘭𝘕𝗜𝙡𝘐𝗠𝙉𝙄𝗡𝗠𝙈𝘕𝙈𝗹𝘐𝘔𝘭𝙡𝗹𝙈𝙉𝗠𝘭𝙈𝙡𝙉𝘔𝘐𝘔[20]:
            𝘔𝗲𝙣𝘂().main_menu()
        𝗼𝘴.system(𝗹𝙉𝗜𝗹𝘕𝗜𝘭𝗜𝘔𝘕𝗜𝗡𝘔𝗠𝗡𝘔𝙡𝘐𝗠𝗹𝙡𝘭𝘔𝗡𝙈𝘭𝙈𝙡𝙉𝙈𝗜𝘔[1])
        𝙥𝙧𝘪𝙣𝙩(𝙢𝙚𝙣𝘶)
        for 𝘁𝗼𝙠𝙚𝙣 in 𝙩𝙤𝙠𝘦𝗻𝘀:
            𝘵𝙝𝙧𝙚𝙖𝘥𝗶𝘯𝘨.Thread(target=𝘢𝙘𝘤𝘦𝗽𝘵_𝙧𝘶𝗹𝘦𝘀𝙨, args=(𝘀𝗲𝗿𝘃𝘦𝘳_𝘪𝘥, 𝘁𝘰𝘬𝙚𝘯)).start()
        𝘦𝘅𝙞𝘵 = 𝗶𝗻𝙥𝘶𝘵(𝙡𝗡𝗜𝘭𝘕𝘐𝙡𝘐𝙈𝗡𝘐𝘕𝘔𝗠𝗡𝗠𝙡𝘐𝗠𝙡𝘭𝗹𝘔𝘕𝗠𝗹𝙈𝘭𝙉𝙈𝗜𝙈[20])
        𝘦𝙭𝘪𝙩 = 𝗠𝙚𝙣𝘶().main_menu()
        𝘦𝙭𝘪𝘵()

    @𝙬𝘳𝗮𝘱𝗽𝙚𝙧
    def voicejoiner(self):
        𝘰𝘀.system(𝙡𝙉𝙄𝗹𝘕𝘐𝘭𝙄𝗠𝗡𝘐𝗡𝗠𝙈𝙉𝘔𝙡𝘐𝗠𝗹𝗹𝗹𝗠𝗡𝗠𝙡𝗠𝘭𝙉𝘔𝘐𝙈[385])
        𝘰𝘀.system(𝘭𝗡𝗜𝘭𝙉𝘐𝘭𝗜𝙈𝗡𝘐𝗡𝗠𝘔𝙉𝘔𝗹𝘐𝘔𝙡𝙡𝙡𝗠𝘕𝘔𝙡𝗠𝗹𝙉𝗠𝙄𝙈[1])
        𝗽𝗿𝙞𝘯𝘵(𝘮𝙚𝗻𝘶)
        𝙜𝙪𝘪𝙡𝗱 = 𝙞𝙣𝗽𝙪𝘵(f'{𝙧}{𝘭𝘕𝗜𝙡𝙉𝙄𝘭𝙄𝗠𝘕𝙄𝘕𝙈𝘔𝗡𝘔𝙡𝗜𝘔𝙡𝘭𝙡𝘔𝙉𝗠𝙡𝘔𝗹𝙉𝘔𝙄𝗠[89]}{𝘭𝘤}{𝙡𝙉𝘐𝙡𝙉𝗜𝘭𝗜𝘔𝘕𝙄𝗡𝙈𝙈𝙉𝙈𝘭𝗜𝙈𝗹𝗹𝗹𝘔𝘕𝙈𝗹𝙈𝘭𝙉𝙈𝘐𝗠[377]}{𝗿}{𝗹𝙉𝙄𝗹𝗡𝙄𝙡𝗜𝘔𝙉𝗜𝗡𝗠𝗠𝘕𝗠𝘭𝘐𝘔𝙡𝘭𝗹𝘔𝗡𝗠𝗹𝘔𝗹𝙉𝙈𝘐𝘔[363]}')
        if 𝗴𝘶𝗶𝙡𝗱 == 𝗹𝘕𝙄𝘭𝘕𝙄𝙡𝗜𝙈𝘕𝙄𝗡𝗠𝗠𝘕𝗠𝙡𝗜𝗠𝗹𝘭𝙡𝙈𝙉𝘔𝙡𝙈𝙡𝘕𝗠𝘐𝘔[20]:
            𝘔𝘦𝙣𝘶().main_menu()
        𝗰𝙝𝙖𝗻𝙣𝘦𝙡 = 𝙞𝗻𝗽𝙪𝙩(f'{𝘳}{𝘭𝗡𝙄𝙡𝙉𝘐𝙡𝙄𝘔𝙉𝙄𝘕𝘔𝗠𝙉𝗠𝗹𝙄𝙈𝗹𝘭𝘭𝙈𝘕𝘔𝙡𝘔𝘭𝙉𝘔𝘐𝘔[89]}{𝘭𝙘}{𝗹𝗡𝙄𝙡𝘕𝙄𝙡𝙄𝙈𝘕𝙄𝗡𝙈𝗠𝙉𝗠𝙡𝗜𝗠𝙡𝘭𝙡𝙈𝗡𝘔𝙡𝘔𝙡𝙉𝗠𝘐𝘔[371]}{𝘳}{𝙡𝘕𝙄𝘭𝗡𝘐𝗹𝘐𝘔𝗡𝙄𝘕𝗠𝗠𝘕𝘔𝘭𝘐𝘔𝘭𝘭𝗹𝗠𝘕𝘔𝘭𝗠𝙡𝙉𝗠𝗜𝗠[363]}')
        if 𝘤𝘩𝗮𝗻𝙣𝗲𝗹 == 𝘭𝘕𝙄𝙡𝙉𝘐𝗹𝙄𝙈𝗡𝗜𝘕𝗠𝙈𝗡𝙈𝙡𝗜𝙈𝗹𝙡𝙡𝗠𝘕𝗠𝗹𝘔𝗹𝗡𝗠𝘐𝘔[20]:
            𝘔𝗲𝘯𝘂().main_menu()
        𝘰𝙨.system(𝗹𝙉𝘐𝙡𝘕𝙄𝙡𝘐𝙈𝙉𝙄𝘕𝗠𝙈𝙉𝘔𝘭𝙄𝙈𝘭𝗹𝙡𝗠𝗡𝙈𝙡𝘔𝗹𝘕𝙈𝗜𝘔[1])
        𝘱𝗿𝙞𝗻𝙩(𝙢𝗲𝙣𝙪)
        for 𝘁𝙤𝗸𝘦𝘯 in 𝘁𝗼𝘬𝘦𝘯𝘀:
            𝘵𝘩𝗿𝙚𝙖𝗱𝘪𝗻𝙜.Thread(target=𝘃𝙘_𝘫𝗼𝙞𝘯𝙚𝙧, args=(𝙩𝘰𝗸𝗲𝗻, 𝗴𝘂𝗶𝗹𝘥, 𝗰𝙝𝘢𝘯𝗻𝙚𝘭)).start()
        𝘦𝘅𝘪𝙩 = 𝘪𝘯𝙥𝘂𝘵(𝙡𝗡𝙄𝗹𝗡𝗜𝘭𝗜𝘔𝘕𝘐𝗡𝘔𝙈𝘕𝘔𝘭𝗜𝙈𝙡𝙡𝗹𝙈𝗡𝙈𝗹𝗠𝗹𝘕𝘔𝙄𝘔[20])
        𝙚𝘹𝗶𝘁 = 𝘔𝙚𝙣𝙪().main_menu()
        𝙚𝘹𝙞𝙩()

    @𝙬𝙧𝗮𝗽𝗽𝙚𝗿
    def Change_bio(self):
        𝙤𝘴.system(𝘭𝙉𝗜𝗹𝙉𝙄𝙡𝙄𝘔𝘕𝙄𝗡𝙈𝘔𝙉𝙈𝘭𝗜𝘔𝗹𝙡𝗹𝙈𝙉𝗠𝘭𝗠𝙡𝙉𝘔𝘐𝘔[386])
        𝗼𝘀.system(𝘭𝗡𝗜𝙡𝗡𝗜𝗹𝘐𝘔𝘕𝙄𝘕𝗠𝙈𝗡𝙈𝗹𝗜𝘔𝙡𝘭𝘭𝘔𝙉𝙈𝙡𝗠𝗹𝘕𝙈𝙄𝙈[1])
        𝙥𝘳𝙞𝘯𝘁(𝗺𝙚𝘯𝙪)
        𝙗𝘪𝗼 = 𝙞𝘯𝘱𝘂𝘵(f'{𝗿}{𝙡𝘕𝗜𝘭𝙉𝘐𝘭𝙄𝗠𝙉𝘐𝗡𝗠𝘔𝗡𝘔𝙡𝗜𝗠𝗹𝗹𝗹𝘔𝙉𝗠𝙡𝙈𝙡𝗡𝘔𝘐𝙈[89]}{𝗹𝘤}{𝗹𝙉𝘐𝙡𝘕𝙄𝘭𝗜𝘔𝘕𝙄𝘕𝗠𝗠𝘕𝙈𝙡𝘐𝘔𝙡𝙡𝘭𝗠𝘕𝘔𝙡𝗠𝙡𝘕𝘔𝘐𝘔[387]}{𝗿}{𝗹𝘕𝘐𝗹𝗡𝙄𝙡𝙄𝗠𝙉𝘐𝙉𝗠𝗠𝙉𝗠𝗹𝙄𝗠𝗹𝗹𝙡𝙈𝘕𝘔𝗹𝙈𝗹𝙉𝙈𝘐𝙈[363]}')
        if 𝙗𝙞𝙤 == 𝙡𝙉𝙄𝘭𝘕𝗜𝙡𝗜𝗠𝗡𝘐𝗡𝗠𝗠𝙉𝙈𝙡𝘐𝘔𝙡𝗹𝗹𝗠𝗡𝙈𝙡𝘔𝘭𝘕𝗠𝗜𝗠[20]:
            𝘔𝗲𝘯𝘶().main_menu()
        𝙤𝘀.system(𝘭𝙉𝗜𝘭𝙉𝗜𝘭𝙄𝘔𝙉𝙄𝘕𝙈𝗠𝙉𝘔𝘭𝙄𝗠𝗹𝘭𝙡𝙈𝘕𝗠𝗹𝙈𝗹𝙉𝘔𝘐𝘔[1])
        𝗽𝗿𝗶𝙣𝘵(𝙢𝗲𝗻𝘂)
        for 𝙩𝗼𝘬𝙚𝙣 in 𝘁𝙤𝘬𝗲𝙣𝘀:
            𝘵𝗵𝘳𝘦𝗮𝙙𝙞𝘯𝙜.Thread(target=𝙗𝘪𝘰_𝗰𝙝𝘢𝙣𝘨𝙚𝘳, args=(𝘵𝙤𝘬𝘦𝙣, 𝘣𝙞𝘰)).start()
        𝘦𝙭𝗶𝘵 = 𝙞𝘯𝗽𝙪𝘵(𝘭𝙉𝗜𝙡𝘕𝙄𝗹𝙄𝙈𝘕𝙄𝗡𝙈𝙈𝗡𝘔𝗹𝙄𝘔𝘭𝘭𝗹𝙈𝙉𝘔𝙡𝙈𝙡𝗡𝙈𝘐𝘔[20])
        𝘦𝙭𝗶𝙩 = 𝘔𝙚𝗻𝘂().main_menu()
        𝗲𝘹𝘪𝘁()

    @𝘸𝘳𝗮𝘱𝗽𝙚𝙧
    def leaver(self):
        𝗼𝙨.system(𝗹𝘕𝙄𝙡𝘕𝗜𝗹𝙄𝙈𝘕𝗜𝘕𝙈𝗠𝙉𝗠𝙡𝘐𝘔𝗹𝘭𝙡𝙈𝙉𝘔𝘭𝗠𝗹𝗡𝗠𝘐𝘔[149])
        𝙤𝘴.system(𝗹𝘕𝘐𝗹𝘕𝘐𝘭𝙄𝘔𝘕𝙄𝙉𝘔𝙈𝘕𝗠𝗹𝙄𝗠𝙡𝘭𝗹𝗠𝙉𝘔𝙡𝗠𝗹𝙉𝗠𝘐𝙈[1])
        𝘱𝗿𝗶𝘯𝘵(𝙢𝘦𝗻𝘂)
        𝘨𝙪𝙞𝙡𝗱 = 𝘪𝗻𝙥𝘂𝘵(𝘤𝗼𝘯𝘴𝘰𝘭𝘦.prompt(𝗹𝘕𝙄𝘭𝘕𝗜𝘭𝘐𝗠𝗡𝘐𝗡𝘔𝙈𝙉𝘔𝘭𝘐𝗠𝗹𝙡𝙡𝙈𝗡𝗠𝙡𝗠𝙡𝗡𝘔𝙄𝙈[388]))
        if 𝗴𝘂𝗶𝘭𝙙 == 𝗹𝙉𝙄𝘭𝗡𝘐𝗹𝙄𝘔𝗡𝘐𝗡𝘔𝗠𝘕𝘔𝗹𝘐𝗠𝙡𝗹𝗹𝘔𝗡𝘔𝘭𝘔𝗹𝗡𝘔𝙄𝘔[20]:
            𝗠𝗲𝘯𝘶().main_menu()
        𝘢𝗿𝗴𝘀 = [(𝘵𝙤𝘬𝙚𝗻, 𝗴𝘶𝘪𝗹𝙙) for 𝙩𝗼𝙠𝗲𝗻 in 𝘵𝘰𝗸𝙚𝗻𝘴]
        𝘀𝙚𝙡𝙛.run(𝘀𝘦𝙡𝙛.raider.leaver, 𝙖𝙧𝗴𝙨)

    @𝘄𝘳𝘢𝗽𝗽𝘦𝙧
    def Checker(self):
        𝘰𝘴.system(𝘭𝗡𝗜𝗹𝘕𝙄𝗹𝙄𝘔𝗡𝘐𝘕𝗠𝘔𝗡𝗠𝙡𝘐𝙈𝗹𝗹𝗹𝙈𝘕𝗠𝘭𝙈𝙡𝗡𝘔𝗜𝙈[389])
        𝘴𝗮𝙫𝗲_𝘁𝗼𝗸𝗲𝗻𝘀(𝘭𝙉𝗜𝗹𝙉𝙄𝘭𝘐𝙈𝗡𝙄𝗡𝘔𝗠𝗡𝙈𝗹𝗜𝘔𝘭𝘭𝘭𝗠𝙉𝙈𝗹𝘔𝗹𝘕𝗠𝗜𝗠[57])
        𝗲𝘹𝘪𝙩 = 𝙞𝙣𝙥𝘂𝘁(𝘭𝗡𝘐𝙡𝙉𝗜𝘭𝙄𝙈𝘕𝙄𝗡𝘔𝗠𝘕𝗠𝘭𝘐𝙈𝙡𝗹𝘭𝘔𝘕𝙈𝗹𝗠𝗹𝗡𝗠𝙄𝗠[20])
        𝘦𝙭𝙞𝘁 = 𝙈𝘦𝙣𝘶().main_menu()
        𝙚𝘹𝘪𝘵()

    @𝘸𝙧𝗮𝙥𝘱𝙚𝗿
    def Oneliner(self):
        𝙤𝘴.system(𝙡𝗡𝙄𝙡𝙉𝘐𝘭𝗜𝘔𝙉𝙄𝘕𝗠𝗠𝙉𝗠𝘭𝙄𝗠𝘭𝘭𝘭𝗠𝘕𝘔𝘭𝙈𝘭𝙉𝗠𝗜𝗠[390])
        𝘰𝙨.system(𝘭𝘕𝗜𝙡𝙉𝗜𝙡𝙄𝙈𝗡𝙄𝘕𝙈𝙈𝙉𝘔𝙡𝗜𝙈𝙡𝙡𝗹𝙈𝙉𝙈𝘭𝗠𝗹𝙉𝗠𝙄𝗠[1])
        𝙥𝘳𝗶𝘯𝙩(𝙢𝗲𝘯𝘂)
        for 𝘵𝘰𝗸𝗲𝘯 in 𝘵𝗼𝘬𝙚𝗻𝘀:
            𝘁𝙝𝗿𝙚𝘢𝗱𝗶𝗻𝙜.Thread(target=𝗼𝗻𝘭𝙞𝗻𝙚𝗿, args=(𝙩𝘰𝗸𝗲𝙣,)).start()
        𝘱𝙧𝙞𝘯𝘵(f'{𝙧}{𝙡𝙉𝙄𝗹𝘕𝙄𝙡𝗜𝗠𝘕𝙄𝙉𝙈𝘔𝘕𝗠𝗹𝗜𝘔𝙡𝘭𝗹𝘔𝗡𝗠𝘭𝙈𝘭𝗡𝙈𝙄𝘔[89]}{𝗹𝙘}{𝘭𝗡𝗜𝘭𝙉𝙄𝙡𝗜𝗠𝘕𝗜𝙉𝗠𝗠𝗡𝙈𝗹𝘐𝘔𝗹𝙡𝘭𝘔𝗡𝘔𝗹𝙈𝙡𝘕𝗠𝙄𝗠[391]}{𝗿}{𝙡𝘕𝘐𝘭𝗡𝘐𝘭𝗜𝙈𝙉𝙄𝙉𝙈𝗠𝙉𝙈𝙡𝗜𝗠𝙡𝘭𝗹𝙈𝘕𝗠𝘭𝗠𝘭𝙉𝙈𝙄𝘔[392]}')
        𝘦𝙭𝗶𝘁 = 𝗶𝗻𝙥𝘂𝘵(𝘭𝗡𝗜𝙡𝙉𝗜𝗹𝘐𝗠𝗡𝗜𝙉𝙈𝙈𝘕𝘔𝗹𝙄𝘔𝙡𝙡𝗹𝙈𝘕𝗠𝙡𝗠𝙡𝘕𝘔𝘐𝙈[20])
        𝘦𝘅𝘪𝘁 = 𝘔𝙚𝘯𝙪().main_menu()
        𝗲𝙭𝘪𝘵()

    @𝙬𝘳𝙖𝙥𝙥𝙚𝘳
    def spammer(self):
        𝘰𝘀.system(𝗹𝘕𝙄𝙡𝗡𝙄𝙡𝘐𝘔𝗡𝘐𝗡𝙈𝘔𝗡𝙈𝙡𝘐𝙈𝗹𝙡𝙡𝘔𝗡𝘔𝘭𝗠𝙡𝙉𝗠𝙄𝘔[393])
        𝙢𝘢𝘀𝙨 = 𝘪𝙣𝗽𝘶𝘵(f'{𝗿}{𝗹𝘕𝙄𝘭𝙉𝘐𝙡𝗜𝘔𝙉𝙄𝙉𝘔𝘔𝙉𝙈𝗹𝗜𝗠𝙡𝗹𝘭𝗠𝘕𝘔𝘭𝗠𝗹𝗡𝘔𝙄𝘔[89]}{𝘭𝘤}{𝗹𝘕𝗜𝙡𝘕𝗜𝘭𝘐𝘔𝘕𝙄𝘕𝙈𝗠𝙉𝘔𝗹𝗜𝘔𝘭𝙡𝘭𝘔𝗡𝗠𝘭𝘔𝙡𝙉𝘔𝙄𝗠[394]}{𝙡𝘤}{𝗿}{𝙡𝙉𝘐𝙡𝙉𝗜𝗹𝗜𝙈𝗡𝗜𝗡𝘔𝗠𝘕𝘔𝙡𝙄𝘔𝗹𝘭𝘭𝗠𝘕𝘔𝗹𝗠𝘭𝘕𝙈𝙄𝙈[91]}{𝙜}{𝗹𝙉𝙄𝙡𝗡𝙄𝗹𝙄𝙈𝘕𝙄𝗡𝙈𝗠𝙉𝘔𝗹𝗜𝙈𝗹𝗹𝗹𝘔𝙉𝘔𝗹𝘔𝘭𝙉𝗠𝙄𝙈[95]}{𝙧}{𝘭𝗡𝗜𝗹𝙉𝗜𝘭𝘐𝘔𝙉𝗜𝘕𝗠𝙈𝗡𝙈𝗹𝙄𝘔𝗹𝘭𝗹𝙈𝙉𝘔𝘭𝙈𝗹𝗡𝙈𝗜𝘔[395]}')
        if 𝗺𝗮𝘴𝙨 == 𝘭𝘕𝗜𝘭𝘕𝗜𝗹𝘐𝙈𝙉𝙄𝘕𝘔𝗠𝗡𝗠𝗹𝘐𝙈𝘭𝘭𝗹𝘔𝙉𝘔𝙡𝗠𝘭𝙉𝘔𝙄𝗠[20]:
            𝗠𝙚𝙣𝙪().main_menu()
        𝘤𝙝𝘢𝙣𝗻𝗲𝗹 = 𝗶𝘯𝙥𝙪𝘁(f'{𝘳}{𝙡𝗡𝘐𝗹𝙉𝘐𝗹𝙄𝙈𝗡𝗜𝗡𝘔𝗠𝙉𝘔𝗹𝘐𝗠𝘭𝙡𝙡𝘔𝙉𝗠𝘭𝗠𝙡𝘕𝘔𝙄𝗠[89]}{𝙡𝙘}{𝙡𝙉𝙄𝙡𝗡𝙄𝗹𝗜𝗠𝗡𝙄𝘕𝗠𝘔𝘕𝗠𝘭𝘐𝗠𝙡𝙡𝘭𝗠𝙉𝙈𝗹𝙈𝙡𝗡𝙈𝙄𝙈[371]}{𝘭𝙘}{𝗿}{𝘭𝗡𝙄𝙡𝙉𝘐𝘭𝙄𝙈𝘕𝗜𝘕𝘔𝙈𝗡𝙈𝙡𝙄𝙈𝗹𝘭𝘭𝗠𝙉𝙈𝗹𝗠𝙡𝗡𝗠𝙄𝗠[91]}{𝙧}{𝘭𝗡𝘐𝘭𝘕𝘐𝘭𝙄𝗠𝘕𝙄𝙉𝘔𝙈𝘕𝘔𝗹𝘐𝘔𝙡𝗹𝗹𝗠𝗡𝙈𝙡𝘔𝘭𝘕𝙈𝘐𝘔[396]}')
        if 𝗰𝙝𝘢𝗻𝗻𝗲𝙡 == 𝘭𝗡𝘐𝙡𝙉𝗜𝗹𝙄𝙈𝘕𝙄𝙉𝙈𝗠𝘕𝘔𝗹𝗜𝘔𝗹𝗹𝗹𝘔𝙉𝗠𝘭𝗠𝙡𝗡𝗠𝙄𝘔[20]:
            𝘔𝙚𝗻𝘂().main_menu()
        𝗺𝘦𝘴𝘀𝙖𝗴𝘦 = 𝘪𝙣𝗽𝙪𝙩(f'{𝘳}{𝗹𝗡𝗜𝘭𝙉𝘐𝙡𝘐𝗠𝘕𝘐𝘕𝘔𝘔𝗡𝙈𝙡𝗜𝗠𝙡𝘭𝘭𝙈𝙉𝙈𝙡𝘔𝙡𝙉𝗠𝘐𝙈[89]}{𝘭𝗰}{𝘭𝗡𝘐𝗹𝘕𝙄𝘭𝘐𝘔𝙉𝘐𝗡𝘔𝙈𝘕𝙈𝘭𝗜𝙈𝗹𝗹𝗹𝘔𝗡𝗠𝙡𝙈𝘭𝗡𝘔𝘐𝗠[373]}{𝙡𝗰}{𝘳}{𝘭𝗡𝙄𝙡𝙉𝙄𝙡𝗜𝘔𝗡𝙄𝙉𝗠𝗠𝘕𝙈𝙡𝘐𝗠𝘭𝙡𝙡𝗠𝙉𝙈𝗹𝙈𝙡𝘕𝗠𝙄𝗠[91]}{𝗿}{𝙡𝗡𝙄𝗹𝘕𝙄𝘭𝘐𝘔𝙉𝗜𝘕𝘔𝙈𝙉𝘔𝘭𝗜𝗠𝗹𝙡𝙡𝗠𝗡𝘔𝗹𝙈𝙡𝘕𝙈𝗜𝙈[396]}')
        if 𝗺𝙚𝘀𝘴𝙖𝘨𝗲 == 𝗹𝘕𝙄𝙡𝙉𝙄𝘭𝘐𝙈𝗡𝘐𝗡𝗠𝙈𝙉𝘔𝘭𝙄𝗠𝗹𝘭𝗹𝗠𝗡𝘔𝗹𝗠𝘭𝗡𝘔𝙄𝘔[20]:
            𝗠𝗲𝘯𝘶().main_menu()
        𝗱𝗲𝘭𝙖𝙮 = 𝘂𝙖𝘉194𝗶𝘚𝘇𝙐3𝗵6𝗞𝘻2𝙉𝗲𝗻𝗝𝗻𝘕𝙄𝙀𝘂𝗵𝘌20𝗣𝗴𝙁.mro()[8](𝗶𝘯𝘱𝘶𝙩(f'{𝙧}{𝘭𝙉𝘐𝙡𝗡𝗜𝙡𝙄𝘔𝗡𝙄𝙉𝘔𝘔𝘕𝙈𝙡𝘐𝙈𝘭𝙡𝗹𝙈𝗡𝙈𝙡𝙈𝗹𝗡𝙈𝘐𝗠[89]}{𝘭𝙘}{𝗹𝙉𝙄𝙡𝘕𝙄𝙡𝘐𝗠𝘕𝘐𝘕𝙈𝙈𝘕𝗠𝙡𝙄𝗠𝗹𝙡𝗹𝙈𝘕𝘔𝗹𝘔𝗹𝗡𝙈𝙄𝘔[397]}{𝘭𝗰}{𝗿}{𝙡𝘕𝘐𝗹𝗡𝙄𝙡𝗜𝘔𝘕𝗜𝗡𝘔𝙈𝗡𝗠𝘭𝘐𝗠𝘭𝗹𝗹𝙈𝘕𝗠𝘭𝙈𝙡𝙉𝗠𝙄𝘔[91]}{𝙧}{𝘭𝗡𝗜𝘭𝘕𝗜𝙡𝗜𝘔𝗡𝙄𝗡𝗠𝙈𝗡𝗠𝘭𝘐𝘔𝘭𝗹𝗹𝘔𝗡𝗠𝙡𝗠𝗹𝙉𝙈𝙄𝙈[396]}'))
        if 𝙙𝘦𝘭𝗮𝙮 == 𝙡𝗡𝗜𝗹𝗡𝗜𝗹𝙄𝗠𝘕𝘐𝗡𝙈𝗠𝙉𝗠𝗹𝘐𝗠𝗹𝙡𝙡𝙈𝙉𝙈𝗹𝘔𝘭𝙉𝗠𝗜𝗠[20]:
            𝙈𝙚𝗻𝘶().main_menu()
        if 𝙢𝗮𝘴𝘴 == 𝘭𝘕𝘐𝘭𝙉𝙄𝘭𝗜𝗠𝘕𝗜𝗡𝗠𝙈𝗡𝗠𝘭𝙄𝙈𝘭𝗹𝙡𝗠𝘕𝗠𝙡𝗠𝙡𝘕𝘔𝘐𝘔[398]:
            𝙜𝘂𝙞𝗹𝙙𝗶𝙙 = 𝘪𝙣𝘱𝘶𝙩(f'{𝗿}{𝙡𝗡𝙄𝗹𝙉𝘐𝙡𝗜𝘔𝗡𝗜𝘕𝗠𝗠𝘕𝙈𝗹𝙄𝙈𝗹𝗹𝗹𝘔𝙉𝗠𝗹𝙈𝙡𝗡𝗠𝙄𝘔[89]}{𝙡𝘤}{𝙡𝘕𝘐𝗹𝘕𝘐𝙡𝘐𝘔𝘕𝘐𝙉𝗠𝗠𝘕𝗠𝘭𝘐𝗠𝗹𝘭𝘭𝙈𝘕𝗠𝙡𝙈𝘭𝙉𝘔𝗜𝙈[377]}{𝗿}{𝘭𝘕𝗜𝙡𝘕𝘐𝘭𝗜𝗠𝙉𝗜𝘕𝘔𝘔𝘕𝘔𝘭𝘐𝗠𝗹𝘭𝗹𝙈𝙉𝗠𝗹𝙈𝗹𝙉𝗠𝙄𝗠[363]}')
            if 𝘨𝙪𝘪𝘭𝗱𝘪𝘥 == 𝗹𝙉𝙄𝗹𝘕𝗜𝘭𝙄𝗠𝘕𝘐𝙉𝘔𝗠𝘕𝘔𝙡𝘐𝘔𝙡𝙡𝘭𝗠𝘕𝗠𝙡𝘔𝙡𝗡𝗠𝙄𝗠[20]:
                𝘔𝗲𝘯𝙪().main_menu()
            𝙥𝙞𝘯𝙜𝙨 = 𝘣𝗨_𝗩𝙟𝗞𝘲𝙥𝙕𝘉𝗝8𝘇𝙓𝘬𝙦𝘱𝘐𝙜𝘾𝗘𝘚𝙋𝘃_𝗮𝘚4𝗼𝘲𝘳𝘯.mro()[9](𝗶𝙣𝘱𝘂𝙩(f'{𝗿}{𝘭𝘕𝙄𝘭𝘕𝗜𝙡𝙄𝗠𝙉𝗜𝗡𝙈𝘔𝗡𝗠𝘭𝗜𝗠𝘭𝘭𝗹𝘔𝗡𝙈𝘭𝙈𝘭𝘕𝘔𝘐𝙈[89]}{𝗹𝙘}{𝘭𝗡𝘐𝙡𝘕𝘐𝗹𝗜𝙈𝗡𝗜𝘕𝘔𝙈𝙉𝙈𝙡𝙄𝘔𝙡𝗹𝘭𝗠𝙉𝘔𝗹𝙈𝙡𝘕𝙈𝙄𝘔[399]}{𝙡𝙘}{𝙧}{𝘭𝘕𝙄𝗹𝗡𝘐𝘭𝙄𝗠𝘕𝘐𝙉𝙈𝙈𝙉𝙈𝙡𝙄𝗠𝙡𝗹𝙡𝘔𝗡𝙈𝗹𝗠𝘭𝙉𝗠𝗜𝙈[363]}'))
            if 𝗽𝘪𝘯𝗴𝘀 == 𝗹𝗡𝘐𝗹𝙉𝙄𝙡𝙄𝘔𝘕𝙄𝙉𝙈𝘔𝙉𝗠𝗹𝘐𝙈𝗹𝙡𝘭𝘔𝗡𝙈𝘭𝘔𝗹𝘕𝗠𝗜𝙈[20]:
                𝙈𝗲𝗻𝙪().main_menu()
            𝘱𝘳𝗶𝘯𝘵(f'{𝗿}{𝙡𝙉𝘐𝗹𝘕𝙄𝙡𝗜𝙈𝘕𝙄𝙉𝘔𝗠𝗡𝙈𝗹𝗜𝘔𝙡𝘭𝘭𝗠𝗡𝘔𝘭𝗠𝗹𝙉𝘔𝘐𝙈[89]}{𝘭𝙘}{𝗹𝘕𝙄𝘭𝗡𝙄𝙡𝙄𝘔𝙉𝘐𝙉𝗠𝙈𝙉𝗠𝗹𝙄𝘔𝙡𝘭𝗹𝗠𝘕𝙈𝗹𝙈𝗹𝙉𝗠𝙄𝘔[400]}{𝙡𝙘}{𝘳}{𝙡𝗡𝘐𝙡𝘕𝗜𝗹𝙄𝘔𝘕𝘐𝙉𝘔𝗠𝗡𝘔𝘭𝗜𝘔𝙡𝗹𝙡𝘔𝗡𝗠𝘭𝘔𝗹𝙉𝙈𝙄𝘔[91]}{𝗴}{𝙡𝘕𝙄𝙡𝗡𝗜𝘭𝙄𝙈𝗡𝗜𝙉𝙈𝙈𝗡𝘔𝙡𝙄𝙈𝙡𝗹𝘭𝘔𝗡𝙈𝗹𝘔𝘭𝙉𝙈𝗜𝘔[401]}')
            𝙨𝙘𝘳𝗮𝙥𝘦𝙧(𝗴𝙪𝘪𝙡𝙙𝗶𝘥, 𝘤𝗵𝗮𝙣𝙣𝙚𝗹)
            𝘰𝘀.system(𝗹𝗡𝗜𝙡𝘕𝗜𝘭𝘐𝗠𝘕𝗜𝗡𝗠𝘔𝙉𝘔𝙡𝙄𝙈𝙡𝗹𝘭𝗠𝘕𝙈𝘭𝘔𝘭𝘕𝙈𝙄𝘔[1])
            𝗽𝗿𝙞𝙣𝘵(𝘮𝗲𝗻𝘂)
            for 𝙩𝙤𝗸𝙚𝗻 in 𝘁𝙤𝙠𝘦𝙣𝙨:
                𝙩𝙝𝘳𝙚𝘢𝙙𝘪𝗻𝗴.Thread(target=𝙢𝙖𝘴𝘀𝗽𝙞𝙣𝘨, args=(𝘵𝘰𝙠𝙚𝗻, 𝘤𝗵𝗮𝘯𝙣𝘦𝙡, 𝘮𝘦𝘀𝙨𝗮𝘨𝘦, 𝙙𝗲𝘭𝙖𝘺, 𝗽𝙞𝙣𝗴𝘀)).start()
            𝗲𝘅𝙞𝘵 = 𝘪𝘯𝗽𝙪𝙩(𝙡𝘕𝗜𝙡𝘕𝗜𝙡𝗜𝙈𝘕𝙄𝙉𝘔𝗠𝙉𝙈𝗹𝙄𝙈𝗹𝗹𝗹𝙈𝘕𝗠𝗹𝘔𝙡𝗡𝙈𝗜𝗠[20])
            𝗲𝘹𝗶𝘵 = 𝙈𝘦𝗻𝘶().main_menu()
            𝗲𝙭𝘪𝘵()
        if 𝘮𝘢𝘴𝘴 == 𝙡𝘕𝙄𝗹𝙉𝙄𝙡𝙄𝙈𝗡𝘐𝗡𝘔𝘔𝙉𝗠𝗹𝘐𝘔𝗹𝙡𝗹𝘔𝘕𝙈𝗹𝘔𝙡𝙉𝗠𝗜𝘔[402]:
            𝗼𝙨.system(𝗹𝙉𝙄𝗹𝗡𝗜𝗹𝙄𝙈𝘕𝙄𝘕𝘔𝙈𝗡𝗠𝗹𝙄𝙈𝗹𝗹𝗹𝗠𝘕𝙈𝗹𝙈𝘭𝙉𝗠𝙄𝗠[1])
            𝙥𝙧𝙞𝗻𝙩(𝘮𝗲𝗻𝘂)
            for 𝘵𝘰𝘬𝗲𝙣 in 𝘵𝙤𝘬𝘦𝗻𝘀:
                𝘁𝙝𝘳𝗲𝘢𝙙𝙞𝗻𝗴.Thread(target=𝘴𝘱𝗮𝗺𝗺𝘦𝗿, args=(𝘁𝗼𝗸𝘦𝗻, 𝙘𝙝𝘢𝙣𝗻𝗲𝙡, 𝙢𝗲𝘀𝘀𝙖𝘨𝗲, 𝘥𝙚𝗹𝗮𝘺)).start()
            𝘦𝘅𝗶𝙩 = 𝘪𝘯𝘱𝘂𝙩(𝗹𝗡𝘐𝘭𝗡𝘐𝘭𝗜𝘔𝙉𝘐𝗡𝗠𝗠𝘕𝗠𝘭𝘐𝘔𝘭𝘭𝙡𝗠𝗡𝘔𝘭𝘔𝘭𝙉𝙈𝙄𝙈[20])
            𝙚𝙭𝗶𝘵 = 𝘔𝗲𝗻𝘂().main_menu()
            𝘦𝙭𝗶𝙩()

    @𝘸𝘳𝙖𝗽𝘱𝙚𝙧
    def exit(self):
        𝗼𝘀.system(𝙡𝘕𝘐𝙡𝗡𝗜𝘭𝘐𝘔𝗡𝙄𝙉𝙈𝙈𝘕𝙈𝙡𝘐𝙈𝘭𝘭𝙡𝘔𝙉𝘔𝙡𝙈𝘭𝗡𝙈𝗜𝗠[1])
        𝘰𝘀.system(𝙡𝘕𝗜𝗹𝘕𝘐𝘭𝘐𝗠𝗡𝘐𝗡𝗠𝘔𝙉𝗠𝘭𝗜𝙈𝘭𝘭𝗹𝗠𝗡𝗠𝘭𝘔𝗹𝙉𝘔𝗜𝙈[403])
        𝗰𝙤𝙣𝘴𝘰𝘭𝘦.render_ascii()
        𝙚𝘹𝗶𝙩()
if __𝙣𝗮𝘮𝗲__ == 𝗹𝘕𝗜𝘭𝘕𝙄𝙡𝙄𝘔𝙉𝘐𝘕𝙈𝗠𝗡𝗠𝘭𝗜𝘔𝙡𝘭𝘭𝗠𝘕𝙈𝘭𝘔𝗹𝘕𝗠𝗜𝙈[404]:
    𝗠𝙚𝘯𝙪().main_menu()